[
    {
        "company": "Tek Pyramids",
        "job_title": "PEGA Developer",
        "location": "Alpharetta GA, USA",
        "full_location": {
            "city": "Alpharetta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [],
            "job_code": "",
            "experience_required": "7-10 years",
            "degree_required": "",
            "visa_sponsorship": "No H1B and OPT",
            "notice_period": "",
            "duration": "",
            "rate": ""
        },
        "skills": {
            "core": [
                "Pega CSSA Certification",
                "Pega UI development",
                "PRPC application implementation",
                "Case management implementation",
                "PRPC architecture",
                "Agile/Scrum concepts"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Pega CSSA Certification",
                "Pega UI development",
                "PRPC application implementation",
                "Case management implementation",
                "PRPC architecture",
                "Agile/Scrum concepts"
            ],
            "with_experience": [
                "Pega CSSA Certification",
                "Pega 7 experience"
            ]
        },
        "job_type": [
            "Hybrid"
        ],
        "contact_person": "Kaveri",
        "email": "kaveri@tekpyramids.com",
        "jd": "Position: PEGA Developer. Location: Alpharetta GA preferred. Working Model: Hybrid Tue/wed/thursday- 9am to 6pm est. Targeted Years of Experience: 7-10 years. No H1B and OPT. Qualifications: 5 plus years of experience implementing (hands on) PRPC application including case management implementation. Experience in Pega UI development. Pega CSSA certification. Pega 7 experience preferred. 8 plus years of diverse experience in IT is preferred. Has expert knowledge of the PRPC architecture, security model, and service interfaces. Has expert PRPC knowledge based on in-depth experience and successful projects. Designs and codes from specifications, analyzes, evaluates, tests, debugs, documents, and implements moderately complex software applications. Under general direction, devises or modifies procedures to solve complex problems considering computer equipment capacity and limitations, operating time, and form of desired results. Competent to work at the highest technical level of all phases of applications programming activities. Monitor program execution for expected performance. Modifies, installs, and prepares technical documentation for system software applications. MUST HAVE SKILLS: Pega CSSA Certification.",
        "emp_type": [],
        "source": "Email",
        "date_posted": "2024-09-30 14:55:56-05:00",
        "unique_id": "192448b51b975719",
        "tag": "Pega Dev"
    }
]