[
    {
        "company": "Sligo Software Solutions Inc.",
        "job_title": "Java Architect",
        "location": "Albany, New York, USA",
        "full_location": {
            "city": "Albany",
            "state": "New York",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "onsite"
            ],
            "job_code": "",
            "experience_required": "14+ Years",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "30 Months",
            "rate": ""
        },
        "skills": {
            "core": [
                "Java",
                "Java EE",
                "JEE",
                "JSF",
                "XML",
                "XSLT",
                "IBM WebSphere",
                "Application Servers",
                "AWS",
                "Azure",
                "Google Cloud",
                "Object Oriented Architecture",
                "Service Oriented Architecture"
            ],
            "primary": [
                "Technical oversight",
                "Application development",
                "Performance testing",
                "Documentation"
            ],
            "secondary": [
                "Data analysis",
                "Hybrid cloud applications",
                "Scalable applications designing"
            ],
            "all": [
                "Java",
                "Java EE",
                "JEE",
                "JSF",
                "XML",
                "XSLT",
                "IBM WebSphere",
                "Application Servers",
                "AWS",
                "Azure",
                "Google Cloud",
                "Object Oriented Architecture",
                "Service Oriented Architecture",
                "Technical oversight",
                "Application development",
                "Performance testing",
                "Documentation",
                "Data analysis",
                "Hybrid cloud applications",
                "Scalable applications designing"
            ],
            "with_experience": [
                "Java",
                "Java EE",
                "JEE",
                "JSF",
                "XML",
                "XSLT",
                "IBM WebSphere",
                "Application Servers",
                "AWS",
                "Azure",
                "Google Cloud"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Katta Dasharatham",
        "email": "dasharatham.katta@sligosoft.com",
        "jd": "Greetings from Sligo Software Solutions, Inc. !!SLIGO is a Software Development & IT Consulting company. We have around 100+ IT associates working with our esteemed clients across several domains such as IT, Banking, Healthcare, and Government. We have an urgent requirement for Java Architect position with our client. Role: Java ArchitectLocation: Albany, New YorkDuration: 30 MonthsDescriptionProvide technical oversight to application development teams working in multiple projects. Guide development teams working in highly available and scalable multitier applications using Object Oriented/Service Oriented Architecture. Assist technical teams with remediation of Public Safety end-of-life (EOL) applications/systems. Plan project resourcing and interact with executive management for planning and status reporting purposes.Duties Implement Integrated Justice (IJ) Portal standards related to application technologies, including UI standards, development methodology, and coding and style guides. Act as the primary technical liaison with technical infrastructure teams to resolve problems and implement solutions to technical issues impacting application performance.Work with the Infrastructure teams to execute activities such as performance test planning and execution failure failover planning and execution, endurance testing and deployment planning and testing. Provide the analysis, design, and code reviews for enterprise applications using JAVA/JEE, JSF, XML, XSLT and for the IBM Portal/WebSphere Application development software. Perform oversight of development activities which may include data analysis, data access, data structures, data manipulation, preparing logical database models, testing and implementation.Prepare, and/or review technical documentation such as designs, schemas, etc., as appropriate. Provide technical guidance to teams of developers.Assist technical teams with remediation of Public Safety end-of-life (EOL) applications/systemsMandatory RequirementsExperience (14+ Years)Makes high-level design choices and dictates technical standards, including software coding standards, tools, and platforms. Designs multi-leveled architecture or component interactions of a large scale software system.",
        "source": "Email",
        "date_posted": "2024-09-30 11:42:41-05:00",
        "unique_id": "19243d18d9230c90",
        "tag": "Java Dev"
    }
]