[
    {
        "company": "RCI",
        "job_title": "IT Project Manager",
        "location": "Oakland, CA, USA",
        "full_location": {
            "city": "Oakland",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "",
            "experience_required": "7+ years",
            "degree_required": "Bachelor’s degree or equivalent years of relevant experience",
            "visa_sponsorship": "USC, GC, H4EAD, TN only",
            "notice_period": "",
            "duration": "12+ Months",
            "rate": "$55-60/hr C2C"
        },
        "skills": {
            "core": [
                "Project Management",
                "Infrastructure",
                "Security",
                "Cloud technologies",
                "Applications",
                "Microsoft Project",
                "Jira"
            ],
            "primary": [
                "PMP"
            ],
            "secondary": [
                "Agile methodologies",
                "Waterfall methodologies"
            ],
            "all": [
                "Project Management",
                "Infrastructure",
                "Security",
                "Cloud technologies",
                "Applications",
                "Microsoft Project",
                "Jira",
                "PMP",
                "Agile methodologies",
                "Waterfall methodologies"
            ],
            "with_experience": [
                "Project Management",
                "PMP"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Anamika",
        "email": "aanamika@rconsultinginc.com",
        "jd": "Must have the local DL of California only. Position: IT Project Manager. Location: 100% Remote [Oakland, CA] / Client Prefers Northern CA. Duration: 12+ Months. Visa – USC, GC, H4EAD, TN only. Rate: $55-60/hr C2C. I am looking for people in California who previously worked for a university or higher education. Please include a summary with the must haves. Please DO NOT send me any program or product managers! Experience managing projects to archive accounting system data after migrations to new platforms. Interview Details: 2 Zoom Interviews. Must Have: 7+ years of solid project management (USA Experience). We need a PM who worked primarily on infrastructure, security, Cloud technologies, Applications etc. Highly advanced skills associated with end-to-end PMLC for programs/projects of large-scale scope. Certification: PMP (MUST – Proof required). Lives in California/Manager prefers northern CA. LinkedIn Job description: Seeking a seasoned project manager with 7+ years of solid project management experience for UCOP IT projects spanning multiple systems & technologies including infrastructure, security, Cloud technologies, Applications etc. The ideal candidate must have demonstrable skills delivering projects in close collaboration with multiple stakeholders, vendors and implementation partners. The ideal candidate must have demonstrable project delivery skills. Able to drive project from initiation to closure with smooth handoff to operations teams. Organize project work into Phases, Work streams. Track and report status on entire project, individual phases, individual work streams, milestones, resource utilization, project finances (incl. burn-down). Comfortable with presenting to executives, sponsors, business leadership team. Proficient in waterfall & Agile methodologies. Thorough in maintaining all project artifacts – charter, executive material, RACI, RAID log etc. Skillful in project plan creation using MS project. Create project dashboards. End to end effective meeting facilitation (Clear Agenda with outcome, next steps, publishing Minutes, track actions etc.). Establish project governance & communication plans with clarity. Key success factors in a candidate: Self-starter, Proactive; ‘can do’ problem-solving attitude; effective navigating ability in ambiguity. Ability to understand organization dynamics & adapt. Audience-specific communication/artifacts. Establish clear roles, responsibilities, ownership. Superior communication skills – Written & Verbal. Ability to influence.",
        "emp_type": [
            "contract"
        ],
        "source": "Email",
        "date_posted": "2024-09-30 14:01:23-05:00",
        "unique_id": "192444ea450656b9",
        "tag": "BA/Scrum Master/PM"
    }
]