[
    {
        "company": "TTDATA LLC",
        "job_title": "Microsoft .NET Tech Lead / Solutions Architect",
        "location": "New York City, NY, USA",
        "full_location": {
            "city": "New York City",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract to hire"
            ],
            "job_code": "",
            "experience_required": "Minimum 10 years’ experience in Microsoft .NET technology",
            "degree_required": "Educated to degree level or higher in Computer Science or a related technology field",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "",
            "rate": ""
        },
        "skills": {
            "core": [
                "C#",
                "ASP.NET",
                "SQL Server",
                "Object Oriented Design",
                "Entity Framework",
                "MVC",
                "Microsoft WCF RIA services",
                "Unit testing using nUnit",
                "UML",
                "CSS",
                "Java scripting",
                "REST web services",
                "Microsoft windows workflow foundations",
                "test-driven development"
            ],
            "primary": [
                "Microsoft .NET 3.5/4",
                "C#",
                "ASP.NET",
                "SQL Server"
            ],
            "secondary": [
                "Power BI",
                "AWS",
                "TDD",
                "BDD",
                "Testing frameworks",
                "Source Control",
                "Release Management"
            ],
            "all": [
                "C#",
                "ASP.NET",
                "SQL Server",
                "Object Oriented Design",
                "Entity Framework",
                "MVC",
                "Microsoft WCF RIA services",
                "Unit testing using nUnit",
                "UML",
                "CSS",
                "Java scripting",
                "REST web services",
                "Microsoft windows workflow foundations",
                "test-driven development",
                "Microsoft .NET 3.5/4",
                "Power BI",
                "AWS",
                "TDD",
                "BDD",
                "Testing frameworks",
                "Source Control",
                "Release Management"
            ],
            "with_experience": [
                "C#",
                "ASP.NET",
                "SQL Server",
                "Object Oriented Design",
                "Entity Framework",
                "MVC"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "S Vetriya",
        "email": "vetriya@ttdatas.com",
        "jd": "From: Vetriya S, TTDATA vetriya@ttdatas.com Reply to: vetriya@ttdatas.com Hi Professionals,I hope you are doing well. I do have a job opening for Full Stack Developer(Python + Angular) position for our client based out at NewYork, NY (Onsite). Please find the below requirement kindly share me updated profile along with contact details asap. Looking for H4 EAD , L2 EAD,GC, USC. Position : Microsoft .NET Tech Lead / Solutions Architect Location : New York City, NY (Onsite)Duration : Contract to Hire Job Description : Key Competencies Hands on experience in Object Oriented analysis and design using common design patterns Hands on experience in designing and developing applications using .NET 3.5/4 development using C# and ASP.NET Competence in SQL Server Competence in Object Oriented design and development techniques Working knowledge in Entity Framework, MVC Working knowledge in Microsoft WCF RIA services Knowledge in Unit testing using nUnit or similar Competence in UML – Sequence diagrams, Class diagrams, etc Working Knowledge in requirements analysis or business analysis techniques Working knowledge in CSS, Java scripting Experience in REST web services Experience in Microsoft windows workflow foundations Experience with test-driven development Client-focused, working independently and simultaneously across multiple projects Capture and documentation of customer requirements and transformation into software design specifications / user stories Writes structured well-documented code to deliver scalable software solutions Good communication, able to write clear and concise documentation for technical and nontechnical audiences Team player with effective time management Strong problem-solving skills and attention to detail Ability to peer review and provide feedback on others work Consistently technically abreast of existing, new and emerging technologies to complement solutions Willing to be flexible with shift Key Activities Creating detailed technical design documentation & estimates Implementing unit tests Develop code as per the specifications and coding standards Ensure all code passes unit testing with appropriate code coverage Peer reviews of other team members’ code Provide feedback on process to refine where necessary Liaise with Architects, Testers and any other project stakeholders both verbally and in writing § Technical support Key Technologies :Experience in the following technologies is required: Microsoft .NET 3.5/4 C# ASP.NET VB .NET Relational Databases like MS SQL Server Web frameworks like MVC ASP.NET Core and Web API Experience in the following technologies is desirable: Integrating websites with 3rd party APIs (REST/SOAP) TDD / BDD (e.g. Cucumber) Testing frameworks Source Control (SVN, TFS) Release Management Power BI and Analytics AWS continuous integration and continuous delivery (CI/CD) Qualifications and Experience Educated to degree level or higher in Computer Science or a related technology field Minimum 10 years’ experience in Microsoft .NET technology Experience of the software development lifecycle and Agile development methodologies Experience of providing client facing support is an advantage Thanks& Regards S VetriyaTTDATA LLCSr.Technical Recruitervetriya@ttdatas.com",
        "emp_type": [
            "contract to hire"
        ],
        "source": "Email",
        "date_posted": "2024-09-30 12:40:11-05:00",
        "unique_id": "19244051cefe988c",
        "tag": ".NET Dev"
    }
]