[
    {
        "company": "Stellar Consulting Solutions LLC",
        "job_title": "ServiceNow Platform BA",
        "location": "NY/NJ, USA",
        "full_location": {
            "city": "",
            "state": "NY/NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "C2C"
            ],
            "job_code": "",
            "experience_required": "3-5 years",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "Long Term",
            "rate": "$42/hr"
        },
        "skills": {
            "core": [
                "Requirement Gathering",
                "Business Process Analysis",
                "Configuration & Customization Support",
                "Stakeholder Communication",
                "Testing & Validation",
                "Documentation",
                "Change Management",
                "Data Analysis",
                "Training"
            ],
            "primary": [
                "ServiceNow",
                "ITSM",
                "ITOM",
                "HR Service Delivery",
                "ITIL",
                "JIRA",
                "Confluence",
                "Agile"
            ],
            "secondary": [
                "User Acceptance Testing",
                "Data Analysis"
            ],
            "all": [
                "Requirement Gathering",
                "Business Process Analysis",
                "Configuration & Customization Support",
                "Stakeholder Communication",
                "Testing & Validation",
                "Documentation",
                "Change Management",
                "Data Analysis",
                "Training",
                "ServiceNow",
                "ITSM",
                "ITOM",
                "HR Service Delivery",
                "ITIL",
                "JIRA",
                "Confluence",
                "Agile"
            ],
            "with_experience": []
        },
        "job_type": [],
        "contact_person": "Deepika Dua",
        "email": "deepika.dua@stellarconsulting.com",
        "jd": "Hello Sir, My name is Deepika & I am a recruiter at Stellar Consulting, and I came across your profile while looking for qualified candidates for ServiceNow Platform BA role. I was impressed by your experience and skills . I think you would be a great fit for this role, as you have almost all the skills & experience required for the role. Below are the job details for your reference. Job Title : ServiceNow Platform BA Location : NY/NJ or east coast Duration : Long Term #Note: Look for someone from Tri-state: in and around NY/NJ, Connecticut, Philadelphia) Pay Rate : $42hr C2C Fixed) Job Description: Responsibilities: Requirement Gathering: Work closely with stakeholders to gather and document business requirements for ServiceNow implementations. Business Process Analysis: Analyze current processes, identify pain points, and recommend ServiceNow solutions to streamline operations and improve service delivery. Configuration & Customization Support: Collaborate with development teams to ensure the correct configuration and customization of the ServiceNow platform, including modules like ITSM, ITOM, HR Service Delivery, and others. Stakeholder Communication: Act as the liaison between business users, IT teams, and developers to ensure project goals are met on time. Testing & Validation: Assist in user acceptance testing (UAT) and post-implementation testing to validate that the system meets the agreed-upon requirements. Documentation: Prepare detailed process flow diagrams, functional specifications, and user guides to ensure all processes and solutions are well-documented. Change Management: Support organizational change management activities by helping users adopt new ServiceNow functionalities and processes. Data Analysis: Conduct data analysis to identify trends, metrics, and KPIs that can be leveraged to optimize ServiceNow usage. Training: Provide training and ongoing support to users to help them maximize the value from the ServiceNOW platform. Qualification: 3-5 years of experience as a Business Analyst, preferably within the IT service management space. ServiceNow Certified System Administrator (CSA) is a plus. Hands-on experience with ServiceNow modules like ITSM, ITOM, CSM, or HR Service Delivery. Strong understanding of ITIL processes and experience working in an ITIL-based environment. Proficiency in JIRA, Confluence, or similar tools for managing requirements and project documentation. Familiarity with Agile methodologies and experience working in Agile environments.",
        "source": "Email",
        "date_posted": "2024-09-30 07:53:45-05:00",
        "unique_id": "19242fef62797eb8",
        "tag": "BA/Scrum Master/PM"
    }
]