[
    {
        "company": "DMS Visions INC",
        "job_title": "Lead SDET",
        "location": "Okemos, MI, USA",
        "full_location": {
            "city": "Okemos",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Bachelor's degree in computer science, information systems or a related field",
            "visa_sponsorship": "NO H1B",
            "notice_period": "",
            "duration": "12+ Months",
            "rate": ""
        },
        "skills": {
            "core": [
                "SDET",
                "Java",
                "J2EE",
                "Java APIs",
                "Application testing",
                "Test automation",
                "REST",
                "SOAP",
                "Selenium",
                "Database queries",
                "Document migration"
            ],
            "primary": [
                "SDET",
                "Java",
                "Test automation",
                "REST",
                "SOAP"
            ],
            "secondary": [
                "Agile methodology",
                "Communication",
                "Organizational skills"
            ],
            "all": [
                "SDET",
                "Java",
                "J2EE",
                "Java APIs",
                "Application testing",
                "Test automation",
                "REST",
                "SOAP",
                "Selenium",
                "Database queries",
                "Document migration",
                "Agile methodology",
                "Communication",
                "Organizational skills"
            ],
            "with_experience": [
                "SDET",
                "Java",
                "Test automation",
                "REST",
                "SOAP"
            ]
        },
        "job_type": [
            "Hybrid"
        ],
        "contact_person": "Abhishek Yadav",
        "email": "abhishek@dmsvisions.com",
        "jd": "Hi,Hope you are doing well !!I have an urgent position. Kindly go through the Job description and let me know if this would be of interest to you. Job Title: Lead SDETLocation: Okemos, MI (Hybrid- 2 days a week onsite)Duration: 12+ Months Contract ****While sharing resume mention consultant location and visa status*** Job Description: Note: Need local candidates to Michigan Resumes no more than 5 pages Skill Matrix (please provide years of experience and year last used)SDETJavaJ2EE development Java APIs (not just functional or Auto – but a blend)J2EE web components and containersApplication testing and test automation (REST/SOAP)Automation (selenium or others)Database (queries, indexes, tables, logic)document migration project (comparing old vs new – utilizing Quadient is a bonus)Experience guiding the work of less experienced SDETs Prefer someone with experience with testing in document migration project (comparing old vs new – utilizing Quadient is a bonus), and guiding the work of less experienced SDETs Target candidate 10+ yearsIn addition to the SDET responsibilities, the candidate as needed will be asked to perform certain duties as a Technical analyst and should be exceptionally good in verbal communication. This position is more testing than developmentWe need to look local to MI first then who will relocateMoving from soap to rest Java and APIs are the 2 most important areas of focus Job Summary: Participates in the creation, maintenance, automation, and execution of test cases to support the validation of user stories in an agile environment. Utilizes Java - Selenium or a company approved tool to develop and maintain automated test scripts and develops SQL scripts to extract data from the database to execute test cases.Primary Job Responsibilities: 1. Works with Feature Teams to understand the business and system impact of requested change across multiple applications and can explain impact of the change to team members. 2. Determines testing impacts for online transactions, web services, and batch jobs and understands how the applications are integrated. Participates in design sessions and promotes test-first culture. 3. Maintains, and enhances test automation frameworks on multiple application platforms, such as mobile, desktop, and web, and building test scenarios and acceptance tests. 4. Offers inputs on the testability of functional elements and product designs. 5. Develops/updates and executes test cases from the user story acceptance criteria that thoroughly tests the change and documents results. Utilizes the test case management tool for test case development and test case execution. Collaborates with team members to ensure that the test cases validate all aspects of impacted systems. Includes test cases to validate that no unintended changes have occurred in application because of the change. 6. Develops, optimizes and refactors automated test scripts for web applications using Selenium-Java or company approved automation tool. 7. Develops and executes API / Integration/ Service tests for REST or SOAP services using corporate tools. 8. Extracts data from databases by developing/updating SQL queries and monitors database structures and the impact of application changes to the data or database structure. 9. Acts as a Subject Matter Expert for assigned applications in the enterprise and provides direction for types of automation required for user stories. Minimum Qualifications: Position requires a bachelor's degree in computer science, information systems or a related field and five years of experience in application testing and test automation of web-services (REST/SOAP) and three years of Java and J2EE development skills with strong understanding of Java APIs, J2EE web components and containers. Position requires experience with: • Agile methodology (Scrum or SAFe is preferred) • Various testing methodologies and strategies • Reviewing software changes and determine testing impacts • Analyzing and resolving complex problems • Excellent communication and organizational skills • Driving thoroughness into acceptance criteria • Extracting clarifications from the rest of the team (e.g., speaking up when things are not clear/complete) Prefer someone with experience with testing in document migration project (comparing old vs new – utilizing Quadient is a bonus), and guiding the work of less experienced SDETs. If you are interested, please share your updated resume and suggest the best number & time to connect with you. Thanks & Regards, Abhishek YadavDMS Vision Inc. | http://dmsvisions.com/4645 Avon Lane, Suite 210, Frisco, TX 75033Email: abhishek@dmsvisions.com | Phone : 972-645-5314 | EXT - 103",
        "emp_type": [
            "contract"
        ],
        "source": "Email",
        "date_posted": "2024-09-30 10:07:40-05:00",
        "unique_id": "192439a76e282d69",
        "tag": "Java Dev"
    }
]