[
    {
        "company": "VBeyond Corporation",
        "job_title": ".Net Tech Lead",
        "location": "Houston, TX, USA",
        "full_location": {
            "city": "Houston",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "",
            "experience_required": "10+ years (with 3+ years in a lead role)",
            "degree_required": "",
            "visa_sponsorship": "H1B",
            "notice_period": "",
            "duration": "Long Term Contract",
            "rate": ""
        },
        "skills": {
            "core": [
                "React"
            ],
            "primary": [
                "React",
                "TypeScript"
            ],
            "secondary": [],
            "all": [
                "React",
                "TypeScript",
                "JavaScript",
                "HTML5",
                "CSS3",
                "Webpack",
                "Babel",
                "Redux",
                "MobX",
                "Jest",
                "Enzyme",
                "RESTful APIs",
                "GraphQL",
                "Git"
            ],
            "with_experience": [
                "React"
            ]
        },
        "job_type": [
            "Hybrid"
        ],
        "contact_person": "Akash Raj Srivastava",
        "email": "akashr@vbeyond.com",
        "jd": "Dear Vendor Partner, My name is Akash Raj Srivastava, and I represent VBeyond Corporation, a global recruitment firm with 18+ years of industry experience. We specialize in sourcing and placing highly skilled talent to meet the unique needs of our clients. Our client is seeking a .Net Tech Lead for a Hybrid position in Houston, TX. Please share if you have any suitable candidate for this role – PLEASE SHARE LOCAL PROFILES TO HOUSTON OR TEXAS. H1B VISA REQUIRED FOR THIS ROLE. Job Title: .Net Tech Lead Location: Houston, TX (Hybrid) Duration: Long Term Contract Job Description: Primary Skills: React, TypeScript Experience: 10+ years (with 3+ years in a lead role) Technologies: - Expertise in React and Redux - JavaScript, HTML5, CSS3 - Modern frontend build tools (Webpack, Babel) - State management libraries (Redux, MobX) - Front-end testing frameworks (Jest, Enzyme) - RESTful APIs and GraphQL - Version control (Git) Mandatory Skill: React Please share your consultant’s updated resume along with their visa copy, photo ID, and I-94 details.",
        "emp_type": [
            "contract"
        ],
        "source": "Email",
        "date_posted": "2024-09-30 15:40:42-05:00",
        "unique_id": "19244a98c70474c2",
        "tag": ".NET Dev"
    }
]