[
    {
        "company": "epeopletech",
        "job_title": "Lead Snowflake Data Engineer",
        "location": "Parsippany, NJ, USA",
        "full_location": {
            "city": "Parsippany",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "",
            "experience_required": "10+ years in data engineering or related fields, with at least 3-4 years in a leadership role",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "Contract",
            "rate": ""
        },
        "skills": {
            "core": [
                "Snowflake",
                "data modeling",
                "SQL optimization",
                "performance tuning",
                "ETL/ELT tools",
                "Apache Airflow",
                "Talend",
                "Informatica",
                "Python",
                "Java",
                "Scala",
                "data governance",
                "security",
                "compliance"
            ],
            "primary": [
                "Snowflake",
                "data modeling",
                "SQL optimization"
            ],
            "secondary": [
                "ETL/ELT tools",
                "Apache Airflow",
                "Talend",
                "Informatica"
            ],
            "all": [
                "Snowflake",
                "data modeling",
                "SQL optimization",
                "performance tuning",
                "ETL/ELT tools",
                "Apache Airflow",
                "Talend",
                "Informatica",
                "Python",
                "Java",
                "Scala",
                "data governance",
                "security",
                "compliance",
                "leadership",
                "communication",
                "analytical",
                "problem-solving"
            ],
            "with_experience": [
                "Snowflake",
                "data modeling",
                "SQL optimization",
                "performance tuning",
                "ETL/ELT tools",
                "Apache Airflow",
                "Talend",
                "Informatica",
                "Python",
                "Java",
                "Scala"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Ekta Chaudhary",
        "email": "ekta@epeopletech.com",
        "jd": "Hi, We have an urgent opening with “Lead Snowflake Data Engineer”. and I have sent you job description, please go through it and let me know your comfort with it and also send me your updated resume ASAP Position: Lead Snowflake Data Engineer Location: 255 Baldwin Road, Suite 205, Parsippany, NJ 07054 Duration: Contract Core Responsibilities: Lead the design, development, and implementation of data pipelines on the Snowflake platform. Mentor and guide a team of data engineers in best practices and technical skills. Collaborate with data architects and stakeholders to define data requirements and ensure alignment with business goals. Optimize data workflows and troubleshoot performance issues. Definition, architecture, validation and implementation of data pipelines for party cloud platform Data modeling oriented to specific business requirements and projects Optimization for EDW snowflake platform such as improve performance, Reduce consumption, and explode technical capabilities, simplifying data models. Development of data pipelines of automation including query refactoring, Framework Migration, DBT Airflow Development. Data Democratization and self service Analyze current Data framework for business analytics reporting, implement best practices and governance process implementation Required Skills: Extensive experience with Snowflake, including data modeling, SQL optimization, and performance tuning. Proficiency in ETL/ELT tools (e.g., Apache Airflow, Talend, Informatica). Strong programming skills in languages such as Python, Java, or Scala. Familiarity with data governance, security, and compliance best practices. Experience: 10+ years of experience in data engineering or related fields, with at least 3-4 years in a leadership role. Proven track record of managing complex data projects from inception to delivery. Certifications: Snowflake Certified Data Engineer or relevant Snowflake certifications. Additional certifications in cloud platforms (AWS, Azure, or GCP) are a plus. Soft Skills: Excellent leadership and communication skills. Strong analytical and problem-solving abilities. Ability to work collaboratively in a fast-paced environment.",
        "emp_type": [
            "contract"
        ],
        "source": "Email",
        "date_posted": "2024-09-30 12:20:49-05:00",
        "unique_id": "1924452016693f4d",
        "tag": "AWS Data Engineer"
    }
]