[
    {
        "company": "Maintec",
        "job_title": "IT Project Manager",
        "location": "Des Moines, IA, 50309, USA",
        "full_location": {
            "city": "Des Moines",
            "state": "IA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [],
            "job_code": "",
            "experience_required": "8 Years",
            "degree_required": "",
            "visa_sponsorship": "No H1B, CPT and OPT",
            "notice_period": "",
            "duration": "",
            "rate": ""
        },
        "skills": {
            "core": [
                "project management",
                "stakeholder management",
                "system integration",
                "technology projects",
                "process development",
                "process analysis",
                "Agile method",
                "change management"
            ],
            "primary": [
                "project governance",
                "project scheduling",
                "resource management",
                "business requirements gathering"
            ],
            "secondary": [
                "multitasking",
                "cross-functional teamwork",
                "budget adherence"
            ],
            "all": [
                "project management",
                "stakeholder management",
                "system integration",
                "technology projects",
                "process development",
                "process analysis",
                "Agile method",
                "change management",
                "project governance",
                "project scheduling",
                "resource management",
                "business requirements gathering",
                "multitasking",
                "cross-functional teamwork",
                "budget adherence"
            ],
            "with_experience": [
                "system integration",
                "technology projects",
                "Agile projects",
                "change management"
            ]
        },
        "job_type": [
            "Hybrid"
        ],
        "contact_person": "Princy Jain",
        "email": "princy@maintec.com",
        "jd": "From: Princy Jain, Maintec princy@maintec.com Reply to: princy@maintec.com Job Title: IT Project Manager Job Location: Des Moines, IA, 50309, USA Work Model: Hybrid Local candidate only Job Description Skill Required / Desired Amount of Experience Direct management of system integration and/or technology projects Required 8 Years Experience managing stakeholder expectations and priorities Required 8 Years Experience working within a project governance structure (methodology, required templates and reporting) Required 8 Years Extensive experience with planning, managing and tracking multiple major impact projects. Required 8 Years Strong process development skills, w/ the ability to learn and understand concepts to interpret, document and formalize procedures Required 8 Years Strong process and gap analysis skills Required 8 Years Excellent project management skills, w/ the ability to multitask and manage multiple tasks with changing priorities in a cross-functional environment Required 8 Years Demonstrated experience with working with business users to gather and document business requirements Required 6 Years Demonstrate ability to prioritize and manage multiple projects and project activities simultaneously while meeting established deadlines Required 6 Years Working experience with Agile Projects Required 3 Years Demonstrated experience with managing client expectations and implementing change management initiatives Required 3 Years Project Overview: The department is seeking a Project Manager to drive technology projects to completion while ensuring adherence to established budgets, business plans, process, procedures and requirements while working closely with business unit personnel, Business Analysts and Architects. The project manager will be responsible for adhering to project management governance on multiple current and future projects. Additionally, the PM will be accountable for generating project schedules, identifying/staffing needs, resourcing, completing the procurement of vendor products / implementation services, and submitting funding requests as required. The PM will manage the delivery efforts and report status of each to the Project Sponsors and the PMO Director. The PM will work with multiple business and platform areas including Information Technology and potentially including upper-level state government committees. The Project Manager will conduct project meetings and is responsible for project tracking and analysis, ensuring adherence to quality standards and project deliverables. The PM will be part of a PMO team responsible for all aspects of IT project governance, assessment, management and control. The ability to gather and define requirements; build a project plan; identifying resource needs; and transparent, clear communications across all levels of stakeholders. Job Responsibilities: Direct management of system integration and/or technology projects Experience managing stakeholder expectations and priorities Experience working within a project governance structure (methodology, required templates and reporting) Extensive experience with planning, managing and tracking multiple major impact projects. Strong process development skills, w/ the ability to learn and understand concepts to interpret, document and formalize procedures Strong process and gap analysis skills Excellent project management skills, w/ the ability to multitask and manage multiple tasks with changing priorities in a cross-functional environment Demonstrated experience with working with business users to gather and document business requirements Demonstrate ability to prioritize and manage multiple projects and project activities simultaneously while meeting established deadlines Working experience with Agile Projects Demonstrated experience with managing client expectations and implementing change management initiatives",
        "source": "Email",
        "date_posted": "2024-09-30 08:30:16-05:00",
        "unique_id": "19243325fd9a6cae",
        "tag": "BA/Scrum Master/PM"
    }
]