[
    {
        "company": "Crea Services LLC",
        "job_title": "Dot Net Developer",
        "location": "NYC NY, USA",
        "full_location": {
            "city": "NYC",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "",
            "experience_required": "Hands on experience in C#/.NET development, particularly with desktop applications.",
            "degree_required": "Bachelor’s or master’s degree in computer science, Information Technology, or related field.",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "",
            "rate": ""
        },
        "skills": {
            "core": [
                "C#/.NET",
                "desktop applications",
                "Equity Derivatives",
                "SWAP business",
                "unit testing",
                "Windows services",
                "test automation"
            ],
            "primary": [
                "C#/.NET",
                "desktop applications"
            ],
            "secondary": [
                "WPF",
                "WinForms",
                "SQL",
                "agile methodologies"
            ],
            "all": [
                "C#/.NET",
                "desktop applications",
                "Equity Derivatives",
                "SWAP business",
                "unit testing",
                "Windows services",
                "test automation",
                "WPF",
                "WinForms",
                "SQL",
                "agile methodologies"
            ],
            "with_experience": [
                "C#/.NET",
                "desktop applications",
                "unit testing",
                "Windows services",
                "test automation"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Mukesh",
        "email": "mkumar@creaservices.net",
        "jd": "Role: Dot Net Developer Location: NYC NY3 Days Hybrid from Day 1 We don’t need Web Application Development experience. We need Desktop Application development experience. We are looking for a candidate who has development experience in C#/.NET with desktop-based application with Equity Derivative and/or SWAP business knowledge. Experience with developing Unit testing modules for Window service-based application. Experience in automating Test Harness. We are seeking a highly skilled C#/.NET Developer with experience in desktop-based applications and a strong background in the Equity Derivatives and/or SWAP business. The ideal candidate will have a deep understanding of financial markets and instruments, particularly in equity derivatives or swaps, and will be responsible for creating robust unit testing modules for Windows service-based applications, as well as automating test harnesses. Key Responsibilities: Develop and maintain desktop-based applications specifically tailored for Equity Derivative and SWAP business functionalities. Collaborate with business analysts and stakeholders to translate business requirements into technical specifications. Design and implement Windows service-based applications with a focus on performance, scalability, and security. Develop comprehensive unit testing modules to validate the functionality and performance of Windows services. Automate test harnesses to streamline the testing process and ensure consistent quality. Participate in code reviews and adhere to best practices in software development. Maintain up-to-date knowledge of C#/.NET programming, design patterns, and application development methodologies. Troubleshoot and resolve complex issues within the application and related systems. Document technical designs, processes, and procedures for cross-team knowledge sharing and future maintenance. Work closely with the quality assurance team to ensure delivery of high-quality and reliable software. Provide technical support and guidance to junior developers and team members. Stay abreast of new trends and best practices in software development and introduce them to the team where beneficial. Required Skills and Qualifications: Bachelor’s or master’s degree in computer science, Information Technology, or related field. Hands on experience in C#/.NET development, particularly with desktop applications. Proven experience in the financial services industry, with a strong understanding of Equity Derivatives and/or SWAP business. Expertise in developing unit testing modules for Windows services. Experience with test automation and familiarity with test harness frameworks. Proficient understanding of code versioning tools, such as Git. Strong understanding of object-oriented programming and design patterns. Excellent problem-solving and analytical skills. Strong communication and interpersonal abilities. Desirable Skills: Experience with WPF, WinForms, or other GUI libraries in .NET for desktop application development. Familiarity with Continuous Integration/Continuous Deployment (CI/CD) pipelines. Knowledge of SQL and experience with database design and management. Experience with agile development methodologies such as Scrum or Kanban.",
        "source": "Email",
        "date_posted": "2024-09-30 16:46:27-05:00",
        "unique_id": "1924509f9f1e1e83",
        "tag": ".NET Dev"
    }
]