[
    {
        "company": "IndusAilabs",
        "job_title": "Developer Standard III - Python Developer",
        "location": "Washington, DC 20433, USA",
        "full_location": {
            "city": "Washington",
            "state": "DC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "",
            "experience_required": "",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "8 Months – Long Term",
            "rate": ""
        },
        "skills": {
            "core": [
                "Python",
                "Excel"
            ],
            "primary": [
                "Requirement Analysis",
                "Code Conversion",
                "Documentation",
                "Testing",
                "Validation",
                "Optimization"
            ],
            "secondary": [
                "Error Handling",
                "Performance Optimization",
                "Version Control"
            ],
            "all": [
                "Python",
                "Excel",
                "Requirement Analysis",
                "Code Conversion",
                "Documentation",
                "Testing",
                "Validation",
                "Optimization",
                "Error Handling",
                "Performance Optimization",
                "Version Control"
            ],
            "with_experience": [
                "Python",
                "Excel"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Mercy Ramya",
        "email": "mercyindusailabs.com@indusailabs.com",
        "jd": "The Python Developer will be responsible for the following tasks: Requirement Analysis:· Review and understand the existing Excel-based calculations.· Identify the key functionalities and logic implemented in the Excel sheets.· Collaborate with stakeholders to gather additional requirements and clarify any ambiguities. Code Conversion:· Convert the Excel-based calculations to Python code, ensuring accuracy and consistency.· Optimize the Python code for performance and scalability.· Implement error handling and validation to ensure robustness Documentation:· Document the existing Excel-based calculations, including formulas, macros, and data flows.· Create comprehensive documentation for the Python code, including code comments, user guides, and technical specifications.· Maintain an organized repository of all project documentation. Testing and Validation:· Develop and execute test cases to validate the accuracy and performance of the Python code.· Compare the results of the Python code with the original Excel calculations to ensure consistency.· Address any discrepancies and refine the code as needed. Optimization and Best Practices:· Identify and implement the most efficient methods for migrating calculations from Excel to Python.· Follow best practices for coding, documentation, and version control.· Provide recommendations for further improvements and optimizations.",
        "emp_type": [
            "contract"
        ],
        "source": "Email",
        "date_posted": "2024-09-30 12:07:09-05:00",
        "unique_id": "19243e7cda8c5632",
        "tag": "Python Dev"
    }
]