[
    {
        "company": "TEK Inspirations Pvt. Ltd.",
        "job_title": "Sr. Data Analyst",
        "location": "Quincy, MA, USA",
        "full_location": {
            "city": "Quincy",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "",
            "visa_sponsorship": "CITIZEN,GREEN CARD,GC EAD,H4 EAD",
            "notice_period": "",
            "duration": "6 Months with a possible extension",
            "rate": ""
        },
        "skills": {
            "core": [
                "Cloud Data warehousing",
                "data analysis",
                "BI Reporting",
                "system engineering"
            ],
            "primary": [
                "SQL",
                "AWS",
                "Snowflake",
                "SAS"
            ],
            "secondary": [
                "Tableau",
                "Cognos"
            ],
            "all": [
                "Cloud Data warehousing",
                "data analysis",
                "BI Reporting",
                "system engineering",
                "SQL",
                "AWS",
                "Snowflake",
                "SAS",
                "Tableau",
                "Cognos"
            ],
            "with_experience": [
                "Cloud-based data solutions",
                "end-to-end data pipelines",
                "large enterprise data platforms",
                "health care information",
                "data privacy controls"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Pritam Das",
        "email": "pritam.das@tekinspirations.com",
        "jd": "Job Description - IN-PERSON INTERVIEW Title: Sr. Data Analyst Location: Quincy, MA/Hybrid 2-3 days onsite every week Duration: 6 Months with a possible extension Visa : CITIZEN,GREEN CARD,GC EAD,H4 EAD Local Only from MA, NH or RI and must have recent client experience from these locations IN-PERSON INTERVIEW Requirements · 5+ years of experience in Cloud Data warehousing, data analysis, BI Reporting, enterprise and business information system architectures, and system engineering · Possess High level SQL (Preferably in Oracle and Snowflake) and/or SAS skills. · Have experience with data warehouse-based operations, analytic functions and query generation. · 3-5 years of experience developing Cloud-based (AWS) data solutions. · 5+ years of Cloud database platform experience such as Snowflake. · Experience in creating and maintaining end-to-end data pipelines. · Strong communication skills comfortable explaining/proposing solutions to technical stakeholders, vendors, and business consumers. · Experience working with a large, multi-terabyte enterprise data platform in Cloud. · Experience working with highly sensitive health care information and familiar with HIPAA and other data privacy controls. · Ability to build trusted relationships with stakeholders, managers, and employees at all levels · Ability to quickly assess/summarize information and effectively identify issues, risks, solutions · Demonstrated strength in multi-tasking and application of strong logical reasoning skills · Familiarity with eligibility and claim based system and Medicaid Federal Reporting processes Minimum Requirements: · Involve in Design and development of cloud-based data management systems. · Understand and translate business requirements into user acceptable solutions. · Generate data to meet specific business needs that require sourcing data from appropriate source systems. · Document code and processes that can be used by all interested parties, including the business, Federal Reporting team, data warehouse team members and others as directed. · Provide query writing support to other analysts and end users. · Be able to understand and implement user requests technically and operationally. · Be available to attend meetings and participate on calls with users and others as requested or directed. · Participate in team meetings and technical reviews as requested. · Communicate effectively with business, peers and management, so they are kept aware of requirements, project status, concerns, processing roadblocks. · Ensure timely delivery of solutions meeting requirements and expectations · Expertise in basic MassHealth knowledge, practices and processes. · Focused attention to detail in all assignments that fall under the purview of the EDME reporting team. · Continually develop skills in SAS and/or SQL, Tableau and Snowflake. · Support analytic and business requirements gathering efforts for ongoing reporting. · Interact with business users and communicate business needs to the Federal Reporting and Data Warehouse development teams when necessary. · The data analyst/developer is responsible for generating tables, files, reports and datasets upon request and as directed by team lead, senior staff or management · Deliver product to satisfy business request by required deadline. · Generate code in SAS or in SQL to read data from the EHS Data Warehouse and output files in a format as requested by users or others.",
        "emp_type": [
            "contract"
        ],
        "source": "Email",
        "date_posted": "2024-09-30 09:37:15-05:00",
        "unique_id": "192435cd7ebf9d22",
        "tag": "AWS Data Engineer"
    }
]