[
    {
        "company": "ZealHire Inc",
        "job_title": "Business Analyst",
        "location": "Phoenix/Scottsdale, AZ, USA",
        "full_location": {
            "city": "Phoenix",
            "state": "AZ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "onsite"
            ],
            "job_code": "",
            "experience_required": "Previous relevant industry experience= ex. Manufacturing Domain, engineering to order preferred.",
            "degree_required": "",
            "visa_sponsorship": "USC/GC only",
            "notice_period": "",
            "duration": "",
            "rate": ""
        },
        "skills": {
            "core": [
                "Design Thinking",
                "Business Analysis",
                "Design Principles",
                "Agile Principles",
                "User Stories",
                "User Flow",
                "wireframes",
                "Entity Relationship Diagram",
                "Architecture Design"
            ],
            "primary": [
                "Low Code Application Platforms (LCAPs)",
                "Mendix",
                "Salesforce"
            ],
            "secondary": [],
            "all": [
                "Design Thinking",
                "Business Analysis",
                "Design Principles",
                "Agile Principles",
                "User Stories",
                "User Flow",
                "wireframes",
                "Entity Relationship Diagram",
                "Architecture Design",
                "Low Code Application Platforms (LCAPs)",
                "Mendix",
                "Salesforce"
            ],
            "with_experience": [
                "Manufacturing Domain",
                "Engineering to Order"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Avinash Kumar",
        "email": "avinash@zealhire.com",
        "jd": "USC/GC100% onsite. Local candidates onlyNeed LinkedIn and DL Semiconductor Industry, LCAPs, User Stories and User Flow experiences are the key.Description:Onsite work in Phoenix/Scottsdale, AZ is required. Relevant industry experience is HIGHLY DESIRED - Specifically Manufacturing or Engineering to Order, prior experience with companies like- Applied Materials, ASML, LAM research, Horiba would be the MOST relevant. The client is involved in the manufacturing of semiconductors. The resource will be meeting with key stakeholder in that location. Primary responsibilities, skillset and sample deliverables expected of the Business Analyst. The Business Analyst is expected to engage end users of ASM and create design documents (components of which are listed under sample deliverables) that will enable developers to then develop on low code application platforms (LCAPs) like Mendix or Salesforce. The LCAP is being evaluated at this juncture.Key Responsibilities:Facilitate conversations with Business Unit end users to elicit problem statements and co-create use cases.Provide guidance and thought leadership on solutions for use cases.Produce low-fidelity wireframes to validate with end users and to inform Developers.Test prototypes with end users to elicit feedback and drive iterations.Establish and maintain product backlog with ASM Product OwnerKey Skillset: Previous relevant industry experience= ex. Manufacturing Domain, engineering to order preferred.Design Thinking , Business Analysis, Design Principles, Agile Principles. Sample Deliverables: Product Backlog comprising User Stories, User Flow, Wireframes, Entity Relationship Diagram + Architecture Design (Working with Technical Lead)",
        "emp_type": [
            "full-time",
            "onsite"
        ],
        "source": "Email",
        "date_posted": "2024-09-30 15:20:16-05:00",
        "unique_id": "1924496db8db2da2",
        "tag": "BA/Scrum Master/PM"
    }
]