[
    {
        "company": "PiplNow LLC",
        "job_title": "Project Manager",
        "location": "Des Moines, IA, USA",
        "full_location": {
            "city": "Des Moines",
            "state": "IA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "C2C"
            ],
            "job_code": "747735",
            "experience_required": "8+ years",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "",
            "rate": ""
        },
        "skills": {
            "core": [
                "Project Management",
                "Stakeholder Management",
                "Process Development",
                "Gap Analysis",
                "Agile Methodologies"
            ],
            "primary": [
                "System Integration Management",
                "Budget Tracking",
                "Project Scheduling"
            ],
            "secondary": [
                "Vendor Procurement",
                "Risk Mitigation",
                "Change Management"
            ],
            "all": [
                "Project Management",
                "Stakeholder Management",
                "System Integration Management",
                "Budget Tracking",
                "Project Scheduling",
                "Process Development",
                "Gap Analysis",
                "Agile Methodologies",
                "Business Requirements Documentation",
                "Risk Mitigation",
                "Change Management",
                "Vendor Management"
            ],
            "with_experience": [
                "Project Management",
                "Stakeholder Management",
                "System Integration Management",
                "Budget Tracking",
                "Project Scheduling",
                "Process Development",
                "Gap Analysis",
                "Business Requirements Documentation",
                "Agile Methodologies",
                "Change Management"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Gobi",
        "email": "gobi@piplnow.com",
        "jd": "Hi, We have an urgent C2C opening for Project Manager (747735) – Day 01 Onsite at Des Moines, IA Our client is looking to fill this role immediately. If you are interested in this role, Please share the updated resume, filled skill matrix, consultant details, visa and dl copy ASAP. Skill Matrix: Skills Years of experience Over all experience Total years of work exp in US As Project Manager Direct management of system integration and/or technology projects Experience managing stakeholder expectations and priorities Experience working within a project governance structure Extensive experience with planning, managing, and tracking projects Strong process development skills Strong process and gap analysis skills Excellent project management skills Experience with business users to gather and document requirements Ability to prioritize and manage multiple projects simultaneously Working experience with Agile projects Experience with client expectations and change management. Job Description: Project Manager (3 Positions) Location: Des Moines, IA (Local/Regional Candidates Only) Work Schedule: Onsite as needed with notice Key Responsibilities: Manage the delivery of multiple projects, including schedule, budget, and scope. Adhere to established project governance structures, including methodologies, templates, and reporting requirements. Work closely with stakeholders, including business units, analysts, architects, and upper-level state government committees. Ensure adherence to quality standards and project deliverables through rigorous tracking and analysis. Develop and maintain project schedules, resource plans, and budget tracking. Manage vendor procurement and implementation services. Conduct project meetings and provide status updates to project sponsors and the PMO Director. Mitigate risks, handle scope creep, and ensure timely delivery of a minimum viable product (MVP). Provide insights to improve processes related to portfolio, project, and program management. Multitask across multiple priorities as per leadership direction and department objectives. Collaborate effectively with cross-functional teams in a fast-paced, challenging environment. Required Qualifications: 8+ years of direct management of system integration and/or technology projects. Proven experience managing stakeholder expectations and priorities. Experience working within a formal project governance structure, utilizing templates and reports. Demonstrated experience in planning, managing, and tracking multiple high-impact projects. Strong process development skills, including the ability to learn, interpret, document, and formalize new procedures. Strong process and gap analysis skills, with the ability to identify areas for improvement. Excellent project management skills, with the ability to multitask and manage multiple tasks in a cross-functional environment. Experience gathering and documenting business requirements from business users. Proven ability to prioritize and manage multiple projects simultaneously while meeting established deadlines. 3+ years of experience working with Agile projects. Experience in managing client expectations and implementing change management initiatives.",
        "emp_type": [
            "C2C"
        ],
        "source": "Email",
        "date_posted": "2024-09-30 17:36:06-05:00",
        "unique_id": "19245385af17091e",
        "tag": "BA/Scrum Master/PM"
    }
]