[
    {
        "company": "Techrooted INC",
        "job_title": ".Net/ Angular Application Developer",
        "location": "San Jose CA, USA",
        "full_location": {
            "city": "San Jose",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "",
            "experience_required": "11+ years",
            "degree_required": "Computer Science",
            "visa_sponsorship": "USC GC only",
            "notice_period": "",
            "duration": "12+ months",
            "rate": ""
        },
        "skills": {
            "core": [
                "Angular",
                ".NET",
                "C#",
                "Azure Cloud Services"
            ],
            "primary": [
                "Angular v14",
                ".NET v6.0",
                "Web Services",
                "JavaScript",
                "Typescript"
            ],
            "secondary": [
                "HTML",
                "CSS",
                "Responsive Design"
            ],
            "all": [
                "Angular",
                ".NET",
                "C#",
                "Azure Cloud Services",
                "Web Services",
                "JavaScript",
                "Typescript",
                "HTML",
                "CSS",
                "Responsive Design"
            ],
            "with_experience": [
                ".NET",
                "Angular"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Amandeep Kaur",
        "email": "amandeep@techrooted.com",
        "jd": "Hi, This is Aman, Technical Recruiter at Techrooted, we have an excellent job opportunity for you. Please let me know if you are interested then share your updated resume along with your contact details so that we can proceed further. Objective: This Information Justice System (IJS) Project requires multiple application developers for the development of a web application that will fill the gaps of the IJS project and CJIC. Required Experience and Abilities: Having 5 years or more experience developing business application in Angular (with recent experience at a minimum using Angular v14 and up) Having 5 years or more Working with Microsoft .NET and Visual Studio (with recent experience using .NET v6.0 and up) Having 5 years or more experience developing programs in C# coding backend and web services Having 2 years or more experience using Azure Cloud Services Experience creating self-contained, reusable, and testable modules and components using Angular Strong Web UI Application development experience in building dynamic and responsive user interfaces using Angular for seamless and engaging user experiences. Solid knowledge and experience of .NET Core / frameworks (e.g. Entity Framework and LINQ); Development experience with Web Services (RESTful, SOAP) Ability to automate unit test cases for both Angular & .NET. Familiarity with build & deploy scripts, process to support CI/CD Experience with full stack (frontend and backend) Solid academic background in Computer Science Experience with Java-script & Typescript HTML/CSS Responsive Design (correct rendering regardless of device: Big Monitor, Small Monitor, Tablet, Phone, etc.) Experience with intelligent design (libraries/reusable code), documentation (inline comments, Word Documents, and Diagrams), coding standards, and code reviews Preferred to also have experience in developing application on other devices (e.g. mobile, tablets)",
        "source": "Email",
        "date_posted": "2024-09-30 08:26:43-05:00",
        "unique_id": "192431c4646b6f10",
        "tag": ".NET Dev"
    }
]