[
    {
        "company": "Devfi",
        "job_title": "Python Developer with AWS & Golang",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [],
            "job_code": "",
            "experience_required": "",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "6 + Months (likely to be extended)",
            "rate": ""
        },
        "skills": {
            "core": [
                "Python",
                "Golang",
                "AWS"
            ],
            "primary": [
                "Python",
                "Golang",
                "AWS"
            ],
            "secondary": [
                "React",
                "Java",
                "Web Development",
                "API development",
                "Testing",
                "Debugging"
            ],
            "all": [
                "Python",
                "Golang",
                "AWS",
                "React",
                "Java",
                "Web Development",
                "API development",
                "Testing",
                "Debugging"
            ],
            "with_experience": [
                "Python",
                "Golang"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Raju Chidurala",
        "email": "rajuc@devfi.com",
        "jd": "Dear IT Professional,Greetings of the day!! We have an immediate job opening with one of my direct clients. Please go through the job description and let me know your thoughts. Job Title: Python Developer with AWS & GolangLocation: Richmond, VA (Onsite day 1 for hybrid model)Duration: 6 + Months (likely to be extended) Primary Skills: Python , Golang And AWSJob Summary:We are seeking a skilled Python Developer with a strong background in AWS to join our dynamic team. The ideal candidate will have experience with at least one of the following additional technologies: React, Golang, or Java. This role requires a proactive individual who can contribute to the design, development, and maintenance of scalable software solutions. Required Qualifications:Primary Skills:Programming Languages:Proficiency in Python and GolangExperience with tool development and integration using these languagesGitHub Integration:Experience with integrating tools and applications with GitHubUnderstanding of GitHub APIs and workflows Secondary Skills:Web Development:Familiarity with web frameworks and development practices in Python and GolangKnowledge of API development and RESTful servicesTesting and Debugging:Strong debugging and troubleshooting skillsExperience with unit testing and test automation Roles and Responsibilities:Develop and maintain tools and applications using Python and GolangIntegrate tools and applications with GitHub for seamless workflowsWrite clean, efficient, and maintainable codeDebug and troubleshoot issues in the developed applicationsCollaborate with cross-functional teams to deliver high-quality software",
        "emp_type": [],
        "source": "Email",
        "date_posted": "2024-09-30 09:21:31-05:00",
        "unique_id": "192434e71270128c",
        "tag": "AWS Data Engineer"
    }
]