[
    {
        "company": "Sonitalent Corp",
        "job_title": "Pega Architect with RPA",
        "location": "Prospect, KY, USA",
        "full_location": {
            "city": "Prospect",
            "state": "KY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [],
            "job_code": "",
            "experience_required": "Min 5 years experience as a Systems Architect",
            "degree_required": "Bachelor's degree: engineering and technical backgrounds are a plus",
            "visa_sponsorship": "USC only",
            "notice_period": "",
            "duration": "6+ months",
            "rate": ""
        },
        "skills": {
            "core": [
                "Pega Systems Architect certification",
                "Pega Robotic Process Automation (RPA)",
                "Azure DevOps",
                "Agile/Scrum development methodology"
            ],
            "primary": [
                "Communication Skills",
                "Troubleshooting",
                "Critical Thinking"
            ],
            "secondary": [
                "Documentation & User Guides",
                "Digital white-boarding tools (Visio / Adobe XD / PowerPoint / Figma, etc.)"
            ],
            "all": [
                "Pega Systems Architect certification",
                "Pega Robotic Process Automation (RPA)",
                "Azure DevOps",
                "Agile/Scrum development methodology",
                "Communication Skills",
                "Troubleshooting",
                "Critical Thinking",
                "Documentation & User Guides",
                "Digital white-boarding tools (Visio / Adobe XD / PowerPoint / Figma, etc.)"
            ],
            "with_experience": [
                "Pega Robotic Process Automation (RPA)",
                "Azure DevOps",
                "Agile/Scrum development methodology"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Abdul Rahman",
        "email": "abdul.rahman@sonitalentcorp.com",
        "jd": "Hi I hope you are doing well, We are looking for a “Pega Architect with RPA”. Please share your updated resume if you are looking for a change. Job Role: Pega Architect with RPA Duration: 6+ months Interview: Phone/ Skype-2 Rounds Visa: USC only LinkedIn Must have Job Description: What You'll Do: Working In A Remote Environment: Work in a remote environment and manage a geographically distributed team. Communication Skills / Collaboration: Communicate clearly and collaborate with teams to iterate on software development concepts and other ideas beneficial to the institute. Discuss and provide an analysis of feasibility. Troubleshooting / Analysis: Troubleshoot complex technical issues using tools to help debug and analyze data. Azure DevOps: Manage work in Microsoft Azure DevOps, utilize boards, queries and creating and updating pertinent work items. Documentation & User Guides: Develop pertinent documentation and user guides for NIA applications to be used and referred to by fellow developers or NIA Staff. Critical Thinking & Analysis: Solve problems, think critically, and analyze user feedback or requirements. Analyze problems and logically break them down into sizable portions which can be presented to development teams or clients for consideration. Required Knowledge and Skills: Bachelor's degree: engineering and technical backgrounds are a plus Min 5 years experience as a Systems Architect Pega Systems Architect certification required 3+ years hands on Experience with Pega Robotic Process Automation (RPA) Experience with DevOps tools such as Azure DevOps Experience with digital white-boarding tools (Visio / Adobe XD / PowerPoint / Figma, etc.) Agile/Scrum development methodology knowledge/experience Abilities: Critical thinker with strong problem-solving ability Team player with excellent communication skills Self-motivated with a strong work ethic.",
        "source": "Email",
        "date_posted": "2024-09-30 12:53:04-05:00",
        "unique_id": "1924430649116409",
        "tag": "Pega Dev"
    }
]