[
    {
        "company": "RCI",
        "job_title": "Senior Project Manager",
        "location": "Des Moines, IA, USA",
        "full_location": {
            "city": "Des Moines",
            "state": "IA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "hybrid"
            ],
            "job_code": "747735",
            "experience_required": "8 Years",
            "degree_required": "",
            "visa_sponsorship": "Any",
            "notice_period": "",
            "duration": "12+ months",
            "rate": ""
        },
        "skills": {
            "core": [
                "Direct management of system integration and/or technology projects",
                "Experience managing stakeholder expectations and priorities",
                "Experience working within a project governance structure",
                "Experience with planning, managing and tracking multiple major impact projects",
                "Process development skills",
                "Process and gap analysis skills",
                "Excellent project management skills",
                "Experience working with business users to gather and document business requirements",
                "Ability to prioritize and manage multiple projects and activities",
                "Working experience with Agile Projects",
                "Managing client expectations and change management initiatives"
            ],
            "primary": [
                "Project management",
                "Stakeholder management",
                "Agile methodology",
                "Change management"
            ],
            "secondary": [],
            "all": [
                "Direct management of system integration and/or technology projects",
                "Experience managing stakeholder expectations and priorities",
                "Experience working within a project governance structure",
                "Experience with planning, managing and tracking multiple major impact projects",
                "Process development skills",
                "Process and gap analysis skills",
                "Excellent project management skills",
                "Experience working with business users to gather and document business requirements",
                "Ability to prioritize and manage multiple projects and activities",
                "Working experience with Agile Projects",
                "Managing client expectations and change management initiatives"
            ],
            "with_experience": [
                "Direct management of system integration and/or technology projects",
                "Experience managing stakeholder expectations and priorities",
                "Experience working within a project governance structure",
                "Experience with planning, managing and tracking multiple major impact projects",
                "Process development skills",
                "Process and gap analysis skills",
                "Excellent project management skills",
                "Experience working with business users to gather and document business requirements",
                "Ability to prioritize and manage multiple projects and activities",
                "Working experience with Agile Projects",
                "Managing client expectations and change management initiatives"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Prakash Singh",
        "email": "prakash@rconsultinginc.com",
        "jd": "Job ID: 747735\nRole: Senior Project Manager\nDuration: 12+ months\nLocation: Des Moines, IA 50309 – Hybrid\nVisa: Any\nClient: State of IA – DOM – DoIT\nLocal candidates only\nMust be available for interview on October 4TH, 7TH, 8TH\nRequired / Desired Skills\nSkillRequired / DesiredAmountof Experience\nDirect management of system integration and/or technology projectsRequired8Years\nExperience managing stakeholder expectations and prioritiesRequired8Years\nExperience working within a project governance structure (methodology, required templates and reporting)Required8Years\nExtensive experience with planning, managing and tracking multiple major impact projects.Required8Years\nStrong process development skills, w/ the ability to learn and understand concepts to interpret, document and formalize proceduresRequired8Years\nStrong process and gap analysis skillsRequired8Years\nExcellent project management skills, w/ the ability to multitask and manage multiple tasks with changing priorities in a cross-functional environmentRequired8Years\nDemonstrated experience with working with business users to gather and document business requirementsRequired6Years\nDemonstrate ability to prioritize and manage multiple projects and project activities simultaneously while meeting established deadlinesRequired6Years\nWorking experience with Agile ProjectsRequired3Years\nDemonstrated experience with managing client expectations and implementing change management initiativesRequired3Years\n\nDescription:\nThe project manager will be responsible for adhering to project management governance on multiple current and future projects. Additionally, the PM will be accountable for generating project schedules, identifying/staffing needs, resourcing, completing the procurement of vendor products / implementation services, and submitting funding requests as required. The PM will manage the delivery efforts and report status of each to the Project Sponsors and the PMO Director. The PM will work with multiple business and platform areas including Information Technology and potentially including upper-level state government committees. The Project Manager will conduct project meetings and is responsible for project tracking and analysis, ensuring adherence to quality standards and project deliverables. The PM will be part of a PMO team responsible for all aspects of IT project governance, assessment, management and control. The ability to gather and define requirements; build a project plan; identifying resource needs; and transparent, clear communications across all levels of stakeholders. Essential is the ability to multitask on continually changing and morphing priorities as prescribed by leadership in response to department and legislative direction.\n\nPOSITION RESPONSIBILITIES AND ESSENTIAL FUNCTIONS\n- Ability to work within a project governance structure (methodology, required templates and reporting)\n- Ability to interact with, educate, learn from, and drive business and IT teams.\n- Ability to work effectively under very broad direction with general supervision\n- Ability to motivate team and meet deadlines in a fast-paced and challenging environment.\n- Ability to gather and organize multiple simultaneous complex business process scenarios\n- Ability to break down complex tasks into actionable work items, sequenced appropriately\n- Ability to manage scope creep with a focus on delivering a minimum viable product\n- Excellent organizational, presentation, interpersonal and team building skills\n- Excellent time management and project planning/strategizing skills\n- Strong verbal and written communication skills\n- Demonstrated experience with managing client expectations, implementing service improvement initiatives\n- Demonstrated experience managing multiple parallel work efforts\n- Track project progress, monitor and modify project schedules and provide status updates to project team. Escalate issues to management and/or appropriate leadership as appropriate.\n- Provide insight and knowledge into improving processes related to portfolio, project and program management\n- Other duties or tasks as assigned by management.",
        "source": "Email",
        "date_posted": "2024-09-30 10:04:48-05:00",
        "unique_id": "19243a0cdd043129",
        "tag": "BA/Scrum Master/PM"
    }
]