[
    {
        "company": "Insoursys",
        "job_title": "Sr. Tosca & Python QA Engineer",
        "location": "Water Street, NY, USA",
        "full_location": {
            "city": "Water Street",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "C2H"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Bachelor's/PG degree in Computer Science, Information Systems, or equivalent",
            "visa_sponsorship": "H1B with Employers and USC and GC on W2",
            "notice_period": "",
            "duration": "6 months contract period",
            "rate": ""
        },
        "skills": {
            "core": [
                "Tosca Automation",
                "QA testing",
                "API Testing",
                "Data Testing",
                "SQL",
                "Python"
            ],
            "primary": [
                "Tosca Automation",
                "API Testing",
                "Python"
            ],
            "secondary": [
                "SQL",
                "Data Testing"
            ],
            "all": [
                "Tosca Automation",
                "QA testing",
                "API Testing",
                "Data Testing",
                "SQL",
                "Python",
                "software development lifecycle methodologies",
                "Agile",
                "defect management systems",
                "automation frameworks"
            ],
            "with_experience": [
                "Tosca Automation",
                "API Testing",
                "Data Testing",
                "SQL"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Tejaswi Athili",
        "email": "tejaswi_athili@insoursysinc.com",
        "jd": "Need: Sr. Tosca & Python QA Engineer Water Street, NY or Princeton, NJ (Hybrid) Must Be Locals With Local ID 1 Round Will be F2F of Interview (Mandatory) and C2H opportunity Employers have No Objection for having your consultant being directly hired by end client anytime AFTER the initial 6 months contract period H1B with Employers And USC and GC on W2 Note: Need to be onsite working hybrid day 1. Responsibilities: Design and develop automation/performance solutions that meet organization standards and build reliable, reusable, and maintainable automated regression suites & test harnesses Create/Maintain tools and frameworks with quality code to simplify testing scenarios Design and develop test plans, and test cases based on functional and design specifications, execute test cases, and analyze and report test results to the teams Work in partnership with the development teams to deliver business functionality on time with required quality that meets the acceptance criteria Uses strong testing skills to provide guidance and assist project staff as appropriate Ensures best practices are followed and testing activities stay on schedule Focus on building efficient solutions for Web, Services/APIs, Database, UI (Multi-browser) testing requirements. Requirement: Bachelor's/PG degree in Computer Science, Information Systems, or equivalent 5+ years of strong experience in QA/testing Strong in API Testing, Data Testing, and SQL queries Strong knowledge of database, API, and software testing concepts Strong knowledge of coding skills in any programming language, preferably Python. Tosca Automation is a must Develop comprehensive test strategy, test plan, and test cases Proficient with software development lifecycle (SDLC) methodologies like Agile, QA methodologies, defect management systems, and documentation Experience in automation, automation frameworks, and automation delivery preferred Good at setting quality standards in various new testing technologies in the industry Good at identifying and defining areas to calculate the overall risk to the project and creating strategies to mitigate those risks and escalate as necessary Excellent analytical and communication skills are essential, with strong verbal and writing proficiencies.",
        "source": "Email",
        "date_posted": "2024-09-30 13:42:54-05:00",
        "unique_id": "192443db70136bbd",
        "tag": "Python Dev"
    }
]