[
    {
        "company": "Scalable Systems",
        "job_title": "Pega CDH Developer",
        "location": "Las Vegas, NV, USA",
        "full_location": {
            "city": "Las Vegas",
            "state": "NV",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [],
            "job_code": "",
            "experience_required": "",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "",
            "rate": ""
        },
        "skills": {
            "core": [
                "Pega CDH",
                "Pega Platform",
                "Java",
                "JavaScript"
            ],
            "primary": [
                "Pega CDH",
                "Pega Platform"
            ],
            "secondary": [
                "Integration Techniques",
                "Problem-Solving",
                "Communication",
                "Attention to Detail"
            ],
            "all": [
                "Pega CDH",
                "Pega Platform",
                "Java",
                "JavaScript",
                "Integration Techniques",
                "Problem-Solving",
                "Communication",
                "Attention to Detail",
                "Pega Certifications",
                "Cloud Experience"
            ],
            "with_experience": [
                "Pega CDH",
                "Pega Platform",
                "Integration Techniques"
            ]
        },
        "job_type": [],
        "contact_person": "Ayush Yadav",
        "email": "ayush.yadav@scalable-systems.com",
        "jd": "Job Description: Pega CDH Developer Location: Las Vegas, NV About the Role: As a Pega CDH Developer, you will be responsible for designing, developing, and implementing Pega applications using the Pega Platform. You will work closely with business analysts, architects, and other team members to deliver high-quality solutions that meet the needs of our clients. Key Responsibilities: Design and Develop Pega Applications: Analyze business requirements and translate them into Pega-based solutions. Develop custom Pega applications, including case management, rules, activities, and integrations. Pega CDH Expertise: Demonstrate deep knowledge and experience with Pega CDH (Case Designer and Harness). Utilize Pega's low-code capabilities to rapidly build and configure applications. Integration: Integrate Pega applications with other systems using various integration techniques (e.g., APIs, SOAP, REST). Testing and Quality Assurance: Conduct unit testing, integration testing, and user acceptance testing to ensure the quality of Pega applications. Troubleshooting and Support: Provide technical support and troubleshooting for Pega applications. Continuous Learning: Stay up-to-date with the latest Pega technologies and best practices. Required Skills and Qualifications: Pega CDH Expertise: Proven experience with Pega CDH, including Case Designer, Harness, and other relevant components. Pega Platform Knowledge: Strong understanding of the Pega Platform architecture, components, and capabilities. Development Skills: Proficiency in Java, JavaScript, and other programming languages. Integration Experience: Experience with integrating Pega applications with other systems using various integration techniques. Problem-Solving and Analytical Skills: Ability to analyze complex problems and develop effective solutions. Communication Skills: Excellent written and verbal communication skills to collaborate effectively with team members and stakeholders. Attention to Detail: Meticulous attention to detail to ensure accuracy and quality in deliverables. Preferred Skills: Pega Certifications: Pega Certified System Architect (PCSA), Pega Certified Lead System Architect (PCLSA), or other relevant Pega certifications. Industry Experience: Experience in the insurance, healthcare, or financial services industries. Cloud Experience: Experience with cloud platforms (e.g., AWS, Azure, GCP) and cloud-native development.",
        "emp_type": [],
        "source": "Email",
        "date_posted": "2024-09-30 12:17:46-05:00",
        "unique_id": "19243f337cd94176",
        "tag": "Pega Dev"
    }
]