[
    {
        "company": "Tanisha Systems",
        "job_title": "IT Project Manager",
        "location": "Conshohocken, PA, USA; Garden City, NY, USA; Morristown, NJ, USA; New York City, NY, USA; Purchase, NY, USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "B.A / B.S degree",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "Long term",
            "rate": ""
        },
        "skills": {
            "core": [
                "commercial insurance",
                "PMLC",
                "SDLC",
                "project management",
                "communication skills",
                "facilitation skills",
                "agile",
                "waterfall",
                "hybrid project delivery methodologies"
            ],
            "primary": [
                "project management experience",
                "IT project management",
                "requirements gathering",
                "testing processes",
                "analytical skills"
            ],
            "secondary": [
                "Project and Portfolio Management tools",
                "MS Project",
                "Planview",
                "SharePoint"
            ],
            "all": [
                "commercial insurance",
                "PMLC",
                "SDLC",
                "project management",
                "communication skills",
                "facilitation skills",
                "agile",
                "waterfall",
                "hybrid project delivery methodologies",
                "project management experience",
                "IT project management",
                "requirements gathering",
                "testing processes",
                "analytical skills",
                "Project and Portfolio Management tools",
                "MS Project",
                "Planview",
                "SharePoint"
            ],
            "with_experience": [
                "commercial insurance",
                "PMLC",
                "SDLC",
                "project management",
                "requirements gathering",
                "testing processes"
            ]
        },
        "job_type": [],
        "contact_person": "Saumya Singh",
        "email": "saumya@tanishasystems.com",
        "jd": "IT Project Manager Onsite – In Office (Conshohocken, PA; Garden City, NY; Morristown, NJ; New York City, NY; Purchase, NY) Long term Contract Must have experience in Commercial Insurance and PMLC and SDLC processes Role Summary: The IT Project Manager is responsible for managing IT projects on a day-to-day basis using the Project Management Life Cycle process and deliverables. Role responsibilities: Perform project management duties for complex IT projects, including those involving AI solutions, in accordance with PMLC and SDLC processes. These objectives include: Perform day-to-day management of all project phases to ensure deliverables are completed on time and budget. Coordinate all project activities with IT project team members and business owners/ stakeholders. Track performance against objectives and develop corrective strategies when objectives are not being met. Create, manage, and update project charters, schedules, risk management plans, communication plans, project budgets, gate reviews and all other project management documentation. Work with project team members and management to secure resources and funding. Coordinate closely with project stakeholders to define project scopes and schedules. Collaborate with these stakeholders to understand business needs, processes, and data sources. Work with business analysts and architects to translate these business needs into clearly documented detailed requirements and functional specifications. Provide regular status updates and maintain relevant metrics to provide transparency on team performance. Communicate with executive leadership to provide project risk analysis, status, and requirements that may impact strategic direction. Stay abreast of AI trends and advancements, evaluating their potential impact and application within ongoing and future projects. Ensure that projects comply with audit requirements. Identify and coordinate cross-project dependencies. Perform additional projects and assignments as needed. Technical Qualifications: 5+ years of project management experience for application and data integration projects. Detailed knowledge of project management and software development life cycle methodologies. Proven experience managing mid-sized to large IT integration projects – independently. Background in Commercial Insurance is highly desired. Strong communication and facilitation skills with an ability to effectively manage cross-functional team discussions. Strong management skills with an ability to achieve results in a matrix management environment. Ability to translate business needs into IT deliverables. Possess the ability to successfully apply waterfall, agile, and hybrid project delivery methodologies. Multi-disciplinary information technology familiarity with proven systems deployment experience. Experience using Project and Portfolio Management tools (MS Project, Planview, SharePoint, etc.). General Qualifications: Expertise with all aspects of requirements and testing processes. Detail-oriented and extremely organized. Strong business planning, organizing, prioritizing and analytical skills. Strong analytical abilities. Skilled in working across organizational boundaries, bringing together people with diverse perspectives and experience to find solutions. Excellent written and verbal (business) communications skills. Personal time management skills and ability to meet individual and team deadlines. Be able to handle multiple priorities and proactively identify risks to project timelines. Team player who works well with technical and business resources.",
        "emp_type": [],
        "source": "Email",
        "date_posted": "2024-09-30 13:04:30-05:00",
        "unique_id": "192441bab4dd659b",
        "tag": "BA/Scrum Master/PM"
    }
]