[
    {
        "company": "Source Infotech",
        "job_title": "Senior/Principal Python Developer",
        "location": "Boston, MA, USA OR San Francisco, CA, USA",
        "full_location": {
            "city": "Boston",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "Hybrid",
                "Contract"
            ],
            "job_code": "",
            "experience_required": "8+ years",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "8-12+ months (can extend longer)",
            "rate": ""
        },
        "skills": {
            "core": [
                "Python",
                "AWS",
                "Django",
                "Flask",
                "JavaScript",
                "HTML",
                "CSS",
                "SQL",
                "NoSQL",
                "RESTful APIs",
                "Git"
            ],
            "primary": [
                "Python",
                "AWS",
                "Financial Services"
            ],
            "secondary": [
                "JavaScript",
                "HTML",
                "CSS",
                "Django",
                "Flask"
            ],
            "all": [
                "Python",
                "AWS",
                "Django",
                "Flask",
                "JavaScript",
                "HTML",
                "CSS",
                "SQL",
                "NoSQL",
                "RESTful APIs",
                "Git",
                "Pandas",
                "Numpy"
            ],
            "with_experience": [
                "Python",
                "AWS",
                "Financial Services"
            ]
        },
        "job_type": [
            "Hybrid"
        ],
        "contact_person": "Gaurav Chaudhary",
        "email": "g.chaudhary@sourceinfotech.com",
        "jd": "Hello, Hope you are doing well I have positions for Senior/Principal Python Developer in Boston, MA OR San Francisco Hybrid (2 days onsite per week) with our client. Kindly review the job description below and see if it might be an option worth considering Job Title: Senior/Principal Python Developer Location: Boston, MA OR San Francisco Hybrid (2 days onsite per week) Duration: 8-12+ months (can extend longer) MUST BE ONSITE FROM DAY 1 – 2X PER WEEK Must have Senior/principal level python development Financial services specifically pre-Trading platform experience AWS This resource can either sit in Boston or San Fran and must be local to either of their offices there. They will be required to come onsite 2x per week. Important Skills Technical – AWS, financial services, deploying code in AWS, Pre-Trading platform experience Must Have: 8+ years of experience working hands-on as a Python Developer. Extensive financial services experience, specifically working on Pre-Trading Platforms 5+ years’ experience deploying code on AWS Responsibilities: Design and Development: Create and maintain applications using Python, JavaScript, HTML, and CSS. Back-End Development: Develop and maintain back-end services and APIs using Python frameworks such as Django or Flask. Front-End Integration: Integrate front-end components into applications, ensuring seamless user experiences. Database Management: Develop and maintain databases and data storage solutions. Code Quality Assurance: Conduct code reviews, ensure code quality, and adhere to best practices. Mentorship: Provide technical leadership and mentorship to junior developers. Collaboration: Work collaboratively with team members and other stakeholders to define project requirements and specifications. Documentation: Prepare technical documentation to ensure transparency and accessibility of the development process. Performance Optimization: Optimize software for performance and scalability. Requirements: Experience: Proven experience as a Senior Python Developer with a strong portfolio of building applications for pre-trading systems in Financial Service Technical Skills: Proficiency in Python, Python libraries and Python frameworks (e.g., Django, Flask, Pandas, Numpy). Strong knowledge of front-end technologies (e.g., JavaScript, HTML, CSS). Experience with databases (e.g., SQL, NoSQL) and data storage solutions. Experience with version control systems (e.g., Git). Understanding of RESTful APIs and web services. Experience in using AWS services like SNS, SQS, CloudFormation, lambda Experience in deploying code on AWS platform Knowledge of CI/CD pipelines and DevOps practices. Soft Skills: Excellent problem-solving and analytical skills. Strong communication and teamwork abilities. Attention to detail and a commitment to delivering high-quality software. Leadership skills and the ability to mentor junior team members.",
        "source": "Email",
        "date_posted": "2024-09-30 12:16:04-05:00",
        "unique_id": "19243f1a2b111e42",
        "tag": "Python Dev"
    }
]