[
    {
        "company": "Stellent IT",
        "job_title": "SAP Basis Administrator",
        "location": "Atlanta, Georgia, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "Georgia",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "onsite"
            ],
            "job_code": "",
            "experience_required": "Over 5 years of experience in SAP Basis administration tasks",
            "degree_required": "Bachelor's degree in computer science or related field, or equivalent experience",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "8+ months",
            "rate": ""
        },
        "skills": {
            "core": [
                "SAP Basis administration",
                "UNIX (AIX)",
                "Linux (Red Hat)",
                "Windows OS",
                "Oracle Database Administration",
                "SQL",
                "SAP Certification (Basis or NetWeaver)"
            ],
            "primary": [
                "Oracle 19c",
                "SSL Certificate Implementation",
                "SAP system optimization",
                "Business Objects Administration"
            ],
            "secondary": [
                "SAP OSS functionality",
                "Capacity planning",
                "Disaster-recovery",
                "Performance tuning",
                "SAP Bundle Patch installation",
                "System refresh & client copies"
            ],
            "all": [
                "SAP Basis administration",
                "UNIX (AIX)",
                "Linux (Red Hat)",
                "Windows OS",
                "Oracle Database Administration",
                "SQL",
                "SAP Certification (Basis or NetWeaver)",
                "Oracle 19c",
                "SSL Certificate Implementation",
                "SAP system optimization",
                "Business Objects Administration",
                "SAP OSS functionality",
                "Capacity planning",
                "Disaster-recovery",
                "Performance tuning",
                "SAP Bundle Patch installation",
                "System refresh & client copies"
            ],
            "with_experience": []
        },
        "job_type": [],
        "contact_person": "Priyanka",
        "email": "priyanka@stellentit.com",
        "jd": "SAP Basis Administrator with ORACLE Atlanta, Georgia (ONSITE ONLY LOCAL WITH STATE IS MUST LIVE WITHIN 1-2 hours) FACE TO FACE INTERVIEW We are seeking a skilled SAP Systems Administrator to manage the technical setup and maintenance of our SAP systems. This role involves overseeing a range of tasks, including installations, upgrades, troubleshooting, connectivity, database administration, SSL Certificate Implementation, network management, and providing MS failover cluster HA support. Proficiency in UNIX (AIX), Linux (Red Hat), and Windows OS is essential for success in this role. Join our team and play a pivotal role in ensuring the smooth operation of our SAP systems infrastructure. 8+ month need. Minimum Qualifications: SAP Certification (Basis or NetWeaver) on Oracle DB Over 5 years of experience in SAP Basis administration tasks such as system installations, upgrades, patches, performance tuning, and troubleshooting. Proficiency in operating systems like Unix/Linux and Windows. Familiarity with database management systems, particularly those used with SAP systems Preferred Experience: • Bachelor's degree in computer science or related field, or equivalent experience. • Proficiency in Oracle and SQL database administration, preferably with experience in Oracle 19c • Experience in SAP Bundle Patch installation. • Ability to perform SAP system optimization and conduct health check analyses. • Familiarity with SAP OSS functionality. • Knowledge of maintaining and connecting multiple SAP systems. • Experience in SSL Certificate implementation. • Proficiency in AIX and Windows OS administration. • Previous involvement in system upgrades. • Experience in Business Objects Administration. • Familiarity with SAP technology stack, including SAP Enterprise Core Component (ECC), Business Intelligence (BI), Enterprise Portal (EP), CRM, SRM, BOBJ, CUA, Redwood, MDM, and JAVA systems. Responsibilities: Integrate the SAP technologies, products, and infrastructure components to run the best in class to deliver business value. Provide technical solutions to meet the requirements, improve system performance and address chronic issues in a multi-instance SAP Environment. Strong hands-on experience with SAP Basis tasks such as calculating strategic requirements and implementing landscape and infrastructure, capacity planning (sizing), high-availability with MS cluster and disaster-recovery, system restore from backup, work with storage team to resolve backup failures, SAP upgrades, System refresh & client copies and Basis administration. Strong knowledge of UNIX, Linux and Windows operating systems. Knowledge should include performance analysis and debugging. Good knowledge on HA/DR technologies including maintenance of HA/DR solutions. Strong knowledge of Oracle Database Administration. Deep knowledge including performance query analysis, SQL Trace analysis, long running job verification, sizing, HA/DR and storage/disk design of Oracle. Strong experience with planning, design, installation, and technical configuration of SAP modules and components. Experienced with complex SAP and non-SAP technical integration and monitoring solutions for SAP applications and platforms. Strong knowledge of Instance, database and query tuning to improve the performance of the database/application. Strong experience with operations of Mid-large-scale SAP landscapes. Ability to work individually (self-motivated) and within a team environment. Experience managing multiple IT initiatives and multiple teams defining systems strategy, developing systems requirements, testing, training, defining support procedures and implementing practical business solutions under multiple deadlines. Adept at designing and implementing technology-enabled business solutions for a government agency as part of a high-talent team and as a team member or a team lead on at least 3+ full cycle SAP Implementations/Upgrade projects.",
        "source": "Email",
        "date_posted": "2024-09-30 10:44:43-05:00",
        "unique_id": "192439ad18728765",
        "tag": "Oracle DBA"
    }
]