[
    {
        "company": "Corteva",
        "job_title": "AWS Software Engineer",
        "location": "Johnston, IA, USA",
        "full_location": {
            "city": "Johnston",
            "state": "IA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "",
            "experience_required": "4 years",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "6 months",
            "rate": ""
        },
        "skills": {
            "core": [
                "AWS",
                "Python",
                "C#",
                "JavaScript",
                "Angular",
                "SQL"
            ],
            "primary": [
                "full-stack web application development",
                "data processing pipelines",
                "DevOps practices"
            ],
            "secondary": [
                "agile software development practices",
                "good communication skills"
            ],
            "all": [
                "full-stack web application development",
                "AWS",
                "Python",
                "C#",
                "JavaScript",
                "Angular",
                "SQL",
                "data processing pipelines",
                "DevOps practices",
                "agile software development practices",
                "good communication skills"
            ],
            "with_experience": [
                "AWS Services",
                "database-backed application development",
                "debugging full stack web applications",
                "modifying CI/CD pipelines",
                "Linux environment"
            ]
        },
        "job_type": [
            "onsite",
            "remote"
        ],
        "contact_person": "Nitin Tehriya",
        "email": "nitin.tehriya@tekinspirations.com",
        "jd": "AWS Software engineer Location : : Onsite Johnston, IA or Indianapolis, IN need local with DL Duration: 6months MOI: Skype Need local candidate with DL Ideal Candidate: - Agriculture Background - Located near Johnston, IA or Indianapolis, IN we would like to see someone who has agriculture experience as Corteva is a big entity and works with a lot of contractors. Please note, this role CAN be remote however if they live within 50 miles of either Johnston, IA or Indianapolis, IN. Software Engineer - AWS Location: Onsite Johnston, IA or Indianapolis, IN OR Remote (if more than 50 miles from locations) Interview Style: 1-2 Rounds Virtual Location: Preference: Johnston, IA – candidate living within 50 mile radius of location required onsite T/W/TH each week. Remote - candidate can be considered as remote if in the US and living more than 50 miles from above indicated GBC location. Project Scope and Brief Description: Application feature development and maintenance for our data processing pipelines and full-stack web applications. Applications focused primarily on image and data processing supporting seed product development in Corteva R&D. Responsibilities: • Develop and support high-quality, scalable, and secure data processing pipelines and full-stack web applications. • Create and execute unit and integration tests consistently for every software development feature completed. • Leverage your solid understanding of design principles and coding practices to craft elegant solutions for R&D. • Deploy applications to AWS and Azure clouds by applying DevOps practices including continuous integration, continuous delivery, testing, monitoring, and automation. • Actively and frequently collaborate with a small team of engineers and analysts at agile project ceremonies such as daily scrum, sprint planning, and sprint reviews. Skills / Experience: Skill Minimum Required Experience Experience developing high quality, multi-tier applications 4 years Proficiency in full-stack web application development including RESTful services and using industry-standard tools, languages, and frameworks such as Python, C#, JavaScript and Angular. Note: Python experience needed for current application set. 2 years Experience with AWS Services like Lambda, Fargate, API Gateway, S3, & RDS, or equivalent experience with other cloud provider services 1 year Experience with database-backed application development including SQL queries 1 year Debugging full stack web applications 1 year Modifying CI/CD pipelines 1 year Linux environment 1 year Additional Beneficial Skills and Experience: • Possesses and demonstrates good communication skills (both written and verbal) • Good working knowledge of SQL and relational databases, including ORM concepts • Familiarity applying agile software development practices as a member of a small team.",
        "emp_type": [
            "contract"
        ],
        "source": "Email",
        "date_posted": "2024-09-30 13:28:51-05:00",
        "unique_id": "1924430dab67444d",
        "tag": "AWS Data Engineer"
    }
]