[
    {
        "company": "Panzer Solutions LLC",
        "job_title": "Cloud Data Architect",
        "location": "Austin Texas, USA",
        "full_location": {
            "city": "Austin",
            "state": "Texas",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [],
            "job_code": "",
            "experience_required": "Minimum 17+ Years",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "",
            "rate": ""
        },
        "skills": {
            "core": [
                "data modeling",
                "data integration",
                "data warehousing",
                "data governance",
                "data security",
                "cloud-native database technologies",
                "high availability",
                "disaster recovery",
                "database performance tuning",
                "CI/CD methodology",
                "API design",
                "web services",
                "RESTful APIs",
                "monitoring tools",
                "DevOps tools"
            ],
            "primary": [
                "Oracle",
                "PostgreSQL"
            ],
            "secondary": [],
            "all": [
                "data modeling",
                "data integration",
                "data warehousing",
                "data governance",
                "data security",
                "cloud-native database technologies",
                "high availability",
                "disaster recovery",
                "database performance tuning",
                "database sharding",
                "table partitioning",
                "horizontal scaling",
                "vertical scaling",
                "user load identification",
                "system optimization",
                "Agile development",
                "program management",
                "cloud migration",
                "RDS",
                "RDS Proxy",
                "data services",
                "data transformation",
                "SaaS",
                "PaaS",
                "IaaS",
                "security",
                "identity/access management",
                "monitoring",
                "platform engineering",
                "mobile development",
                "tablet development",
                "API design",
                "web services",
                "monitoring tools",
                "DevOps tools",
                "GitLab",
                "Jenkins",
                "containers"
            ],
            "with_experience": []
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Zaid Khan",
        "email": "zaid.khan@panzersolutions.com",
        "jd": "Dear Consultant, How are you doing well! My name is Zaid khan and I am working as a Talent Acquisition at Panzer Solutions LLC. We deal with US IT and non IT recruitment services. We have the below opening with our preferred client, let me know if you are available & interested in this position. If interested please share a copy of your resume and best time, number to reach. Immediate Interview Candidates Must be Local Texas to Only NOTE : Candidates Must Have Previous Experience with Any State Client Position Title: Cloud Data Architect ( BACKFILL Role ) Location: Austin Texas Position Will be Remote in Texas Exp: Minimum 17+ Years Must Experience with data modeling, data integration, data warehousing, data governance, and data security Experience developing migration strategies for on-premises databases to cloud-native database technologies Experience developing, updating and maintaining conceptual, logical, and physical data models to support changing business requirements Experience designing and implementing data architectures that enable efficient data storage, retrieval and analysis Experience designing and implementing high availability and disaster recovery solutions to minimize database downtime for planned/unplanned outages Experience with Oracle and/or PostgreSQL in HA deployments and Expertise in data storage Experience migrating Oracle RAC/Exadata infrastructure to a public cloud environment Experience designing and implementing effective and efficient data models Experience with database performance tuning benchmark techniques, database sharding, table partitioning, horizontal/vertical scaling, user load, identification/measuring bottlenecks, system optimization Hands-on experience with Agile development, Program management/project management experience for large cloud migrations Hands on experience with database services like RDS, RDS Proxy and other Data Services. Experience with replication of databases and other types of data. Experience transforming data into cloud native storage and other formats. Experience using standard concepts, practices, and procedures of cloud technology, including Software as a Service (SaaS), Platform as a Service (PaaS), or Infrastructure as a Service (IaaS). Hands-on experience with adjacent technology areas including Security, Identity / Access Management and Monitoring. Hands-on experience as a platform engineer for Cloud platform Hands-on experience with CI/CD methodology Hands-on development experience for mobile and tablet platforms Experience with APIs design and implementation. Experience with Web services and RESTful APIs Experience with Monitoring tools Experience with DevOps tools GitLab, Jenkins, and Container.",
        "emp_type": [],
        "source": "Email",
        "date_posted": "2024-09-30 12:02:38-05:00",
        "unique_id": "19243e3ab1959f47",
        "tag": "AWS Data Engineer"
    }
]