[
    {
        "company": "STM Consulting Inc",
        "job_title": "PM6-Project Manager",
        "location": "Des Moines, IA 50309, USA",
        "full_location": {
            "city": "Des Moines",
            "state": "IA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [],
            "job_code": "747735",
            "experience_required": "9 to 10 years",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "12 Months",
            "rate": ""
        },
        "skills": {
            "core": [
                "Project Management",
                "Stakeholder Management",
                "Agile Methodology"
            ],
            "primary": [
                "System Integration",
                "Technology Projects",
                "Project Governance",
                "Business Requirements Gathering"
            ],
            "secondary": [
                "Process Development",
                "Process Analysis",
                "Multitasking",
                "Change Management"
            ],
            "all": [
                "Project Management",
                "Stakeholder Management",
                "Agile Methodology",
                "System Integration",
                "Technology Projects",
                "Project Governance",
                "Business Requirements Gathering",
                "Process Development",
                "Process Analysis",
                "Multitasking",
                "Change Management"
            ],
            "with_experience": [
                "Project Management",
                "Stakeholder Management",
                "Agile Methodology",
                "System Integration",
                "Technology Projects"
            ]
        },
        "job_type": [
            "Hybrid"
        ],
        "contact_person": "Mounika",
        "email": "kavuri.moinika@consultstm.com",
        "jd": "Hi Professional, Hope your doing good Immediate need for PM6-Project Manager at Des Moines, IA 50309 Requisition ID: 747735. Position: PM6-Project Manager Location: Des Moines, IA 50309 - Hybrid (2 to 3 days a week onsite, every week). Duration: 12 Months. Max 2 Submissions Need full address (Including Zip) of the candidate. Need Internal Summary. Manager: Shannon Swenson Interview: Web Cam or In Person Interview Note: INTERVIEW DATES: Interviews will be conducted on [October 4TH, 7TH, 8TH] Only submit candidates available for interviews on the date(s) provided. Skills Matrix: (9 to 10 Years' Experience)·Direct management of system integration and/or technology projects·Experience managing stakeholder expectations and priorities·Experience working within a project governance structure (methodology, required templates and reporting)·Extensive experience with planning, managing and tracking multiple major impact projects.·Strong process development skills, w/ the ability to learn and understand concepts to interpret, document and formalize procedures·Strong process and gap analysis skills·Excellent project management skills, w/ the ability to multitask and manage multiple tasks with changing priorities in a cross-functional environment·Demonstrated experience with working with business users to gather and document business requirements·Demonstrate ability to prioritize and manage multiple projects and project activities simultaneously while meeting established deadlines·Working experience with Agile Projects·Demonstrated experience with managing client expectations and implementing change management initiatives The Department of Management/Division of Information Technology (DOM-DoIT) Project Manager is responsible for a variety of department and project tasks associated with the managing and tracking of business and IT initiatives. This requisition is for three (3) Project Managers resource to handle multiple projects across DOM-DoIT. Currently, these projects will include a project with DOM ADO to GitHub migration, HHS Vision, Manage Engine Rollout, Security Initiatives and other projects as they are approved and funded. *** LIMIT SUBMITTALS TO LOCAL/REGIONAL RESOURCE AVAILIBLE TO BE ONSITE AS NEEDED WITH NOTICE*** DOM-DoIT – PMO Division provides adaptable, secure, and cost-effective technology services and solutions across multiple State Agencies and Divisions. We manage all the State's IT assets, projects and resources, and we deliver technology and expertise to support Citizens of Iowa and their family’s every day. This includes consistently delivering top tier performance and value to citizens as a trusted partner and services provider. The PMO is committed to the pursuit of creative and innovative solutions that enable our State to help Iowans achieve healthy, safe, stable and self-sufficient lives through the programs and services we provide. We strive for an IT culture that identifies the newest, most effective solutions through discovery, open discussion and collaboration. We have fun together, care about each other and take pride in the solutions we provide. We believe in continuously optimizing our processes, refining our solutions and improving ourselves to the benefit of the Iowans we serve. If you are passionate about applying your creative and innovative architecture strategies and approaches across the State of Iowa technology enterprise, then this is the role for you! The department is seeking a Project Manager to drive technology projects to completion while ensuring adherence to established budgets, business plans, process, procedures and requirements while working closely with business unit personnel, Business Analysts and Architects. The project manager will be responsible for adhering to project management governance on multiple current and future projects. Additionally, the PM will be accountable for generating project schedules, identifying/staffing needs, resourcing, completing the procurement of vendor products / implementation services, and submitting funding requests as required. The PM will manage the delivery efforts and report status of each to the Project Sponsors and the PMO Director. The PM will work with multiple business and platform areas including Information Technology and potentially including upper-level state government committees. The Project Manager will conduct project meetings and is responsible for project tracking and analysis, ensuring adherence to quality standards and project deliverables. The PM will be part of a PMO team responsible for all aspects of IT project governance, assessment, management and control. The ability to gather and define requirements; build a project plan; identifying resource needs; and transparent, clear communications across all levels of stakeholders. Essential is the ability to multitask on continually changing and morphing priorities as prescribed by leadership in response to department and legislative direction. Requirements: (9 to 10 years experience)·Direct management of system integration and/or technology projects ·Experience managing stakeholder expectations and priorities ·Experience working within a project governance structure (methodology, required templates and reporting) ·Extensive experience with planning, managing and tracking multiple major impact projects.·Strong process development skills, w/ the ability to learn and understand concepts to interpret, document and formalize procedures ·Strong process and gap analysis skills·Excellent project management skills, w/ the ability to multitask and manage multiple tasks with changing priorities in a cross-functional environment ·Demonstrated experience with working with business users to gather and document business requirements·Demonstrate ability to prioritize and manage multiple projects and project activities simultaneously while meeting established deadlines ·Working experience with Agile Projects·Demonstrated experience with managing client expectations and implementing change management initiatives POSITION RESPONSIBILITIES AND ESSENTIAL FUNCTIONS·Ability to work within a project governance structure (methodology, required templates and reporting)·Ability to interact with, educate, learn from, and drive business and IT teams.·Ability to work effectively under very broad direction with general supervision·Ability to motivate team and meet deadlines in a fast-paced and challenging environment.·Ability to gather and organize multiple simultaneous complex business process scenarios·Ability to break down complex tasks into actionable work items, sequenced appropriately·Ability to manage scope creep with a focus on delivering a minimum viable product·Excellent organizational, presentation, interpersonal and team building skills·Excellent time management and project planning/strategizing skills·Strong verbal and written communication skills·Demonstrated experience with managing client expectations, implementing service improvement initiatives·Demonstrated experience managing multiple parallel work efforts·Track project progress, monitor and modify project schedules and provide status updates to project team. Escalate issues to management and/or appropriate leadership as appropriate.·Provide insight and knowledge into improving processes related to portfolio, project and program management·Other duties or tasks as assigned by management.",
        "source": "Email",
        "date_posted": "2024-09-30 09:05:50-05:00",
        "unique_id": "19243c95391c070b",
        "tag": "BA/Scrum Master/PM"
    }
]