[
    {
        "company": "Vizon Inc",
        "job_title": "Microsoft Dynamics Business Analyst",
        "location": "Chicago, Illinois, USA",
        "full_location": {
            "city": "Chicago",
            "state": "Illinois",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "",
            "experience_required": "8+ years",
            "degree_required": "Bachelor's degree in computer science, marketing, business administration or relevant field",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "6 months",
            "rate": ""
        },
        "skills": {
            "core": [
                "Microsoft Dynamics CRM",
                "Business Analysis",
                "Functional Analysis",
                "Sales and Marketing"
            ],
            "primary": [
                "Microsoft Dynamics CRM"
            ],
            "secondary": [
                "Mining/Heavy industries experience"
            ],
            "all": [
                "Microsoft Dynamics CRM",
                "Business Analysis",
                "Functional Analysis",
                "Sales and Marketing",
                "Mining/Heavy industries experience"
            ],
            "with_experience": [
                "Microsoft Dynamics CRM",
                "Business Analysis",
                "Functional Analysis"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Harsh Goyal",
        "email": "harsh@vizoninc.com",
        "jd": "Must have prior experience working in the Mining/Heavy industries!!! Job Description - Must have valid LinkedIn with profile photo & two end client references. There will be technical video screening with PV Duration: 6-month contract to hire Technical Video call for screening Job Title: Microsoft Dynamics Business Analyst Location: Chicago, IL – hybrid work model ( Must be local) This position is located in our Chicago office with work performed at client site in Chicago; however, a hybrid working model is acceptable. Candidates will be required to work onsite as often as requested by the client. JOB OVERVIEW Looking for experienced lead Microsoft Dynamics CRM Business/Functional Analyst with experience in the Mining/Heavy industries preferred along with experience in the Sales and Marketing area of CRM implementation. The lead functional analyst for CRM-Dynamics will be expected to: Gather business needs/requirements Act as a bridge between business and IT teams Design the dynamics modules, Conduct design meetings/workshops Work with the technical team to develop the design Work with the testing team Conduct some training for the end users. Future duties and responsibilities: Gather business needs/requirements Act as a bridge between business and IT teams Design the dynamics modules, Conduct design meetings/workshops Work with the technical team to develop the design Work with the testing team Conduct some training for the end users. Required qualifications to be successful in this role 8+ year of experience working with Microsoft dynamics marketing and sales CRM Implementation 8+ year of experience working as a Business/Functional Analyst Minimum Education Required: Bachelors degree in computer science, marketing, business administration or relevant field. Fluent in English – French a plus.",
        "emp_type": [
            "contract"
        ],
        "source": "Email",
        "date_posted": "2024-09-30 10:37:59-05:00",
        "unique_id": "19243946e047e3db",
        "tag": "BA/Scrum Master/PM"
    }
]