[
    {
        "company": "Yochana IT Solutions",
        "job_title": "AWS Python Developer",
        "location": "Plano, TX, USA",
        "full_location": {
            "city": "Plano",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [],
            "job_code": "",
            "experience_required": "",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "",
            "rate": ""
        },
        "skills": {
            "core": [
                "Python",
                "GitHub Integration"
            ],
            "primary": [
                "Proficiency in Python",
                "Experience with tool development and integration using Python",
                "Experience with integrating tools and applications with GitHub",
                "Understanding of GitHub APIs and workflows"
            ],
            "secondary": [
                "Familiarity with web frameworks and development practices in Python and Golang",
                "Knowledge of API development and RESTful services",
                "Strong debugging and troubleshooting skills",
                "Experience with unit testing and test automation"
            ],
            "all": [
                "Python",
                "GitHub Integration",
                "Proficiency in Python",
                "Experience with tool development and integration using Python",
                "Experience with integrating tools and applications with GitHub",
                "Understanding of GitHub APIs and workflows",
                "Familiarity with web frameworks and development practices in Python and Golang",
                "Knowledge of API development and RESTful services",
                "Strong debugging and troubleshooting skills",
                "Experience with unit testing and test automation"
            ],
            "with_experience": []
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Abdul Haleem",
        "email": "haleem@yochana.com",
        "jd": "I hope you are doing well, We do have an immediate role as AWS Python Developer. Role: AWS Python Developer Location: Plano, TX or Chicago, IL (Day 1 Onsite) Please find the below Job Description. Primary Skills: Programming Languages: Proficiency in Python Experience with tool development and integration using these languages GitHub Integration: Experience with integrating tools and applications with GitHub Understanding of GitHub APIs and workflows Secondary Skills: Web Development: Familiarity with web frameworks and development practices in Python and Golang Knowledge of API development and RESTful services Testing and Debugging: Strong debugging and troubleshooting skills Experience with unit testing and test automation Roles and Responsibilities: Develop and maintain tools and applications using Python and Golang Integrate tools and applications with GitHub for seamless workflows Write clean, efficient, and maintainable code Debug and troubleshoot issues in the developed applications Collaborate with cross-functional teams to deliver high-quality software.",
        "emp_type": [],
        "source": "Email",
        "date_posted": "2024-09-30 10:08:21-05:00",
        "unique_id": "192437a48aa591a5",
        "tag": "AWS Data Engineer"
    }
]