[
    {
        "company": "CCIT",
        "job_title": "Program Manager",
        "location": "Hybrid (Lansing, MI), USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [],
            "job_code": "",
            "experience_required": "10+ years of Project Management experience",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "1 year with possible extension",
            "rate": ""
        },
        "skills": {
            "core": [
                "Project Management"
            ],
            "primary": [
                "IT Data Governance",
                "Data Warehouse Implementation/Solicitation",
                "Procurement (RFP/SOW)",
                "Vendor Management",
                "Multi-projects and/or Program Management"
            ],
            "secondary": [],
            "all": [
                "Project Management",
                "IT Data Governance",
                "Data Warehouse Implementation/Solicitation",
                "Procurement (RFP/SOW)",
                "Vendor Management",
                "Multi-projects and/or Program Management"
            ],
            "with_experience": [
                "Project Management",
                "IT Data Governance",
                "Data Warehouse Implementation/Solicitation",
                "Procurement (RFP/SOW)",
                "Vendor Management",
                "Multi-projects and/or Program Management"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Tushar Chauhan",
        "email": "tushar@ccitinc.com",
        "jd": "Hello, Please find the job description of Program Manager Job Title: Program Manager Location: Hybrid (Lansing, MI) (Candidate must be local) Duration: 1 year with possible extension Top Skills & Years of Experience Required: • 10+ years of Project Management experience Beneficial experience, ranked by priority: Ø IT Data Governance – 2 years Ø Data Warehouse Implementation/Solicitation – 2 years Ø Procurement (RFP/SOW) – 1 year Ø Vendor Management – 1 year Ø Multi-projects and/or Program Management (will be multiple DIWD projects rolled into a DIWD program) – 1 year Job Description: High-Level Job Duties · Establish and monitor project controlling methods to ensure timely knowledge and awareness of changes to project and/or program cost, quality, or schedule. · Provide planning and reporting to ensure the successful completion of assigned projects according to the sponsor’s goals and objectives. Planning should adhere to the State of Michigan’s Methodology (SUITE) and the Agency’s project prioritization process. Planning and reporting spans the entire lifecycle of the project from initiation to close. · Direct and coordinate day to day activities, tasks, and deliverables required from the project team according to the project plan. · Perform miscellaneous functions as needed to contribute to the overall operation and objectives of the Department of Technology, Management, and Budget (DTMB). Project Details: MDOT – DIWD P3 System Integrator Solicitation (SI) · Document requirements and develop a Statement of Work (SOW) to procure a vendor contract for SI services · MDOT – DIWD P3 Independent Verification and Validation (IV&V) · Document requirements and develop a Statement of Work (SOW) to procure a vendor contract for IV&V services Thanks & Regards Tushar Chauhan tushar@ccitinc.com +1 (248)301-2788",
        "emp_type": [],
        "source": "Email",
        "date_posted": "2024-09-30 16:03:56-05:00",
        "unique_id": "19244bed3b410aa6",
        "tag": "BA/Scrum Master/PM"
    }
]