[
    {
        "company": "VIZON INC",
        "job_title": "Microsoft Dynamics Business Analyst",
        "location": "Chicago, IL 60607, USA",
        "full_location": {
            "city": "Chicago",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "full-time"
            ],
            "job_code": "",
            "experience_required": "8+ years",
            "degree_required": "Bachelor's degree in computer science, marketing, business administration or relevant field",
            "visa_sponsorship": "USC, GC",
            "notice_period": "",
            "duration": "6-month contract to hire",
            "rate": ""
        },
        "skills": {
            "core": [
                "Microsoft Dynamics CRM",
                "Business Analysis",
                "Functional Analysis"
            ],
            "primary": [
                "CRM Implementation",
                "Sales and Marketing"
            ],
            "secondary": [
                "Design Dynamics Modules",
                "Gather Business Needs",
                "Training End Users"
            ],
            "all": [
                "Microsoft Dynamics CRM",
                "Business Analysis",
                "Functional Analysis",
                "CRM Implementation",
                "Sales and Marketing",
                "Design Dynamics Modules",
                "Gather Business Needs",
                "Training End Users"
            ],
            "with_experience": [
                "Microsoft Dynamics Marketing",
                "Microsoft Dynamics Sales"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Roopesh Sharma",
        "email": "roopesh@vizoninc.com",
        "jd": "Hello, Hope you are doing great. Please respond me on my official email - roopesh@vizoninc.com Must have valid LinkedIn with profile photo & two end client references. There will be technical video screening with PV Fluent in English French Job Title: Microsoft Dynamics Business Analyst Location: Chicago, IL 60607 – hybrid work model ( Must be local) Duration: 6-month contract to hire Technical Video call for screening Visa: USC, GC This position is located in our Chicago office with work performed at client site in Chicago; however, a hybrid working model is acceptable. Candidates will be required to work onsite as often as requested by the client. JOB OVERVIEW Looking for experienced lead Microsoft Dynamics CRM Business/Functional Analyst with experience in the Mining/Heavy industries preferred along with experience in the Sales and Marketing area of CRM implementation. The lead functional analyst for CRM-Dynamics will be expected to: Gather business needs/requirements Act as a bridge between business and IT teams Design the dynamics modules, Conduct design meetings/workshops Work with the technical team to develop the design Work with the testing team Conduct some training for the end users. Future duties and responsibilities: Gather business needs/requirements Act as a bridge between business and IT teams Design the dynamics modules, Conduct design meetings/workshops Work with the technical team to develop the design Work with the testing team Conduct some training for the end users.",
        "emp_type": [
            "contract",
            "full-time"
        ],
        "source": "Email",
        "date_posted": "2024-09-30 09:58:35-05:00",
        "unique_id": "1924370a30c779f9",
        "tag": "BA/Scrum Master/PM"
    }
]