[
    {
        "company": "Integrated Technology Strategies, Inc.",
        "job_title": "Project Manager",
        "location": "Des Moines, Iowa, USA",
        "full_location": {
            "city": "Des Moines",
            "state": "Iowa",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "",
            "experience_required": "8 years",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "",
            "rate": ""
        },
        "skills": {
            "core": [
                "Project Management",
                "Stakeholder Management",
                "Agile Methodology"
            ],
            "primary": [
                "Project Governance",
                "Process Development",
                "Gap Analysis"
            ],
            "secondary": [
                "Time Management",
                "Team Building",
                "Communication Skills"
            ],
            "all": [
                "Project Management",
                "Stakeholder Management",
                "Agile Methodology",
                "Project Governance",
                "Process Development",
                "Gap Analysis",
                "Time Management",
                "Team Building",
                "Communication Skills"
            ],
            "with_experience": [
                "Client Expectations Management",
                "Change Management"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Goutham",
        "email": "goutham@itstrategiesinc.com",
        "jd": "Client is State of Iowa. Agency is Department of Management. Role is that of PM (Experience related to Project Governance is Important). Work Location is Des Moines - Hybrid. Interview is Video or In-Person. Interview Dates are Oct. 4th, 7th, and 8th. Max sub is 2 per opening, No sub is Open. Short Description: The Department of Management/Division of Information Technology (DOM-DoIT) Project Manager is responsible for a variety of department and project tasks associated with the managing and tracking of business and IT initiatives. This requisition is for three (3) Project Managers resource to handle multiple projects across DOM-DoIT. Currently, these projects will include a project with DOM ADO to GitHub migration, HHS Vision, Manage Engine Rollout, Security Initiatives and other projects as they are approved and funded. LIMIT SUBMITTALS TO LOCAL/REGIONAL RESOURCE AVAILABLE TO BE ONSITE AS NEEDED WITH NOTICE. DOM-DoIT – PMO Division provides adaptable, secure, and cost-effective technology services and solutions across multiple State Agencies and Divisions. We manage all the State's IT assets, projects and resources, and we deliver technology and expertise to support Citizens of Iowa. The PMO is committed to creative and innovative solutions. The project manager will drive technology projects to completion while ensuring adherence to established budgets and requirements. Essential is the ability to multitask on continually changing priorities. Requirements: (8 years experience) Direct management of system integration and/or technology projects. Experience managing stakeholder expectations and priorities. Experience working within a project governance structure. Strong process development skills, with the ability to learn and understand concepts. Excellent project management skills.",
        "emp_type": [
            "contract"
        ],
        "source": "Email",
        "date_posted": "2024-09-30 07:46:03-05:00",
        "unique_id": "19242f70aac43c48",
        "tag": "BA/Scrum Master/PM"
    }
]