[
    {
        "company": "Sibitalent",
        "job_title": "Full Stack Golang Developer - with Python",
        "location": "100% Remote, USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "",
            "experience_required": "",
            "degree_required": "",
            "visa_sponsorship": "Only H1B/ H4 and L2 EAD workable",
            "notice_period": "",
            "duration": "1 Year",
            "rate": "$50/hr. C2C Non negotiable"
        },
        "skills": {
            "core": [
                "Java/J2EE",
                "Micro-Services",
                "HQL",
                "CICD pipelines",
                "SQL"
            ],
            "primary": [
                "Golang",
                "Python",
                "SpringBoot",
                "Angular",
                "ReactJS",
                "NodeJS",
                "HTML5",
                "CSS3",
                "AWS"
            ],
            "secondary": [
                "Kafka",
                "Docker",
                "OpenShift",
                "Kubernetes",
                "Hibernate",
                "NoSQL",
                "Couchbase",
                "DynamoDB",
                "MongoDB",
                "Rabbit MQ"
            ],
            "all": [
                "Java/J2EE",
                "Golang",
                "Python",
                "Micro-Services",
                "HQL",
                "CICD pipelines",
                "SQL",
                "SpringBoot",
                "Spring Core",
                "Spring AOP",
                "Hibernate",
                "Kafka",
                "JMS",
                "Caching",
                "JUnit",
                "Mockito",
                "Angular",
                "ReactJS",
                "NodeJS",
                "JavaScript",
                "HTML5",
                "CSS3",
                "jQuery",
                "Docker",
                "OpenShift",
                "Kubernetes",
                "NoSQL",
                "Couchbase",
                "DynamoDB",
                "MongoDB",
                "AWS S3",
                "AWS EC2",
                "AWS EKS",
                "AWS API Gateway",
                "AWS RDS",
                "AWS ELB",
                "AWS Route 53",
                "CloudWatch",
                "SQS",
                "SNS",
                "Lambda",
                "Rabbit MQ"
            ],
            "with_experience": [
                "Java/J2EE",
                "SpringBoot",
                "Micro-Services",
                "Angular",
                "ReactJS",
                "AWS"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Sagar Kumar",
        "email": "sagar.kumar@sibitalent.com",
        "jd": "From: Sagar, Sibitalent sagar.kumar@sibitalent.com Reply to: sagar.kumar@sibitalent.com Only H1B/ H4 and L2 EAD workable Position: Full Stack Golang Developer - with Python Location: 100% Remote Duration: 1 YearRate: $50/hr. C2C Non negotiable Job Description-As a full JD stack web developer with experience in frontend, backend, and cloud development, with expertise in Java/J2EE, Responsive Web Applications, and Cloud Technologies.Well-versed skill in the design, development, and deployment of applications for the J2EE platform using SpringBoot, Spring Core, Spring AOP, Hibernate, Kafka, JMS, Caching, Micro-Services, JUnit, Mockito.Hands-on experience in Front-End technologies like Angular, ReactJS, NodeJS, JavaScript, HTML5, CSS3, jQuery used for Responsive web page designing. Experience in all phases of Software Development Life Cycle (SDLC) – Analysis, Design, Implementation, Integration, QA methodologies, Test Strategy. Test metrics and maintenance of applications. Strong experience on software development methodologies like Waterfall, Agile, TDD, Scrum.Worked with Spring Features like Spring Boot, Spring MVC, Spring DAO,Spring Security, Spring Schedulers, Spring Cache, Spring AOP, Spring BatchExp in using Redis and HazelCast in a clustered environment. Experience in utilizing the Apache Kafka building real-time data streaming applications and pipelines.Experience with Docker, OpenShift and Kubernetes in a runtime environment, providing value in building, testing, and deploying applications on an open-source platform Experience in using Hibernate as an ORM Mapping tool like JPA Entities for mapping Java Classes using HQL.Experience with NoSQL DB using Couchbase, DynamoDB, MongoDB for storing diverse types of data, enabling efficient and flexible data management solutions.Familiarity with a range of AWS services, including AWS S3, EC2, EKS, API Gateway, AWS RDS, AWS ELB, AWS Route 53, CloudWatch,, SQS, SNS and Lambda. This experience involves setting up, configuring, and overseeing Amazon images to facilitate seamless server migration to the cloud.Experience in working with messaging systems like Kafka, Rabbit MQ. Exp in CICD pipelines to enhance the efficiency of the build and deployment procedures using Jenkins, Cloudbees, Spinnaker.Extensive Experience in retrieving and manipulating data from backend using Database SQL querie.",
        "source": "Email",
        "date_posted": "2024-09-30 10:24:55-05:00",
        "unique_id": "192438878e67c6d4",
        "tag": "Python Dev"
    }
]