[
    {
        "company": "Stellar IT Solutions",
        "job_title": "Sr. Business Analyst with PMP Certification",
        "location": "Annapolis, MD, USA",
        "full_location": {
            "city": "Annapolis",
            "state": "MD",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Master’s degree in Information Systems",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "PMP Certification",
                "Master’s degree in Information Systems"
            ],
            "primary": [
                "UML",
                "NIEM / JIEM data modeling",
                "Requirements capture and tracking software",
                "XML",
                "SOAP protocol software",
                "Integration patterns",
                "web services",
                "APIs",
                "Odyssey Case Management System"
            ],
            "secondary": [
                "Effective communication",
                "Training and demonstrations",
                "Systems development life cycle principles",
                "Database knowledge – logical, relational"
            ],
            "all": [
                "PMP Certification",
                "Master’s degree in Information Systems",
                "UML",
                "NIEM / JIEM data modeling",
                "Requirements capture and tracking software",
                "XML",
                "SOAP protocol software",
                "Integration patterns",
                "web services",
                "APIs",
                "Odyssey Case Management System",
                "Effective communication",
                "Training and demonstrations",
                "Systems development life cycle principles",
                "Database knowledge – logical, relational"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Arpitha S",
        "email": "arpithas@stellarit.com",
        "jd": "From: Arpitha S, Stellar IT Solutions arpithas@stellarit.com Reply to: arpithas@stellarit.com Position: MJUD Integrations Business Analyst Location: 189 Harry S Truman Parkway, Annapolis, MD 21401 Onsite/Remote: Hybrid Duration: Long Term Job Description: Candidate needs to have PMP Certification, Masters degree in Information Systems. For submission we need a copy of the PMP certificate, Signed RTR, and copy of Masters Degree or transcript, 3 candidate references. OFFEROR RESOURCE QUALIFICATIONS 1. The Offeror shall propose resource(s) that meet the following minimum qualifications: a. Active Project Management Professional (PMP) Certification. b. Master’s degree in information systems. OFFEROR RESOURCE(S) SKILLS, EXPERIENCE, & CAPABILITIES 1. Offeror shall propose resource(s) possessing the following preferred skills, experience, and capabilities: a. Experience with: (1) UML and other tools used to capture and document user and functional requirements. (2) NIEM / JIEM data modeling. (3) Requirements capture and tracking software. (4) XML and SOAP protocol software. (5) Discussing, analyzing and documenting high-level business requirements related to internal and external clients. (6) Integration patterns, web services and APIs. (7) Odyssey Case Management System. b. Ability to: (1) Communicate effectively and to establish and maintain effective working relationships with peers, end users and vendor development staff, as well as all levels of management and judicial personnel as necessary. (2) Work effectively within a diverse IT organization. (3) Provide training and demonstrations pertaining to integrations software. c. Knowledge of: (1) Systems development life cycle principles and methodologies (2) Database knowledge – logical, relational Offeror Resource(s) Degree and/or Certificate(s): Offeror shall submit a copy of any degree and/or certificate for each proposed resource as required or preferred in Section III.B. of this PORFP. (1) Offeror shall provide evidence of an active Project Management Professional (PMP) Certification. (2) Offeror shall provide a copy of their master’s degree in information systems, or other evidence (e.g., transcript) that their proposed resource has a master’s degree. (3) Offeror Resource(s) Right-to-Represent (RTR) Letter: Offerors are strongly encouraged to provide a right to represent letter/agreement for the proposed resource(s). PLACE OF PERFORMANCE 1. Work shall be performed in a hybrid setting each week, Monday through Friday, as follows: a. Three (3) days remote at a suitable off-site location selected by the Offeror/Offeror Resource(s). (1) The AOC reserves the right to determine an off-site location is not suitable (e.g., crowded public space with distracting background noise during meetings). b. Two (2) days on site at the Maryland Judiciary Information Systems, 189 Harry S Truman Parkway, Annapolis, MD 21401. 2. On-site support may be required. As designated by the Judiciary’s Chief Technology Officer, the proposed resource(s) must be able to report on-site within twenty-four (24) hours after notification. a. If required to report, the Offeror Resource shall report to Maryland Judiciary Information Systems, 189 Harry S Truman Parkway, Annapolis, MD 21401. b. The AOC does not have a limit on the number of times the proposed resource(s) may be required to be onsite. Regards, Arpitha S Technical Recruiter Email: arpithas@stellarit.com Rockville, MD | McLean, VA | Palo Alto, CA StellarIT.com | StellariDeaLabs.com",
        "source": "Email",
        "date_posted": "2024-10-10 08:14:21-05:00",
        "unique_id": "19276d2cfe454bd1",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]