[
    {
        "company": "Yochana Solutions Inc.",
        "job_title": "Senior Software Engineer",
        "location": "St. Louis, MO, USA",
        "full_location": {
            "city": "St. Louis",
            "state": "MO",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$60/hr max. all inclusive C2C",
            "job_code": "",
            "contact_person": "Madhulatha",
            "email": "madhulatha@yochana.com"
        },
        "skills": {
            "core": [
                "Java",
                "Test Driven Development (TDD)",
                "Behavior Driven Development (BDD)",
                "Agile",
                "Continuous Integration (CI)",
                "Continuous Delivery (CD)"
            ],
            "primary": [
                "Debugging",
                "API standards",
                "Design patterns",
                "Automation",
                "Cloud first software development"
            ],
            "secondary": [
                "Security Fundamentals",
                "Microservices",
                "Infrastructure as code",
                "Python",
                "Ruby",
                "Bash",
                "Perl",
                "Groovy",
                "Sonar",
                "Zally",
                "Checkmarx"
            ],
            "all": [
                "Java",
                "Test Driven Development (TDD)",
                "Behavior Driven Development (BDD)",
                "Agile",
                "Continuous Integration (CI)",
                "Continuous Delivery (CD)",
                "Debugging",
                "API standards",
                "Design patterns",
                "Automation",
                "Cloud first software development",
                "Security Fundamentals",
                "Microservices",
                "Infrastructure as code",
                "Python",
                "Ruby",
                "Bash",
                "Perl",
                "Groovy",
                "Sonar",
                "Zally",
                "Checkmarx"
            ],
            "with_experience": [
                "Java (secure code)",
                "Test Driven Development (TDD)",
                "Behavior Driven Development (BDD)",
                "Agile practices",
                "Continuous Integration (CI)",
                "Continuous Delivery (CD)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "jd": "Hello I’m a Madhulatha Technical Recruiter with Yochana Solutions Inc., a national IT staffing solutions provider with 14+ years of experience delivering value to leading companies across the U.S.A. and Canada, I'm currently staffing for Title: Senior Software Engineer -St. Louis, MO [Onsite] Below you will find the job description, if you are qualified and interested, please send me your Updated Word Document Resume. I'm very sorry if this position is not an ideal fit, We'll keep you in mind for other suitable positions and referrals would be appreciated. Thank you so much for your attention and participation. Role Title: Senior Software Engineer Hiring Mode: Contract (TP) Location: St. Louis, MO [Onsite] Need only Locals Bill Rate: $60/hr max. all inclusive C2C Note: Local profiles will be preferred Nice to have: Security Fundamentals – SSH, File Transfer Protocol – SFTP, exposure to reactive system and Microservices. Job description: Must haves- Has ability to write secure code in Java language Understands and implements standard branching (e.g., Gitflow) and peer review practices. Move the team towards trunk based development Has skills in test driven and behavior driven development (TDD and BDD) to build just enough code and collaborate on the desired functionality. Ability to keep the full testing pyramid healthy - Has skills to author test code with lots of smaller tests followed by few contract tests at service level and fewer journey tests at the integration level Able to perform debugging and troubleshooting to analyze core, heap, thread dumps and remove coding errors Understands the use of basic design patterns (e.g., factory, adaptor, singleton, composite, observer, strategy, inversion of control) Understands and implements Application Programming Interface (API) standards and cataloging to drive API/service adoption and commercialization and effort estimation Experienced in agile and modern SDLC practices (Scrum/Kanban/Continuous Delivery/DevOps/Quality engineering) and the delivery situations they are used for Experience in Continuous Integration (CI) and Delivery (CD) concepts, and capabilities to support automation, pipelines, virtualization, and containerization Nice to have- Familiar with secure coding standards (e.g., OWASP, CWE, SEI CERT) and vulnerability management Infrastructure as code and cloud first software development knowledge experience preferred. Has ability to write code (in languages such as Java, Python, Ruby, Bash, Perl, Groovy) to build automation tasks that are repeatable and efficient Apply tools (e.g., Sonar, Zally, Checkmarx) and techniques to scan and measure code quality and anti-patterns as part of development activity Understands use cases for advanced design patterns (e.g., service-to-worker, MVC, API gateway, intercepting filter, dependency injection, lazy loading, all from the gang of four) to implement efficient code Thanks and regards Madhulatha Resource Specialist Yochana IT Solutions Inc",
        "source": "Email",
        "date_posted": "2024-10-10 08:16:02-05:00",
        "unique_id": "19276b41dfaecc3e",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]