[
    {
        "company": "FISEC GLOBAL",
        "job_title": "Java Architect",
        "location": "Phoenix, AZ, USA",
        "full_location": {
            "city": "Phoenix",
            "state": "AZ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Long term",
            "rate": "$65/hour"
        },
        "skills": {
            "core": [
                "Java",
                "JBoss",
                "Application Management",
                "Architecture Documentation",
                "Technical Support"
            ],
            "primary": [
                "Integration Solutions",
                "Collaboration",
                "Agile Methodology",
                "Defect Tracking",
                "Web/E-commerce Knowledge"
            ],
            "secondary": [
                "Open text",
                ".NET",
                "Custom Web Services",
                "Message Bus",
                "Deployment and Troubleshooting",
                "Architecture Design",
                "Communication",
                "Problem-Solving",
                "Leadership"
            ],
            "all": [
                "Java",
                "JBoss",
                "Application Management",
                "Architecture Documentation",
                "Technical Support",
                "Integration Solutions",
                "Collaboration",
                "Agile Methodology",
                "Defect Tracking",
                "Web/E-commerce Knowledge",
                "Open text",
                ".NET",
                "Custom Web Services",
                "Message Bus",
                "Deployment and Troubleshooting",
                "Architecture Design",
                "Communication",
                "Problem-Solving",
                "Leadership"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "RAHUL BALUSA",
        "email": "rahul@fisecglobal.net",
        "jd": "From: RAHUL BALUSA, FISEC GLOBAL rahul@fisecglobal.net Reply to: rahul@fisecglobal.net Role: Java ArchitectLocation: Phoenix, AZ (Hybrid)Duration: Long termONLY US citizens NOTE: PLEASE DON’T SHARE RESUMES WHICH GOT SUBMITTED TO HCL AMERICA IN LAST 90 DAYS Job Description:Service Lead specializing in Java/JBoss role involves managing and maintaining critical applications within an ASM framework:Application Management: Oversee the administration, maintenance, and support of Java-based applications running on JBoss application servers.Architecture Documentation: Manage and maintain application architecture documentation and procedures for installation and maintenance.Technical Support: Analyze, debug, support, and occasionally modify software enhancements and new products used in local, networked, or Internet-related computer programs.Team Leadership: Provide day-to-day direction to development teams, ensuring adherence to standard patterns, architectures, and best practices using open-source tools.Integration Solutions: Develop and support JMS-based integration solutions and APIs (based on REST principles) for internal applications and third-party system integration scenarios.Collaboration: Work closely with the technical team to determine systems planning, scheduling, and implementation timelines.Desired Skills:Java/JBoss, Open text, .NET a. Proficiency in Java: As a Service Lead, you'll need a strong grasp of the Java programming language. b. Custom Web Services: You'll develop custom web services using Java, automate migration processes, and implement security features. c. Message Bus: Expertise in using custom Java-based data delivery buses for ultra-stable and high-performance inter-application communication.JBOSS: Application Server Expertise: JBOSS (now known as WildFly) is an open-source application server. Familiarization with its architecture, deployment, and configuration. Manage applications, resources, and security within JBOSS. b. Deployment and Troubleshooting: Familiarization to deploy applications on JBOSS, monitor performance, and troubleshoot issues effectively.Architecture Design: Expertise in application architecture design and business processes.Defect Tracking: Proficiency in using tools like Jira and JUnit for defect tracking.Agile Methodology: Experience with Agile methodology and optimizing software development processes.Web/E-commerce Knowledge: Familiarity with web and e-commerce architectures and technologies.Soft Skills: a. Communication: Excellent communication skills are crucial. You'll collaborate with cross-functional teams, interact with stakeholders, and lead discussions. b. Problem-Solving: Service Leads often encounter complex challenges. Develop strong problem-solving abilities and think critically when addressing issues. c. Leadership: As a lead, you'll guide and mentor team members. Effective leadership ensures successful project delivery.",
        "source": "Email",
        "date_posted": "2024-10-10 16:59:51-05:00",
        "unique_id": "1927892cb27f8cf1",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]