[
    {
        "company": "VDart.inc",
        "job_title": "IVR Lead Engineer with GCP",
        "location": "San Jose, CA, USA",
        "full_location": {
            "city": "San Jose",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "onsite",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "JavaScript",
                "Java",
                "Python"
            ],
            "primary": [
                "IVR design principles",
                "Excellent communication",
                "Leadership skills",
                "Problem-solving",
                "Troubleshooting"
            ],
            "secondary": [
                "Agile principles",
                "Scrum practices"
            ],
            "all": [
                "JavaScript",
                "Java",
                "Python",
                "IVR design principles",
                "Excellent communication",
                "Leadership skills",
                "Problem-solving",
                "Troubleshooting",
                "Agile principles",
                "Scrum practices"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Mohamed Razith.R",
        "email": "razith.r@vdartinc.com",
        "jd": "From: Mohamed Razith.R, VDart.inc razith.r@vdartinc.com Reply to: razith.r@vdartinc.com Title: IVR Lead Engineer with GCP Location: San Jose, CA / Austin, TX (Onsite) Duration: Contact Job Description: Lead Engineer: Oversee the entire IVR / Cases development lifecycle, from project planning and scoping to implementation and maintenance. Design: Collaborate with stakeholders to define IVR requirements and create detailed design specifications. Authoring/Development: Develop IVR / Cases applications using Google Cloud Platform tools and technologies, such as Dialogflow and Contact Center & Java Operational Support: Provide Tier I, II, and III support for IVR / Cases applications, troubleshooting issues and resolving customer inquiries. Integration: Integrate IVR solutions with other systems and platforms, such as CRM, ERP, and contact center applications. Performance Optimization: Optimize performance of the system to ensure efficient and effective customer interactions. Lead a team of engineers and cross-functional stakeholders in the development and launch of [specific project/product]. Documentation: Create and maintain comprehensive documentation for IVR / Cases solutions, including design specifications, user manuals, and troubleshooting guides. Collaboration: Work closely with cross-functional teams, including product managers, developers, and testers, to deliver successful projects. Provide guidance and support to the Scrum Team on Agile principles and Scrum practices. Act as a liaison between the Scrum Team and external stakeholders, including product owners, management, and other teams. Required Skills and Qualifications: Proficiency in scripting languages (e.g., JavaScript, Java, Python). Excellent communication and leadership skills. – MANDATORY REQUIREMENT Understanding of IVR design principles and best practices. Excellent problem-solving and troubleshooting skills. Ability to work independently and as part of a team.",
        "source": "Email",
        "date_posted": "2024-10-10 11:05:44-05:00",
        "unique_id": "192777d8b61d0f10",
        "emp_type": [
            "onsite",
            "third party"
        ],
        "tag": "GCP Data Engineer"
    }
]