[
    {
        "company": "Paramount Software Solutions",
        "job_title": "Sr Project/Program Manager",
        "location": "Salem, OR, USA",
        "full_location": {
            "city": "Salem",
            "state": "OR",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "project management",
                "budget management",
                "schedule management",
                "scope management",
                "configuration management"
            ],
            "primary": [
                "PMBOK",
                "risk management",
                "resource allocation",
                "project communications",
                "team capacity management"
            ],
            "secondary": [
                "testing",
                "verification",
                "validation",
                "change control",
                "project oversight"
            ],
            "all": [
                "project management",
                "budget management",
                "schedule management",
                "scope management",
                "configuration management",
                "PMBOK",
                "risk management",
                "resource allocation",
                "project communications",
                "team capacity management",
                "testing",
                "verification",
                "validation",
                "change control",
                "project oversight"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Zakir",
        "email": "zakir@paramountsoft.net",
        "jd": "From: Zakir, Paramount Software Solutions zakir@paramountsoft.net Reply to: zakir@paramountsoft.net Hi,Good day to you,One of my clients is looking for the below skillset, please share your profiles at the earliest.Job Title: Sr Project/Program ManagerLocation: Salem, OR (Remote) Duration: 12 MonthsJob Description: Individuals with successful project management experience limited to projects of small scope, limited risk and complexity and/or of short duration. Individuals at this level will typically be assigned to manage projects under the direction of a State supervisor or manager. Individuals with this level of experience are suitable for small Client Agency projects with clear, achievable outcomes, or in assignment as project support on larger projects. Individuals at this level can also be used in the capacity of a Project Controller, provided that they can satisfy the basic requirements of that position. Advanced level: Individuals with a mastery of project management skills, qualifications and experience. This individual shall function effectively with very little supervision, while maintaining a high professional standard. They are assigned to extremely complex and/or high risk projects that reflect the highest priorities of state government. These individuals are comfortable working with the highest levels of state government and are able to contribute to the furtherance of the states’ objectives. These individuals have the necessary skills and experience to assist in statewide project portfolio management and/or IT Investment Management.Apply project management principles and techniques as defined in the Project Management Body of Knowledge (PMBOK). Manage project budgets, schedules, timelines as well as report on progress and status deliverables. Full responsibility for scope management, configuration management, including change control issues logs, testing, verification, and validation of new systems. Coordination and oversight of all project resources including IS technical staff, customers, and contract personnel. Ensure adherence to project management, development, testing, and documentation standards of the ISD division. Coordinate the implementation of applications with the assigned LSA. Manage resource allocation and project team capacity to ensure project work is accomplished. Project communications, regular “stand up” project meetings, and coordination with the Configuration Management Specialist and Database Administrator. Control and monitor all out-sourced tasks.",
        "source": "Email",
        "date_posted": "2024-10-10 12:53:42-05:00",
        "unique_id": "19277b17338d14ef",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]