[
    {
        "company": "VBeyond Corporation",
        "job_title": "Java Lead(Loyalty Crowd twist experience)",
        "location": "USA",
        "full_location": {
            "city": "Hillsborough",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "12+ Years",
            "degree_required": "Bachelor's or Master’s degree in Computer Science, Software Engineering or related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Spring Boot",
                "Microservices",
                "CrowdTwist",
                "Google Cloud services"
            ],
            "primary": [
                "RabbitMQ",
                "Transactional databases",
                "Gradle",
                "SonarQube",
                "Test-Driven Development (TDD)",
                "API development",
                "Performance optimization",
                "Docker"
            ],
            "secondary": [
                "Grafana",
                "Newrelic",
                "Bamboo",
                "Bitbucket",
                "Technical story writing",
                "Design documentation",
                "Excellent communication skills"
            ],
            "all": [
                "Java",
                "Spring Boot",
                "Microservices",
                "CrowdTwist",
                "Google Cloud services",
                "RabbitMQ",
                "Transactional databases",
                "Gradle",
                "SonarQube",
                "Test-Driven Development (TDD)",
                "API development",
                "Performance optimization",
                "Docker",
                "Grafana",
                "Newrelic",
                "Bamboo",
                "Bitbucket",
                "Technical story writing",
                "Design documentation",
                "Excellent communication skills"
            ],
            "with_experience": [
                "Java (12+ years)",
                "Spring Boot",
                "Microservices",
                "CrowdTwist",
                "Google Cloud services"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Shanmuga Priya S.",
        "email": "shanmugapriyas@vbeyond.com",
        "jd": "Greetings from VBEYOND,I hope you are doing well. I am Shanmuga Priya S. from VBeyond Corp. We are a global recruitment company with a specialization in the hiring of IT professionals. One of our clients is looking for a Java Lead(Loyalty Crowd twist experience)| Contract (Remote). If you feel this requirement is not suitable for you, kindly share the same with your circle or reply REMOVE. Role: Java Lead.Hiring: ContractMode: Remote.Experience : 12+ YearsLoyalty Crowdtwist Mandate Skill.Specific Expectation Resource should have very good experience in Java Microservices Springboot along with Experience and ResponsibilitiesProven expertise in Java development with a strong focus on Spring Boot MicroservicesShould have experience worked in Loyalty areaShould have experience worked in CrowdtwistHandson experience with Google Cloud services particularly PubSub and Cloud SQLFamiliarity with RabbitMQ and transactional databases for efficient data processingProficient in building and managing projects using GradleIndepth knowledge and practical application of SonarQube for code quality analysisStrong background in TestDriven Development TDD with unit and contract testing expertiseExtensive experience in API development ensuring seamless integrationDemonstrated skills in performance optimization for scalable applicationsAbility to troubleshoot and resolve production issues efficientlyFamiliarity with monitoring tools like Grafana and Newrelic for performance trackingExperience in the ecommerce shipping domain with knowledge of BOPIS featuresHandson experience with Bamboo and Bitbucket for CICD pipelinesTechnical story writing and proficiency in creating design documentationExcellent communication skills for effective collaboration within crossfunctional teamsExperience in working with DockerQualificationsProven track record as a Senior Java Developer Java Tech Lead Java Architect with comprehensive experience in the specified technologiesBachelors or master’s degree in computer science software engineering or related fieldMinimum of 8- 9 years of relevant experience in Java developmentThanks and RegardsShanmuga Priya SVBeyond Corporation || PARTNERING FOR GROWTH Hillsborough, New Jersey, USAEmail ID : Shanmugapriyas@vbeyond.comContact : (908)589-4031Website: www.vbeyond.com",
        "source": "Email",
        "date_posted": "2024-10-10 10:50:38-05:00",
        "unique_id": "192774804a839b59",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]