[
    {
        "company": "Vyze Inc",
        "job_title": "Project Manager",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Bachelor's degree preferred",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Data Integration",
                "Project Management",
                "Retail Experience"
            ],
            "primary": [
                "Power Point",
                "Jira",
                "Excel"
            ],
            "secondary": [
                "Communication",
                "Leadership"
            ],
            "all": [
                "Data Integration",
                "Project Management",
                "Retail Experience",
                "Power Point",
                "Jira",
                "Excel",
                "Communication",
                "Leadership"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Saurav Thainua",
        "email": "sthainua@vyzeinc.com",
        "jd": "From: saurav thainua, vyze inc sthainua@vyzeinc.com Reply to: sthainua@vyzeinc.com Job Description -Job Title: Project ManagerLocation: Remote (live in the Eastern or Central time zones)Duration: 6+monthsMOI: skypeNote – Need to have done Data Integration projects in Retail. Tech Skills: Power Point, Jira, ExcelCompetencies: Large Project Management, Retail Experience a Must, Experience with Data Projects - preferably large-scale data integration project, Extremely good communication required, ability to speak to very senior management Responsible for the coordination and completion of project deliverables, key Workshops, steering committees, and governance.Sets deadlines, assigns responsibilities, and monitors and summarizes progress of project. Prepares reports and Power Point Presentations for upper management regarding progress of project.May require a bachelor's degree and experience in the field or in a related area. Familiar with a variety of the field's concepts, practices, and procedures. Relies on limited experience and judgment to plan and accomplish goals. Performs a variety of tasks. Leads and directs the work of others. A wide degree of creativity and latitude is expected. Typically reports to a manager or head of a unit/department.",
        "source": "Email",
        "date_posted": "2024-10-10 12:42:03-05:00",
        "unique_id": "19277a6c750d6753",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]