[
    {
        "company": "Yochana IT Solutions",
        "job_title": "Sr. Full Stack Developer (Tech Lead)",
        "location": "Minneapolis, MN, USA",
        "full_location": {
            "city": "Minneapolis",
            "state": "MN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "At least 7 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java 11/J2EE",
                "SQL development",
                "RESTful APIs",
                "microservices",
                "Spring Framework"
            ],
            "primary": [
                "PL/SQL programming",
                "Oracle 18c",
                "Agile methodologies",
                "DevSecOps",
                "CI/CD pipeline",
                "GIT",
                "Jenkins",
                "Maven",
                "AWS",
                "Kubernetes",
                "RedHat OpenShift",
                "Angular framework"
            ],
            "secondary": [
                "Swagger",
                "JSON",
                "POSTMAN",
                "Code Build/Code Pipeline",
                "API Gateways",
                "Lambdas",
                "Nexus",
                "Gitlab",
                "Agility",
                "automation and test tools",
                "Postman",
                "Mockito",
                "SonarQube",
                "AWS Certified Solutions Architect – Associate",
                "AWS Certified Developer – Associate"
            ],
            "all": [
                "Java 11/J2EE",
                "SQL development",
                "RESTful APIs",
                "microservices",
                "Spring Framework",
                "PL/SQL programming",
                "Oracle 18c",
                "Agile methodologies",
                "DevSecOps",
                "CI/CD pipeline",
                "GIT",
                "Jenkins",
                "Maven",
                "AWS",
                "Kubernetes",
                "RedHat OpenShift",
                "Angular framework",
                "Swagger",
                "JSON",
                "POSTMAN",
                "Code Build/Code Pipeline",
                "API Gateways",
                "Lambdas",
                "Nexus",
                "Gitlab",
                "Agility",
                "automation and test tools",
                "Postman",
                "Mockito",
                "SonarQube",
                "AWS Certified Solutions Architect – Associate",
                "AWS Certified Developer – Associate"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Yochana Max",
        "email": "max@yochana.com",
        "jd": "From: Max, Yochana IT Solutions max@yochana.com Reply to: max@yochana.com Role: Sr. Full Stack Developer (Tech Lead)Location: Minneapolis, MN(Onsite)Responsibilities:Tech Lead (Sr. Full Stack Developer) will be joining the team and contributing to the software design, software development, and overall product lifecycle. The Software Development Engineer is responsible for development, operations and support, and enhancements of Operations systems. They have knowledge of API Development and Layered Architecture principles. As a member of the Team, this position requires working closely with internal team members, Product Owners, Business SMEs and other supporting IT groups. Responsibilities: Engineer. implement & support code for break-fix, maintenance, and enhancements, and integrating container platforms with automated CI/CD pipelinesDesign and develop cloud-native applications, features, and enhancements with an emphasis on clean, highly efficient, supportable, and well documented code for the full technology stackEnsure that the methodology, standards, and procedures are adopted and implementedProvide efficient solution and deliverables to shorten the project life cycle, where applicableOwn the quality of the product delivered by engaging closely in testing activities.Create visual models (flowcharts, class and activity diagrams, sequence diagrams)Lead resolution of issues with interfacing systems built on different technologiesFacilitate and participate in regular scrum ceremoniesSupport operationally critical environment, using monitoring tools and scripts, data feeds and associated scripts, research, and analysis of production issues, capturing logging Minimum QualificationsAt least 7 years of hands-on experience as a Software Engineer or related technical engineering capacity.Expertise in Java 11/J2EE framework, design patterns and toolsSolid Database Experience: SQL development Skills (must have), PL/SQL programming experience, Oracle 18c or TOADProficient in RESTful APIs and microservices with Swagger, JSON, POSTMANExperience in Agile methodologies, DevSecOps, CI/CD pipeline and Build tools (GIT, Jenkins, Maven or Gradle)Cloud-native development using Spring Framework (SpringBoot, SpringBatch) and working knowledge of developing and deploying applications in AWSExperience with Containers, Kubernetes, RedHat OpenShift, Developer Workspace, Devops, Jenkins, Code Build/Code Pipeline, API Gateways, Lambdas, Nexus, Gitlab, Agility, or related technologiesExperience with Angular frameworkStrong analytical skills and excellent verbal and written communication skillsAbility to work well with others in a time sensitive and team environment with minimal supervision, be results oriented and capable of meeting deadlines with attention to detail and follow throughStrong technical and non-technical communication skills. Assures smooth flowing, timely transmission of critical informationExcellent judgment and problem-solving skills; individual should be able to resolve problems in a calm and quick manner and display a high degree of initiative and drive Competitive EdgeExperience engineering software with Red Hat OpenShift Service on AWS (ROSA) Cluster, Compute pool, Compute node, Namespace, Pod, App, Service, and ROSA deploymentExperience working with various AWS cloud services such as EC2, S3 bucket, AWS code pipeline, CloudFormation, Auto Scaling, VPC, Route 53, ELB, etc.Experience with automation and test tools (Postman, Mockito, SonarQube)Experience with test driven developmentAWS Certified Solutions Architect – AssociateAWS Certified Developer – Associate",
        "source": "Email",
        "date_posted": "2024-10-10 10:38:16-05:00",
        "unique_id": "1927750f3916a3ef",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]