[
    {
        "company": "Stellentit",
        "job_title": "HR Project Manager",
        "location": "Tampa, FL, USA",
        "full_location": {
            "city": "Tampa",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Bachelor's degree in human resources, business administration, operations management, project management, or a related field (or equivalent experience)",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "long term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "project management",
                "HR processes",
                "communication",
                "project management tools",
                "change management"
            ],
            "primary": [
                "organizational skills",
                "analytical skills",
                "leadership",
                "interpersonal skills",
                "HRIS"
            ],
            "secondary": [
                "PMP certification",
                "PSM/CSM certification",
                "Lean Six Sigma certification",
                "management consulting experience"
            ],
            "all": [
                "project management",
                "HR processes",
                "communication",
                "project management tools",
                "change management",
                "organizational skills",
                "analytical skills",
                "leadership",
                "interpersonal skills",
                "HRIS",
                "PMP certification",
                "PSM/CSM certification",
                "Lean Six Sigma certification",
                "management consulting experience"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Navya Gupta",
        "email": "navya@stellentit.com",
        "jd": "Hello, I hope you are doing well! Kindly acknowledge me, are you Comfortable with this Position then please share me your updated resume Job Title:- HR Project Manager Location:- Tampa, Florida (Hybrid) Duration:-long term Any Visa fine Contract Job Description:- Seeking a self-starting project manager with a focus on continuous improvement initiatives; will play a pivotal role in supporting the efficient execution of projects within our Human Resources (HR) Project Office. The position is a subject matter expert (SME) in one or more areas of HR focusing on optimizing HR processes, driving efficiency, and ensuring alignment with organizational goals. The successful candidate will be a detail-oriented, organized, and proactive individual who thrives in a fast-paced environment and can effectively collaborate with cross-functional teams. Required Competencies: Strong project management skills with the ability to manage multiple projects simultaneously. In-depth knowledge of HR processes, policies, and best practices. Excellent communication and interpersonal skills to effectively collaborate with diverse teams. Proficiency in project management tools and software (e.g., MS Project, MS SharePoint, MS Teams). Ability to lead and influence cross-functional teams without direct authority. Knowledge of change management principles and practices. Ability to work independently and as part of a team in a fast-paced environment. Duties and Responsibilities: Project Leadership: Lead and manage HR projects/initiatives from initiation to completion, ensuring they are delivered on time and within budget. Collaborate with cross-functional teams to define project scope, objectives, and deliverables. Develop comprehensive project plans, timelines, and resource allocation. Subject Matter Expertise: Serve as the HR subject matter expert, providing guidance to HR Project Office team members. Stay up-to-date with industry trends, best practices, and regulatory changes to ensure HR compliance and effectiveness. Change Management: Lead change management initiatives related to HR process improvements, ensuring seamless transitions and user adoption. Develop and deliver training programs to HR Project Office staff and stakeholders. Stakeholder Collaboration: Foster strong working relationships with HR Project Office team members, department heads, and external partners to drive successful project outcomes. Act as a liaison between HR and other departments to ensure alignment of project goals with organizational objectives. Risk and Issue Management: Assist in identifying project risks and issues and escalate them to the HR Project Office Head/Portfolio Management. Support in developing and implementing risk mitigation strategies. Monitor project risks and issues and provide status updates. Budget Tracking: Assist in tracking project budgets and expenses. Collaborate with the finance department to ensure accurate financial reporting. Assist in preparing financial reports related to project expenditures. Quality Assurance: Assist in maintaining project quality standards and adherence to best practices. Participate in quality reviews and audits as required. Education and Experience: Bachelor's degree in human resources, business administration, operations management, project management, or a related field (or equivalent experience). Working towards or have obtained a Project Management Professional (PMP), PSM/CSM – Professional/Certified Scrum Master certification or Lean Six Sigma certification is a plus. 5+ years in a project management role. Impeccable organizational skills and attention to detail. Strong analytical and problem-solving skills. Strong communication, leadership, and interpersonal skills. Proficiency in HRIS (HR Information Systems) and project management software is highly preferred. Change management experience is highly preferred. Management consulting experience is highly desirable. Hybrid work environment with a combination of remote work and on-site presence in either Tampa, FL.",
        "source": "Email",
        "date_posted": "2024-10-10 09:14:55-05:00",
        "unique_id": "19276efe6f3eee72",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]