[
    {
        "company": "NatWest Bank",
        "job_title": "Project Manager / Business Analyst",
        "location": "Stamford, CT, USA",
        "full_location": {
            "city": "Stamford",
            "state": "CT",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Management qualification",
            "visa_sponsorship": "Any Visa except H4, H1b and OPT",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$55/hr"
        },
        "skills": {
            "core": [
                "change management",
                "regulatory projects",
                "project delivery"
            ],
            "primary": [
                "collaborative approach",
                "stakeholder management",
                "project lifecycle management"
            ],
            "secondary": [
                "financial business case",
                "risk management",
                "project cost tracking"
            ],
            "all": [
                "change management",
                "regulatory projects",
                "project delivery",
                "collaborative approach",
                "stakeholder management",
                "project lifecycle management",
                "financial business case",
                "risk management",
                "project cost tracking"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Balram Kumar Singh",
        "email": "balram@spearstaffing.com",
        "jd": "From: Balram Kumar Singh, Spear Staffing LLC balram@spearstaffing.com Reply to: balram@spearstaffing.com Project Manager / Business Analyst Stamford, Connecticut, (Hybrid) – onsite 2 days a week Client: NatWest BankAny Visa except H4, H1b and OPTVideo InterviewRate: 55 hr. C2CStart Date: ASAP Required BA/PM Project – Rule Mapping //Hybrid This is an opportunity for a driven Business Analyst/ Jr. Project Manager to join NatWest Markets and deliver our goals on time, within budget and to the highest qualityYou’ll be joining an innovative and inclusive culture where you’ll have access to fantastic development opportunities What you'll doIn your new role, you’ll prepare, analyze and provide reporting on all analysis on regulations and rule mapping to policies, manage project plans, controls and make sure that the plans are in line with any wider program plans and controls. You’ll drive activities to adequately prepare the business and engage all the appropriate stakeholders effectively to enable change to be implemented and handed over.You’ll lead a team through the project lifecycle, setting team objectives and carrying out individual assessments, while building and maintaining a positive working relationship with stakeholders across multiple franchises and functions. You’ll also:Own and drive the project delivery to meet its outcomes and milestone on time and on targetIdentify, track, manage and mitigate any project risks, assumptions, issues and dependenciesLead and monitor the production of a project milestones and make sure that the solutions clearly support the required outcomes and is aligned to our strategic goalsAnalyze the appropriate statements and prepare estimates for approvalDrive the creation of a financial business caseTrack and report project costs and make sure that the project is completed in allotted budgetsMake sure that all project deliverables satisfy the requirements and that they adhere to the agreed governance framework The skills you'll needWe’ll expect you to hold a management qualification, as well as some experience in change management. You should also have experience of delivering regulatory projects that support a business strategy and its growth agenda. You’ll also need:A collaborative approach and the ability to build productive relationships with stakeholders, colleagues and senior managersExperience of delivering complex regulatory projects",
        "source": "Email",
        "date_posted": "2024-10-10 10:47:40-05:00",
        "unique_id": "192778ea2de85ea4",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]