[
    {
        "company": "KPG",
        "job_title": "Jr. SQL DBA",
        "location": "Mechanicsburg, PA, USA",
        "full_location": {
            "city": "Mechanicsburg",
            "state": "PA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "2+ years",
            "degree_required": "Bachelor’s degree with an IT-related major or minor; OR Associate’s degree with an IT-related major or minor and two years of experience in the IT area.",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "T-SQL",
                "SQL DBA",
                "Database Code Development"
            ],
            "primary": [
                "Stored Procedures",
                "Database Standards",
                "Code Reviews",
                "Performance Optimization"
            ],
            "secondary": [
                "Metadata Analysis",
                "User Security Management",
                "Help Desk Support",
                "Documentation"
            ],
            "all": [
                "T-SQL",
                "SQL DBA",
                "Database Code Development",
                "Stored Procedures",
                "Database Standards",
                "Code Reviews",
                "Performance Optimization",
                "Metadata Analysis",
                "User Security Management",
                "Help Desk Support",
                "Documentation"
            ]
        },
        "job_type": [
            "onsite",
            "hybrid"
        ],
        "contact_person": "Kaushal Chauhan",
        "email": "kaushlendra@kpgtech.com",
        "jd": "Hello, Hope you are doing well, Please check the below mentioned job description and let me know your interest with your updated resumeJob Title: Jr. SQL DBAType/Location: Onsite: Mechanicsburg, PA - Local to PA Only Visa: NO H1BThis job is 100% Onsite for the first 6-weeks then Hybrid (3 days in office/2 days remote).Note: DO NOT SHARE H1B FOR THIS ROLE Job Description: Jr. SQL DBA - Job responsibilities include:• Designs, develops, and maintains database code objects, including coding for T-SQL, stored procedures and views in cooperation with application developers and in accordance with database standards and best practices.• Designs, develops, and maintains database code scripts to validate or maintain data external to the application.• Manages and performs detailed testing of database objects and scripts; performs code reviews.• Writes and maintains specifications and documentation for database objects and scripts.• Contributes to the design of the data model for application modifications/enhancements.• Identifies T-SQL code performance issues and optimizes T-SQL code for performance.• Participates (with a team of six) in an on-call weekly rotation to provide support for critical systems outside regular working hours.• Performs lookup value and metadata entry and maintenance to support the application.• Understands the administration screens and uses the application where appropriate.• Performs user security change requests using in-house tools and template T-SQL scripts.• Utilizes knowledge of T-SQL to perform application metadata and security maintenance activities.• Performs testing of lookup values, metadata modifications, and application security for quality assurance.• Performs metadata analysis to ensure the case management systems function properly.• Monitors help desk ticket queues and prioritizes tasks based on severity and priority levels.• Develops and implements data scripts using IDERA Rapid SQL for SAP ASE databases.• Assists with maintaining procedural documentation for the metadata administration and application security tasks.• Assists team members and training staff with the collection and implementation of metadata.Required experience includes:• 2+ years of SQL DBA experience• Experience with T-SQL fundamentals.• Bachelor’s degree with an IT-related major or minor; OR Associate’s degree with an IT-related major or minor and two years of experience in the IT area.",
        "source": "Email",
        "date_posted": "2024-10-10 12:50:36-05:00",
        "unique_id": "19277ae9de9f4268",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "DB Admin"
    }
]