[
    {
        "company": "KPG99",
        "job_title": ".Net Core Developer",
        "location": "Jacksonville, FL, USA",
        "full_location": {
            "city": "Jacksonville",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "8+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".Net Core 5+",
                "Angular 16+",
                "MS SQL",
                "PostgreSQL",
                "REST APIs",
                "SOAP APIs"
            ],
            "primary": [
                "GIT",
                "DevOps CI/CD",
                "Database Design",
                "Integration with External Systems"
            ],
            "secondary": [
                "Technical Documentation",
                "Scrum Methodology",
                "Code Audits",
                "Performance Optimization"
            ],
            "all": [
                ".Net Core 5+",
                "Angular 16+",
                "MS SQL",
                "PostgreSQL",
                "REST APIs",
                "SOAP APIs",
                "GIT",
                "DevOps CI/CD",
                "Database Design",
                "Integration with External Systems",
                "Technical Documentation",
                "Scrum Methodology",
                "Code Audits",
                "Performance Optimization"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Sonali Gupta",
        "email": "sgupta@kpgtech.com",
        "jd": "Hi,Please Read the below Requirement and share your resume and also please let me know your visa status and current Location if interested..Net Core DeveloperLocation-Hybrid in Jacksonville, FL - Local OnlyDuration: 6+ Months Any Visa SUMMARY: Responsible for utilizing established procedures, guidelines, and industry knowledge and experience to analyze current business information systems, applications, and tools in order to identify and implement moderately complex solutions that meet organizational needs and requirements, under general supervision.GENERAL RESPONSIBILITIES: Performs need, trend, feasibility and performance assessments related to business information systems and applications to ensure business requirements are fulfilled, risks are mitigated, and value is optimized. Designs, codes, tests and analyzes existing and new software. Makes and implements recommendations that improve system design and/or streamline performance and productivity based on analysis. Develops and documents best practices based on management and end-user feedback. Coordinates the installation of new software systems and provides ongoing technical support for moderately complex systems, applications and tools. Conducts code and configuration audits in order to assess accuracy and performance. Creates moderately complex technical documentation, such as software user guides, that enhance the operation, maintenance and development of systems. Anticipates internal/external business challenges and recommends and implements system value opportunities, including process optimization, policies and procedures, and end-user experience improvements. May indirectly lead other, less experienced, software developers in the implementation of small scale projects or components of larger projects. Establishes and maintains partnerships internal/external of the organization to maintain a unified approach to software development and assist in facilitating the resolution of software and business information system issues.EXPERIENCE: 8+ years of experience as a full stack developer with deep knowledge in Angular 16+, .Net Core 5 +, MS SQL, PostgreSQL.Design, develop and support the in-house applications.Experience in design and building Rest and Soap API’sExperience in designing and maintaining Databases.Experience in integration with external systems.Experience in GIT and adhere to DevOps CI/CD standards through existing pipelines.Adhere to scrum methodology through ceremonies.",
        "source": "Email",
        "date_posted": "2024-10-10 12:22:51-05:00",
        "unique_id": "19277953510ac932",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]