[
    {
        "company": "FirstStudent",
        "job_title": "JDE Business Analyst Mid Level",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "financial systems",
                "ERP",
                "billing",
                "invoicing",
                "contract review",
                "financial reconciliation"
            ],
            "primary": [
                "JDE experience",
                "acute listening skills",
                "strong communication",
                "detail-focused"
            ],
            "secondary": [
                "change management",
                "planning",
                "relationship-building",
                "hands-on training",
                "production support"
            ],
            "all": [
                "financial systems",
                "ERP",
                "billing",
                "invoicing",
                "contract review",
                "financial reconciliation",
                "JDE experience",
                "acute listening skills",
                "strong communication",
                "detail-focused",
                "change management",
                "planning",
                "relationship-building",
                "hands-on training",
                "production support"
            ],
            "with_experience": [
                "financial systems",
                "ERP",
                "billing",
                "invoicing",
                "contract review",
                "financial reconciliation"
            ]
        },
        "job_type": [],
        "contact_person": "Anupam",
        "email": "anupam.gupta@klaxontech.com",
        "jd": "From: Anupam, Klaxontech Inc anupam.gupta@klaxontech.com Reply to: anupam.gupta@klaxontech.com Hi ,My name is Anupam and I am a Staffing Specialist at klaxon technologies Inc. I am reaching out to you on an exciting job opportunity with one of our clients. If you are looking for a new job opportunity, please share your updated resume with your rate expectations. Position: JDE Business Analyst- Mid LevelClient: VacoCompany: FirstStudent Background: Order-to-Cash (O2C) kicked off early in 2024 as a proof of concept for a modernized billing process to bring accuracy, consistency and efficiency to customer invoicing. Currently, all bus depots/locations rely on manual and cumbersome Excel-based processes. The expected benefits of this project are to elevate First Student to a best-in-class level. As the proof of concept wraps up, there will be a large effort to roll out the new process across all existing locations (500+). Each location operates independently – much like a franchise model, which will require significant process analysis and deep dives to understand current state. This understanding will need to rapidly be translated to the future state process while not disrupting business operations. The Financial Systems/Business analyst will be responsible for:· Learning setup and processing steps for all systems involved in customer invoicing (current state and future state)· Evaluating contracts and interpreting the future state system setup requirements across these systems· Anticipating scenarios/gaps that have not been documented/identified through working with locations and project team· Documenting requirements of system gaps, reviewing with the broader project team, prioritizing backlogs and assisting with testing· Extensive change management, planning and relationship-building with location team members based on aggressive project schedule· Hands-on training (virtual) and production support with non-technical end users Required Skills:· Experience with financial systems/ERP and associated billing/invoicing business processes and approvals; JDE experience is beneficial· Acute listening skills coupled with an inquisitive nature and strong yet empathetic communication – both with external locations and core project team· Ability to flex and improvise while adhering strictly to the plan and expected outcomes· Extremely detail-focused and experienced in contract review and financial reconciliation from current state to future state",
        "source": "Email",
        "date_posted": "2024-10-10 09:10:51-05:00",
        "unique_id": "1927711849c3b48d",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]