[
    {
        "company": "Iowa Workforce Development",
        "job_title": "Technical Business Analyst - Hybrid",
        "location": "Des Moines, IA, USA",
        "full_location": {
            "city": "Des Moines",
            "state": "IA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "7 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "data migration",
                "business requirements",
                "data flow diagrams",
                "system architecture mapping",
                "business process flow documentation",
                "communication skills",
                "software development lifecycle",
                "testing systems",
                "test cases",
                "MS Office",
                "MS Project",
                "MS Visio",
                "Jira",
                "SQL"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "data migration",
                "business requirements",
                "data flow diagrams",
                "system architecture mapping",
                "business process flow documentation",
                "communication skills",
                "software development lifecycle",
                "testing systems",
                "test cases",
                "MS Office",
                "MS Project",
                "MS Visio",
                "Jira",
                "SQL"
            ],
            "with_experience": [
                "data migration (7 years)",
                "business requirements (7 years)",
                "data flow diagrams (7 years)",
                "system architecture mapping (7 years)",
                "business process flow documentation (7 years)",
                "communication skills (7 years)",
                "software development lifecycle (7 years)",
                "testing systems (7 years)",
                "test cases (7 years)",
                "MS Office (7 years)",
                "MS Project (7 years)",
                "MS Visio (7 years)",
                "Jira (7 years)",
                "SQL (7 years)"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Manoj Kumar Akkapelly",
        "email": "resume@msysinc.com",
        "jd": "From: Manoj Kumar Akkapelly, Msysinc resume@msysinc.com Reply to: resume@msysinc.com Title: Technical Business Analyst - HybridLocation: Des Moines, IA, United StatesLength: Long termRestriction: W2 or c2cSend resume to: manojk@msysinc.com Description:*** Very long term project Initial PO till for 1 year expect to go for 3+ years *** *** Hybrid ****** This position requires that someone is available to work onsite 2 days per week, so the priority will be given to local resources. ***Short Description:Technical Business Analyst skilled at consulting with business stakeholders and technical resources to define requirements and validate conversion for a large scale data migration effort for Unemployment Insurance Modernization.Complete Description:Iowa Workforce Development has an immediate need for a Technical Business Analyst skilled at consulting with business stakeholders and technical resources to define requirements and validate conversion for a large scale data migration effort for Unemployment Insurance Modernization. Specifically, this role will be dedicated to gathering necessary documentation, participating in technical requirement discussions, and performing validations.This individual will participate in testing and group sessions to define and validate requirements, identify gaps and analyze process needs.This individual will participate in vendor hosted data conversion sessions, articulating and/or documenting needs clearly and accurately to vendor teams.This individual will perform data validation for a large scale data migration effort, as legacy data is migrated to a modernized system, working in partnership with IWD IT resources and vendor project team to prepare test cases as necessary, document test results and articulate needs.Iowa Workforce Development is a state agency with a remarkable amount of modernization taking place. These projects will transform agency business operations, eliminate technical debt, improve user experience and return significant cost savings. The UI Benefit Modernization will move a 40 year old legacy mainframe system to a contemporary web based solution. The new system will be a modified/configurable off the shelf product, developed and hosted by a third party vendor.This position will work closely with the UI Benefits Modernization project manager and data conversion workstream lead, as well as IWD technical resource and UI SMEs, while interacting daily with the vendors project management and business analyst teams.We are seeking a Business Analyst with data migration experience to analyze and triage data migration testing results. The testing phase is complete, and all scripts for the data migration have been written. The original data mapping and requirements have also been finalized. We need a Business Analyst who can review the script results, identify discrepancies, and determine necessary changes to the data mapping requirements. This role involves working closely with both the business side to refine requirements and the technical team managing the data warehouse. While prior testing experience is not required, as the scripts are already in place, the ideal candidate should be able to understand why discrepancies exist and revise the requirements accordingly.Required Skills:Involvement in prior medium to large scale data conversions 7 YearsDemonstrated ability to elicit, document and understand business and technical requirements 7 YearsExperience preparing data flow diagrams, system architecture mapping, business process flow documentation 7 YearsDemonstrated strong communication skills across technical teams and business stakeholders 7 YearsProficient understanding of the software development lifecycle and related methodologies 7 YearsExperience testing systems against test cases and technical specifications, analyzing and documenting results 7 YearsExperience preparing test cases and technical specifications 7 YearsProficient in the use of MS Office, MS Project, MS Visio, Jira (or equivalent) 7 YearsDemonstrated ability to facilitate productive meetings with technical teams and business stakeholders 7 YearsWorking knowledge using SQL – Intermediate level or higher 7 YearsInvolvement in milestone/stage gate sign off and approval, ensuring technical and business readiness 7 YearsExperience partnering with vendor project teams and managing relationships 7 Years",
        "source": "Email",
        "date_posted": "2024-10-10 11:48:41-05:00",
        "unique_id": "192777862139539d",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]