[
    {
        "company": "Techgene Solutions LLC",
        "job_title": "Enterprise Platform Developer",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "5 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "DevOps",
                "Micronaut",
                "Kafka",
                "Agile"
            ],
            "primary": [
                "coding",
                "API's",
                "Back-end systems",
                "Cloud",
                "microservices",
                "K8s",
                "Redis",
                "Docker",
                "React JS",
                "Postgres",
                "Azure",
                "AWS",
                "GCP"
            ],
            "secondary": [
                "Continuous Delivery Pipeline",
                "event-driven systems",
                "technical diagrams",
                "technical documentation",
                "automation",
                "data management",
                "integration technologies"
            ],
            "all": [
                "Java",
                "DevOps",
                "Micronaut",
                "Kafka",
                "Agile",
                "coding",
                "API's",
                "Back-end systems",
                "Cloud",
                "microservices",
                "K8s",
                "Redis",
                "Docker",
                "React JS",
                "Postgres",
                "Azure",
                "AWS",
                "GCP",
                "Continuous Delivery Pipeline",
                "event-driven systems",
                "technical diagrams",
                "technical documentation",
                "automation",
                "data management",
                "integration technologies"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Raj",
        "email": "raj.s@techgene.com",
        "jd": "From: Raj, Techgene raj.s@techgene.com Reply to: raj.s@techgene.com I tried to reach you for the below position Enterprise Platform Developer and RemoteI hope you are well. I am (Raj) with Techgene Solutions LLC. We’re Enterprise Platform Developer and I think your experience is a great fit for this role. If you’re interested in learning more, I’d love to connect with you. Please review the Job description below and let me know if you are comfortable. I look forward to hearing from you soon. Thank you! Please share your profiles to raj.s@techgene.com or you can reach me at 972-580-0247 Ext 253 CHECKPOINT Full Legal Name Contact Number Email ID Date of Birth (MM/DD) Last 4 Digit SSN Current Location with Zip Code Two LinkedIn references from their recent two projects Work Authorization/Visa Status Passport Number Corporation Name Open to relocate OR Travel LinkedIn Total Years of IT Experience Education DetailsUniversity, year: US Experience Role: Enterprise Platform DeveloperRemoteType: ContractDuration: Long Term Must have: Java, DevOps, Micronaut, Kafka, Agile, coding Experience Enterprise Platform Developer is a key technical contributor who can digest complex business problems and identify architecturally sound solutions. They will support platform and solution development by providing, communicating, and evolving the broader technology and architectural view of the system solution, with demonstrated expertise in a variety of information technology concepts, practices, and procedures, can design and partner to implement software applications. Understands API’s, Back-end systems, Cloud and helps transform concepts to life using Agile framework.Roles & Responsibilities• Work in an iterative/Agile environment and be a strong team player.• Provide hands-on platform development and expertise in the creation of technical solutions to address system needs across the enterprise, working closely with all the application development teams. • Conducts code reviews for system modifications & development.• Ability to work flexible hours as needed to accommodate remote team needs.• Ability to deliver end-to-end solutions using innovative approaches to complex design problems.• Analyze & tune application performance, with a focus on user experience, system responsiveness and scalability.• Participate in planning, definition, and high-level design of the solution and exploration of solution alternatives.• Enable the Continuous Delivery Pipeline of systems through appropriate design guidelines and investment advocacy, working to identify creative solutions to apply DevOps principles to core systems.• Establish critical NFRs for the solution and participate in the definition of others.• Work with multiple Technology teams to champion the adoption of patterns, platforms, and tools to support the usage and conformity of solution architecture. • Define subsystems and their interfaces, allocate responsibilities to subsystems, understand solution deployment, and communicate requirements for interactions with solution context.• Assess industry technology trends & best practices to identify best-in-class Technology & architecture directions.• Play an active role in identifying new technologies for improving systems.• Experience with building microservices, frameworks, platforms & automations that are used across the enterprise.• Strong hands-on experience in developing distributed and event-driven systems using technologies such as K8s, Kafka, Redis, messaging, etc.• Strong knowledge of advanced technology architecture and emerging trends.• Effectively adapt to rapid technological & business change & maintaining enthusiasm & displaying sound judgment.• Demonstrate craving for continuous improvement, by understanding of new technology innovation & its application.• Hands-on experience producing detailed technical diagrams and authoring technical documentation with demonstrated experience in architecting cloud native solutions with platforms such as Azure, AWS, GCP, etc.• 5 years’ experience architecting solutions that include automation, mobile, data management, integration technologies and deployment on cloud infrastructures, preferably for large enterprises.• Experience with Java, Micronaut, React JS, Postgres, Redis, Docker, K8s/AKS and Azure cloud.",
        "source": "Email",
        "date_posted": "2024-10-10 07:42:42-05:00",
        "unique_id": "19276a9afbfb654a",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]