[
    {
        "company": "Tek Inspirations LLC",
        "job_title": "Principal Java Developer",
        "location": "Dallas, TX, USA",
        "full_location": {
            "city": "Dallas",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "12+ years",
            "degree_required": "Bachelor’s Degree or a combination of work experience and education",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "J2EE",
                "Spring Boot",
                "Microservices"
            ],
            "primary": [
                "Spring Cloud",
                "Azure",
                "GCP",
                "AWS",
                "GraphQL",
                "REST",
                "Kafka",
                "RabbitMQ",
                "SQS",
                "NOSQL",
                "SQL"
            ],
            "secondary": [
                "Agile",
                "Behavior-Driven-Design (BDD)",
                "Application Development",
                "SDLC"
            ],
            "all": [
                "Java",
                "J2EE",
                "Spring Boot",
                "Microservices",
                "Spring Cloud",
                "Azure",
                "GCP",
                "AWS",
                "GraphQL",
                "REST",
                "Kafka",
                "RabbitMQ",
                "SQS",
                "NOSQL",
                "SQL",
                "Agile",
                "Behavior-Driven-Design (BDD)",
                "Application Development",
                "SDLC"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Sanjeev Kumar Singh",
        "email": "sanjeev.singh@tekinspirations.com",
        "jd": "From: Sanjeev Kumar Singh, Tek Inspirations LLC sanjeev.singh@tekinspirations.com Reply to: sanjeev.singh@tekinspirations.com Job Description Principal Java Developer 6+ monthsHybrid – Dallas, TXSkill Set: Java / J2ee, Spring Boot, Spring Cloud, Any public cloud experience (Azure, GCP, AWS), Microservices, GraphQL, REST, Event driven solutions & design (Kafka / RabbitMQ / SQS etc.), NOSQL, SQLManager Notes:Working with portfolios on supply, sales and customer sideBuilding enterprise level webservicesHands on Cloud who can build microservices100% hands on.Principal will have 4 portfolios; Roles are the same but expectation is principal is more Sr and has more portfolios to work onPrincipal is someone who can mentor junior developers and manage multiple deliveries. They wont be overseeing anyoneMust haves: Java J2EE, Spring boot microservices, any experience building services on CloudOverviewThe Developer’s role is to develop and enhance in-house software applications or extensions bycoding with a technical language to meet business requirements and business objectives. Thiscan include taking technical specifications and developing an application or integration of databetween applications, testing, as well as, completing the appropriate technical documentation.The developer may also be responsible for delivering support to end users in the organizationfor specific code, including troubleshooting code.Specialized Skills and TechnologiesJava / J2ee, Spring Boot, Spring Cloud, Any public cloud experience (Azure, GCP, AWS),Microservices, GraphQL, REST, Event driven solutions & design (Kafka / RabbitMQ / SQS etc.),NOSQL, SQLPrimary Responsibilities? Serve in a team leader capacity with large-scale Application Development projects /programs? Lead and direct offshore application development programs? Maintain a working knowledge of Software Code Development leading practices andserve as a thought leader to the SGWS organization? Facilitate Code Development / Engineering training and education programs for the ITteam? Provide coaching and development to more junior Application Developers? Oversee the work of 3rd party Development teams? Drive the collection of required information to develop work scope around solutions toattain business requirements along with data needs as required? Serve as liaison between Divisions/Functions and IT on projects and enhancements? Perform other job-related duties as assignedMinimum Qualifications? Bachelor’s Degree or a combination of work experience and education? 12+ years in an application development or comparable experience? Experience working with, and directing, third-party Application Development teams? Experience leading and supporting teams with large-scale Application Developmentprojects / programs? Extensive experience across the entire project life cycle (SDLC) – be it implementing newsoftware or enhancing existing functionality? Experience with interfaces into and from platforms (using APIs, ESB, SAP PI etc.? Participate in Agile teams? Drive Behavior-Driven-Design (BDD) process? Excellence in communicating and presenting complex information to technical andnontechnical stakeholdersPhysical Demands? Physical demands include a considerable amount of time sitting and typing/keyboarding,using a computer (e.g., keyboard, mouse, and monitor), or adding machine? Physical demands with activity or condition may include walking, bending, reaching,standing, squatting, and stooping? May require occasional lifting/lowering, pushing, carrying, or pulling up to 20lbs",
        "source": "Email",
        "date_posted": "2024-10-10 15:54:05-05:00",
        "unique_id": "1927856963e90f29",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]