[
    {
        "company": "Quantig",
        "job_title": "Business Analyst",
        "location": "Quincy, MA, USA",
        "full_location": {
            "city": "Quincy",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "2+ years",
            "degree_required": "Bachelor's",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Snowflake",
                "Data Warehouse",
                "Salesforce",
                "SQL",
                "AWS",
                "Tableau"
            ],
            "primary": [
                "Data analytics",
                "Data profiling",
                "Communication skills",
                "Cloud database platform experience"
            ],
            "secondary": [
                "HIPAA compliance",
                "Project management",
                "Technical documentation",
                "Stakeholder engagement",
                "Cross-training"
            ],
            "all": [
                "Snowflake",
                "Data Warehouse",
                "Salesforce",
                "SQL",
                "AWS",
                "Tableau",
                "Data analytics",
                "Data profiling",
                "Communication skills",
                "Cloud database platform experience",
                "HIPAA compliance",
                "Project management",
                "Technical documentation",
                "Stakeholder engagement",
                "Cross-training"
            ]
        },
        "job_type": [],
        "contact_person": "Alex",
        "email": "recruiter4@quantig.com",
        "jd": "From: Alex, quantig.com recruiter4@quantig.com Reply to: recruiter4@quantig.com Hi,Title: Business AnalystLOCATION:Quincy, MA (LOCALS FROM MA, NEW HAMSHIRE,RI ONLY)Duration : LOng termMUST HAVE: BA, SNOWFLAKE, DATA WARE HOUSE, SALESFORCE , SQL, AWS, BI TOOL SUCH AS TABLEAUJ.D:DETAILED LIST OF JOB DUTIES AND RESPONSIBILITIES: * Plan for, develop, and document in detail the functional, technicaland business requirements of solutions for business and technicalprojects of a wide range of complexity * Write both business and technical documentation that is appropriateto support the development and end user community * Engage and collaborate with internal/external stakeholders tounderstand their requirements and get their feedback throughout thelifecycle of projects * Follow established PMO standards and procedures * Communicate milestones that define delivery timetables based oncapacity and prioritization * Ensure timely delivery of solutions meeting requirements andexpectations * Investigate, design, and implement business solutions and majorupgrades or enhancements to existing solutions * Assist in complex data analysis and translates business needs intoData solutions * Assist with data training to ensure the end users of the DataPlatform and the BI reports fully understand all components. * Cross train peers within subject matter areas and technical expertiseareas * Work with Architects, Developers and Analysts to present an overviewof requirements to build use cases * Work with technical teams to translate business requirements totechnical requirements * Gather and understand user requirements and business activities * Experience in Participating requirements and solution review sessionsinvolving Data platform implementation. * Expertise in leading presentation of requirements analysis tomanagement, technical, analytical and business stakeholders * Contribute to project plans as requested by project managers ordirector * Assist internal management in establishing project priorities and inallocating service delivery resources * Ensure timely delivery of solutions meeting requirements andexpectationsQUALIFICATIONS: Minimum experience/skills: * Experience in creating, reviewing and maintaining end-to-end dataplatform requirements. * Strong communication skills comfortable explaining/proposingsolutions to technical stakeholders, vendors, and business consumers. * Experience working with highly sensitive health care information andfamiliar with HIPAA and other data privacy controls. * Thorough knowledge and experience of data warehouse and EnterpriseData solution. * Data analytics and data profiling skills * 2+ years of Cloud database platform experience such as Snowflake. * Salesforce Experience * Familiarity with AWS cloud services * Excellent SQL query skills * Working knowledge with at least one Business Intelligence tool suchas Tableau * Effective and good communications skills * Ability to work with teams and independently.",
        "source": "Email",
        "date_posted": "2024-10-10 07:33:13-05:00",
        "unique_id": "19276ac7c5c2e667",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]