[
    {
        "company": "Fluxtek Solutions Inc",
        "job_title": "SAP S4 HANA Project Manager",
        "location": "Columbus, OH, USA",
        "full_location": {
            "city": "Columbus",
            "state": "OH",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "15+ Years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "S4/HANA Migration",
                "Project Management",
                "Stakeholder Management",
                "Agile Methodologies",
                "Analytical Skills"
            ],
            "primary": [
                "SAP Products Knowledge",
                "Governance Processes",
                "Team Leadership",
                "Problem Solving",
                "Communication Skills"
            ],
            "secondary": [
                "Collaboration",
                "Risk Management",
                "Budget Management",
                "Vendor Management",
                "Relationship Building"
            ],
            "all": [
                "S4/HANA Migration",
                "Project Management",
                "Stakeholder Management",
                "Agile Methodologies",
                "Analytical Skills",
                "SAP Products Knowledge",
                "Governance Processes",
                "Team Leadership",
                "Problem Solving",
                "Communication Skills",
                "Collaboration",
                "Risk Management",
                "Budget Management",
                "Vendor Management",
                "Relationship Building"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "SAIRAM",
        "email": "sai.ram@fluxteksol.com",
        "jd": "From: SAIRAM, Fluxtek Solutions Inc sai.ram@fluxteksol.com Reply to: sai.ram@fluxteksol.com Role: SAP S/4 HANA Project ManagerLocation: Columbus, OH (Hybrid) local candidatesDuration: Long termExperience: 15+ YearsSuccessfully lead the merging of the Americas ECC SAP system within an existing S4/HANA Private Cloud Edition that is used for non-Americas legal entities. You will be responsible to manage the project and coordinate all streams with the support of the Project Sponsor. You ensure that the assigned project is correctly managed according to relevant project management standards and ensure that it is delivered on time, within budget, and according to scope. The project must respect any policies & procedures as used within. You have a team of IT staff and external consultants as needed located in multiple locations globally to achieve this. The IT environment is spread over multiple sites globally and working together with other IT & business teams all over the world will be essential. The project Manager will be working in an international environment with a flat organizational structure where initiative is expected and appreciated; in addition to excellent leadership qualities.Key responsibilities/Expectations/What does the role have to deliverParticipate in the selection of the partner who will do the migration.Drive the Project Initiation phase, prepare the project charter, identify stakeholders, work with the supplier Project manager to do the project planning.Understand the S/4 HANA and other SAP products to ensure solutions, and roadmaps are comprehensive.Work with key stakeholders to set project objectives, requirements, and success criteria.Actively build positive, collaborative relationships with Business to understand the business priorities and bring assets and expertise aligned with these priorities.Set up and lead effective governance and program management office processes to manage the solution, decision-making, deliverables, stage gates, schedule, resources, and costs.Partner with the IT Point of Contact the Supplier Project Manager and the Business Project Manager to execute, monitor, and control the results of the migration. You are accountable for the success of the migration. You are responsible for the IT side of the project together with the Business Project Manager (who owns the Business requirements gathering, Business Acceptance testing, and all other topics and deliverables coming from the Business) and with the Supplier Project Manager (who manages the consultants) and with the IT Business Applications Migration Responsible.Deep-dive existing and potential problem areas, develop and communicate corrective action and mitigation plans, and drive follow-through to successful resolution. Be hands-on when needed to help your team solve problems and get through crunch periods.Help your teams connect the dots and collaborate effectively by understanding and sharing solution and delivery integration points across functional and technical workstreams.Work along with the project’s solution architect and consultants to arrive at a clear scope definition and objectives document.Ensure that all deliverables are complete and accurate and are signed off by Business & IT according to the Business Applications standards and SAP Best Practices.You identify lessons learned in each phase to ensure continuous improvement during the migration.You follow project cost vs budget.Manage and negotiate between multiple suppliers and vendors in the program.Report project progress and updates to all levels, including the Executive Committee.Risk Management Experience/Skills:At least 1 successful experience as a Project Manager for S4/HANA Migration5 years of proven successful Project and Program management in a SAP landscapeExperience managing a team onshore and offshore Excellent communication skillsExcellent stakeholder management skillsStrong analytical and problem-solving abilitiesYou have strong organizational skills, to manage and prioritize work and initiatives under deadlines and you have experience with the Agile way of workingDemonstrated ability to build relationships and work collaboratively at all levels.",
        "source": "Email",
        "date_posted": "2024-10-10 07:29:02-05:00",
        "unique_id": "1927688377bb7f16",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]