[
    {
        "company": "Indiana Department of Health (IDOH)",
        "job_title": "Senior .NET Developer",
        "location": "Indianapolis, IN, USA",
        "full_location": {
            "city": "Indianapolis",
            "state": "IN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "749179",
            "experience_required": "10 years",
            "degree_required": "Bachelor’s Degree in Computer Science or related fields with IT experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "ASP.NET",
                "C#",
                "MVC"
            ],
            "primary": [
                "Web Services",
                "SDLC",
                "Strong verbal and written communication skills",
                "Ability to solve complex programming issues"
            ],
            "secondary": [
                "Experience in Healthcare Industry"
            ],
            "all": [
                "ASP.NET",
                "C#",
                "MVC",
                "Web Services",
                "SDLC",
                "Strong verbal and written communication skills",
                "Ability to solve complex programming issues",
                "Experience in Healthcare Industry"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Sameer Kumar",
        "email": "sameer@globalitfamily.com",
        "jd": "From: SAM, Global IT Family sameer@globalitfamily.com Reply to: sameer@globalitfamily.com Requisition Class: SUP : Information TechnologyRegion Name: State of IndianaTitle/Role: IN-IDOH Senior .NET Developer (749179)Start Date: 11/04/2024End Date: 09/30/2025Work Arrangement: HybridWorksite Address: 2 N. Meridian St. Indianapolis IN 46204Agency Interview Type: Webcam only Local candidates only. The Indiana Department of Health (IDOH) is seeking a senior .NET Developer for Long Term Acute Care program area. Developer is responsible to maintain a number of stabilized .NET applications developed in VB.net, C# with Oracle, and SQL server as databases. Software developer position is to analyze software requirements, designing, developing, testing, and implementing the new Quality Assurance Management Information System (QAMIS) or make enhancements to existing application according to specifications from program team. Essential Duties / Responsibilities: • Use object-oriented techniques and best practices for design, development, unit testing and deployment. • Use Microsoft .NET Framework and a supported MVC framework, C# programming language to development of the applications.• Analyzing, designing, developing, testing, and implementing software programs and application enhancements.• Document all deliverables and perform system unit testing and validation of procedures.• Work with program area team on technical issues including system design and testing.• Analyzing information to recommend and plan the development and implementation of new systems or modifications of an existing system.• Work with Program team members on detailed business requirements, understanding business processes and technology, agency standards, and ensuring project goal alignment.• Write technical specifications based on conceptual design and stated business requirements.• Work with project manager to ensure project plan is maintained and project milestones are being met. • Have ability to work independently and under general supervision with latitude for independent judgment. • Responsible to modify existing applications from time to time due to changes in technology, security, state or federal law changes and national standards. SkillRequired / DesiredAmountof ExperienceASP.NETRequired10YearsC#, MVCRequired5YearsWork experience in analysis and addressing security related issues for applications built in multiple languagesRequired5YearsWeb ServicesRequired5YearsExpert understanding of SDLCRequired Strong verbal and written communication skillsRequired Ability to solve complex programming issuesRequired Bachelor’s Degree in Computer Science or related fields with IT experienceRequired Experience in Healthcare IndustryHighly desired Question 5Selected candidate will be required to work onsite 3 days per week. Please confirm the resource understands this requirement.Question 6The manager has indicated this position is a possible contract to hire opportunity for eligible candidates only.Question 7The manager has indicated the position is a possible contract to hire opportunity for eligible candidates only. Thanks & Regards,Sameer KumarGlobal IT FamilyEmail: sameer@globalitfamily.com www.globalitfamily.comSkype: sameer.satapathyLinkedIn : https://www.linkedin.com/in/sameer-satapathy-10ab0318/ (Open to connect in Linkedin)Connect with us!",
        "source": "Email",
        "date_posted": "2024-10-10 08:02:57-05:00",
        "unique_id": "19276a9b7fba49bb",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]