[
    {
        "company": "Indiana Dept of Health",
        "job_title": ".NET Developer",
        "location": "Indianapolis, IN, USA",
        "full_location": {
            "city": "Indianapolis",
            "state": "IN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Must have existing work authorization",
            "notice_period": "Not specified",
            "duration": "12 months",
            "rate": "$50/hour"
        },
        "skills": {
            "core": [
                "ASP.Net",
                "C#",
                "MVC"
            ],
            "primary": [
                "VB.net",
                "Oracle",
                "SQL Server",
                "web services",
                "SDLC"
            ],
            "secondary": [
                "strong verbal and written communication skills",
                "ability to solve complex programming issues"
            ],
            "all": [
                "ASP.Net",
                "C#",
                "MVC",
                "VB.net",
                "Oracle",
                "SQL Server",
                "web services",
                "SDLC",
                "strong verbal and written communication skills",
                "ability to solve complex programming issues"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Vanshika Gupta",
        "email": "vanshikag@vbeyond.com",
        "jd": "From: Vanshika Gupta, VBeyond vanshikag@vbeyond.com Reply to: vanshikag@vbeyond.com Hi,Hope you are doing good !My name is Vanshika, I am a resource professional with VBeyond Corporation. VBeyond is a national recruiting company which partners with many of the leading employers in the Life Sciences, IT, and Financial Services sectors, feel free to check us out at www.vbeyond.com. Please share relevant profiles only !! Role: .NET DeveloperExperince : 10+ yearsClient: Indiana Dept of Health (2 N. Meridian St, Indianapolis, IN 46204) (Local)Max rate offered is $50 an hour (this is a FIXED rate, we cannot go higher) Work schedule is HYBRID (2-3 days onsite a week)Interview is VIRTUALLength of contract is 12 monthsVisa : USC and GC with pervious visa copy EAD with passport number Responsibilities: Candidates presented must be eligible for full time hire, without requiring sponsorship.Developer is responsible to maintain a number of stabilized .NET applications developed in VB.net, C# with Oracle, and SQL server as databases. Software developer position is to analyze software requirements, designing, developing, testing, and implementing the new Quality Assurance Management Information System (QAMIS) or make enhancements to existing application according to specifications from program team. Use object-oriented techniques and best practices for design, development, unit testing and deployment. Use Microsoft .NET Framework and a supported MVC framework, C# programming language to development of the applications.Analyzing, designing, developing, testing, and implementing software programs and application enhancements.Document all deliverables and perform system unit testing and validation of procedures.Work with program area team on technical issues including system design and testing.Analyzing information to recommend and plan the development and implementation of new systems or modifications of an existing system.Work with Program team members on detailed business requirements, understanding business processes and technology, agency standards, and ensuring project goal alignment.Write technical specifications based on conceptual design and stated business requirements.Work with project manager to ensure project plan is maintained and project milestones are being met. Have ability to work independently and under general supervision with latitude for independent judgment. Responsible to modify existing applications from time to time due to changes in technology, security, state or federal law changes and national standards. Requirements: Experience with ASP.NetExperience with C#, MVC.Work experience in analysis and addressing security related issues for applications built in multiple languages.Experience in web services.Expert understanding of SDLC.Strong verbal and written communication skills.Ability to solve complex programming issues.",
        "source": "Email",
        "date_posted": "2024-10-10 16:38:56-05:00",
        "unique_id": "19278a569f9fdd15",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]