[
    {
        "company": "Executive Office of Health and Human Services, CISO’s Office",
        "job_title": "Sr. Security PM",
        "location": "Quincy, MA, USA",
        "full_location": {
            "city": "Quincy",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "5 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "NIST Risk Management",
                "FIPS 199",
                "FIPS 200",
                "NIST 800-53 Security and Privacy Controls",
                "NIST 800-60 Mapping"
            ],
            "primary": [
                "PMI",
                "Agile",
                "Strong attention to detail",
                "Exceptional communication skills",
                "Organizational skills",
                "Ability to build relationships"
            ],
            "secondary": [
                "Technical project management",
                "Operational project management",
                "Leadership skills",
                "Customer service skills",
                "Problem-solving skills",
                "Team collaboration skills"
            ],
            "all": [
                "NIST Risk Management",
                "FIPS 199",
                "FIPS 200",
                "NIST 800-53 Security and Privacy Controls",
                "NIST 800-60 Mapping",
                "PMI",
                "Agile",
                "Strong attention to detail",
                "Exceptional communication skills",
                "Organizational skills",
                "Ability to build relationships",
                "Technical project management",
                "Operational project management",
                "Leadership skills",
                "Customer service skills",
                "Problem-solving skills",
                "Team collaboration skills"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Mayank Mer",
        "email": "mayank.mer@pivotal-technologies.com",
        "jd": "Need local to MA only || NIST experience Role : Sr. Security PMWith NIST experience. Location : Must be local to Quincy, MA – HybridVisa : No H1/OPT The Executive Office of Health and Human Services, CISO’s Office seeks a highly motivated Project Manager to lead project management efforts for multiple security initiatives, ultimately resulting in the development of a robust, modernized security program. Must Have the NIST experience. Possess prior experience in Security and/or Compliance with some familiarity with NIST Risk Management, FIPS 199, 200, NIST 800-53 Security and Privacy Controls, NIST 800- 60 Mapping Types of Information and Information Systems to Security Categories. Important SkillsTechnical – PMI, Agile, NIST Risk Management, FIPS 199, 200, NIST 800-53 Security and Privacy Controls, NIST 800- 60 MappingSoft – Strong attention to detail, exceptional communication and organizational skills, ability to build relationships JOB DESCRIPTION: PROGRAM OVERVIEW: DETAILED LIST OF JOB DUTIES AND RESPONSIBILITIES: Engage with stakeholders to identify project expectations, goals and outcomes to determine project scope, objectives, and deliverables. Conduct meetings with EOHHS business areas to establish a mutual understanding of engagement objectives, timeline, roles, and deliverables.Collaborate with both business stakeholders and IT resources to develop comprehensive project plans with detailed milestones and activities outlining tasks, timelines, resources, and requirements. Coordinate with both internal and external stakeholders on the execution of activities according to project defined requirements Liaise with the vendor as a key Point of Contact (POC) to facilitate business responses to vendor questions in a timely fashion Assist business and technical leads in the priorities that lead to the successful completion of requirements Monitor results against established timelines, deliverables, tasks, dependencies and associated technical specifications Assume Responsibility for overall coordination, facilitation, and aggregation of status reporting and health of the project, including keeping all levels of management appraised of project status. Lead the tracking and follow-up of risks, issues, and constraints and escalate where appropriate Manage and maintain project documentation, ensuring that documentation is collected, version controlled, and available upon request Maintain the confidentiality, integrity and availability of data across the organization Ensure compliance with EOTSS, EOHHS, Security, and departmental policies, guidelines, and objectives. QUALIFICATIONS: Preferred Knowledge, Skills, and Abilities: Minimum of 5 (five) years of experience in technical project management. Strong operational and project management skills, including PMI and Agile project management experience in all software development lifecycle methodologies. Able to foster a collaborative work environment and demonstrate excellent leadership skills. Possess prior experience in Security and/or Compliance with some familiarity with NIST Risk Management, FIPS 199, 200, NIST 800-53 Security and Privacy Controls, NIST 800- 60 Mapping Types of Information and Information Systems to Security Categories.Possess strong organizational, presentation and customer service skills.Possess excellent problem-solving and team collaboration skills as required in project environments.",
        "source": "Email",
        "date_posted": "2024-10-10 10:00:12-05:00",
        "unique_id": "19277193371aacf2",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]