[
    {
        "company": "Siri InfoSolutions inc",
        "job_title": "ETRM BA (nMarket + ISO)",
        "location": "Houston, TX, USA",
        "full_location": {
            "city": "Houston",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "7-10 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long term contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "ETRM",
                "CTRM",
                "Agile project management",
                "Data Models",
                "ISO Scheduling Systems"
            ],
            "primary": [
                "Energy trading",
                "Risk management",
                "Scheduling tools",
                "Database design",
                "North American ISO Markets"
            ],
            "secondary": [
                "Power Commodity trading",
                "Deal modeling",
                "Deal valuation",
                "System integration",
                "Azure DevOps"
            ],
            "all": [
                "ETRM",
                "CTRM",
                "Agile project management",
                "Data Models",
                "ISO Scheduling Systems",
                "Energy trading",
                "Risk management",
                "Scheduling tools",
                "Database design",
                "North American ISO Markets",
                "Power Commodity trading",
                "Deal modeling",
                "Deal valuation",
                "System integration",
                "Azure DevOps"
            ],
            "with_experience": [
                "ETRM (7-10 years)",
                "CTRM (7-10 years)",
                "Agile project management",
                "Database design"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Ganesh Kathila",
        "email": "ganesh.k@siriinfo.com",
        "jd": "From: Ganesh Kathila, Siri InfoSolutions inc ganesh.k@siriinfo.com Reply to: ganesh.k@siriinfo.com Job Title: ETRM BA (nMarket + ISO) Location: Houston, TX – Day 1 Onsite Duration: Long term contract Summary: Work directly with the client gathering requirements to align technology with business strategy and goals. Expert knowledge of energy trading and risk management processes across front, middle, and back- office functionalities with extensive Power Commodity trading experience. Background in supporting Trading in the following market (ERCOT/Tx, PJM, CAISO, NEISO, NYISO, MISO and SPP) with and emphasis in integrating, enhancing, and maintaining Scheduling Tools. Detail understanding of how to gather business requirements and create formal business cases, user stories and design documentation. Proven experience using Agile project management principles, leading, and guiding delivery through the entire system life cycle. Experiences building and support complex Data Models with knowledge/understanding on database design. Subject matter expert in ISO settlement process, Deal modeling, Deal valuation process with additional ability performing analysis on existing systems/interfaces.Essential experience and requirements:7-10 years, direct functional and technical experience in support ETRM (Energy Trading and Risk management systems) / CTRM (Commodity Trading and Risk management systems) and Scheduling systems7-10 years of experience with RDMSStrong functional understanding of North American Energy trading end to end business processes.Strong functional understanding of North American ISO Markets with an emphasis on SchedulingKnowledge of deal lifecycle, CTRM systems including but not limited to position reporting, deal modelling, risk valuation, invoicing, settlements, scheduling and pricing.Should have experience in managing an end-to-end delivery of trade capture system.Should have experience in system integration standard processes specifically for power operations (Scheduling /Bidding/Auction/Rewards/ ISO integration). Knowledge of corresponding domain information tying back to database attributes required.Strong knowledge of ISO Scheduling Systems (i.e nMarket/PowerOptix/Adapt2/OATI) or similar products is required. Knowledge of different markets and variations required.Solid understanding of invoicing/contract/statement data, Settlements process, Invoice generation, transaction typesSolid understanding of ISO published statement date.Solid understanding of the STP (Straight Through Processing)Adept in handling business changes and managing collaborator expectations.Provide comprehensive documentation for requirements, functional design, workflows, support project tracking.Effective management of tasks, timelines, progress reporting on tasks Perform requirement gathering, functional analysis and functional design.Knowledge and experience with using Azure DevOps (ADO) in full software lifecycle.Manage communication across multiple teams, third party vendor, and multiple consulting staff.Understanding of Software Development Life Cycle and Agile methodologiesBehavior and Skills:Ability to work in a fast-paced environment and interact with various collaborators.You are able to work in small teams, or alone, for project delivery.Candidate should be able to exhibit strong analytical and problem-solving skills, to deliver high quality solutions to clients.Candidate should be able to liaise with other teams to resolve cross functional issues.High self-motivation and strong delivery focusStrong verbal and written communication skillsExcellent team working skills",
        "source": "Email",
        "date_posted": "2024-10-10 10:12:45-05:00",
        "unique_id": "19277261c37befec",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]