[
    {
        "company": "Hitachi",
        "job_title": "Oracle Financials Business Systems Analyst",
        "location": "Redmond, WA, USA",
        "full_location": {
            "city": "Redmond",
            "state": "WA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "6+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "4+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle Financials E-Business Suite (EBS)",
                "Oracle R12 EBS",
                "Financial Processes (OTC, PTP, RTR)",
                "Oracle Financials Accounting Hub (FAH)"
            ],
            "primary": [
                "Business Systems Analysis",
                "Configuration and Implementation",
                "Testing and Support",
                "Problem Response and Triage",
                "Documentation Management"
            ],
            "secondary": [
                "Fit-gap analysis",
                "Cross-functional collaboration",
                "Information Security compliance",
                "SOX compliance",
                "Automation initiatives"
            ],
            "all": [
                "Oracle Financials E-Business Suite (EBS)",
                "Oracle R12 EBS",
                "Financial Processes (OTC, PTP, RTR)",
                "Oracle Financials Accounting Hub (FAH)",
                "Business Systems Analysis",
                "Configuration and Implementation",
                "Testing and Support",
                "Problem Response and Triage",
                "Documentation Management",
                "Fit-gap analysis",
                "Cross-functional collaboration",
                "Information Security compliance",
                "SOX compliance",
                "Automation initiatives"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Ashish Sharma",
        "email": "asharma@adventatech.com",
        "jd": "Job Description -Oracle Financials Business Systems AnalystRedmond,WA GC/USC/GC EAD/OPT/TN/H412+ monthsCLient- HitachiJDhybrid roleMust Have Requirements: Must have at least 6 years of experience working with Oracle Financials E-Business Suite (EBS)Experience working within Oracle R12 EBSExperience with Financial Processes (OTC, PTP, and RTR)Working with Oracle Financials Accounting Hub (FAH) Job Description: Responsibilities The Business Systems Analyst - Oracle EBS Application will assist with the cultivation of business relationships and application centric deliverables for the Oracle E -Business Suite (EBS). The analyst will help manage the responsibility of all current and future Oracle EBS related modules and interfaces required by the business to support all business requirements. The BSA will be responsible for the design, configuration, modification, implementation, testing, and support of Oracle Applications modules. The role will work directly with internal business users to understand the business needs and make recommendations on how Oracle Applications can be leveraged to provide new capabilities/functionality and provide real time support. In the course of this support, the BSA manages the process of problem response, triage and manages the team’s documentation of defects and communicates remediation. Oversees design and implementations of feeds, data structures, reports, etc. including analysis and documentation following project management and SDLC disciplines to ensure structured and effective implementation. Deliverables: As an Oracle EBS functional expert, you'll drive the design and configuration of cutting-edge processes in the financials domain, leveraging your expertise to enhance systems and exceed customer expectationsDive into exciting projects, from fit-gap analysis to post-production support, and unleash your creativity to streamline our operationsImplement industry best practices in Oracle R12 EBS for Financials processes (OTC, PTP & RTR), driving efficiency and innovationConduct fit-gap analysis, develop solutions, and write detailed functional specifications for projectsLead end-to-end system development phases, ensuring timely delivery and client satisfactionCollaborate with cross-functional teams to exceed customer expectations and maintain Information Security and SOX complianceProvide troubleshooting expertise, resolve software application issues, and drive automation initiatives for process optimizationDevelop comprehensive test strategies and plans for application updates and enhancementsDeliver high-quality presentations to address challenges and propose effective solutions",
        "source": "Email",
        "date_posted": "2024-10-10 08:09:33-05:00",
        "unique_id": "19276ae783c5b92b",
        "emp_type": [
            "full-time",
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]