[
    {
        "company": "Bluebird Technologies",
        "job_title": "Back-End Developer - IV",
        "location": "Basking Ridge, NJ, USA",
        "full_location": {
            "city": "Basking Ridge",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Bachelor's degree in computer science, software engineering, or other related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Microservices",
                "Cassandra",
                "DevOps",
                "AWS"
            ],
            "primary": [
                "J2EE",
                "Spring",
                "UNIX",
                "Agile Development",
                "XML",
                "JIRA",
                "Confluence",
                "Git",
                "Stash",
                "Spring Boot"
            ],
            "secondary": [
                "Oracle SQL/PL-SQL",
                "Shell Scripts",
                "CRON",
                "Problem-solving",
                "Teamwork",
                "Collaboration",
                "Stakeholder Management"
            ],
            "all": [
                "Java",
                "Microservices",
                "Cassandra",
                "DevOps",
                "AWS",
                "J2EE",
                "Spring",
                "UNIX",
                "Agile Development",
                "XML",
                "JIRA",
                "Confluence",
                "Git",
                "Stash",
                "Spring Boot",
                "Oracle SQL/PL-SQL",
                "Shell Scripts",
                "CRON",
                "Problem-solving",
                "Teamwork",
                "Collaboration",
                "Stakeholder Management"
            ],
            "with_experience": [
                "Java (10+ years)",
                "Microservices",
                "Cassandra"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Krishna Kumar",
        "email": "krishna@bluebirdtechnologies.com",
        "jd": "From: Krishna Kumar, Bluebird Technologies krishna@bluebirdtechnologies.com Reply to: krishna@bluebirdtechnologies.com Job Posting Title: Back-End Developer - IVHybrid - 2x a week in the office - (Need Locals)Site: Basking Ridge-NJ-USA Targeted Years of Experience: 10+ years Responsible for the design and development of medium to highly complex systems. Skills include system design and analysis as well as business skills. Works with data and project managers to understand systems and consults with customers to understand needs. Developments and implements new systems, corrects software errors in existing systems, and works to improve performance through hardware upgrades. Manages computer systems in a business environment and responsible for resolving technical issues. Knowledgeable in programming, data structures, computer systems, and software engineering. Bachelor's degree in computer science, software engineering, or other related field. Ability to manage multiple assignments. Superior written and oral communication skills. 10+ years of experience. As a Senior Java Developer, you will design and implement a highly scalable, highly available application for Verizon Wireless. You will implement next gen platform using open source / open systems, which is cloud enabled and based on Micro services architecture.· Design, Architect and create solutions using java, micro service and Cassandra No SQL Database · Strong analytical and diagnostic skills · Analysis, design for the products and services in the Wireless business to fulfill the needs of strategic initiatives · Understand the business needs and make critical design decisions an implement the same with other team members · Participate in day to day activities involving design, development, test support, deployment and production monitoring and support for Order Management platform · Communicate with external teams including business clients on various issues and resolutions to provide the best customer experience · Participate in requirement gathering and create design documents . AWS and Cassandra certification preferred Must Have:Over 10+ years of experience in the Software Development Industry.4 years of Bachelor’s degree in Computer Science or Electronics or Electrical Engineering Strong with DevOps open source tools and AWS cloud services – Preferably AWS certified Experience developing applications using Java, J2EE and spring Experienced with Various J2EE application servers like WebSphere, Tomcat and spring boot.Demonstrates hands-on experience in UNIX environment and related UNIX utilities including shell scripts and CRON.Experience handling complete product releases from development, integration, testing, to production Experience with agile development and must have knowledge of XML schemas, JIRA, Confluence, Git, and Stash.Hands on experience with Spring BootExperience in implementing critical high-availability applications and experience in Microservices Experience with No SQL technology – Cassandra Problem-solving skills to develop quick yet sound solutions to resolve complex issues.Teamwork & collaboration skills to work across organizations and lead cross-functional teams including offshore resources Good Communication & stakeholder management skills Programming Language(s): Competency in Oracle SQL/PL-SQL, working knowledge of-Java, exposure to CassandraApplication(s): DB tool SQL Developer or Toad, SoapUI, XML Spy.",
        "source": "Email",
        "date_posted": "2024-10-10 07:59:19-05:00",
        "unique_id": "19276a5ba3556272",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]