[
    {
        "company": "Softcom Systems, Inc",
        "job_title": "Java Architect with GCP and Micro service experience",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "GCP Services",
                "Java",
                "Spring Boot",
                "Microservices"
            ],
            "primary": [
                "Data Flow",
                "Kafka"
            ],
            "secondary": [],
            "all": [
                "GCP Services",
                "Java",
                "Spring Boot",
                "Microservices",
                "Data Flow",
                "Kafka"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Ashok",
        "email": "ashok@softcomsystems.com",
        "jd": "Need Locals Only 5 Days Onsite Hi, Hope you are doing good. This is Ashok from Softcom System, We have below urgent requirements. Please find the below JD and share your interest, Role :: Java Architect with GCP and Micro service experience Location: Atlanta, GA - Full Onsite Duration: Long term Must Have Skills GCP Services Java Spring Boot Data Flow Kafka Detailed Job Description Looking for Java Architect with GCP and Micro service experience Provide Solution for migration from legacy application Support the junior team members Coordinate with client, onsite and third party team members Are you ready for Day 1 Onsite (Yes/No): Full Name: Date of Birth (mm/dd/yyyy): Available from (mm/dd/yyyy): SSN (Last 4 digits): Contact Number: Email ID: Current Location: Visa Status: Passport No: Skype ID: LinkedIn: Education(Branch & University): Year of Passed Out: Ready for In-person Interview: Ready for Relocation: Availability for Interview(5 Time slots for Next 3 Business Days): Employer Details: Name: Phone: Email:",
        "source": "Email",
        "date_posted": "2024-10-10 08:24:41-05:00",
        "unique_id": "19276bc19d3e2c38",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]