[
    {
        "company": "Largeton INC",
        "job_title": "Sr. Business Data Analyst",
        "location": "Quincy, MA, USA",
        "full_location": {
            "city": "Quincy",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "2+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Salesforce",
                "Mulesoft",
                "Snowflake",
                "Informatica (IICS)",
                "Tableau",
                "SQL"
            ],
            "primary": [
                "Data analytics",
                "Data profiling",
                "Cloud database platform experience",
                "Business Intelligence tool experience"
            ],
            "secondary": [
                "Healthcare experience",
                "Documentation skills",
                "Presentation skills",
                "AWS cloud services familiarity",
                "Snowflake certification",
                "Tableau reporting experience"
            ],
            "all": [
                "Salesforce",
                "Mulesoft",
                "Snowflake",
                "Informatica (IICS)",
                "Tableau",
                "SQL",
                "Data analytics",
                "Data profiling",
                "Cloud database platform experience",
                "Business Intelligence tool experience",
                "Healthcare experience",
                "Documentation skills",
                "Presentation skills",
                "AWS cloud services familiarity",
                "Snowflake certification",
                "Tableau reporting experience"
            ],
            "with_experience": [
                "Salesforce",
                "Mulesoft",
                "Snowflake (2+ years)",
                "SQL"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Kiran Bhatt",
        "email": "kiran.bhatt@largeton.us",
        "jd": "From: Kiran Bhatt, Largeton INC. kiran.bhatt@largeton.us Reply to: kiran.bhatt@largeton.us Job Short DescriptionUtilizing a combination of Salesforce, Mulesoft, Snowflake, Informatica (IICS), and Tableau, the new local public health data platform will representJob Description Title- Sr. Business Data AnalystClient- Executive Office of Health & Human ServicesLocation- Hybrid- Quincy/Boston, MA - Locals onlyDuration- 6+ MonthsVisa- No H1B/opt/cptONSITE INTERVIEW Local Only from MA, NH or RI and must have recent client experience from these locations.In-Person Interview Client Job Description Utilizing a combination of Salesforce, Mulesoft, Snowflake, Informatica (IICS), and Tableau, the new local public health data platform will represent a major transformation in how information flows between the state and municipal governments. · Plan for, develop, and document in detail the functional, technical and business requirements of solutions for business and technical projects of a wide range of complexity· Write both business and technical documentation that is appropriate to support the development and end user community· Engage and collaborate with internal/external stakeholders to understand their requirements and get their feedback throughout the lifecycle of projects· Follow established PMO standards and procedures· Communicate milestones that define delivery timetables based on capacity and prioritization· Ensure timely delivery of solutions meeting requirements and expectations· Investigate, design, and implement business solutions and major upgrades or enhancements to existing solutions· Assist in complex data analysis and translates business needs into Data solutions· Assist with data training to ensure the end users of the Data Platform and the BI reports fully understand all components.· Cross train peers within subject matter areas and technical expertise areas· Work with Architects, Developers and Analysts to present an overview of requirements to build use cases· Work with technical teams to translate business requirements to technical requirements· Gather and understand user requirements and business activities· Experience in Participating requirements and solution review sessions involving Data platform implementation.· Expertise in leading presentation of requirements analysis to management, technical, analytical and business stakeholders· Contribute to project plans as requested by project managers or director· Assist internal management in establishing project priorities and in allocating service delivery resourcesEnsure timely delivery of solutions meeting requirements and expectations Requirements· Experience in creating, reviewing and maintaining end-to-end data platform requirements.· Strong communication skills comfortable explaining/proposing solutions to technical stakeholders, vendors, and business consumers.· Experience working with highly sensitive health care information and familiar with HIPAA and other data privacy controls.· Thorough knowledge and experience of data warehouse and Enterprise Data solution. Data analytics and data profiling skills· 2+ years of Cloud database platform experience such as Snowflake.· Salesforce Experience· Familiarity with AWS cloud services· Excellent SQL query skills· Working knowledge with at least one Business Intelligence tool such as Tableau Preferred experience/skills:• Healthcare experience• Excellent Documentation and Presentation Skills• Amazon Web Services experience• Snowflake certification• Tableau reporting experienceThanks & RegardsKiran Bhatt|Technical RecruiterEmail:kiran.bhatt@largeton.us | LARGETON INC | 13800 Coppermine Rd, Herndon, VA 20171",
        "source": "Email",
        "date_posted": "2024-10-10 11:55:28-05:00",
        "unique_id": "192777e04958954a",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]