[
    {
        "company": "Smarttechlink",
        "job_title": "Product Manager/ Project Manager (Data Engineering Team)",
        "location": "Seattle, WA, USA",
        "full_location": {
            "city": "Seattle",
            "state": "WA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "experience_required": "5+ years",
            "degree_required": "Bachelor’s degree in computer science, Data Science, Engineering, or a related field; Master's degree preferred.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Data Engineering",
                "Product Management",
                "Project Management",
                "Snowflake"
            ],
            "primary": [
                "Azure Databricks",
                "Agile methodologies",
                "Data governance",
                "Data analytics"
            ],
            "secondary": [
                "Apache Spark",
                "SQL",
                "Python",
                "Machine learning concepts",
                "Certification in Azure"
            ],
            "all": [
                "Data Engineering",
                "Product Management",
                "Project Management",
                "Snowflake",
                "Azure Databricks",
                "Agile methodologies",
                "Data governance",
                "Data analytics",
                "Apache Spark",
                "SQL",
                "Python",
                "Machine learning concepts",
                "Certification in Azure"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Iswarya",
        "email": "iswarya.k@smarttechlink.com",
        "jd": "Hi,We do have a priority requirement with one of our clients. Kindly review and let me know if you have any questions.Product Manager/ Project Manager (Data Engineering Team)Seattle, WA or Frisco, TX Mandatory Skills Data Engineering, Product Management, Project Management, SnowflakeWe are seeking a highly skilled Technical Product Owner/Program manager to lead our Data Engineering and Data Science initiatives for a US based wireless customer.In the role, you will be responsible for managing the product lifecycle for our data platforms, specifically You will work closely with leveraging Azure Databricks and Snowflakecross-functional teams to define product vision, gather requirements, and ensure successful delivery of data solutions that drive business value. You will also be responsible for guiding and mentoring a team of Dota engineers, Data Analysts, Data science resources working on a global delivery model (US and India) following Agile Scrum method of execution. Key ResponsibilitiesProduct Vision and Strategy: o Collaborate with Technical Product Manager in the team to define and communicate the product vision and strategy for data engineering and data science initiatives. o Collaborate with stakeholders to align product goals with business objectives.Requirements Gathering: o Engage with business users to gather and document detailed requirements for data products. o Translate business needs into technical specifications for data engineering and analytics. Backlog Management:Prioritize and manage the product backlog, ensuring alignment with strategic objectives and user needs. o Clearly define acceptance criteria for user stories and ensure quality deliverables.Collaboration and Communication: o Act as the primary liaison between technical teams and business stakeholders, o Facilitate regular communication and updates regarding project status, risks, and opportunities. Technical Oversight: o Collaborate with data engineers and data scientists to oversee the design and implementation of data solutions using Azure Databricks and Snowflake. o Ensure best practices in data governance, security, and compliance are followed.Data Analytics and Insights: o Work with data science teams to develop models and algorithms that deliver actionable insights. o Analyse data to identify trends and opportunities for product improvement. User Training and Support: o Develop user training materials and documentation to support adoption of data products. o Provide ongoing support and address user feedback to enhance product functionality, Team Management: o Act as a single point contact for UST to the customer accountable for the successful execution of the engagement, o Identify and allocate necessary resources, both internal and external, required for project success. o Mentor and guide team members on Agile practices, fostering skill development and Agile maturity. o Manage Production support team ensuring team adheres to the SLA Qualifications:Bachelor’s degree in computer science, Data Science, Engineering, or a related field; Master's degree preferred.. 5+ years of experience in product ownership er product management, with a focus on data engineering and data science,Strong technical background with hands-on experience in Azure Databricks and SnowflakeFamiliarity with data warehousing concepts, ETL processes, and big data technologiesProven experience in Agile methodologies and tools (eat., Scrum, Kanban, IRA)Excellent communication and interpersonal skill, with the ability to influence and engage stakeholders at all levels.Strong analytical and problem-solving abilities, with a data driven mindset. Preferred Skills: Experience with other data technologies and frameworks (eg, Apache Spark, SQL, Python)Knowledge of machine learning concepts and frameworks Certification in Azure or relevant data technologies is a plusThanks & Regards Iswarya | Technical RecruiterIswarya.k@smarttechlink.com | www.smarttechlink.com",
        "source": "Email",
        "date_posted": "2024-10-10 14:09:16-05:00",
        "unique_id": "19277f6a156396ad",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]