[
    {
        "company": "Nukasani Group",
        "job_title": "Senior .NET Developer",
        "location": "Indianapolis, IN, USA",
        "full_location": {
            "city": "Indianapolis",
            "state": "IN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10 years",
            "degree_required": "Bachelor’s Degree in Computer Science or related fields with IT experience",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Best competitive rate"
        },
        "skills": {
            "core": [
                "ASP.NET",
                "C#",
                "MVC"
            ],
            "primary": [
                "Web Services",
                "SDLC",
                "Strong verbal and written communication skills",
                "Ability to solve complex programming issues"
            ],
            "secondary": [
                "Experience in Healthcare Industry"
            ],
            "all": [
                "ASP.NET",
                "C#",
                "MVC",
                "Web Services",
                "SDLC",
                "Strong verbal and written communication skills",
                "Ability to solve complex programming issues",
                "Experience in Healthcare Industry"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Nancy",
        "email": "recruiter5@nukasanigroup.com",
        "jd": "Dear Partner, Good Morning, Greetings from Nukasani Group Inc! We have below urgent long term contract project immediately available for Senior .NET Developer, Indianapolis, IN need submissions you please review the below role, if you are available, could you please send me updated word resume, and below candidate submission format details, immediately. If you are not available, any referrals would be greatly appreciated. Interviews are in progress, urgent response is appreciated. Looking forward for your immediate response and working with you. Candidate Submission Format - needed from you Full Legal Name Personal Cell No ( Not google phone number) Email Id Skype Id Interview Availability Availability to start, if selected Current Location Open to Relocate Work Authorization Total Relevant Experience Education./ Year of graduation University Name, Location Last 4 digits of SSN Country of Birth Contractor Type DOB: mm/dd Home Zip Code Assigned Job Details Job Title : Senior .NET Developer Location: Indianapolis, IN Rate : Best competitive rate Candidates presented must be eligible for full time hire, without requiring sponsorship. Developer is responsible to maintain a number of stabilized .NET applications developed in VB.net, C# with Oracle, and SQL server as databases. Software developer position is to analyze software requirements, designing, developing, testing, and implementing the new Quality Assurance Management Information System (QAMIS) or make enhancements to existing application according to specifications from program team. Essential Duties / Responsibilities: • Use object-oriented techniques and best practices for design, development, unit testing and deployment. • Use Microsoft .NET Framework and a supported MVC framework, C# programming language to development of the applications. • Analyzing, designing, developing, testing, and implementing software programs and application enhancements. • Document all deliverables and perform system unit testing and validation of procedures. • Work with program area team on technical issues including system design and testing. • Analyzing information to recommend and plan the development and implementation of new systems or modifications of an existing system. • Work with Program team members on detailed business requirements, understanding business processes and technology, agency standards, and ensuring project goal alignment. • Write technical specifications based on conceptual design and stated business requirements. • Work with project manager to ensure project plan is maintained and project milestones are being met. • Have ability to work independently and under general supervision with latitude for independent judgment. • Responsible to modify existing applications from time to time due to changes in technology, security, state or federal law changes and national standards.",
        "source": "Email",
        "date_posted": "2024-10-10 08:16:18-05:00",
        "unique_id": "19276d0dd8c11f28",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]