[
    {
        "company": "Yochana IT Solutions",
        "job_title": "Business Analyst",
        "location": "New York, NY, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "8-10 years",
            "degree_required": "Bachelor's degree in business, finance, or a related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Market Risk",
                "Stakeholder Management",
                "Requirements Documentation",
                "Analytical Skills"
            ],
            "primary": [
                "Communication Skills",
                "Problem-Solving",
                "Technical Aptitude",
                "Agile Methodologies"
            ],
            "secondary": [
                "Credit Risk",
                "Treasury Risk",
                "Certified Business Analyst Professional (CBAP)",
                "Certified Data Management Professional (CDMP)",
                "Financial Risk Manager (FRM)"
            ],
            "all": [
                "Business Analysis",
                "Market Risk",
                "Stakeholder Management",
                "Requirements Documentation",
                "Analytical Skills",
                "Communication Skills",
                "Problem-Solving",
                "Technical Aptitude",
                "Agile Methodologies",
                "Credit Risk",
                "Treasury Risk",
                "Certified Business Analyst Professional (CBAP)",
                "Certified Data Management Professional (CDMP)",
                "Financial Risk Manager (FRM)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Madhu",
        "email": "madhu.d@yochana.com",
        "jd": "From: Madhu, Yochana madhu.d@yochana.com Reply to: madhu.d@yochana.com Hi , Hope you doing good!! I’m a Technical Recruiter with Yochana IT Solutions, a national IT staffing solutions provider with 15 plus years of experience delivering value to leading companies across the U.S and Canada. I'm currently staffing for a Business Analyst . Experience Below you will find the job description, if you are qualified and interested please send me your Updated Word Document Resume. My apologies if this position is not an ideal fit, we'll keep you in mind for other suitable positions and referrals would be appreciated. Job Title: Business Analyst Location: New York / New Jersy , Tampa FL (Day 1 onsite)Job Type: Contract Interview process: Telephonic/ Web Ex Key Responsibilities:• Business Requirements Documentation: o Elicit, analyze, and document detailed business requirements for Market Risk technology solutions.o Collaborate with Market Risk stakeholders to understand their needs and objectives.o Translate complex business concepts into clear and concise requirements that can be understood by technology teams.• Subject Matter Expertise: o Develop a deep understanding of specific systems or processes within the Market Risk domain, such as limits management systems or stress testing.o Become an expert in these areas to effectively communicate and translate business requirements.• Risk Knowledge: o Possess a solid understanding of Market Risk concepts and principles.o Knowledge of Credit or Treasury Risk can be a valuable asset.• Stakeholder Management: o Build and maintain strong relationships with stakeholders across the organization.o Facilitate effective communication and collaboration between business and technology teams.• Requirements Analysis: o Analyze business requirements to identify dependencies, conflicts, and potential risks.o Prioritize requirements based on business value and feasibility.• Solution Design: o Collaborate with technology teams to design and develop solutions that meet business requirements.o Ensure that technology solutions align with the overall Market Risk strategy.• Testing and Validation: o Support the development and execution of test cases to validate that technology solutions meet business requirements.o Participate in user acceptance testing (UAT) to ensure the system is fit for purpose.Required Qualifications:• Experience: 8-10 years of experience in business analysis, preferably within the financial services industry.• Knowledge: Strong understanding of Market Risk concepts and principles. Knowledge of Credit or Treasury Risk is beneficial.• Skills: Excellent written and verbal communication skills. Ability to elicit and document requirements effectively. Strong analytical and problem-solving skills.• Education: Bachelor's degree in business, finance, or a related field.Preferred Qualifications:• Experience with market risk management systems and business analysis tools.• Knowledge of Agile methodologies and tools.• Certifications in business analysis (e.g., Certified Business Analyst Professional (CBAP), Certified Data Management Professional (CDMP) ,or Financial Risk Manager (FRM)).Key Competencies:• Analytical Skills: Ability to analyze complex business problems and identify solutions.• Communication Skills: Effective communication and collaboration skills to work with stakeholders at all levels.• Technical Aptitude: Understanding of technology concepts and the ability to learn new systems quickly.• Problem-Solving: Ability to identify and resolve issues efficiently.• Attention to Detail: Meticulous approach to requirements documentation and analysis Thanks & Regards,Madhu,Resource Specialist,Email: Madhu.d@yochana.com / www.yochana.comA : 23000 Commerce Drive, Farmington Hills, MI 48335.Note: This is not an unsolicited mail. If you are not interested in receiving our e-mails then please reply with subject line",
        "source": "Email",
        "date_posted": "2024-10-10 07:37:43-05:00",
        "unique_id": "1927695af8d16445",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]