[
    {
        "company": "Tetrahed",
        "job_title": "Scrum Master",
        "location": "Vienna, VA, USA",
        "full_location": {
            "city": "Vienna",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Significant project management experience",
            "degree_required": "Advanced degree in Information Systems, Computer Science, Engineering, or related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Scrum",
                "Agile",
                "Project Management",
                "Advanced Analytics",
                "Data Integration",
                "Visualization"
            ],
            "primary": [
                "Business Intelligence",
                "Cloud Applications",
                "Software Development",
                "System Administration",
                "Resource Allocation",
                "Coaching"
            ],
            "secondary": [
                "Banking",
                "Finance",
                "Investments",
                "CSM Certification",
                "PMI-ACP Certification",
                "Database Skills",
                "Presentation Software Skills",
                "Research Skills",
                "Analytical Skills",
                "Problem-Solving Skills"
            ],
            "all": [
                "Scrum",
                "Agile",
                "Project Management",
                "Advanced Analytics",
                "Data Integration",
                "Visualization",
                "Business Intelligence",
                "Cloud Applications",
                "Software Development",
                "System Administration",
                "Resource Allocation",
                "Coaching",
                "Banking",
                "Finance",
                "Investments",
                "CSM Certification",
                "PMI-ACP Certification",
                "Database Skills",
                "Presentation Software Skills",
                "Research Skills",
                "Analytical Skills",
                "Problem-Solving Skills"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Parimala",
        "email": "parimala@tetrahed.com",
        "jd": "From: Parimala, Tetrahed parimala@tetrahed.com Reply to: parimala@tetrahed.com HiHope you are doing good Role: Scrum MasterLocation: Vienna or Winchester, VA; Pensacola, FL; or San Diego, CA(Hybrid) Need only LocalsAnd need USC, GC nad EADs This is a different type of scrum master - looking for candidates with expertise in analytics or business intelligence applications or products and significant project management experience. Candidates must have strong fundamentals in advanced analytics, data integration, and visualization. The Scrum Master works closely with the Product Owner to prioritize and lead delivery of the initiative's capabilities by removing impediments, facilitating team meetings and events, and fostering an environment for high performance. The Scrum Master manages a continuous workflow of their team. They advocate, adopt and coach their team on lean, agile and scrum practices. Participate on complex, essential projects working under minimal supervision and with wide latitude for independent judgment. Accountable for completion of assigned deliverables and milestones. Individual contributor and mentor to junior staff. Highly skilled and proficient in discipline, considered senior level position. Responsibilities:·Exhibit behaviors of a Lean-Agile Leader through mindset; helps the team embrace SAFe core values, adopt and apply SAFe principles and implement SAFe practices.·Support the team rules of Scrum, eliminate impediments, and lead the team in efforts for relentless improvement and heightened efficiency.·Ensure technology and service delivery roadmap support the solution strategy and are sustainable to meet the needs of the various solutions being delivered on that product.·Facilitate the team's progress toward team goals; utilizing the current Program Increment (PI) Objectives as Iteration Goals·Ensure that goals, scope and product backlog items are understood and can be fulfilled by team members.·Collaborate with Product Owner, customers and developers to identify and clarify scope of problems/issues in terms of business/systems requirements and processes.·Support the team's efforts to continuously improve communications and relationships with other delivery teams; represent the team in the Scrum of Scrums (SoS), helping the team remain aware of engagement opportunities and program effectiveness.·Engage in challenging the old norms of development to improve performance in the areas of quality, predictability, flow, and velocity.·Support software development teams in applying the Scrum framework. Qualifications ·Functional and technical expertise in at least 1 analytics or business intelligence application or product·Significant project management experience, as well as strong fundamentals in advanced analytics, data integration, and visualization·Working knowledge of Cloud Applications (e.g. Azure, Data Bricks)·Proficient in software development and system administration·Significant experience in resource allocation and management·Significant experience in leading, guiding and coaching professional staff.·Significant experience leading agile development teams and facilitating team meetings in Agile environment.·Advanced knowledge of development or operations framework methodologies, including Agile principles·Desired - In-depth knowledge and experience in Banking/Finance/Investments, familiar with terminology, concepts and business processes and systems·Desired - Familiarity with industry standards and regulations·Desired - CSM and/or PMI-ACP certification·Advanced database and presentation software skills·Advanced research, analytical, and problem-solving skills.·Effective skill in building strategic and execution-focused plans and alliances with partner leadership·Desired - Advanced degree in Information Systems, Computer Science, Engineering, or related field Thanks & Regards, Parimala Technical Recruiterparimala@tetrahed.com",
        "source": "Email",
        "date_posted": "2024-10-10 14:37:50-05:00",
        "unique_id": "19278985661cdb5e",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Scrum Master"
    }
]