[
    {
        "company": "Vyze1 inc",
        "job_title": "Last Mile Delivery Program Manager",
        "location": "Charlotte, NC, USA",
        "full_location": {
            "city": "Charlotte",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "6 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Program Management experience",
                "Last Mile Gig Delivery experience",
                "Analytical skills"
            ],
            "primary": [
                "Agile methodology experience",
                "PMP",
                "DoorDash or Uber program experience"
            ],
            "secondary": [],
            "all": [
                "Program Management experience",
                "Last Mile Gig Delivery experience",
                "Analytical skills",
                "Agile methodology experience",
                "PMP",
                "DoorDash or Uber program experience"
            ],
            "with_experience": [
                "Program Management experience",
                "Last Mile Gig Delivery experience",
                "Analytical skills"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Sam",
        "email": "slenka@vyzeinc.com",
        "jd": "Job Description -Position: Last Mile Delivery Program ManagerClient: CharterLocation: Charlotte, NC• 4x/week onsite, open to showing options that only want on site 1-3 days, preference is Charlotte but we know this skillset is niche.Contract Length: 6 months, potential to convertVisa :H4-EAD , GC-EAD, GC & USC Note : Need best candidate with DL,VISA AND LINKEDIN. kindly submit passport number of candidate.Why is this REQ open? A need to stand up a final mile platform to better serve the company’s customers with 2-hour delivery options vs. having to wait days for a productTop Requirements: 1. Program Management experience2. Last Mile Gig Delivery experiencea. Last Mile Gig Delivery is the term used for delivery in 0-24 hours. Uber and DoorDash are examplesb. Fulfillment experience would be relevant as well – Parcel Delivery (UPS, FedEx), Freight Delivery (Ryder, etc.)3. Analytical skillsa. Ability to take data sets and manipulate themPlusses1. Agile methodology experience2. PMP3. DoorDash or Uber program experienceDay to Day Responsibilities/project specifics: This role is within a supply chain organization that has been tasked with standing up a Last Mile Delivery program. Nor the IT infrastructure or resources exist at this time, so the team is seeking someone with significant program management experience in the fulfillment space (parcel or freight), if not specific to Last Mile Delivery to get this company’s products to the customer within a few hours of ordering. Currently, if stock is not available at a retail store, the customer must wait 2-3 days for traditional parcel delivery rather than having same day options. This role will include oversight on the IT and operations side, though it will sit within the operations team. This candidate should be able to help start the program while working with internal IT teams to relay requirements to expand functionality of applications/platforms that may be needed to set up this capability. From there, the role will involve monitoring performance as well as other data including compliance and on time delivery Required Skills1. Program Management experience 2. Last Mile Gig Delivery experience a. Last Mile Gig Delivery is the term used for delivery in 0-24 hours. Uber and DoorDash are examples b. Fulfillment experience would be relevant as well – Parcel Delivery (UPS, FedEx), Freight Delivery (Ryder, etc.) 3. Analytical skills a. Ability to take data sets and manipulate them Plusses 1. Agile methodology experience 2. PMP 3. DoorDash or Uber program experience",
        "source": "Email",
        "date_posted": "2024-10-10 10:48:31-05:00",
        "unique_id": "19277455f649b62a",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]