[
    {
        "company": "LARGETON INC.",
        "job_title": "Jr. Business Analyst",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Bachelor’s degree required.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Excel",
                "analytical thinking",
                "problem-solving",
                "communication skills",
                "attention to detail"
            ],
            "primary": [
                "Model N",
                "SAP iShift",
                "Contracting",
                "Membership",
                "Pricing"
            ],
            "secondary": [
                "change and growth mindset",
                "independence",
                "adaptability",
                "data compliance",
                "collaboration"
            ],
            "all": [
                "Excel",
                "analytical thinking",
                "problem-solving",
                "communication skills",
                "attention to detail",
                "Model N",
                "SAP iShift",
                "Contracting",
                "Membership",
                "Pricing",
                "change and growth mindset",
                "independence",
                "adaptability",
                "data compliance",
                "collaboration"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Manisha Gupta",
        "email": "manisha@largeton.us",
        "jd": "From: manisha, Largeton manisha@largeton.us Reply to: manisha@largeton.us Hello!Hope you are doing well.I would like to share job description with you. Please review and help us to find suitable candidate. Jr. Business Analyst LOCATION: 100% REMOTEDescription:Title: Contract Membership Specialist (CMS)Qualifications:• Bachelor’s degree required.• Model N and SAP iShift experience preferred.• Experience in Contracting, Membership or Pricing preferred.• Change and growth mindset with high degree of independence and adaptability to changing environments.• Critical thinking and problem-solving mindset.• Strong analytical thinking, Excel, and implementation skills.• Excellent written/oral communication skills. Ability to communicate effectively and professionally.• High level of attention to detail and accuracy.• Utilize Model N Revenue Manager to Maintain the Membership Life Cycle of Large Organized Customers (LOC). This includes contract membership activities surrounding new eligibility and continued maintenance such as movement, additions, and deletions.• Works independently with Revenue Manager platform to create and manage membership affiliations and eligibility status for both direct and indirect customers.• Processes Master Data requests within SAP iShift according to business rules for Vaccines accounts.• Resolve membership affiliation and inquiries from account management teams.• Monitor Revenue Manager platform and boundary systems to confirm data accuracy.• Responsibility for managing daily business tasks and processes with internal/external key stakeholders.• Access and process data within reporting tools, including Revenue Manager, MicroStrategy, and boundary systems.• Communicate and resolve membership discrepancies with internal and external customers; resolve inquires, maintain synchronization and integrity of membership.• Create, maintain, and support a collaborative environment with external customers and internal business partners.• Responsible and accountable for data compliance activities within membership and the oversight and execution of applicable processes and business decisions to achieve compliance.• Ensure accurate and up-to-date membership files are retained according to audit/compliance requirements.• Support and collaborate with Sanofi Account Management team regarding contracting and membership processes.• Proactively collaborate with internal teams and external customers to harmonize membership processes, resolve issues, and address business challenges.• Comply with SOX and Government Pricing P&Ps.• Support and follow all SOP documentation guidelines, compliance, and auditing processes. Thanks, and RegardsManisha GuptaLARGETON INC. 13800 Coppermine Rd,Herndon, VA 20171 Disclaimer: Largeton is an equal opportunity employer. There is no discrimination based on race, color, religion, sex, national origin, age, disability, or any other protected status.",
        "source": "Email",
        "date_posted": "2024-10-10 08:51:30-05:00",
        "unique_id": "19276dc789faf7e6",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]