[
    {
        "company": "Maintec Technologies Inc",
        "job_title": "Technical BA-UI Modernization",
        "location": "Des Moines, IA, USA",
        "full_location": {
            "city": "Des Moines",
            "state": "IA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "8 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Technical Business Analyst",
                "data migration",
                "requirements gathering",
                "data validation",
                "communication skills"
            ],
            "primary": [
                "data flow diagrams",
                "system architecture mapping",
                "business process flow documentation",
                "software development lifecycle",
                "testing systems",
                "MS Office",
                "MS Project",
                "MS Visio",
                "Jira",
                "SQL"
            ],
            "secondary": [
                "facilitating meetings",
                "vendor management",
                "milestone sign off"
            ],
            "all": [
                "Technical Business Analyst",
                "data migration",
                "requirements gathering",
                "data validation",
                "communication skills",
                "data flow diagrams",
                "system architecture mapping",
                "business process flow documentation",
                "software development lifecycle",
                "testing systems",
                "MS Office",
                "MS Project",
                "MS Visio",
                "Jira",
                "SQL",
                "facilitating meetings",
                "vendor management",
                "milestone sign off"
            ],
            "with_experience": [
                "data migration",
                "SQL"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Reetti Mendratta",
        "email": "reeti@maintec.com",
        "jd": "Hello, Greetings for the day,We are hiring for Technicl BA- UI Modernization please share local and Independent Visa from Des Moines IA. Title: Technical BA-UI ModernizationLocation: Des Moines IA 50319Duration: 8 Months This position requires that someone is available to work onsite 2 days per week, so the priority will be given to local resources. Job Description:Technical Business Analyst skilled at consulting with business stakeholders and technical resources to define requirements and validate conversion for a large-scale data migration effort for Unemployment Insurance Modernization. We are seeking a Business Analyst with data migration experience to analyze and triage data migration testing results. The testing phase is complete, and all scripts for the data migration have been written. The original data mapping and requirements have also been finalized. We need a Business Analyst who can review the script results, identify discrepancies, and determine necessary changes to the data mapping requirements. This role involves working closely with both the business side to refine requirements and the technical team managing the data warehouse. While prior testing experience is not required, as the scripts are already in place, the ideal candidate should be able to understand why discrepancies exist and revise the requirements accordingly. Complete Description: an immediate need for a Technical Business Analyst skilled at consulting with business stakeholders and technical resources to define requirements and validate conversion for a large-scale data migration effort for Unemployment Insurance Modernization. Specifically, this role will be dedicated to gathering necessary documentation, participating in technical requirement discussions, and performing validations. This individual will participate in testing and group sessions to define and validate requirements, identify gaps and analyze process needs.This individual will participate in vendor-hosted data conversion sessions, articulating and/or documenting needs clearly and accurately to vendor teams.This individual will perform data validation for a large-scale data migration effort, as legacy data is migrated to a modernized system, working in partnership with IWD IT resources and vendor project team to prepare test cases as necessary, document test results and articulate needs.Iowa Workforce Development is a state agency with a remarkable amount of modernization taking place. These projects will transform agency business operations, eliminate technical debt, improve user experience and return significant cost savings. The UI Benefit Modernization will move a 40-year-old legacy mainframe system to a contemporary web-based solution. The new system will be a modified/configurable off-the-shelf product, developed and hosted by a third-party vendor. This position will work closely with the UI Benefits Modernization project manager and data conversion workstream lead, as well as IWD technical resource and UI SMEs, while interacting daily with the vendor's project management and business analyst teams.",
        "source": "Email",
        "date_posted": "2024-10-10 09:24:39-05:00",
        "unique_id": "1927702dd572c6b9",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]