[
    {
        "company": "State of New Jersey - NJATCSU",
        "job_title": "Business Analyst",
        "location": "Trenton, NJ, USA",
        "full_location": {
            "city": "Trenton",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "contract",
                "third party"
            ],
            "job_code": "747913",
            "experience_required": "5 years",
            "degree_required": "4-year college degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "1+ Years (Multiple Year Contract)",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Excellent communication and customer service skills",
                "Experience with developing systems via a structured SDLC methodology",
                "Experience with testing, training and user support",
                "Ability to analyze and document complex business processes and work flows",
                "Ability to gather data via diverse means",
                "Ability to document storyboards, wireframes, system flows, interfaces, use cases, and business rules"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Excellent communication and customer service skills",
                "Experience with developing systems via a structured SDLC methodology",
                "Experience with testing, training and user support",
                "Ability to analyze and document complex business processes and work flows",
                "Ability to gather data via diverse means",
                "Ability to document storyboards, wireframes, system flows, interfaces, use cases, and business rules"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Krishna",
        "email": "krishna@os-inc.com",
        "jd": "From: Krishna, Orchid Solutions Inc krishna@os-inc.com Reply to: krishna@os-inc.com Please find the direct client opening below and kindly let me know if you have any suitable consultants. The client is only looking for local candidates in New Jersey (Trenton, NJ) Business Analyst Client: State of New Jersey - NJATCSU Job ID: 747913 Location: Trenton, NJ Duration: 1+ Years (Multiple Year Contract) Mode of Interview: Web Cam Note: Work will be on-site 2 days per week, and, remote 3 days per week. No exceptions. Please provide Local candidates. Job Description Full-time professional information technology project development work experience and/or function/business process analysis work experience. Develop workflows, requirements, QC testing and production support for projects. Excellent Verbal and Written Communication skills Required. This position will require the BA to work in an agile environment with other teams and IT developers to lay out and design the portal structure for the Judiciary Enterprise Portal system, the Enterprise Single Sign On system, and any other enterprise feature that would require users to interact with any system or feature within the Enterprise Portal. The BA will be required to: - Write User Stories/Requirements - Track User Stories/Requirements - Create User Interface Mockups - Test - Support production issues Skills Required: - Excellent communication and customer service skills - Experience with developing systems via a structured SDLC methodology - Experience with testing, training and user support - Ability to analyze and document complex business processes and work flows, and propose areas for improvement - Ability to gather data via diverse means (i.e. interviews, observation, surveys, existing written documentation) and interpret relevant information - Ability to document storyboards, wireframes, system flows, interfaces, use cases, and business rules. Skill Required / Desired Amount Actual years used Last Years used Experience as a BA Required 5 Experience with developing systems via a structured SDLC methodology Required 5 Experience with testing, training and user support Required 5 Ability to analyze and document complex business processes and work flows, and propose areas for improvement Required 5 Ability to gather data via diverse means (i.e. interviews, observation, surveys, existing written documentation) and interpret relevant information Required 5 Ability to document storyboards, screen mockups, wireframes, system flows, interfaces, use cases, and business rules. Required 5 Customer service experience Required 5 5 years of relevant experience; 5 plus years in particular application area Required 5 4-year college degree Required 4",
        "source": "Email",
        "date_posted": "2024-10-10 10:03:27-05:00",
        "unique_id": "19279877995ba873",
        "emp_type": [
            "full-time",
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]