[
    {
        "company": "SSPEARHEAD INC",
        "job_title": ".Net Developer",
        "location": "Albany, NY, USA",
        "full_location": {
            "city": "Albany",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "HBITS-06-13624",
            "experience_required": "84 months",
            "degree_required": "Bachelor's Degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "09 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".Net 3.5 or above",
                "MVC pattern",
                "Web Services",
                "Windows Communication Foundation (WCF)",
                "XML",
                "PL/SQL",
                "Oracle databases",
                "SSRS",
                "Cognos",
                "SQL",
                "Azure DevOps"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                ".Net 3.5 or above",
                "MVC pattern",
                "Web Services",
                "Windows Communication Foundation (WCF)",
                "XML",
                "PL/SQL",
                "Oracle databases",
                "SSRS",
                "Cognos",
                "SQL",
                "Azure DevOps"
            ],
            "with_experience": [
                ".Net 3.5 or above",
                "MVC pattern",
                "Web Services",
                "Windows Communication Foundation (WCF)",
                "XML",
                "PL/SQL",
                "Oracle databases",
                "SSRS",
                "Cognos",
                "SQL",
                "Azure DevOps"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Yogesh Dahiya",
        "email": "yogeshd@sspearhead.com",
        "jd": "From: Yogesh Dahiya, SSPEARHEAD INC yogeshd@sspearhead.com Reply to: yogeshd@sspearhead.com Hi, Hope you are doing good. Please have a look on below position and let me know if you are interested? Required Documentation: Make sure you if you are fine with this job then please share the below details at the time submission time.If you are not going to provide these details then please don’t apply for this job.1: Passport mandatory for these visa’s ( EAD, GC and H1B)2: Visa stamping copy required for H1 B3: Must be provide 3 references with full name, email id, client name and phone number.4: Bachelor degree copy must be submitted Job Description:Job Id: HBITS-06-13624Role: .Net Developer Client: NYS ITS Duration: 09 monthsLocation: Albany, NY ( Hybrid)There is only 1 round interview direct client.Qualifications NYePay is a multi-component system that replaces the process & cost of printing physical checks and mailing them to recipients. NYePay currently provides the ability to submit electronic payments for local districts to adoption subsidy recipients. Current contract with our banking partner, Key Bank, expired in March 2023 and new contract is in progress with 2 new banking partners. This change will require significant modification and testing in NYePay to establish the debit card enrollment and ACH payment transfers with the new bank. OCFS intends to expand the cost savings of NYePay by extending its capabilities to Child Care benefits issuances as part of new legislation mandating a direct deposit option for Child Care subsidies. In addition, NYePay will be expanded to include New York City as a participating district for adoption payments. These changes will require many modifications to NYePay.Qualifications Systems Developer- Develops and implements applications and programs for the backend processing systems used in businesses and organizations. Expert- 84+ months: Candidate is able to provide guidance to large teams and/or has extensive industry experience and is considered at the top of his/her field. 84 months experience developing n-tiered applications utilizing .Net 3.5 or above using MVC pattern. 84 months experience writing and developing Web Services or Windows Communication Foundation (WCF). 84 months experience with XML Type PL/SQL writing packages, stored procedures and triggers in Oracle databases. 72 months experience in design and developing application reports using reporting tools such as SSRS or Cognos. 72 months experience design & deployment of complex SQL objects and relational databases design 48 months experience doing CI/CD using tools like Azure DevOps performing tasks such as automated builds, writing build & release pipelines and creating work items. Bachelor’s Degree Day-to-Day tasksAnalysis, gathering new requirements and .NET development Provide ad-hoc reporting Maintain and Develop Oracle PL/SQL programming Unit testing for new developmen E-mail is the best way to reach me, if I don’t pick your call. Thanks & RegardsYogesh DahiyaSspearhead Inc",
        "source": "Email",
        "date_posted": "2024-10-10 11:57:26-05:00",
        "unique_id": "19277a88c61fcf57",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]