[
    {
        "company": "Allied Business Consulting",
        "job_title": "On-Site Senior Quality Assurance/Business Analyst (J2EE/Java/ORACLE/SQL SERVER/Manual/Automated Testing)",
        "location": "Tallahassee, FL, USA",
        "full_location": {
            "city": "Tallahassee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "11-12+ years",
            "degree_required": "Bachelor’s Degree in Computer Science, Information Systems, Business Administration, or other related field or equivalent work experience.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "$XX/hr (All Inclusive)"
        },
        "skills": {
            "core": [
                "Senior Quality Assurance/Business Analyst",
                "Test plans/Cases/Scripts/strategies",
                "Manual/Automated/System/Integration/Regression/Functional/Performance/User Acceptance/Stress/Security/Quality Control Testing",
                "defect logging and tracking",
                "Java/J2EE",
                "Oracle",
                "MS SQL Server 2019",
                "PL-SQL"
            ],
            "primary": [
                "performance and load testing metrices",
                "automation scripts for testing",
                "Section 508/ADA compliance",
                "web applications",
                "JAD Sessions",
                "Req Gathering",
                "define business requirements",
                "functional design documents",
                "Requirement Traceability Matrix",
                "use cases",
                "Functional specifications",
                "document business processes",
                "workflows",
                "system requirements",
                "facilitation of meeting",
                "HTML",
                "CSS",
                "JavaScript",
                "Angular",
                "UI libraries",
                "Git",
                "CVS",
                "Jira",
                "Unix-basic scripting",
                "Agile",
                "MS Office/Visio",
                "Waterfall and Agile/Scrum methodologies"
            ],
            "secondary": [
                "LoadRunner",
                "Selenium",
                "JUnit",
                "documentation",
                "Government experience",
                "Criminal Justice Application experience"
            ],
            "all": [
                "Senior Quality Assurance/Business Analyst",
                "Test plans/Cases/Scripts/strategies",
                "Manual/Automated/System/Integration/Regression/Functional/Performance/User Acceptance/Stress/Security/Quality Control Testing",
                "defect logging and tracking",
                "performance and load testing metrices",
                "automation scripts for testing",
                "Section 508/ADA compliance",
                "web applications",
                "JAD Sessions",
                "Req Gathering",
                "define business requirements",
                "functional design documents",
                "Requirement Traceability Matrix",
                "use cases",
                "Functional specifications",
                "document business processes",
                "workflows",
                "system requirements",
                "facilitation of meeting",
                "Java/J2EE",
                "Webpages built using HTML, CSS, and JS/TS",
                "Webservice",
                "REST services built using Java Spring Boot",
                "JBoss application servers",
                "Alfresco ECM",
                "LoadRunner",
                "Selenium",
                "JUnit",
                "Oracle",
                "MS SQL Server 2019",
                "PL-SQL",
                "stored procedures",
                "triggers",
                "views",
                "JavaScript",
                "Angular",
                "UI libraries",
                "Git",
                "CVS",
                "Jira",
                "Unix-basic scripting",
                "Agile",
                "MS Office/Visio",
                "Waterfall and Agile/Scrum methodologies",
                "Documentation",
                "Govt experience",
                "Criminal Justice Application experience"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Alka",
        "email": "alka@abcinc-us.com",
        "jd": "From: alka, Allied Business Consulting alka@abcinc-us.com Reply to: alka@abcinc-us.com On-Site Senior Quality Assurance/Business Analyst (J2EE/Java/ORACLE/SQL SERVER/Manual/Automated Testing) - Tallahassee, FLPosition is with Dept of Law Enforcement so it will be plus to have Criminal Justice Application exp + Govt exp. Make sure that we have about 3 + Top candidates for the positions who can provide 3 ref. We are seeking candidates with 11-12+ years of experience. Start will be Jan/Feb 2025 due to the extensive background check (including finger printing, credit check and drug screen) so ideally we need candidates who already have a project NOT someone on bench. We would need the Resume, Matrix, signed certification form (Exhibit E), on-site form and Ref for each candidate submitted. DO NOT send the signed certification to any consultant unless you have a signed Rate Agreement with them.This closes by Monday (10/21/24).!!!!! Need copy of Degree and any relevant Certifications !!!!! Basically need a Senior Quality Assurance/Business Analyst who has worked in the JAVA/oracle/SQL Server environment. 75% QAA and 25% SBA Official ID : FDLE HQ ITS RMM RFQ SOW 24-25-054 Quality Assurance Analyst for MEPIC Technology Upgrade Request #: PR616298-R116932 – Use this for R-T-R Telecommuting: Telecommuting is not an option for this position. This is NOT a remote position.In order to submit we need A) complete skill Matrix B) complete ref sheet. Ref from 3 different projects are needed with All the fields filled out. C) An up to date resume and Cover letter (why you should be the selected candidate) in word format only. Please make sure all the skills listed in the skill matrix and the JD are reflected in your resume (only if you have the experience). See if you need to change anything in the attached resumeD) Manual signed Resume certification form with Blue ink including the witness signature. GIS will be able to provide the 2 witness signature. DL copy or passport copy is needed as form of identification to witness the persons signature. Please leave the date blank so we DO NOT have you bother you with this STEP for any future positions.E) Manual signed “on-site Acknowledgement” form with Blue/Black ink by the consultant providing the services. Only place the signature; the Top info box will be filled by GIS, Inc. F) Rate as agreed - $XX/hr (All Inclusive) C-2-C with once a month billing terms NET 30. Please confirmG) No Double submission to the state of Florida. Please confirm This is in ref to the position listed below Position ID: 429001-MEPIC Title: On-Site Senior Quality Assurance/Business Analyst (J2EE/Java/ORACLE/SQL SERVER/Manual/Automated Testing)Location: Tallahassee, FLPay rate: DOELength: Long TermTravel required: noneTelecommute: No Skills: \"Senior Quality Assurance/Business Analyst\"; Test plans/Cases/Scripts/strategies; Manual/Automated/System/Integration/Regression/Functional/Performance/User Acceptance/Stress/Security/Quality Control Testing; defect logging and tracking; performance and load testing metrices; automation scripts for testing; Section 508/ADA compliance; web applications; JAD Sessions; Req Gathering; define business requirements; functional design documents; Requirement Traceability Matrix; use cases, Functional specifications; document business processes, workflows, system requirements; facilitation of meeting; Java/J2EE; Webpages built using HTML, CSS, and JS/TS; Webservice; REST services built using Java Spring Boot; JBoss application servers; Alfresco ECM; LoadRunner; Selenium, JUnit; Oracle; MS SQL Server 2019, PL-SQL; stored procedures, triggers, views; JavaScript; Angular; UI libraries; Git, CVS, Jira; Unix-basic scripting; Agile; MS Office/Visio; Waterfall and Agile/Scrum methodologies; Documentation; Govt Description: Please DO NOT Apply unless YOU: 1) Can work 100% on-site from day one & have all the Required skill set and have worked as a \"On-Site Senior Quality Assurance/Business Analyst (J2EE/Java/ORACLE/SQL SERVER/Manual/Automated Testing)\" in a large & Complex IT Environment. 2) can meet the min required experience as defined under the MANDATORY Skill. 3) can provide at least 3 verifiable experience from completed and/or substantially completed jobs that closely match this request + fill out a skill Matrix4) Can go through a Full background investigations (including finger printing, credit check and drug screen) by the client once selected. You would also need to fill out some pages of paperwork from the client to start the background check process which typically takes 4+ weeks. Your Status WILL ALSO BE VERIFIED USING E-VERIFY SYSTEM.5) have a Competitive Rate6) Can come for a Mandatory F-2-F interview at your own cost once position is confirmed and the background check has been initiated7) Can sign a certification form verifying All the experience in your resume9) will be available in Jan/Feb 2025 timeframe as the background check after a successful interview takes a minimum of 4+ weeks.Each staff member assigned to this project must have a background screening that is equivalent to a Level Two (2) screening standard. This is a fixed fee/hourly based project which is inclusive of travel, lodging, per diem expenses and all other costs associated with the completion of the associated tasks. Interviews:In the event an interview is requested, in-person interviews will be conducted at Tallahassee, Florida. At the discretion of the manager, interviews may be conducted remotely via Microsoft Teams. A phone interview may also be requested. Telecommuting:Telecommuting is not an option for this position. This is NOT a remote position. BackgroundThe mission of the Client is to “promote public safety and strengthen domestic security by providing services in partnership with local, state, and federal criminal justice agencies to prevent, investigate, and solve crime while protecting Florida’s citizens and visitors.” In 1982, the Florida Legislature appropriated funds for the establishment of the first state Missing Endangered Persons Information Clearinghouse (MEPIC) in the nation. The current system has added functionality over the years as required by legislation and to assist the Client members who use the system to issue alerts and streamline processes for faster communication about a missing person.The MEPIC system needs to be replaced with a database re-design and programming in newer technology with web screens that adhere to the current business needs rather than being constrained by the foundation of a 1983 system design. Newer technology in a re-designed MEPIC system can better assist in the recovery of missing persons. Description of Major Duties & Deliverables The Quality Assurance Analyst will work under the direction of Client’s assigned Project Manager and in conjunction with the project’s current Business Analyst to achieve the goals and objectives of the MEPIC Technology Upgrade Project as defined and funded by a Legislative Budget Request (LBR). This person is expected to perform the tasks and specific assignments given by the assigned Client Project Manager. The Client Project Manager reports to the Client Supervisor. They will be responsible for understanding the MEPIC business processes and requirements captured. This highly professional position on the team will be the sole person responsible for managing and ensuring quality software development results of the new MEPIC system, under the leadership of the assigned Client Project Manager. This is an excellent opportunity for someone who thrives in a dynamic environment and has a passion for both business analysis and testing.Quality Assurance Analyst responsibilities include, but may not be limited to the following:1. Business Analysis: a. Collaborate with project stakeholders and development team to define business requirements and translate them into functional design documents, as needed.b. Create and manage the Requirement Traceability Matrix (RTM).c. Create and maintain use cases, and functional specifications.d. Work closely with the development team to ensure that business requirements are correctly understood and implemented.e. Analyze and document business processes, workflows, and system requirements, as needed.2. Testing (Manual and Automation):a. Conduct manual testing of applications without reliance on testing tools, using methodical approaches.b. Develop, document, and execute comprehensive test plans and test cases based on project requirements and functional design documents.c. Perform different types of testing, including functional, regression, integration, and smoke.d. Identify and report bugs, track them to resolution, and work with the development team to resolve issues.e. Knowledge of automating testing by writing scripts and using programming languages or automation frameworks.f. Develop and maintain User Acceptance Testing (UAT) scenario test cases, automated test suites where applicable, ensuring consistency and usability among all.g. Performing test case scenarios for the upgraded and enhanced system following the Client methodology of development testing, System testing, and User Acceptance Testing.h. Assist in user acceptance testing, as3. Test Strategy & Planning: a. Create and execute testing strategies that align with business goals and ensure high-quality product delivery.b. Design and implement test procedures for various types of testing, including system, integration, performance testing, stress testing, and security testing.c. Provide detailed documentation on test results, including defect logging and tracking.d. Ensure that all testing is well-documented, traceable, and aligned with the overall project plan.e. Interpreting traceability matrices to map business requirements to test cases.f. Creating performance and load testing metrices and provide statistical analysis of results. g. Contribute to activity definition, activity sequencing, activity resource estimating, activity duration estimating, WBS development to facilitate quality control testing of the application.h. Contribute to risk identification, tracking, analysis related to quality control testing.i. Contribute to issue management and tracking related to quality control testing. 4. Collaboration & Communication: a. Liaise with development teams and stakeholders to ensure proper implementation of functional requirements.b. Communicate progress, challenges, and results of the testing process to the project team and a weekly status report to the project manager.c. Participate in project meetings to provide insights from both a business analysis and testing perspective.d. Responsible for assisting with the coordination of project deliverables associated with quality control testing.e. Identify and document metrics for success in quality control testing.f. Effective communication among project stakeholders related to quality control testing.g. Coordinate activities with Client staff required to support the project for testing.h. Assist with the production implementation as needed. Mandatory Knowledge, Skills, and Abilities:• Bachelor’s Degree in Computer Science, Information Systems, Business Administration, or other related field or equivalent work experience.• Min of 11-12+ Years of Experience in IT• Minimum of Ten (10) years of experience in gathering and documenting business requirements (functional and non-functional) on full life cycle development projects.• Minimum of Five (5) years of experience as a quality assurance analyst or lead tester performing the work.• Minimum of Five (5) years of experience creating comprehensive Test Plans and use of automated testing tools.• Experience and knowledgeable of software testing methods and best practices.• Experience in creating and maintaining test plans, test cases, and performance testing.• Experience in testing integration of multiple systems or applications.• Experience in facilitation of meeting(s) to walk-thru test case/scenario documentation.• Experience in functional, regression, integration, and user acceptance testing.• Experience creating test strategies, detailed use cases, test plans, test cases, and performance testing.• Experience in testing to adhere to Section 508/ADA compliance in web applications.• Experience and technical knowledge in testing the J2EE/JAVA, JBOSS application server, MS SQL and ORACLE database environments.• Experience and technical knowledge in testing web applications developed in Angular and other UI libraries.• Experience with various testing tools and techniques. • Experience querying data in tables to verify data insert/update/delete to tables, to produce quality testing results.• Strong attention to detail, quality minded with results oriented.• Strong analytical skills.• Excellent communication skills (oral and written).• Excellent analysis skills and successful discovery of system defects and issues.• Excellent problem-solving skills.• Excellent collaboration skills.• Knowledgeable of software development methodologies and processes.• Knowledgeable of Waterfall and Agile/Scrum methodologies.• Skill to perform analysis and troubleshooting of system defects and issues.• Skill to use defined procedures to configure, test and debug software.• Ability to perform technical research of technologies and methods for testing the functional and nonfunctional requirements.• Ability to work independently or cooperatively with team members.• Ability to design quality control and test procedures.• Ability to apply technical expertise to test system solutions.• Ability to work with minimal supervision.• Ability to manage and perform the testing portion of the project, including services/products/technology solution evaluations/modifications, data development, analysis, first draft written communications, and client interaction.• Accountable to the Client assigned Project Manager for the project.• Ability to test the project components in the agreed schedule, to the correct technical specification (i.e., defined to meet user requirements) within the approved budget and other specified criteria.• Ability to automate testing processes, including writing test scripts using tools like Selenium, JUnit, or similar.• Ability to test in the following environments:o Java 21o REST services built using Java Spring Booto Angularo Webpages built using HTML, CSS, and JS/TS.o MS SQL Servero Stored procedures, triggers, views, etc.o JBOSS 5.0 and highero LoadRunner Preferred Knowledge, Skills, and Abilities:• Master's Degree in Computer Science, Information Systems, Business Administration or other related field or equivalent work experience.• Experience with creating automation scripts for testing. • Government, Law Enforcement, or Public Safety IT projects• Certification in different Quality Control test methods.• Proficient with the following products.o Microsoft Visioo Jirao Loadrunnero Alfresco ECMo SQLo Java Spring Booto Angularo HTML, CSS, and JS/TSThe QAA will report to the designated Client supervisor. The QAA is expected to perform the tasks and specific assignments given by the Client supervisor.Note : These are Full Time ON-SITE Contract Position with NO remote options allowed.**When responding please do tell us your All--inclusive compensation requirements ***. POSITION STARTS : Jan/Feb 2025# of Positions : 1",
        "source": "Email",
        "date_posted": "2024-10-10 09:10:01-05:00",
        "unique_id": "1927711be6a5f15d",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]