[
    {
        "company": "O2finc",
        "job_title": "Project / Program Manager (Child welfare application)",
        "location": "Durham, NC, USA",
        "full_location": {
            "city": "Durham",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Leadership",
                "Negotiation",
                "Time Management",
                "Organizational Skills"
            ],
            "primary": [
                "Communication",
                "Presentation Skills",
                "Resource Management",
                "Risk Management",
                "Budget Management"
            ],
            "secondary": [
                "Agile (PMI-ACP) Certification",
                "PgMP Certification",
                "Application Modernization",
                "Collaboration with State and Local Government",
                "Knowledge of Social Services and Medicaid Programs"
            ],
            "all": [
                "Project Management",
                "Leadership",
                "Negotiation",
                "Time Management",
                "Organizational Skills",
                "Communication",
                "Presentation Skills",
                "Resource Management",
                "Risk Management",
                "Budget Management",
                "Agile (PMI-ACP) Certification",
                "PgMP Certification",
                "Application Modernization",
                "Collaboration with State and Local Government",
                "Knowledge of Social Services and Medicaid Programs"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Ayesha",
        "email": "ayesha@o2finc.com",
        "jd": "From: Ayesha, O2finc ayesha@o2finc.com Reply to: ayesha@o2finc.com Job Title: Project / Program Manager (Child welfare application)Duration: 12 MonthsLocation: Durham, NC.Onsite from Day 1 Description:The client is seeking an experienced Project Manager. This management role will work with multiple internal and external stakeholders, project teams, divisions, departments, and vendors to strategize, implement, and maintain the various modernization initiative for social services and Medicaid programs. This position will interact with all levels of staff including executive staff. Responsibilities include but are not limited to:Review project proposals or plans to determine a time frame, funding limitations, procedures for accomplishing projects, staffing requirements and the assignment of available departmental resources to various project phases.Identify and schedule project deliverables, milestones, and required activities and tasks.Provide leadership and motivation to project team members throughout the project life cycle and confer with project staff to outline a work plan.Establish a work plan and staffing for project activities, iterations, or phases, and arrange for recruitment or assignment of project personnel.Ensure that project goals are in line with business objectives.Ensure that project goals are achieved.Assign duties and responsibilities to project personnel and define the scope of their authority.Direct and coordinate the activities of project personnel to ensure projects progress on schedule and within budget.Review status reports prepared by project personnel and modify schedules or plans as required.Work with business and cross-functional teams to develop Business Case and Cost Benefit analysis for prioritized initiatives within the program.Manage multiple Vendor onboarding and identify key requirements needed from cross-functional teams and Vendors.Work with other program managers to identify risks and opportunities across multiple projects within the department.Manage budget across various workstreams and funding channels for maximum productivity.Manage resource allocations and expectations for program.Collaborate with the DIT to ensure program compliance with the State IT Roadmap and all State Privacy and security requirements. Skills:The selected candidate must be a results-oriented individual with a strong work ethic and must be able to demonstrate excellent leadership, negotiation, time management, facilitation, and organizational skills.Experience in communicating in a fashion tailored to the audience and their needs.Excellent written communication and presentation skillsDemonstrates experience in working effectively with all levels of staff, clients, and other IT personnel.Experience in the responsibility for acquiring and utilizing the necessary resources and skills, within agreed parameters of cost, timeframes, and quality for a program.Ability to identify and plan systematic corrective action to reduce errors and improve the quality of the systems and services, by examination of the root causes of problems.Ability to build, influence, lead and motivate effective teams towards end results. Management prefers applicants with the following:Candidate with PgMP CertificationCandidate with Agile (PMI-ACP) CertificationExperience managing or supervising programs involving Application modernization and modularization projects.Experience collaborating with State and Local GovernmentExperience in complex, cross-functional team environmentsKnowledge of social services and Medicaid programs or similarly complex case management systems.",
        "source": "Email",
        "date_posted": "2024-10-10 16:08:17-05:00",
        "unique_id": "19278c14adc58042",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]