[
    {
        "company": "Vyze",
        "job_title": "Sr. Project Manager",
        "location": "Columbus, OH, USA",
        "full_location": {
            "city": "Columbus",
            "state": "OH",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Bachelor’s or Master’s degree in computer science, information systems, or related field is preferred; or equivalent work experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "IT program/project management",
                "Kronos",
                "UltiPro",
                "Organizational Change Management",
                "Budget / Financial Management"
            ],
            "primary": [
                "SaaS Experience",
                "Waterfall",
                "Iterative",
                "project methodologies",
                "communication skills",
                "problem-solving",
                "negotiation",
                "decision-making"
            ],
            "secondary": [
                "Planisware",
                "Excel",
                "PowerPoint",
                "Project Management Professional Certification – PMP",
                "CSM",
                "PROSCI certification"
            ],
            "all": [
                "IT program/project management",
                "Kronos",
                "UltiPro",
                "Organizational Change Management",
                "Budget / Financial Management",
                "SaaS Experience",
                "Waterfall",
                "Iterative",
                "project methodologies",
                "communication skills",
                "problem-solving",
                "negotiation",
                "decision-making",
                "Planisware",
                "Excel",
                "PowerPoint",
                "Project Management Professional Certification – PMP",
                "CSM",
                "PROSCI certification"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Abhiram Rout",
        "email": "arout@vyzeinc.com",
        "jd": "From: Abhiram Rout, Vyze arout@vyzeinc.com Reply to: arout@vyzeinc.com Job Title: Sr. Project ManagerLocation: Local to OH, ON SITE! 25% travel required for plant visits, local to Columbus Duration: 6+ Months Visa: USC/GC/GC EAD Hard Requirements: Relatable manufacturing experience required. SaaS Experience is a must. Kronos experience, UltiPro implementations experience preferred. This candidate has to have excellent communication skills and very strong PM experience.Interview Process: One 15 minute prescreen call with me, one 30 minute teams interview with my manager, one to two client interviews (teams/possibly on site) Sr. IT Project Manager- (UKG Workforce Management) Top Consulting is looking to add a Sr. IT Project Manager will provide direction and guidance to the client’s team with specific focus on the WFM implementation. The role is responsible for partnering with line of business leaders and key stakeholders to align technology projects to optimize the value IT delivers and to accomplish the business strategy. The Senior IT Project Manager will be responsible for tracking and reporting status up to the project Steering Committee and the executive-level Management Leadership Team.Primary Responsibilities:Responsible for overseeing the execution of IT projects by ensuring the quality, completeness, tracking and reporting of work items as they flow between participants in key business processesLead the project team through Initiation, Planning, Build/Configuration/Validation, Deployment, and Closure stages of complex IT projects Utilize resources scheduling and time managementCoordinate the efforts of work teams consisting of team members and vendors Incorporate risk mitigation strategy and contingency plan Perform analysis that reflects actual vs. planned variances Accountable for project charter, documentation of requirements, and testing strategy linked back to the project deliverables' requirements.Project schedule development, status reporting, communications planning and management using the corporate standard processes and tools in alignment with overall IT and Project Management methodologyManaging project financials, including budget, forecast, and actuals trackingOverseeing Organizational Change Management – strategy, communication plans, end user training in alignment with enterprise standardsPerform project closing activities including operational transition planning and executionProven leader and trusted advisor championing project needs to deliver predictable and repeatable project results Track and prepare monthly metrics using Planisware, Excel, PowerPoint or other tools. Prepare forecasts of project spending and cash flows, budget variance monitoring, and schedule compliance. Issue reports to senior leaders on the status of the projectQualification Requirements:5+ years of IT program/project management experience with projects of increasing complexity of size and scope Experience with Kronos is requiredExperience with UltiPro system implementations is requiredExperienced with Organizational Change Management strategy and execution is highly preferredProficient in Waterfall, Iterative, and blended project methodologies Experienced in managing large application delivery and integration projects including negotiating with software, hardware and infrastructure providers, working with matrixed teams, green field builds, migrations, and decommissioning legacy applications Proficient in Budget / Financial Management including Business Case completion Demonstrate problem-solving, negotiation, and decision-making skills to effectively manage project stakeholders – internal and externalExperienced in facilitating project meetings and standups Adherence to the Project Lifecycle Management (Initiation, Planning, Requirements/Design, Build/Configuration, Testing/Validation, Deployment, and Closure) Planning, Defining and Managing ScopeProject Task Estimation and Schedule Management Resource Planning and SchedulingRisk Analysis and ManagementIssue and Change Management Test Planning and ManagementDeployment / Implementation ManagementBusiness Knowledge: Proficient in multiple business disciplines and functions Bachelor’s or Master’s degree in computer science, information systems, or related field is preferred; or equivalent work experience Project Management Professional Certification – PMP or CSM PROSCI certification is a plus but not required",
        "source": "Email",
        "date_posted": "2024-10-10 17:04:48-05:00",
        "unique_id": "19278f720f0456b1",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]