[
    {
        "company": "Sonitalentcorp",
        "job_title": "Senior Application Developer (.NET)",
        "location": "New York, NY, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "8 years",
            "degree_required": "BA/BS Degree or equivalent, in a technology related field or other degree preferred.",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".NET",
                "C#",
                "SQL Server",
                "GIS mapping software",
                "ASP.NET"
            ],
            "primary": [
                "HTML5",
                "CSS",
                "JavaScript",
                "React",
                "Angular",
                "WCF",
                "SSIS",
                "Azure DevOps"
            ],
            "secondary": [
                "Microservices",
                "Bootstrap",
                "UML",
                "Business Intelligence",
                "Decision Support Systems"
            ],
            "all": [
                ".NET",
                "C#",
                "SQL Server",
                "GIS mapping software",
                "ASP.NET",
                "HTML5",
                "CSS",
                "JavaScript",
                "React",
                "Angular",
                "WCF",
                "SSIS",
                "Azure DevOps",
                "Microservices",
                "Bootstrap",
                "UML",
                "Business Intelligence",
                "Decision Support Systems"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Bhuwan Tiwari",
        "email": "bhuwan.tiwari@sonitalentcorp.com",
        "jd": "From: bhuwan tiwari, Sonitalentcorp bhuwan.tiwari@sonitalentcorp.com Reply to: bhuwan.tiwari@sonitalentcorp.com Role: Senior Application Developer (.NET)Location: New York, NY Job Type: ContractVisa - No OPT ,CPT & H1B GIS mapping software Services Desired: DOT seeks an experienced consultant that can: Perform detailed and quality application design, database design, coding, and unit/ integration/ performance testing. · Develop and integrate complex application modules using .NET 4.8, ASP.NET, .NET Core, C#, n-Tier architecture, SOA, XML/JSON-based web services and application development tools such as Microsoft Visual Studio 2019/2022 and SQL Server Management Studio. · Implement web-based user interfaces in .NET using Razor/MVC5/MVVM architectural patterns, AJAX, HTML5, CSS and JavaScript (React, Angular or Backbone) · Develop relational database design, normalization, T-SQL/stored procedures and manage databases in SQL Server 2019 and Azure SQL. · Build secure web applications with user authentication and role-based access control. · Institute graphic user interfaces following user experience and accessibility best practices. · Generate reports using Microsoft SQL Reporting Services (SSRS), ad-hoc reporting, and data migration/transformation using SSIS packages. · Perform configuration management, continuous integration, and version control utilizing Azure DevOps. · Implement web services using Windows Communication Foundation (WCF). · Adhere to Software Development Life Cycle (SDLC) processes. The following methodologies are currently being used for different projects Waterfall, RUP and Agile. · Create/update design artifacts and deliverables such as use case diagrams, application architecture, class/sequence diagrams and high-level/detailed design documentation. · Collaborate with business analysts, quality assurance specialists and application developers during the design, development, testing, and implementation of applications. · Understand high level application architecture/design, network design, performance constraints and security frameworks. · Participate in and contribute to formal/informal technical reviews and presentations. · Research, present and/or make recommendations on technical issues. MANDATORY SKILLS/EXPERIENCE: Note: candidates who do not have the mandatory skills will not be considered. Minimum of 8 years’ experience with writing application software, data analysis, data access, data structures, data manipulation, databases, programming, testing and implementation, technical and user documentation, software conversions; environments include but are not limited to mainframe, mid-range, personal computers, laptop; available to assist and/or lead in the design of program specifications and the implementation of software solutions. c. Preferred Skills/Experience for Consultant Candidates: · BA/BS Degree or equivalent, in a technology related field or other degree preferred. · Advanced-level certifications and/or training in application development. · Microsoft Certified Professional. · AWS Certification or Azure Cloud Certification · 8 years of experience in object-oriented design, development, testing and deployment in a web/client-server environment. · 6-7 years of hands-on development experience with projects involving Microsoft.NET and SQL Server technologies for web, web service and desktop application development using C#.NET, ASP.NET, ADO.NET, HTML 5, AJAX, WPF, WCF, MVC, Microservices, jQuery, Entity Framework, LINQ, Visual Studio 2017/2019. · 6+ years of relational database design, normalization, T-SQL, stored procedures, SQL Server 2014/2017/2019, SSIS packages, data modeling tools (ERwin/ERStudio). · Proficiency in data analysis and ad-hoc reporting using T-SQL, Microsoft SQL Server, and Microsoft Excel. · Expertise in map-based application development and GIS mapping software, with ESRI ArcGIS Desktop, ArcGIS Online, Open Layers and/or Mapbox preferred. · Advanced working knowledge of Microsoft Team Foundation Server, Azure DevOps, or a similar application lifecycle management tool. · Experience in UML/Rational tools or other design tools. · Strong analytical, decision-making, and problem-solving skills. · Good communication, presentation, and leadership skills. · Proficient in JavaScript frameworks: React, Backbone and Angular.· Proficient in responsive design frameworks, such as Bootstrap. · Proficient in Wireless/Mobile/Disconnected architecture/applications. · Experience with online payment implementation / integration. · Working knowledge in Business Intelligence and Decision Support Systems. · Prior experience working in federal, state, or local government projects.",
        "source": "Email",
        "date_posted": "2024-10-10 12:58:22-05:00",
        "unique_id": "19277b5bafb97f4c",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]