[
    {
        "company": "McubeSoft",
        "job_title": "SingleStore Database Administrator",
        "location": "Austin, TX, USA",
        "full_location": {
            "city": "Austin",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "contract",
                "third party"
            ],
            "experience_required": "Proven experience as a Database Administrator, specifically with SingleStore.",
            "degree_required": "Bachelor’s degree in Computer Science, Information Technology, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SingleStore",
                "Python",
                "Database Administration"
            ],
            "primary": [
                "Database Performance Tuning",
                "Backup and Recovery",
                "Database Security"
            ],
            "secondary": [
                "Vertica",
                "MySQL",
                "Oracle",
                "AWS",
                "DevOps",
                "Data Warehousing",
                "ETL"
            ],
            "all": [
                "SingleStore",
                "Python",
                "Database Administration",
                "Database Performance Tuning",
                "Backup and Recovery",
                "Database Security",
                "Vertica",
                "MySQL",
                "Oracle",
                "AWS",
                "DevOps",
                "Data Warehousing",
                "ETL",
                "Unix/Bash",
                "Unix/Linux OS system administration",
                "Unix Shell scripting",
                "Snowflake",
                "Distributed Systems",
                "Clickhouse"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Ahad",
        "email": "ahad@mcubesoft.com",
        "jd": "From: Ahad, McubeSoft ahad@mcubesoft.com Reply to: ahad@mcubesoft.com Job : SingleStore DBA Job Location : Austin, TX(Hybrid). Job DescriptionSingelsore DBA Requirement:Job Summary: We are looking for SingleStore DBA with Python Programming. He/She will be responsible for managing and maintaining our SingleStore database environment. This includes database performance tuning, monitoring, backup and recovery, and ensuring data integrity and security. The ideal candidate will have a solid background in database administration, particularly with SingleStore, and will use their Python programming skills to develop scripts and tools to automate routine tasks and improve database efficiency. Key Responsibilities:Install, configure, and maintain SingleStore database systems.Monitor database performance, implement performance tuning, and optimize queries.Ensure high availability and disaster recovery of database systems.Develop, test, and deploy backup and recovery plans.Implement and maintain database security policies and procedures.Create and maintain database documentation, including data models, schemas, and procedures.Develop Python scripts to automate database management tasks and enhance operational efficiency.Troubleshoot and resolve database-related issues and provide support to development teams.Collaborate with other IT professionals and stakeholders to ensure seamless integration of database systems with other applications.Stay updated with the latest industry trends and best practices in database management and Python programming.Qualifications:Bachelor’s degree in Computer Science, Information Technology, or a related field. Proven experience as a Database Administrator, specifically with SingleStore. Strong proficiency in Python programming, with experience in writing scripts for database management and automation.In-depth knowledge of database performance tuning, query optimization, and troubleshooting.Experience with database backup and recovery procedures.Familiarity with database security best practices.Excellent problem-solving skills and attention to detail.Strong communication and collaboration skills.Ability to work independently and manage multiple tasks effectively. Preferred Qualifications:Experience with other database systems (e.g., Vertica, MySQL, Oracle). Familiarity with cloud-based database solutions and infrastructure (e.g., AWS). Experience with DevOps tools and practices.Knowledge of data warehousing and ETL processes. Skill SetsPreferenceMemSQLIs RequiredSinglestoreIs RequiredpythonIs RequiredVerticaNice To HaveAWSIs RequiredUnix/BashIs RequiredUnix/Linux OS system administrationIs RequiredUnix Shell scriptingIs RequiredSnowflakeNice To HaveDistributed SystemsIs RequiredClickhouseNice To Have",
        "source": "Email",
        "date_posted": "2024-10-10 08:09:26-05:00",
        "unique_id": "19276aea5bd4e8af",
        "emp_type": [
            "full-time",
            "contract",
            "third party"
        ],
        "tag": "DB Admin"
    }
]