[
    {
        "company": "Techgene Solutions LLC",
        "job_title": "Technical Business Analyst (UI Modernization)",
        "location": "Des Moines, IA, USA",
        "full_location": {
            "city": "Des Moines",
            "state": "IA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "7 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "7+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "data migration",
                "business analysis",
                "data validation",
                "requirements gathering",
                "communication skills",
                "SQL"
            ],
            "primary": [
                "data flow diagrams",
                "system architecture mapping",
                "business process flow documentation",
                "software development lifecycle",
                "testing systems",
                "MS Office",
                "MS Project",
                "MS Visio",
                "Jira"
            ],
            "secondary": [
                "facilitating meetings",
                "vendor management",
                "milestone/stage gate sign off"
            ],
            "all": [
                "data migration",
                "business analysis",
                "data validation",
                "requirements gathering",
                "communication skills",
                "SQL",
                "data flow diagrams",
                "system architecture mapping",
                "business process flow documentation",
                "software development lifecycle",
                "testing systems",
                "MS Office",
                "MS Project",
                "MS Visio",
                "Jira",
                "facilitating meetings",
                "vendor management",
                "milestone/stage gate sign off"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Jatin Keshav",
        "email": "jatin.k@techgene.com",
        "jd": "From: Jatin Keshav, Techgene Solutions LLC jatin.k@techgene.com Reply to: jatin.k@techgene.com Role: Technical Business Analyst (UI Modernization)Location: Des Moines IA 50319 – Hybrid (2 Days/Week)Duration: 7+ Months LOCAL PROFILES ONLY – IN-PERSON INTERVIEW Note:We are seeking a Business Analyst with data migration experience to analyze and triage data migration testing results. The testing phase is complete, and all scripts for the data migration have been written. The original data mapping and requirements have also been finalized. We need a Business Analyst who can review the script results, identify discrepancies, and determine necessary changes to the data mapping requirements. This role involves working closely with both the business side to refine requirements and the technical team managing the data warehouse. While prior testing experience is not required, as the scripts are already in place, the ideal candidate should be able to understand why discrepancies exist and revise the requirements accordingly. Immediate need for a Technical Business Analyst skilled at consulting with business stakeholders and technical resources to define requirements and validate conversion for a large-scale data migration effort for Unemployment Insurance Modernization. Specifically, this role will be dedicated to gathering necessary documentation, participating in technical requirement discussions, and performing validations.This individual will participate in testing and group sessions to define and validate requirements, identify gaps and analyze process needs.This individual will participate in vendor-hosted data conversion sessions, articulating and/or documenting needs clearly and accurately to vendor teams.This individual will perform data validation for a large-scale data migration effort, as legacy data is migrated to a modernized system, working in partnership with IWD IT resources and vendor project team to prepare test cases as necessary, document test results and articulate needs. These projects will transform agency business operations, eliminate technical debt, improve user experience and return significant cost savings. The UI Benefit Modernization will move a 40-year-old legacy mainframe system to a contemporary web-based solution. The new system will be a modified/configurable off-the-shelf product, developed and hosted by a third-party vendor.This position will work closely with the UI Benefits Modernization project manager and data conversion workstream lead, as well as IWD technical resource and UI SMEs, while interacting daily with the vendor's project management and business analyst teams. Skill RequirementsInvolvement in prior medium to large-scale data conversionsDemonstrated ability to elicit, document and understand business and technical requirementsExperience preparing data flow diagrams, system architecture mapping, business process flow documentationDemonstrated strong communication skills across technical teams and business stakeholders Proficient understanding of the software development lifecycle and related methodologies Experience testing systems against test cases and technical specifications, analyzing and documenting results Experience preparing test cases and technical specificationsProficient in the use of MS Office, MS Project, MS Visio, Jira (or equivalent)Demonstrated ability to facilitate productive meetings with technical teams and business stakeholdersWorking knowledge using SQL – Intermediate level or higherInvolvement in milestone/stage gate sign off and approval, ensuring technical and business readiness Experience partnering with vendor project teams and managing relationships SkillRequired / DesiredAmountof Experience• Involvement in prior medium to large-scale data conversionsRequired7Years• Demonstrated ability to elicit, document and understand business and technical requirementsRequired7Years• Experience preparing data flow diagrams, system architecture mapping, business process flow documentationRequired7Years• Demonstrated strong communication skills across technical teams and business stakeholdersRequired7Years• Proficient understanding of the software development lifecycle and related methodologiesRequired7Years• Experience testing systems against test cases and technical specifications, analyzing and documenting resultsRequired7Years• Experience preparing test cases and technical specificationsRequired7Years• Proficient in the use of MS Office, MS Project, MS Visio, Jira (or equivalent)Required7Years• Demonstrated ability to facilitate productive meetings with technical teams and business stakeholdersRequired7Years• Working knowledge using SQL – Intermediate level or higherRequired7Years• Involvement in milestone/stage gate sign off and approval, ensuring technical and business readinessRequired7Years• Experience partnering with vendor project teams and managing relationshipsRequired7Years",
        "source": "Email",
        "date_posted": "2024-10-10 08:26:25-05:00",
        "unique_id": "19276bff2d738690",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]