[
    {
        "company": "SSPEARHEAD INC",
        "job_title": "Business Analyst",
        "location": "Albany, NY, USA",
        "full_location": {
            "city": "Albany",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "HBITS-06-13622",
            "experience_required": "84 Months",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "24 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Requirements Elicitation",
                "SDLC",
                "Stakeholder Management",
                "Process Mapping"
            ],
            "primary": [
                "Health Care Billing Systems",
                "JAD Sessions",
                "Requirements Management",
                "Test Plans",
                "User Acceptance Testing"
            ],
            "secondary": [
                "Interpersonal Skills",
                "Problem Solving",
                "Flexibility",
                "Adaptability",
                "Computer Programming"
            ],
            "all": [
                "Business Analysis",
                "Requirements Elicitation",
                "SDLC",
                "Stakeholder Management",
                "Process Mapping",
                "Health Care Billing Systems",
                "JAD Sessions",
                "Requirements Management",
                "Test Plans",
                "User Acceptance Testing",
                "Interpersonal Skills",
                "Problem Solving",
                "Flexibility",
                "Adaptability",
                "Computer Programming",
                "CBAP Certification"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Yogesh Dahiya",
        "email": "yogeshd@sspearhead.com",
        "jd": "From: Yogesh Dahiya, SSPEARHEAD INC yogeshd@sspearhead.com Reply to: yogeshd@sspearhead.com , Hope you are doing good. Please have a look on below position and let me know if you are interested? Required Documentation: Make sure you if you are fine with this job then please share the below details at the time submission time.If you are not going to provide these details then please don’t apply for this job.1: Passport mandatory for these visa’s ( EAD, GC and H1B)2: Visa stamping copy required for H1 B3: Must be provide 3 references with full name, email id, client name and phone number. Job Description:Job Id: HBITS-06-13622Role: Business Analyst Client: NYS OMH Duration: 24 monthsLocation: Albany, NY ( Hybrid)There is only 1 round interview direct client.Qualifications Daily Tasks will include but not limited to the following: Work closely with the project manager, technical team members and other project stakeholders to provide guidance throughout the System Development Life Cycle (SDLC).Work closely with Business Systems Analyst and the project team to identify and scope the stated business problem, provide guidance and recommend/execute best approach to problem.Work as a liaison to stakeholders, software uses and Subject Matter Experts to elicit, analyze, communicate, validate and verify the requirements for complex changes to current business processes, policies and information systems and for the development of new business processes, policies and information systems.Conveys the demands of software users to the developers and ensures understanding of requirements clearly articulated artifactsCreate as-is and to-be business process flows to ensure that the implemented business process and supporting software meets agency needs.Conduct requirements workshops and JAD sessions with agency subject matter experts as one of the many techniques to be used to elicit requirements.Create business requirements documents, context diagrams, business requirements document (BRD), system \"as-is” and \"to be” states, system specifications, use cases and workflow diagrams, report and screen mockups, swim lane diagrams, and prototypes.Ensure that artifacts required by ITS governance process and Secure Systems Development Lifecycle (SSDLC) are created and support the project scope. Manage requirements through the life of the contract using a requirements management plan and traceability to ensure coverage between the source of each requirement and the test case(s) it will be tested by. Software Analyst: Patient Characteristic Survey (PCS), Cyber Remediation projects Studies the software application domain, prepares software requirements, and specification documents. Liaises between the software users and the software developers. Conveys the demands of software users to the developers. Skills include: working knowledge of software technology; computer programming experience/expertise; general business knowledge; problem solving/reduction skills; interpersonal relation skills; flexibility and adaptability.Expert 84+ months: Candidate is able to provide guidance to large teams and/or has extensive industry experience and is considered at the top of his/her field. 84 Months Experience eliciting then analyzing the stakeholder's business needs using a variety of analysis techniques and converting those into verified and validated functional and non-functional requirements for development 84 Months Experience in creating and maintaining software development artifacts for communication of requirements, including context diagrams, textual use cases, swim lane diagrams, report specifications, wireframes, user interface specifications, and non-functional requirements specifications 84 Months Experience facilitating requirement workshops, JAD sessions and structured walkthroughs, ensuring requirements are understood, conveyed and met 72 Months Experience managing requirements throughout the Requirements Management Lifecycle, including creation and execution of a Requirements Management Plan, requirements traceability, establishing requirements baselines and managing requirements change control. 64 Months Experience creating test plans and test cases and working with users on User Acceptance Testing 64 Months Experience working on Health Care billing systems CBAP (Certified Business Analysis Professional) certification by the International Institute of Business Analysis (IIBA) E-mail is the best way to reach me, if I don’t pick your call. Thanks & RegardsYogesh DahiyaSspearhead Inc",
        "source": "Email",
        "date_posted": "2024-10-10 15:17:27-05:00",
        "unique_id": "19278350a56c7e67",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]