[
    {
        "company": "Resource Consulting Services Inc",
        "job_title": "Senior Project Manager",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "136641",
            "experience_required": "10 years",
            "degree_required": "Bachelor’s Degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "1 year with possible extension",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Agile Leadership",
                "Microsoft DevOps",
                "Project Management"
            ],
            "primary": [
                "Budget Management",
                "Vendor Management",
                "Change Management"
            ],
            "secondary": [
                "Communication Skills",
                "Risk Management",
                "Team Building",
                "Stakeholder Management",
                "Technical Support"
            ],
            "all": [
                "Agile Leadership",
                "Microsoft DevOps",
                "Project Management",
                "Budget Management",
                "Vendor Management",
                "Change Management",
                "Communication Skills",
                "Risk Management",
                "Team Building",
                "Stakeholder Management",
                "Technical Support"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Ansar Alam",
        "email": "ansar@rconsultinginc.com",
        "jd": "From: Ansar Alam, Resource Consulting Services Inc ansar@rconsultinginc.com Reply to: ansar@rconsultinginc.com Job ID: 136641Role: Senior Project ManagerDuration: 1 year with possible extension.Location: Lansing, MI 48933 – Hybrid – Tuesday and WednesdayVisa: Any Local candidates onlyPrior state experience is preferred Must Have: 5 years of experience managing projects with budgets greater than $5 million.5 years Agile Leadership Experience (document in resume) 10 years of experience as a project manager (must be last position)2 years Microsoft DevOps ExperienceExperience working with other project managers to ensure technology integration between systemsPrevious State of Michigan experience highly desiredBachelor’s Degree Description:This Project Manager will be responsible for a $20 million modernization project, which will be highly complex, require extensive change and vendor management skills, and experience with Microsoft DevOps. General responsibilities:Designs, plans, and coordinates work teams. Follows standard project management industry practices such as the PMI's framework. Understands business and technical objectives of a project and works closely with project sponsor. Creates project charter and work plan and tracks budget and schedule progress via appropriate metrics. Establishes project organization and methodologies and defines roles and responsibilities. Documents risks and develops mitigation plans. Manages scope. Creates and implements a communication plan. Builds an effective team, assigns tasks to team members, and evaluates outcomes. Negotiates resources. Communicates to stakeholders and project sponsor. Identifies, tracks, and ensures resolution of issues and removal of barriers. Provides technical support to project members. Handles complex application features and technical designs. Designs and implements the components required for complex application features. Generally manages a group of applications system analysts. Relies on experience and judgment to plan and accomplish goals. Professional certification is highly desirable.May require specific PC, workstation, operating system, application or platform skills. Provides overall direction to the formulation, development, implementation, and delivery of a project. Exercises management responsibility over the achievement of performance, revenue, and profit objectives of a project and its contracts. Ensures that the project plan maintains tasks, schedules, estimates, and status, and disseminates information to team members and customers. Creates a structure and organization for the management of a complex environment with emphasis on quality, productivity, and consistency. Directs corrective actions in any area where performance falls below objectives. Arranges for the assignment of responsibility to other supporting facilities, business areas, and support functions, and monitors their performance. Self-directed and independent. Responsible for the coordination and completion of projects. Oversees all aspects of projects. Sets deadlines, assigns responsibilities, and monitors and summarizes progress of project. Prepares reports for upper management regarding status of project.",
        "source": "Email",
        "date_posted": "2024-10-25 09:17:41-05:00",
        "unique_id": "192c42a7940adf32",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]