[
    {
        "company": "Vkore",
        "job_title": ".NET Production support",
        "location": "Santa Clara, CA, USA",
        "full_location": {
            "city": "Santa Clara",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Proven experience as a .NET production support or similar role",
            "degree_required": "Bachelor’s degree in Computer Science, Engineering, or a related field (or equivalent experience)",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "C#",
                ".NET",
                "MongoDB",
                "ASP.NET",
                "MVC",
                "Web API"
            ],
            "primary": [
                "HTML",
                "CSS",
                "JavaScript",
                "Angular",
                "React",
                "SQL Server",
                "Entity Framework",
                "Git"
            ],
            "secondary": [
                "Problem solving",
                "Continuous improvement",
                "Communication",
                "Interpersonal skills"
            ],
            "all": [
                "C#",
                ".NET",
                "MongoDB",
                "ASP.NET",
                "MVC",
                "Web API",
                "HTML",
                "CSS",
                "JavaScript",
                "Angular",
                "React",
                "SQL Server",
                "Entity Framework",
                "Git",
                "Problem solving",
                "Continuous improvement",
                "Communication",
                "Interpersonal skills"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Sonu",
        "email": "sonu@vkoresolutions.com",
        "jd": "From: Sonu, Vkore sonu@vkoresolutions.com Reply to: sonu@vkoresolutions.com Hi, Please find the job description below: Job Title: .NET Production support Location: Santa Clara CA Must: preferred local candidates. Key Responsibilities: Design, develop, and maintain scalable and high-performance .NET applications. Write clean, efficient, and maintainable code using C#, ASP.NET, and other relevant technologies. Collaborate with stakeholders to gather and understand project requirements. Participate in all phases of the software development lifecycle, including analysis, design, development, testing, and deployment. Troubleshoot and resolve application issues, including debugging and performance optimization. Ensure application security, reliability, and scalability. Write and maintain technical documentation. Stay up-to-date with the latest industry trends and technologies to ensure the use of best practices. Qualifications: Bachelor’s degree in Computer Science, Engineering, or a related field (or equivalent experience). Proven experience as a .NET production support or similar role, with strong proficiency in C# and the .NET framework. Strong experience with MongoDB. Strong in production support. Hands on experience in handling production support tickets from L1 to L4 based on SLA metrics defined for production support tickets as well. Good problem solving capabilities and good in Continuous improvement program in developed applications. Good communication skill. Experience with ASP.NET, MVC, Web API, and other .NET technologies. Familiarity with front-end technologies such as HTML, CSS, JavaScript, and modern frameworks (e.g., Angular, React). Experience with relational databases (e.g., SQL Server) and data access technologies (e.g., Entity Framework). Knowledge of version control systems (e.g., Git). Strong problem-solving skills and attention to detail. Ability to work independently and as part of a team in a fast-paced environment. Excellent communication and interpersonal skills.",
        "source": "Email",
        "date_posted": "2024-10-25 10:37:35-05:00",
        "unique_id": "192c4746012f16f1",
        "emp_type": [
            "third party"
        ],
        "tag": ".net developer"
    }
]