[
    {
        "company": "Fifth Third Bank",
        "job_title": "Java Software Architect",
        "location": "Cincinnati, OH, USA",
        "full_location": {
            "city": "Cincinnati",
            "state": "OH",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "5+ years",
            "degree_required": "Bachelor’s degree in a relevant technology field or equivalent combination of education and work experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Permanent",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Spring Framework",
                "RESTful APIs"
            ],
            "primary": [
                "Platform Engineering",
                "Microservice-oriented architecture",
                "Test Driven Development",
                "Agile/Scrum"
            ],
            "secondary": [
                "Banking/Financial Services Background",
                "Experience with core banking platforms"
            ],
            "all": [
                "Java",
                "Spring Framework",
                "RESTful APIs",
                "Platform Engineering",
                "Microservice-oriented architecture",
                "Test Driven Development",
                "Agile/Scrum",
                "Banking/Financial Services Background",
                "Experience with core banking platforms",
                "Java 17 or higher",
                "Spring 6.x & Spring Boot 3.x",
                "Back end for front ends",
                "Git",
                "GitHub",
                "Jenkins",
                "JFrog",
                "Outstanding problem-solving and communication skills",
                "Willingness to work in a highly collaborative environment",
                "Deep understanding of IT security best practices",
                "Experience analyzing legacy platforms",
                "Experience designing, implementing, and supporting complex technical solutions",
                "Able to provide technical coaching and guidance to junior software and platform engineers"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Ashish Yadav",
        "email": "ashish@vyzeinc.com",
        "jd": "From: Ashish Yadav, Vyze Inc. ashish@vyzeinc.com Reply to: ashish@vyzeinc.com Job Description -Title: Java Software Architect Client: Fifth Third BankLocation: Cincinnati , OH (Onsite)Location: Required to be onsite 5 days a weekGENERAL FUNCTION:The Principle Solution Architect is a seasoned individual who can work independently and with very little management guidance. This individual is recognized as an expert in this field and has the knowledge and experience to be a recognized leader in this craft. Will evaluate, design and implement technology solutions to build and progress technology strategies with a line of business. In the majority of situations, the incumbent will be the application owner responsible for third party, purchased software aligned with a LOB. Will have responsibility to work with vendor to understand upcoming changes, how the software fits into the technology roadmap and design plans to ensure business continuity and effectiveness. Understands the bank's systems, how they are configured, how we need to reconfigure to meet the changes. If aligned to an agile squad may work closely with the product owner to ensure user stories are defined appropriately to develop effective technology solutions. Will have the flexibility to work on very complex initiatives and provide guidance and advice to less seasoned engineers.All employees are responsible and accountable for risk by openly exchanging ideas and opinions, elevating concerns, and following policies and procedures as defined. Accountable for always doing the right thing for customers and colleagues and ensuring that actions and behaviors drive a positive customer experience. Operating within the Bank's risk appetite, you will achieve results while consistently identifying, assessing, managing, monitoring, and reporting risks of all types.DUTIES AND RESPONSIBILITIES:Help to define the long-term vision for one or more products and domains and help to lead the technical execution towards that vision.Work with the line of business and IT squads to design solutions to incorporate software changes and effectively work with all partners to ensure effective implementationConsult with Product Owners to understand the business technology roadmap and make recommendations on continued utilization or elimination of inhouse and current third-party software solutions.Be the main liaison with software vendor(s) for systems utilized by a particular line of businessStay abreast of upcoming changes and enhancements in vendor’s software and how those changes will impact the business.Implement and maintain new features and capabilities while continuously improving the quality of our technical products and servicesFollow industry and organizational best practices and standards and participate in company communities of practice to continuously refine and communicate them. Contribute to a culture of continuous improvement.Achieve operational excellence by automating processes and creating maintainable, supportable, and testable solutionsKeep up with technology trends and innovations in your field(s) of practiceProvide operational support and troubleshooting for your team’s products and servicesProvide coaching, mentoring, and training for new or less experienced team membersHelp to define the long-term vision for one or more products and domains and help to lead the technical execution towards that vision.Design and document the overall architecture of technology solutions, ensuring alignment with business objectives and requirements.Ensure that technology solutions meet necessary performance, scalability, and security standards.Seek opportunities for re-use and collaboration across teams to improve processes and capabilities that exceed the scope of a single team.Operate as a trusted advisor, establishing yourself as a company-wide go-to resource for specific technologies, topics, or domains.SUPERVISORY RESPONSIBILITIES: None.MINIMUM KNOWLEDGE, SKILLS AND ABILITIES REQUIRED:Bachelor’s degree in a relevant technology field or equivalent combination of education and work experience5+ years of engineering or other IT work experience relevant to the positionExperience working with third party commercial off the shelf and internally built applicationsDeep understanding of reactive architecture principles and familiarity with microservice oriented architectureUnderstanding of decentralized and asynchronous data flows and related tools, modern warehousing best practices, and the data security as a fundamental aspect of data movementExperience with container hosted application footprints in hybrid cloud/on-premises environmentsOutstanding problem-solving and communication skillsWillingness to work in a highly collaborative environment spanning multiple departments and squadsDeep understanding of IT security best practicesExperience in banking or financial services industryExperience analyzing legacy platforms, documenting current state tech stack and process flows, and translating optimized business processes into modern technical architecturesExperience designing, implementing, and supporting complex technical solutionsAble to provide technical coaching and guidance to junior software and platform engineers5 years’ experience in Java 17 or higher5 years’ experience in Spring 6.x & Spring Boot 3.x5 years with RESTful API development and back end for front ends3 years’ experience in micro-service-oriented back-end architecture & development2 years’ experience working in agile/scrum teams3 years’ experience with Test Driven Development with JunitPrior experience with Git, GitHub, Jenkins and JFrogMust Have Skills: JavaPlatform Engineering RESTful API'sSpring Framework Nice to Have Skills: Banking/Financial Services BackgroundExperience with core banking platforms (deposit systems, debit card processing, ATM, check processing or client billing) is a plus",
        "source": "Email",
        "date_posted": "2024-10-25 10:05:15-05:00",
        "unique_id": "192c46949c1d019b",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]