[
    {
        "company": "fwdatatech.com",
        "job_title": "Project Manager",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Bachelor’s degree in Information Technology, Computer Science, Information Security, or a related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Manager",
                "Cloud Security Operations",
                "AWS",
                "Azure",
                "GCP"
            ],
            "primary": [
                "Project Management",
                "Cloud Security Frameworks",
                "Compliance Requirements"
            ],
            "secondary": [
                "Incident Response",
                "Vulnerability Assessments",
                "Patch Management",
                "Monitoring"
            ],
            "all": [
                "Project Manager",
                "Cloud Security Operations",
                "AWS",
                "Azure",
                "GCP",
                "Project Management",
                "Cloud Security Frameworks",
                "Compliance Requirements",
                "Incident Response",
                "Vulnerability Assessments",
                "Patch Management",
                "Monitoring"
            ]
        },
        "job_type": [
            "onsite",
            "hybrid"
        ],
        "contact_person": "Yuvaraj",
        "email": "yuvaraj@fwdatatech.com",
        "jd": "Hi All,Hope you are doing well,Please find the below requirement, let me your thoughts Role: Project Manager – C2CLocation: Atlanta, GA – Hybrid Must Have SkillsSkill 1 – Project Manager to lead our Cloud Security Operations team.Skill 2 - Monitor cloud security infrastructureWe are seeking a seasoned and results-driven Project Manager to lead our Cloud Security Operations team. In this role, you will manage the day-to-day operations of cloud security projects, ensuring the secure and efficient management of cloud environments across AWS, Azure, and GCP. The ideal candidate will have experience managing cloud security operations, strong project management skills, and a deep understanding of cloud security frameworks and compliance requirements. Key Responsibilities: • Lead the planning, execution, and delivery of cloud security operations projects across multiple cloud platforms (AWS, Azure, GCP). • Develop project timelines, milestones, and deliverables to ensure the timely completion of security initiatives. • Ensure all cloud security operations adhere to company policies, industry best practices, and regulatory requirements. • Oversee the day-to-day operations of the cloud security team, ensuring that security controls, monitoring, and incident response plans are properly implemented. • Manage operational tasks such as patch management, vulnerability assessments, and security incident response within cloud environments. • Monitor cloud security infrastructure to ensure optimal performance and minimal downtime while responding quickly to security incidents. • Develop and maintain cloud security incident response plans, ensuring the organization is prepared to respond to security threats in a timely manner. • Oversee post-incident reviews and implement lessons learned to improve the security operations and response processes. Qualifications • Bachelor’s degree in Information Technology, Computer Science, Information Security, or a related field",
        "source": "Email",
        "date_posted": "2024-10-25 14:05:39-05:00",
        "unique_id": "192c5321b1019408",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]