[
    {
        "company": "ZealHire",
        "job_title": "BUSINESS ANALYST/QUALITY ANALYST",
        "location": "Frisco, TX, USA",
        "full_location": {
            "city": "Frisco",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Archer",
                "GRC",
                "Business Analysis",
                "Quality Assurance"
            ],
            "primary": [
                "Agile"
            ],
            "secondary": [],
            "all": [
                "Archer",
                "GRC",
                "Business Analysis",
                "Quality Assurance",
                "Agile"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Raman Arora",
        "email": "raman@zealhire.com",
        "jd": "Hello, My name is Raman Arora and I am a Staffing Specialist at ZealHire. I am reaching out to you on an exciting job opportunity with one of our clients. Job Title - BUSINESS ANALYST/QUALITY ANALYST Location - Frisco, Auburn Hills, Michigan, Texas Job Description: USC/GC need LinkedIn, VISA DL Find someone with Archer or GRC (governance, risk, and controls) exp Local to TX, MI Onsite Requirements:*Hybrid onsite requires a minimum of 2 full days onsite (8hrs/day x 2 days). Skills: Experience with Archer or GRC (governance, risk, and controls) Business Systems Quality Analyst Facilitating evaluation of business requirements for business application integration, service activation, delivering new or modified software systems enhancements. Experience in the development of scope, goals, objectives and business and system requirements while ensuring complete traceability to project objectives. Drive end-to-end production support incident management which includes identification of impacted areas/applications, coordinating client engagement and communication and driving the completion of root cause analysis. Should you be interested, please send me a copy of your resume in word format along with the following details ASAP. Full Name: Current Location: Hourly rate on C2C/W2: Work Authorization: Earliest Available date to start: Date and times available to interview: Two Professional References: (Preferably Supervisory references): Kind Regards, Raman Arora Technical Recruiter ZealHire Inc. Email: Raman@zealhire.com Direct: ​ (332) 287 8468 Ext. 112 https://www.linkedin.com/in/raman-arora-97b749211/ 14 Wall Street 20th Floor | New York, NY 10005 www.zealhire.com",
        "source": "Email",
        "date_posted": "2024-10-25 07:23:46-05:00",
        "unique_id": "192c3c22d69b4d1b",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]