[
    {
        "company": "Adbakx",
        "job_title": "Mobile Project Manager",
        "location": "Irvine, CA, USA",
        "full_location": {
            "city": "Irvine",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "13+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "$70/C2C"
        },
        "skills": {
            "core": [
                "Project manager",
                "Mobile apps (iOS / Android)",
                "B2B SAAS applications",
                "Confluence",
                "JIRA"
            ],
            "primary": [
                "Strong Product skills",
                "Work with UX design teams",
                "Manage Mobile Agile scrum teams",
                "Strong documentation skills",
                "Competitive analysis"
            ],
            "secondary": [
                "Communication skills",
                "Problem statement articulation",
                "Requirements capture",
                "Product roadmap management"
            ],
            "all": [
                "Project manager",
                "Mobile apps (iOS / Android)",
                "B2B SAAS applications",
                "Confluence",
                "JIRA",
                "Strong Product skills",
                "Work with UX design teams",
                "Manage Mobile Agile scrum teams",
                "Strong documentation skills",
                "Competitive analysis",
                "Communication skills",
                "Problem statement articulation",
                "Requirements capture",
                "Product roadmap management"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Pradeep Peddireddy",
        "email": "pradeep@adbakx.com",
        "jd": "From: Pradeep Peddireddy, Adbakx pradeep@adbakx.com Reply to: pradeep@adbakx.com Hi, I hope you are doing great today. Our client is looking to procure qualified candidates for the Mobile Project Manager. Enclosed below is the Job Description for your reference. Kindly forward the resumes of qualified candidates in Word format, Contact details, Submission process format and Skill Matrix for further processing. Job Title: Mobile Project ManagerLocation: Irvine, CA (Dayone Onsite role.. No Remote No Hybrid. Local Consultants only)Duration: 12+ Months ContractHourly rate: 70/C2CNumber of Position: 1Its for Implementation partnerNote: Strictly no OPT’S, CPT and “H1B Transfer candidates” consultants for this role. Required Skills:Around 13+ years of experience as Project managerIdeally should have past experience with Mobile apps ( iOS / Android) / B2B SAAS applicationsStrong Product skills needed, being able to create and manage mobile product roadmap, clearly understand articulate the problem statement, lead discovery of initiatives , capture requirements and create PRD’s.Work with UX design teams, engineering and cross functional teams for solutioning.Responsible for coordination with business stakeholders from C10 countries working through UAT launches, rollouts and post rollout support.Strong communication skillsManage Mobile Agile scrum teams - Manage healthy product backlog, run groomings, sprint planningsStrong documentation skills with Confluence, JIRAResponsible for doing competitive analysis and work with research team to understand the customer needs and create a roadmap based on that.Personality Traits- Product mentality (asks questions, probes to understand the problem statement and the use cases, needs to have a sense of ownership and urgency. Submission process formatFirst Name Middle Name Last Name LinkedIn Contact Number Alternate Contact number Email Address Alternate Email Address Skype Id / Zoom ID Available Start Date Best time to call you in Working hours Your preferred Interview time Slot Work Authorization Visa expire date Highest Qualification Year of Passing University Comfortable working on Dayone onsite in Irvine, CA, USA ? Yes / No :- Last 4 Digits of SSN Total Years of Experience Total U.S.A. Years of Experience Current Location Willing to Relocate (Yes/No) Willing to Travel (Yes/No) Pay Rate (W2/1099/C2C) Profile Sourced from Vendor/Partner company is Consultant on there W2/1099/H1b ? If you not TechM Ex-employee then mention as N/AEx-TechM Employee: If Ex-TechM Employee required ID NO: Reporting Manager: Project name: Exit reason: Last 3 Months' rating: Are you Currently working? Yes/No:Which Date/Month have you done with your Current project? OrWhen is your project going to End?Any possibility of Extension of the Project?When we scheduled the Interview for you and at the same time you got a meeting then which one you preferred? SkillsYears of ExperienceTotal Years of Experience Project manager Mobile apps ( iOS / Android) B2B SAAS applications Work with UX design teams, engineering and cross functional teams for solutioning. Confluence, JIRA product backlog, run groomings, sprint plannings Thanks & Regards Pradeep PeddireddyAdbakxSenior Client Account ManagerCertified Minority Business Enterprise (MBE) │ E-Verify Employer | .",
        "source": "Email",
        "date_posted": "2024-10-25 13:11:30-05:00",
        "unique_id": "192c52000fb447ca",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]