[
    {
        "company": "VDart",
        "job_title": "ServiceNow Technical PM",
        "location": "Denver, CO, USA",
        "full_location": {
            "city": "Denver",
            "state": "CO",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "10-12+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "ServiceNow"
            ],
            "primary": [
                "IT Service Management (ITSM)",
                "ServiceNow implementations",
                "ServiceNow configurations",
                "ServiceNow customizations",
                "ServiceNow integrations"
            ],
            "secondary": [
                "Excellent communication",
                "Interpersonal skills"
            ],
            "all": [
                "Project Management",
                "ServiceNow",
                "IT Service Management (ITSM)",
                "ServiceNow implementations",
                "ServiceNow configurations",
                "ServiceNow customizations",
                "ServiceNow integrations",
                "Excellent communication",
                "Interpersonal skills"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Ramesh M",
        "email": "ramesh.m@vdartinc.com",
        "jd": "Hi , Hope you are doing great! I am currently working on the below opportunity ServiceNow Technical PM. Please let me know your response with resume ServiceNow Technical PMLocation: Denver, CO 80206 – HybridDuration: Contract Job Summary: Seeking an experienced Project Manager with expertise in ServiceNow. The ideal candidate will have a strong background in project management, with a focus on implementing and optimizing ServiceNow solutions. Responsibilities: The Project Manager will be responsible for overseeing the planning, execution, and delivery of ServiceNow project, ensuring they are completed on time, within scope Develop comprehensive project plans outlining tasks, timelines, and resource requirements Lead project teams in the execution of ServiceNow implementations, upgrades, and enhancements Utilize in-depth knowledge of ServiceNow platform capabilities to drive the successful implementation of solutions Collaborate with technical teams to design and implement ServiceNow configurations, customizations, and integrations Communicate effectively with internal and external stakeholders to ensure a clear understanding of project objectives, status, and risks Facilitate regular project status meetings and provide timely updates to key stakeholders Risk Management: Identify potential risks and issues that may impact project delivery and develop mitigation strategies Proactively address and resolve challenges to keep projects on track Implement and enforce best practices for ServiceNow development and configuration Conduct thorough testing and quality assurance to ensure solutions meet the specified requirements Resource Management: Coordinate and allocate resources effectively to meet project demands Provide leadership and guidance to project team members Maintain comprehensive project documentation, including project plans, status reports, and change requests Ensure that all project documentation is up-to-date and accessible Qualifications: The ideal candidate will have a strong background in project management, with a focus on implementing and optimizing ServiceNow solutions 10-12+ years of proven experience as a Project Manager, with a focus on ServiceNow implementation/project management Strong understanding of IT Service Management (ITSM) processes and ServiceNow modules Excellent communication and interpersonal skills",
        "source": "Email",
        "date_posted": "2024-10-25 11:04:22-05:00",
        "unique_id": "192c48c21121048c",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]