[
    {
        "company": "TEK Inspirations LLC",
        "job_title": "AWS Developer",
        "location": "Trenton, NJ, USA",
        "full_location": {
            "city": "Trenton",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "9+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Cloud Application Development",
                "Serverless Computing (AWS Lambda, etc.)",
                "Microservices Architecture",
                "API Development (RESTful)",
                "AWS SDKs and CLI",
                "AWS Services (S3, DynamoDB, API Gateway, File Transfer etc.)",
                "Automation and Scripting",
                "Security Best Practices",
                "Problem-Solving",
                "Testing (Unit, Integration)"
            ],
            "primary": [
                "Programming (Python, Java)",
                "AWS Solution Architect Certification",
                "AWS Sysops Admin Certification"
            ],
            "secondary": [],
            "all": [
                "Cloud Application Development",
                "Serverless Computing (AWS Lambda, etc.)",
                "Microservices Architecture",
                "Programming (Python, Java)",
                "API Development (RESTful)",
                "AWS SDKs and CLI",
                "AWS Services (S3, DynamoDB, API Gateway, File Transfer etc.)",
                "Automation and Scripting",
                "Security Best Practices",
                "Problem-Solving",
                "Testing (Unit, Integration)",
                "AWS Solution Architect Certification",
                "AWS Sysops Admin Certification"
            ],
            "with_experience": [
                "Cloud Application Development",
                "Serverless Computing (AWS Lambda, etc.)",
                "Microservices Architecture",
                "API Development (RESTful)",
                "AWS SDKs and CLI",
                "AWS Services (S3, DynamoDB, API Gateway, File Transfer etc.)",
                "Automation and Scripting",
                "Security Best Practices",
                "Problem-Solving",
                "Testing (Unit, Integration)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Satyajit Nayak",
        "email": "satyajit@tekinspirations.com",
        "jd": "From: Satyajit Nayak, tekinspirations satyajit@tekinspirations.com Reply to: satyajit@tekinspirations.com Job Description -LinkedIn mandatory, Local candidates only with DL, send your expert and get interviewAWS DeveloperTrenton, NJ, 5 Days On-Site6 month contract Exp: 9+ years including all mentioned below. Education background clientMust Have: Cloud Application Development Required 7 YearsServerless Computing (AWS Lambda, etc.) Required 7 YearsMicroservices Architecture Required 5 YearsProgramming (Python, Java) Desired 5 YearsAPI Development (RESTful) Required 7 YearsAWS SDKs and CLI Required 7 YearsAWS Services (S3, DynamoDB, API Gateway, File Transfer etc.) Required 7 YearsAutomation and Scripting Required 7 YearsSecurity Best Practices Required 7 YearsProblem-Solving Required 7 YearsTesting (Unit, Integration) Required 7 YearsAWS Solution Architect Certification Highly desiredAWS Sysops Admin Certification Highly desiredThe AWS Developer will need experience designing, developing, & deploying cloud-native applications on AWS.As an AWS Developer, you will be responsible for designing, developing, and deploying cloud-native applications on the AWS platform. You will work closely with cross-functional teams to build scalable and secure solutions that meet business requirements. The role requires strong knowledge of AWS services, server-less computing, and microservices architecture to build scalable, secure, and efficient applications that leverage the full potential of AWS services. You will play a key role in developing applications that are reliable, efficient, and optimized for performance in a cloud environment.Responsibilities:• Design and develop cloud-native applications using AWS services such as AWS Transfer Family, Glue, Lambda, VPC, DynamoDB, API Gateway, and S3.• Implement serverless architectures and microservices using AWS best practices.• Write clean, maintainable, and efficient code using programming languages such as Python, Node.js, or Java.• Develop and integrate RESTful APIs to support application functionality.• Collaborate with architects, engineers, and product managers to understand requirements and translate them into technical solutions.• Utilize AWS SDKs and tools to integrate with various AWS services and automate workflows.• Ensure applications are secure, scalable, and optimized for performance.• Monitor and troubleshoot application performance and resolve issues as they arise.• Write unit and integration tests to ensure application quality and reliability.• Stay updated on AWS services and emerging cloud technologies to incorporate them into projects.",
        "source": "Email",
        "date_posted": "2024-10-25 16:07:16-05:00",
        "unique_id": "192c5a16fa8a6071",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]