[
    {
        "company": "Sapphire Software Solutions",
        "job_title": "Project Manager",
        "location": "Chicago, IL, USA",
        "full_location": {
            "city": "Chicago",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ months contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [],
            "primary": [],
            "secondary": [],
            "all": []
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Jatin",
        "email": "jatin@sapphiresoftwaresolutions.com",
        "jd": "From: Jatin, Sapphire Software Solutions jatin@sapphiresoftwaresolutions.com Reply to: jatin@sapphiresoftwaresolutions.com Job Title: Project ManagerLocation: Chicago, ILDuration: 12+ months contract Job Description:To manage and ensure that the project schedules are adhered to as per the client specifications and deliveries are as per the time and quality standards for complex or large-scale projects. To oversee quality assurance processes, ensuring adherence to coding standards, implementation of best practices and perform Value creation and KM activities. To ensure process improvement and compliance and participate in technical design discussion and to review technical documents. Responsible for shaping the overall project strategy working closely with stakeholders to define project scope, objectives, deliverables and keeping track of schedule to ensure on time delivery as per the defined quality standards. To work closely with the development team, On-site Engineers to understand technical requirements and work with them to address and resolve technical issues. Identify & flag potential risks and issues that may impact project timelines or quality, develop mitigation strategies / contingency plans to address risks and provide regular project updates to key stakeholders.",
        "source": "Email",
        "date_posted": "2024-10-25 11:12:00-05:00",
        "unique_id": "192c4931f492513c",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]