[
    {
        "company": "Conflux Systems INC",
        "job_title": "Senior Java developer",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party",
                "contract"
            ],
            "job_code": "",
            "experience_required": "12+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "1 year with possible extension",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "J2EE",
                "WebSphere",
                "ASP.Net",
                ".Net 6.0",
                "Java MVC frameworks",
                "Hibernate",
                "SQL",
                "Object Oriented Analysis"
            ],
            "primary": [
                "Angular",
                "React",
                "Micro service",
                "Cloud-based deployment",
                "Junit",
                "Selenium",
                "Cucumber",
                "Maven",
                "Spring Boot"
            ],
            "secondary": [
                "Git",
                "OpenShift",
                "Docker",
                "Kubernetes",
                "Azure DevOps",
                "Jenkins",
                "Visio",
                "Agile",
                "Content Management Knowledge"
            ],
            "all": [
                "Java",
                "J2EE",
                "WebSphere",
                "ASP.Net",
                ".Net 6.0",
                "Angular",
                "React",
                "Java MVC frameworks",
                "Hibernate",
                "SQL",
                "Object Oriented Analysis",
                "Micro service",
                "Cloud-based deployment",
                "Junit",
                "Selenium",
                "Cucumber",
                "Maven",
                "Spring Boot",
                "Git",
                "OpenShift",
                "Docker",
                "Kubernetes",
                "Azure DevOps",
                "Jenkins",
                "Visio",
                "Agile",
                "Content Management Knowledge"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "P Chaitanya",
        "email": "chaitanya.p@confluxsystems.com",
        "jd": "Hi, Hope you're Doing well. Please find the given below job description and let me know if you're interested. Must I need MI DL Copy and Local to Michigan F2F Interview Job Title: Senior Java developer Interviews: In-person interview REQUIRED. Indicate Y/N on coversheet Duration: 1 year with possible extension Position location: Lansing, MI. Hybrid Role with 2 days onsite from day 1 - Tuesday & Wednesday Local candidates ONLY – MI Experience 12+ Years Systems Analyst: The Systems (Technical) Analyst will work with the ORS Development and Operations Teams to analyze the current system architecture and research emerging technologies, system changes, prepare for specifications, configuration of software, program code evaluation and testing. Lead and manage the design, implementation and delivery of system and software architecture designs, strategies and quality assurance plans. Design, prototype, develop and implement to achieve business results for the client. Experienced expert able to lead and deliver the technical documentation of solutions using object-oriented, service-oriented architecture, and n-tier architectures. Documents both the State and industry best practices for software engineering. Leads in the development and documentation of long-term technology strategy and planning for the entire organization leveraging existing and acquiring new resources. Leads and actively participates on project teams’ business by documenting technical requirements in alignment with business needs and requirements, performing analysis, design, development, integration, and maintenance of the ORS technical ecosystem. This position supports the ORS Clarity application, the Employer Self Service (ESS) application, the mi Account application and the Microsoft Dynamics 365 Customer Relationship Management system. Skill Description: Ability to write quality technical specifications (Familiarity with Swagger) Considerable knowledge of Java, J2EE, WebSphere development technologies. ASP.Net, .Net 6.0 or latest version. Flexibility to work with other technologies (i.e., Angular, React, etc.) Experience with design patterns and organizing algorithms Experienced in designing and implementing Java MVC frameworks (Struts MVC) and ORM tool (Hibernate) and Java Script, Web Services and EJB. Experience in developing systems with Microsoft SQL Server (SQL 2016 or higher) Experience writing Structured Query Language (SQL) and stored procedures. Experience performing analysis and requirements gathering with customers. Experience with both web-based and client server-based systems architecture. Experience with Object Oriented Analysis, design and programming experience. Experience with application and database development and access methods. Experience with systems development methodology utilized in the development of new systems and enhancements. Experience with Cort icon Rules Engine technology Experience with WebSphere Liberty Experience with Git Experience with Content Management Knowledge (e.g. FileNet) Experience with Micro service and Cloud-based deployment Experience with Junit, Selenium, Cucumber Experience with Maven Experience with Security Framework, JWT, Oauth, Spring Boot, Batch Framework Experience with OpenShift, Docker and Kubernetes Experience with Azure DevOps, Jenkins Experience creating business process models within the process modeling methodology framework Experience using Visio and process modeling software such as Rational Rose, UML Diagrams, or other tools. Knowledge of Web Services, process automation, batch operations, API, Cloud / Gov Cloud Ability to work and communicate well with all levels of IT project stakeholders Ability to prepare detailed written instructions and technical documentation using industry best practices Ability to work under pressure and tight timelines and diagnose and resolve complex problems quickly. Other technologies as identified through discovery Nice to Have Familiarity with documentation standards Previous SOM Experience Experience with Agile.",
        "source": "Email",
        "date_posted": "2024-10-25 08:47:23-05:00",
        "unique_id": "192c40eb9e453b12",
        "emp_type": [
            "third party",
            "contract"
        ],
        "tag": "Java developer"
    }
]