[
    {
        "company": "Maintec Technologies Inc",
        "job_title": "Enterprise Data Architect",
        "location": "Trenton, NJ, USA",
        "full_location": {
            "city": "Trenton",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "experience_required": "15+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Data Architecture",
                "AWS Cloud Architecture",
                "AWS Glue",
                "Operational Data Modeling Skills",
                "Analytical Modeling Skills",
                "Data Governance",
                "Master Data Management",
                "Information Governance",
                "Metadata Management",
                "Data Cataloging",
                "Data Engineering and ETL",
                "Data Quality",
                "Experience writing in explanatory and procedural styles",
                "Experience in prioritization and multi-tasking"
            ],
            "primary": [
                "AWS Lambda",
                "AWS Storage",
                "AWS RDS",
                "AWS Redshift",
                "AWS DMS"
            ],
            "secondary": [
                "Mainframe Technologies including Cobol, Db2, IMS DB/DC, VSAM, JCL",
                "Knowledge of working in Federal, State and Local Government"
            ],
            "all": [
                "Data Architecture",
                "AWS Cloud Architecture",
                "AWS Glue",
                "Operational Data Modeling Skills",
                "Analytical Modeling Skills",
                "Data Governance",
                "Master Data Management",
                "Information Governance",
                "Metadata Management",
                "Data Cataloging",
                "Data Engineering and ETL",
                "Data Quality",
                "Experience writing in explanatory and procedural styles",
                "Experience in prioritization and multi-tasking",
                "AWS Lambda",
                "AWS Storage",
                "AWS RDS",
                "AWS Redshift",
                "AWS DMS",
                "Mainframe Technologies including Cobol, Db2, IMS DB/DC, VSAM, JCL",
                "Knowledge of working in Federal, State and Local Government"
            ]
        },
        "job_type": [],
        "contact_person": "Reetti Mendratta",
        "email": "reeti@maintec.com",
        "jd": "Hello, Greetings for the day, Hiring for Enterprices Data Architect please share only Local and Independent Visa Holder from Trenton NJ, as soon as possible. Job title: Enterprise Data ArchitectLocation: Trenton, NJOnly Local candidates are considered by the client. Candidate Must have 15 Years Data Architecture and 10 years AWS Cloud Architecture experience.Required Sr Enterprise Architect focusing for building data architecture Frameworks, Standards, and Data Modeling activities defining Conceptual, Logical, Physical Analytical and Canonical models. 10 years Hands on experience of AWS Architecture required.Required Skills• Data Architecture. Required 15 Years• AWS Cloud Architecture. Required 10 Years• AWS Glue/Athena/Storage/Lambda/Data Brew/RDS/ Redshift, DMS. Required 10 Years• Operational Data Modeling Skills. Required 15 Years• Analytical Modeling Skills. Required 15 Years• Data Governance. Required 10 Years• Master Data Management. Required 15 Years• Information Governance. Required 10 Years• Metadata Management. Required 10 Years• Data Cataloging. Required 15 Years• Data Engineering and ETL. Required 15 Years• Data Quality. Required 15 Years• Experience writing in explanatory and procedural styles for multiple audiences Required 15 Years• Experience in prioritization and multi-tasking Required 5 Years Desired Skills• Mainframe Technologies including Cobol, Db2, IMS DB/DC, VSAM, JCL. Desired 5 years.• Knowledge of working in Federal, State and Local Government. Desired 5 years. The enterprise data architect must have a deep understanding of AWS services and cloud infrastructure. This skill set includes proficiency in AWS core services such as EC2, S3, VPC, and RDS, as well as an understanding of advanced services like AWS Lambda, Amazon ECS, and AWS Outposts. Enterprise Data Architect is responsible for designing the blueprint for Client data management framework. Collaborate with Client IT management and other teams to develop a data strategy that meets departmental needs and industry requirements. Create an inventory of the data necessary to build and implement a data architecture. Envision, design data pipelines and how data will flow through the enterprise. Maintain a repository of all data architecture procedures and artifacts. Develop measures that ensure data accuracy, integrity and accessibility. Continually monitor, refine and report data management system performance. He should have strong business and communication skills as well as knowledge to act as a bridge between business operations and IT. of the big data industry. He must work with data engineers to integrate, consolidate, cleanse and structure data for use in analytics applications. Knowledge And Experience• 15+ years of experience in Business/working as a Data Architect, Data Modeler, Data Analyst.• Understand the AWS Cloud Architecture and the basics of its infrastructure.• Hands on Experience and Expertise in using AWS tools: AWS glue, data brew, AWS Lambda, AWS S3, AWS Dynamo DB, AWS RDS, Athena, Redshift, DMS.• Hands on Experience and Expertise in creating and automating Data pipelines using AWS services.• Expertise in Data Management Principles.• Expertise in Master Data Management Principles.• Expertise in Data Governance Concepts.• Expertise in Data Engineering Methodologies.• Expertise in Data Modeling, Solution Architecture, Master Data Management (MDM), Gathering and Systems Analysis in State.• Proficient in, NoSQL, Relational MDM Data Modeling.• Experience in Data Governance with Collibra.• Experienced in working with different Software Development Methodologies. Duties And Responsibilities• Conduct an Assessment of the Current State of Data Systems.• Establish the System of Record and Data Dictionary for Data Systems.• Develop Enterprise Architecture.• Create and construct Conceptual, Logical, and Physical Models.• Facilitate Business Sessions to validate business taxonomy and use cases.• Provide an initial design solution for the core data model and additional forthcoming data structures.• Support project requirements in the modernization of Conceptual, Logical, and Physical Models.• Define the Client architecture across Conceptual, Logical, and Physical layers.• Develop and maintain Conceptual, Logical, and Physical data models utilizing best practices and ensuring optimal query performance.• Optimize and update Conceptual, Logical, and Physical data models to foster a new and secure data environment.• Assist in establishing best practices for standard naming conventions.• Coordinate activities with the EDL team, including developers and testers.• Assist in promoting database objects from lower to higher environments.• Lead design reviews of data models and relevant metadata to ensure consistency.• Recommend opportunities for the reuse of data models across projects.• Consult with Database Administrators regarding the creation of physical data schemas, referential integrity, and the fulfillment of business requirements.• Collaborate with ETL developers, report developers, and end users on effective database utilization.• Guide System Analysts, Engineers, Programmers, and others on project limitations, requirements, interfaces, and system integration challenges and solutions.• Mentor Client team members on all facets of Data Modeling.",
        "source": "Email",
        "date_posted": "2024-10-25 11:32:56-05:00",
        "unique_id": "192c5062efce99b9",
        "emp_type": [
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]