[
    {
        "company": "Intellect Tech Solutions",
        "job_title": "Azure Cloud Solution Architect",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "15+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Azure architecture",
                "Azure DevOps",
                "C#",
                ".NET Core",
                "SQL Server"
            ],
            "primary": [
                "CI/CD pipelines",
                "SSIS",
                "ASP.NET MVC",
                "MuleSoft",
                "Go-Anywhere"
            ],
            "secondary": [
                "Infrastructure Management",
                "Risk Management",
                "Network Understanding",
                "Technical Documentation",
                "Mainframe Migration Strategies"
            ],
            "all": [
                "Azure architecture",
                "Azure DevOps",
                "C#",
                ".NET Core",
                "SQL Server",
                "CI/CD pipelines",
                "SSIS",
                "ASP.NET MVC",
                "MuleSoft",
                "Go-Anywhere",
                "Infrastructure Management",
                "Risk Management",
                "Network Understanding",
                "Technical Documentation",
                "Mainframe Migration Strategies"
            ],
            "with_experience": [
                "Azure architecture (8+ years)",
                "Azure DevOps (8+ years)",
                "C# (6+ years)",
                ".NET Core (6+ years)"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Mansi",
        "email": "mmalipeddi@intellecttechsolutions.com",
        "jd": "From: Mansi, Intellect Tech Solutions mmalipeddi@intellecttechsolutions.com Reply to: mmalipeddi@intellecttechsolutions.com AZURE CLOUD SOLUTIONS ARCHITECTLocation :; RemoteShare resume with 15+ years of expereince. ESSENTIAL FUNCTIONS:Architectural Design: Develop and implement scalable Azure solutions tailored to needs of the Mainframe Transformation project.Technical Expertise: Leverage strong knowledge of Microsoft technologies, including. Core, C#, MS SQL Server, Azure DevOps, and SQL Server Integration Services (SSIS). Collaboration: Work closely with cross-functional teams to ensure seamless integration of Azure solutions with existing systems and applications, including those based on SQL Server, and ASP.NET MVC.DevOps Practices: Design, implement, and maintain CI/CD pipelines using Azu DevOps to automate deployments and streamline development workflows.Custom Integrations: Design and managing custom integrations within Azure Environment enhance application functionality (MuleSoft, Go-Anywhere, SFTP etc.Performance Optimization: Enhance assigned applications, address production issues, and ensure optimal performance of Azure solutions.ETL Processes: Utilize SSIS for developing and maintaining ETL processes to facilitate data migration and transformation between systems. (Nice to have)Infrastructure Management: Maintain Azure infrastructure for both production and non- production environments, ensuring optimal performance and availability. (Nice to have) Risk Management: Construct risk assessments and remediation plans for complex service proposals and advanced technologies.Environment Setup: Utilize Azure templates to create and configure new environments efficiently.Network Understanding: Understand and manage Azure networking concepts to ensure secure and reliable connectivity between resources.Documentation: Prepare and maintain comprehensive technical documentation, including architecture diagrams, process flows, and design specifications.Subject Matter Expert: Act as a trusted advisor for technical services, providing insights and guidance to both internal and external stakeholders.At least six [8] years of hands-on experience in Azure architecture and related technologiesAt least six [8] years of experience in Azure DevOps, including writing CI/CD pipelinesAt six years [6] years of experience in software development using C#At least Six [6] years of experience in .NET Core development, working in a team environmentProven technical leadership skills and ability to effectively communicate technical concepts to non- technical stakeholdersExperience with Microsoft technologies such as Visual Studio, SQL Server, and ASP.NET MVCAbility to analyze customer service requirements and design service solutions to meet those objectivesAbility to troubleshoot and resolve complex technical issuesExperience with PDF generation using iText and familiarity with MuleSoft and Go AnywhereFamiliarity with mainframe migration strategies using SSIS as data transformation tool.Understanding of Azure networking concepts and infra structure maintenance for production and non-production environmentsAbility to create and configure new Azure environments using Azure templatesMeticulous attention to detail with an ability to produce high-quality work in a dynamic environment. Highly organized and able to manage multiple tasks at once and meet deadlinesMeticulous attention to detail with an ability to produce high-quality work in a dynamic environment. Highly organized and able to manage multiple tasks at once and meet deadlinesExtensive skill in effective verbal and written communications with stakeholdersKnowledge of mainframe technologies and systems is a plus.",
        "source": "Email",
        "date_posted": "2024-10-25 11:03:41-05:00",
        "unique_id": "192c48b83bfc0106",
        "emp_type": [
            "third party"
        ],
        "tag": "Azure Data Engineer"
    }
]