[
    {
        "company": "Swift Technologies INC",
        "job_title": "Applications Developer -Dot Net",
        "location": "Seattle, WA, USA",
        "full_location": {
            "city": "Seattle",
            "state": "WA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Senior-level",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "XML",
                "JavaScript",
                "VB.NET",
                "VB6",
                "C#",
                "Microsoft Team Foundation Server (TFS)",
                "Azure DevOps",
                "SQL"
            ],
            "primary": [
                "JSON",
                "WCF",
                "Web Services",
                "Visual Studio (VS)",
                "industry standard software development frameworks",
                "algorithms",
                "design patterns"
            ],
            "secondary": [
                "SQL Reporting Services",
                "Windows Batch Scheduler (TIDAL)",
                "GIT",
                "MVC/MVVM"
            ],
            "all": [
                "XML",
                "JavaScript",
                "VB.NET",
                "VB6",
                "C#",
                "Microsoft Team Foundation Server (TFS)",
                "Azure DevOps",
                "SQL",
                "JSON",
                "WCF",
                "Web Services",
                "Visual Studio (VS)",
                "industry standard software development frameworks",
                "algorithms",
                "design patterns",
                "SQL Reporting Services",
                "Windows Batch Scheduler (TIDAL)",
                "GIT",
                "MVC/MVVM"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "pavan",
        "email": "pavan@swifttechinc.com",
        "jd": "Hello Guy'sHope you are doing good!!Greetings from Swift Technologies INC!Resource Category: Applications Developer -Dot Net Required Resource Level: SeniorLocation: Seattle, WA- Onsite The scope of work includes, but is not limited to, functional software enhancements, technical debt clean-up, bug fixing, estimation, analysis, and validation. This position teams with the project team consisting of technical leads, quality assurance testers, business analysts, business partners, product owner, project manager, and others to complete and accept the solutions developed. The scope of work will also include elicitation and analysis of requirements, documentation, and verification of customer requirements. Work comes into the project team via user stories, bugs, and work order tickets. This person will evaluate the request for completeness, and in collaboration with team members, develop software solutions which meet the objective and intent of the business problem being solved. The developer will create and execute unit tests, create delivery instructions for moving software from the development environment to the quality assurance region and into production. Business Enterprise and Technology Solutions applications are supported by a range of technical skill sets and tools including XML, JavaScript, Classic ASP, .NET 8, VB.NET, VB6, C#, SQL Reporting Services, Windows Batch Scheduler (TIDAL), Microsoft Team Foundation Server (TFS), Azure DevOps, TFVS, GIT, Web Services, SQL, Visual Studio (VS), and MVC/MVVM. Much of the work is accomplished in a scrum delivery model. This resource may need to work with DOL to develop in-scope changes for the project. This may include integration with computer systems from partner agencies, third parties, and internal DOL applications. In addition to the skills needed and outlined in the scope of the work section, they will need to leverage our enterprise service bus to complete development activities. Knowledge, Skills, and Abilities The skillset required to deliver this work includes senior-level experience and knowledge using XML, JavaScript, VB.NET, VB6, C#, Microsoft Team Foundation Server (TFS) and/or Azure DevOps, JSON, WCF, Web Services, SQL, Visual Studio (VS), and industry standard software development frameworks, algorithms, and design patterns. Preferred qualifications include experience analyzing, designing, architecting, and programming computer systems applications or databases.",
        "source": "Email",
        "date_posted": "2024-10-25 12:42:06-05:00",
        "unique_id": "192c4e59a83e7d52",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]