[
    {
        "company": "Pure Imagination Labs",
        "job_title": "Project Manager with Construction management",
        "location": "Salina, KS, USA",
        "full_location": {
            "city": "Salina",
            "state": "KS",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "7-10 years",
            "degree_required": "Bachelor’s degree in Project Management, Construction Management, Engineering or equivalent combination of education and experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Construction Management",
                "Engineering",
                "PMP",
                "PMI-ACP"
            ],
            "primary": [
                "Microsoft Office Suite",
                "Google Workspace",
                "Notion",
                "Smart sheets",
                "JIRA"
            ],
            "secondary": [
                "Organizational skills",
                "Multitasking",
                "Time management",
                "Verbal communication",
                "Written communication"
            ],
            "all": [
                "Project Management",
                "Construction Management",
                "Engineering",
                "PMP",
                "PMI-ACP",
                "Microsoft Office Suite",
                "Google Workspace",
                "Notion",
                "Smart sheets",
                "JIRA",
                "Organizational skills",
                "Multitasking",
                "Time management",
                "Verbal communication",
                "Written communication"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Devyani Kumari",
        "email": "devyani@absoluting.com",
        "jd": "From: Devyani Kumari, Absolute IT devyani@absoluting.com Reply to: devyani@absoluting.com Project Manager with Construction management Job Location: Salina, Kansas Required On-Site: This position is required to be performed full-time at Pure Imagination Labs worksite. Required Residence: This candidate must live or reside in the state of Kansas; or relocate within six (6) months of offered employment. Candidate must have an active and an updated LinkedIn ID with a picture and current location updated (REQUIRED!!) Overview: As a Project Manager at Pure Imagination Labs, you will oversee the entire lifecycle of immersive and interactive projects, from design through construction, technology procurement, deployment, logistics, and integration. You will ensure alignment with creative, technical, and financial objectives while managing teams, vendors, and stakeholders to deliver projects on time, within scope, and on budget. Basic Qualifications: • Bachelor’s degree in Project Management, Construction Management, Engineering is required or equivalent combination of education and experience. • Minimum 7-10 years of experience managing complex projects involving design, construction, technology, and deployment or a similar role. • PMP (Project Management Professional), PMI-ACP, or equivalent certification required. • Solid understanding of construction management principles, logistics, and technology integration. • Proficiency in office software (e.g., Microsoft Office Suite, Google Workspace). Additional Qualifications: • Knowledge with project management tools (Notion, Smart sheets, and JIRA) • Exceptional organizational, multitasking, and time management skills with the ability to prioritize multiple complex projects efficiently. • Strong verbal and written communication skills, with the ability to interact effectively with internal teams, external vendors, and other stakeholders. • Ability to handle sensitive information with confidentiality and professionalism.",
        "source": "Email",
        "date_posted": "2024-10-25 12:25:50-05:00",
        "unique_id": "192c4d6bbcdbd822",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]