[
    {
        "company": "American Express",
        "job_title": "Cloud Database Engineer",
        "location": "Phoenix, AZ, USA",
        "full_location": {
            "city": "Phoenix",
            "state": "AZ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "6+ months",
            "degree_required": "Not specified",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "3 months remote then hybrid",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "DB certifications in cloud Platforms – AWS and/or GCP",
                "Proven experience as a database engineer",
                "Hands-on experience on relational databases",
                "Hands-on experience on NoSQL databases",
                "Experience in designing and implementing database GDHA, HA, DR",
                "DB provisioning automation",
                "Database security including encryption and access controls"
            ],
            "primary": [
                "Scripting languages (Ansible, Python)",
                "Infrastructure-as-code tools (Terraform/AWS Cloud Formation)",
                "Familiarity with DevOps practices and tools for CI/CD"
            ],
            "secondary": [
                "Experience with Active Directory",
                "RBAC",
                "Compliance standards",
                "Experience with enterprise-scale cloud database deployments",
                "Knowledge of DBMS concepts such as ACID, CAP and consistency"
            ],
            "all": [
                "DB certifications in cloud Platforms – AWS and/or GCP",
                "Proven experience as a database engineer",
                "Hands-on experience on relational databases",
                "Hands-on experience on NoSQL databases",
                "Experience in designing and implementing database GDHA, HA, DR",
                "DB provisioning automation",
                "Database security including encryption and access controls",
                "Scripting languages (Ansible, Python)",
                "Infrastructure-as-code tools (Terraform/AWS Cloud Formation)",
                "Familiarity with DevOps practices and tools for CI/CD",
                "Experience with Active Directory",
                "RBAC",
                "Compliance standards",
                "Experience with enterprise-scale cloud database deployments",
                "Knowledge of DBMS concepts such as ACID, CAP and consistency"
            ]
        },
        "job_type": [
            "remote",
            "hybrid"
        ],
        "contact_person": "Muskan Sharma",
        "email": "muskan.sharma@infotechspectrum.com",
        "jd": "Hi, Cloud Database Engineer Location: Phoenix, Arizona 3 months remote then hybrid6 +Months USC/GC/GCEAD/H4EAD (Genuine visa Only) Top skills & qualifications: DB certifications in cloud Platforms – AWS and/or GCPProven experience as a database engineer with hands on experience on relational databases (Cloud SQL, AlloyDB, Spanner, Aurora, Postgres, Oracle) and/or NoSQL databases (Cassandra, MongoDB, DynamoDB, Firestore, Bigtable)Experience in designing and implementing database GDHA, HA, DR, and fault tolerant DB architectures DB provisioning automation, monitoring, and maintenance using scripting languages (Ansible, Python) and infrastructure-as-code tools (Terraform/AWS Cloud Formation) Experience in database security including encryption, access controls, Active Directory, RBAC, and compliance standardsFamiliarity with DevOps practices and tools for continuous integration and deployment (CI/CD) Day-to-day activities: Jira is used for project management DB Engineering team meets on a daily basis to review progress on assigned tasks (see job description for roles and responsibilities) Working independently and with team members with new DB technology and integrated services in AWS and GCP Defining, testing, and documenting standards and best practices, developing runbooks, providing training to developers and DB support teams for new cloud DB technologies, features, and integrated services Help chart the course for database technology at American Express! We need top technical talent to supplement our Database Engineering team. This team selects the operational database technologies American Express will use, and figures out how best to set them up. We define, design, implement, test, and communicate the architectures, configurations, best practices, and standards for optimal use of database technologies across the company, both on-prem and public cloud. We evaluate new database versions, product enhancements, features, components and extensions for performance, throughput, scalability, availability, monitoring, and security; and we partner with our hosting, database administration, and operational support teams to operationalize and harden database technology for our top-tier financial applications. This specific posting is for a software/infrastructure engineer with experience in integrating, deploying and running relational and/or NoSQL databases in AWS and/or GCP. The candidate will put these skills to use by evaluating and preparing new and upgraded cloud database offerings offerings for use across Amex, and by documenting, presenting and explaining the appropriate techniques, patterns and best practices for their use to our application development, database administration, and operational support teams. The candidate will bring solid knowledge of DBMS concepts such as ACID, CAP and consistency. The ideal candidate will have experience with enterprise-scale cloud database deployments, including intra- and inter-data-center high availability configurations, fault tolerance and failover, replication, cluster management, automated provisioning, upgrade techniques, backup & restoration techniques, security mechanisms, health monitoring and alerting techniques, and troubleshooting.",
        "source": "Email",
        "date_posted": "2024-10-25 14:58:41-05:00",
        "unique_id": "192c5e864229ef21",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]