[
    {
        "company": "Triwave Solutions Inc",
        "job_title": "CCATS Project Manager- Child Care",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "At least 12 years of relevant industry experience in the discipline is required.",
            "degree_required": "Bachelor's Degree from an accredited college or university in the specific discipline required by the State. A Master’s Degree or Ph.D. Degree is preferred.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "CCATS application",
                "Communication"
            ],
            "primary": [
                "IT experience",
                "Fit Gap Analysis",
                "Presentation skills"
            ],
            "secondary": [
                "Maryland State procurement"
            ],
            "all": [
                "Project Management",
                "CCATS application",
                "Communication",
                "IT experience",
                "Fit Gap Analysis",
                "Presentation skills",
                "Maryland State procurement"
            ],
            "with_experience": [
                "Project Management",
                "CCATS application",
                "IT experience"
            ]
        },
        "job_type": [],
        "contact_person": "Priyanka Verma",
        "email": "priyanka@triwavesolutions.com",
        "jd": "From: priyanka verma, Triwave Solutions Inc priyanka@triwavesolutions.com Reply to: priyanka@triwavesolutions.com Program/Project Management CCATS Subject Matter ExpertEducation:Bachelor s Degree from an accredited college or university in the specific discipline required by the State. A Master s Degree or Ph.D. Degree is preferred.General Experience:At least 12 years of relevant industry experience in the discipline is required.Specialized Experience:At least ten years of combined new and related older technical experience in the IT field directly related to the required area of expertise.Preferred Experience:a) Certified Project Management Professional by the Project Management Institute requiredb) Experience with the CCATS application requiredc) Excellent verbal and written communication skills requiredd) Experience with Maryland State procurement a pluse) Experience drafting Fit Gap Analysis a plusf) Prior experience preparing and delivering informative, well-organized presentations.Duties:Expertise in information technology, particularly in Child Care. Requires expertise in the formulation of specifications and the execution of technical initiatives in vertical areas. Defines requirements, performs analyses, and develops plans and requirements for systems. Provides technical and administrative guidance and expertise for personnel performing software development tasks related to Child Care management. Must be able to coordinate with the Program/Project Manager and stakeholders to ensure problem solution and user satisfaction. Makes recommendations, if needed, for approval of major systems requirements related to Child Care management. Provide guidance in interpreting, applying, and implementing applicable laws, regulations, policies, and procedures.",
        "source": "Email",
        "date_posted": "2024-10-25 06:28:06-05:00",
        "unique_id": "192c38f365107e60",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]