[
    {
        "company": "Virginia Department of Transportation (VDOT)",
        "job_title": "IT Project Coordinator",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "2+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Permanent",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Microsoft Project",
                "Project Online",
                "Microsoft Planner",
                "MS Excel",
                "MS PowerPoint"
            ],
            "primary": [
                "risk management",
                "quality assurance control",
                "communication skills",
                "collaboration",
                "organizational skills"
            ],
            "secondary": [
                "interpersonal communication",
                "decision making",
                "presentation skills",
                "schedule management",
                "tracking project risks"
            ],
            "all": [
                "Microsoft Project",
                "Project Online",
                "Microsoft Planner",
                "MS Excel",
                "MS PowerPoint",
                "risk management",
                "quality assurance control",
                "communication skills",
                "collaboration",
                "organizational skills",
                "interpersonal communication",
                "decision making",
                "presentation skills",
                "schedule management",
                "tracking project risks"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Vikas",
        "email": "vikas@cyber-resource.com",
        "jd": "itle: IT Project CoordinatorProject Coordinator in the IT Division to organize all types of projects, from simple to complex. Excellent time management and communication skills necessary to coordinate and track the delivery of results ahead of deadlines. Job Description: The Virginia Department of Transportation (VDOT) has an opportunity for a Project Coordinator in our Information Technology Division to administer and organize all types of projects, from simple activities to more complex executive level initiatives. This position is located in Richmond, VA at the VDOT Central Office. To succeed in this role, you should have excellent time management and communication skills which are necessary to collaborate with business partners and internal teams to coordinate and track the delivery of results ahead of deadlines. Position specific responsibilities and duties include, but are not limited to: • Coordinate project activities, resources, equipment and information• Maintain project documentation and respond to progress inquiries queries and reporting.• Monitor project progress and handle any issues that arise.• Act as the point of contact and communicate initiative status to all participants.• Assign tasks to internal teams and assist with schedule management• Capture and track project or initiative risks and mitigations Qualifications:• Strong working knowledge of Microsoft Project, Project Online, and Microsoft Planner• Extensive experience using MS Excel, MS PowerPoint • Familiarity with risk management and quality assurance control• Ability to actively engage in collaborations, transparently share progress, and adapt to evolving guidance• Strong written and verbal communication skills and the ability to collaborate and provide information to all levels of the organization, customers, and 3rd parties• Excellent interpersonal communication, decision making, presentation, and organizational skills• Strong can-do attitude in a time sensitive environment• 2+ years of experience working in a project coordinator or schedular role Reports to: Transformation Architecture Program ManagerWork Location: Primarily remote, but could be asked to attend an occasional on-site meetingWork Hours: 40 hours per week, typically Monday through Friday, 8:30 AM to 5 PM, flexible schedule available SkillRequired / DesiredAmountof Experience2+ years of experience working in a project coordinator or schedular roleRequired2YearsAbility to coordinate project activities, resources, equipment and informationRequired2YearsAbility to maintain project documentation and respond to progress inquiries queries and reportingRequired2YearsExperience monitoring project progress and handling issues that ariseRequired2YearsFamiliarity with risk management and quality assurance controlRequired2YearsStrong can-do attitude in a time sensitive environmentRequired3YearsExtensive experience using MS Excel, MS PowerPointRequired3YearsStrong written and verbal communication skillsRequired3YearsAbility to collaborate and provide information to all levels of the organization, customers, and 3rd partiesRequired2YearsExcellent interpersonal communication, decision making, presentation, and organizational skillsRequired3YearsAbility to assign tasks to internal teams and assist with schedule managementRequired2YearsAbility to capture and track project or initiative risks and mitigationsRequired2Years DescriptionQuestion 1Commonwealth of Virginia security policies prohibit the use of offshore IT contractors. Do you attest to the fact that your candidate will physically reside within the US for the duration of the assignment?Question 2Please list candidate's email address.",
        "source": "Email",
        "date_posted": "2024-10-25 13:33:08-05:00",
        "unique_id": "192c51452bdaaaf3",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]