[
    {
        "company": "Tek Inspirations",
        "job_title": "Senior .NET Developer",
        "location": "Milwaukee, WI, USA",
        "full_location": {
            "city": "Milwaukee",
            "state": "WI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "8-10 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 months+",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "C#",
                ".NET Core",
                "ASP.NET Core",
                "Angular",
                "React",
                "SQL",
                "REST API",
                "Microsoft Azure"
            ],
            "primary": [
                "NPM",
                "Entity Framework",
                "Unit Testing",
                "Continuous Integration",
                "Automating Deployment Pipelines"
            ],
            "secondary": [
                "Experience with security data/providers",
                "Building technology solutions for a trading desk",
                "Agile methodologies",
                "Creative problem solving",
                "Process improvement"
            ],
            "all": [
                "C#",
                ".NET Core",
                "ASP.NET Core",
                "Angular",
                "React",
                "SQL",
                "REST API",
                "Microsoft Azure",
                "NPM",
                "Entity Framework",
                "Unit Testing",
                "Continuous Integration",
                "Automating Deployment Pipelines",
                "Experience with security data/providers",
                "Building technology solutions for a trading desk",
                "Agile methodologies",
                "Creative problem solving",
                "Process improvement"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Aditi Sikarwar",
        "email": "aditi.sikarwar@tekinspirations.com",
        "jd": "Need Candidates on PV W2 Senior .NET DeveloperNeed Only investment bank and financial services Domain experience candidatesMilwaukee or Madison, WI (Need only Local candidates)HybridPhone/Skype Pv Note : This client is picky and will interview in-depth. They need a senior developer not mid-level. Need minimum 8-10 years’ experience candidates With excellent communications skills and hand on experience with below skills A Senior .NET Developer for a 12 month+ role with a financial services company with a reputation for being ranked as one of the best companies to work for. The is role requires hybrid model onsite in Milwaukee. The developer will primarily be focused on developing a greenfield application used by our Sales & trading desks. In addition, the person will also gain experience supporting existing applications and integrationsTechnical Profile:Proficient in C# and .NET CoreStrong front-end development skills with experience in web development frameworks (ASP.NET Core, Angular, React, etc.) and tools (NPM)Strong SQL skills (Ability to interact with databases using SQL, entity framework, or other ORM)Background developing REST API servicesExperience with on-prem infrastructure and cloud platforms, especially Microsoft AzureExperience writing unit testsExperience with continuous integration and automating deployment pipelinesPreferred: Experience working with security data/providers (ex. Bloomberg) and/or experience building technology solutions for a trading desk.Qualities needed for any of this role:Good communicator who wants to work in a team environment, comfortable performing pair programmingAnalytical – not afraid to dive into complex code and data to troubleshoot issuesSelf-Motivated – Someone who is willing to look for how to add value even if a specific task isn’t assigned.Creative problem solver who is automation focused – we’re looking to not have recurring work come back to us, but to better automate or teach/train users for self serviceMotivated by small quick wins and process improvementComfortable working in an agile environment. Prefer experience working in agileBenefits of client:Long-term contract with potential for extended renewalsTeam focused environment. We treat our consultants as part of the team.Rich developer community with lunch & learns on best practices. Focus on software artisanship.DevOps culture. We use automated deployment and are constantly looking to improve in the DevOps space. Our DBAs/App Admins are part of our collaboration.Agile/lean practices with diversity of projectsAbout our Client—Our client is a multinational independent investment bank and financial services company with a reputation for being ranked as one of the best companies to work for",
        "source": "Email",
        "date_posted": "2024-10-25 09:34:45-05:00",
        "unique_id": "192c43c17121c7d4",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]