[
    {
        "company": "Tek Inspirations LLC",
        "job_title": "Sr. Project Manager (Cash Application)",
        "location": "Columbus, OH, USA",
        "full_location": {
            "city": "Columbus",
            "state": "OH",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "4-6 years",
            "degree_required": "Bachelor’s degree or equivalent work experience required",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Budget Management",
                "Risk Management",
                "Cross-functional Team Collaboration",
                "Critical Thinking"
            ],
            "primary": [
                "Manufacturing Experience",
                "SaaS Applications Implementation",
                "Finance-related Projects",
                "Change Management",
                "Process Improvement"
            ],
            "secondary": [
                "PMP Certification",
                "Supply Chain Management",
                "Master Data Management",
                "R&D Collaboration",
                "Procurement Collaboration"
            ],
            "all": [
                "Project Management",
                "Budget Management",
                "Risk Management",
                "Cross-functional Team Collaboration",
                "Critical Thinking",
                "Manufacturing Experience",
                "SaaS Applications Implementation",
                "Finance-related Projects",
                "Change Management",
                "Process Improvement",
                "PMP Certification",
                "Supply Chain Management",
                "Master Data Management",
                "R&D Collaboration",
                "Procurement Collaboration"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Inder Negi",
        "email": "inder.negi@tekinspirations.com",
        "jd": "From: Inder, Tek Inspirations inder.negi@tekinspirations.com Reply to: inder.negi@tekinspirations.com Title: Sr. Project Manager (Cash Application)Location: Hybrid-Columbus, OHVisa: USC/GC/GC-EAD/H4-EADMOI: Phone then video Must have LinkedIn Profile and Must have Manufacturing experience The Sr. Project Manager will manage the execution of projects in a CPG/food manufacturing space. This individual will also be responsible for overseeing the timelines, budget, and deliverables of complex, high-impact projects. The successful candidate will collaborate effectively with cross-functional teams, stakeholders (internal and external), demonstrate the ability to create clarity for project teams and stakeholders, demonstrate critical thinking skills, and coordinate project teams to drive results.Responsibilities:Responsible for project management of complex, high-impact projects, inclusive of overseeing timeline, budget, resources, and risk management. Facilitates the initiation, planning, execution, and closure process.Coordinates and manages work teams consisting of project team members and internal/external stakeholders.Accountable for achieving project milestones.Is able to effectively escalate issues and requests for additional support.Conduct regular risk assessments and adapts project plans as necessary.Communicates status of projects to project stakeholders.Leads project closing activities, including transition planning and execution, allowing for the sharing of best practices, and capturing of key learnings.Facilitates decision making within project team and stakeholders.Contributes to program goals, objectives, and deliverables in alignment with organizational priorities.Assists project owner in chartering the project.Accountable for the delivery of project charter and documentation of requirements inclusive of testing and qualification of solutions that link back to the project requirements in the scope of deliverables.Manages project financials, including budget, forecast, and actuals tracking.Supports change management process.Accountable for project gating procedure by maintaining all documentation for projects.Identifies, recommends, and leads opportunities for process improvement.Mentors and coaches project managers and team members to enhance skills and performance.Commercialization specification: Facilitates the set-up of all commercialization master data, working with Master Data Management, R&D, Procurement, Finance and Sales.Qualifications:Bachelor’s degree or equivalent work experience required.4-6 years of relevant experience in a project management role, preferably in a CPG/food manufacturing environment.Experience with implementing large, complex SaaS applicationsExperience in Finance-related projects with the High Radius application preferredSupply Chain specification: 5+ years of relevant experience in manufacturing and supply chain environment preferred.PMP certification preferred.",
        "source": "Email",
        "date_posted": "2024-10-25 15:10:03-05:00",
        "unique_id": "192c5e474f06dfc5",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]