[
    {
        "company": "Technocraft solutions",
        "job_title": "Senior Project manager (Only Locals)",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "136641",
            "experience_required": "10 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Agile Leadership",
                "Microsoft DevOps",
                "Project Management"
            ],
            "primary": [
                "Budget Management",
                "Technology Integration",
                "Vendor Management"
            ],
            "secondary": [
                "SOM Experience",
                "Communication Skills",
                "Team Leadership"
            ],
            "all": [
                "Agile Leadership",
                "Microsoft DevOps",
                "Project Management",
                "Budget Management",
                "Technology Integration",
                "Vendor Management",
                "SOM Experience",
                "Communication Skills",
                "Team Leadership"
            ],
            "with_experience": [
                "Agile Leadership (5 years)",
                "Project Management (10 years)",
                "Microsoft DevOps (2 years)"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Harsh Tiwari",
        "email": "harsh.tiwari@technocraftsol.com",
        "jd": "From: Harsh Tiwari, Technocraft solutions harsh.tiwari@technocraftsol.com Reply to: harsh.tiwari@technocraftsol.com Job Title: Senior Project manager (Only Locals)Job ID: 136641 (Hybrid)Location: Lansing, MI (DTMB)Duration: 12 Months Note***Interviews: MS Teams video interview with camera ON.Position location: Lansing, MI. Hybrid Role with 2 days onsite from day 1 – Tuesday and WednesdayLocal ONLY Top Skills & Years of Experience Required:• 5 years of experience managing projects with budgets greater than $5 million.• 5 years Agile Leadership Experience (document in resume)• 10 years of experience as a project manager (must be last position)• 2 years Microsoft DevOps Experience• Experience working with other project managers to ensure technology integration between systems• Previous SOM experience highly desired Requested experience: 5 years of experience managing projects with budgets greater than $5 million. 5 years Agile Leadership Experience (document in resume) 10 years of experience as a project manager (must be last position) Microsoft DevOps Experience Experience working with other project managers to ensure technology integration betweensystems Must be local to Lansing, Michigan area. Work will be 2 days per week in office and 3 daysremote. Previous SOM experience highly desired. This Project Manager will be responsible for a $20 million modernization project, which will be highlycomplex, require extensive change and vendor management skills, and experience with MicrosoftDevOps.General responsibilities: Designs, plans, and coordinates work teams. Follows standard project management industrypractices such as the PMI’s framework. Understands business and technical objectives of aproject and works closely with project sponsor. Creates project charter and work plan and tracksbudget and schedule progress via appropriate metrics. Establishes project organization andmethodologies and defines roles and responsibilities. Documents risks and develops mitigationplans. Manages scope. Creates and implements a communication plan. Builds an effective team,assigns tasks to team members, and evaluates outcomes. Negotiates resources. Communicatesto stakeholders and project sponsor. Identifies, tracks, and ensures resolution of issues andremoval of barriers. Provides technical support to project members. Handles complexapplication features and technical designs. Designs and implements the components requiredfor complex application features. Generally manages a group of applications system analysts.Relies on experience and judgment to plan and accomplish goals. Professional certification ishighly desirable. May require specific PC, workstation, operating system, application or platform skills. Providesoverall direction to the formulation, development, implementation, and delivery of a project.Exercises management responsibility over the achievement of performance, revenue, and profitobjectives of a project and its contracts. Ensures that the project plan maintains tasks,schedules, estimates, and status, and disseminates information to team members andcustomers. Creates a structure and organization for the management of a complex environmentwith emphasis on quality, productivity, and consistency. Directs corrective actions in any areawhere performance falls below objectives. Arranges for the assignment of responsibility to othersupporting facilities, business areas, and support functions, and monitors their performance.Self-directed and independent. Responsible for the coordination and completion of projects.Oversees all aspects of projects. Sets deadlines, assigns responsibilities, and monitors andsummarizes progress of project. Prepares reports for upper management regarding status of project.",
        "source": "Email",
        "date_posted": "2024-10-25 10:31:29-05:00",
        "unique_id": "192c46f4261108bc",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]