[
    {
        "company": "Source Infotech Inc",
        "job_title": "Workday HCM, Payroll, Comp, Time, Benefits",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "1+ years",
            "degree_required": "Bachelor's degree",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ months contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Workday HCM",
                "Payroll",
                "Excel"
            ],
            "primary": [
                "Exceptional written and verbal communication skills",
                "Strong analytical skills",
                "Ability to synthesize multiple sources of data/information"
            ],
            "secondary": [
                "Active listening skills",
                "Flexibility and adaptability",
                "Problem solving and root cause analysis skill"
            ],
            "all": [
                "Workday HCM",
                "Payroll",
                "Excel",
                "Exceptional written and verbal communication skills",
                "Strong analytical skills",
                "Ability to synthesize multiple sources of data/information",
                "Active listening skills",
                "Flexibility and adaptability",
                "Problem solving and root cause analysis skill"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Abhisek Kumar",
        "email": "abhisek.k@sourceinfotech.com",
        "jd": "From: abhisek, source infotech abhisek.k@sourceinfotech.com Reply to: abhisek.k@sourceinfotech.com Title: Workday HCM, Payroll, Comp, Time, BenefitsLocation: 100% RemoteDuration: 6+ months contractIV: Phone and VideoVisa: No H1b/CPT We are hiring a Business Analyst to join our project team. The Project Management Office is looking for individuals to join the PMO as a resource to be assigned as needed. Assignment can be with any department within the state of Maine, dependent on need. You will report directly to the project management office. Your main tasks will include performing detailed requirements analysis, documenting processes, and performing some user acceptance testing. As a key contributor to the State of Maine Workday implementation it is imperative that you establish high quality standards and lead by example. Top 3 Skills: 1+ years of experience with Workday HCM and/or Payroll.Exceptional written and verbal communication skills.Ability to synthesize multiple sources of data/information and compile into a cohesive presentation.State government employment is ALWAYS preferred. Especially Maine government! Key Responsibilities:Monitoring/Supporting/Researching Data Quality/Data Cleanup with StakeholdersData ValidationTicket Management (JIRA)Eliciting, analyzing, documenting, validating, and communicating business requirementsGeneral project documentation (i.e. meeting notes, drafting proposals)General support through testing phases: researching issues, providing guidance on defect resolutionOther Project Support tasks as identified Required Skills: Exceptional written and verbal communication skillsStrong analytical skillsProficient with Excel (VLOOKUP's, pivot tables, concatenations, etc.)Excellent active listening skillsAbility to clearly articulate messages to various audiencesActive listening skillsAbility to influence othersFlexibility and adaptability; ability to work in ambiguous situations at all levels of the organizationProblem solving and root cause analysis skillAbility to synthesize multiple sources of data/information and compile into a cohesive presentation Minimum Qualifications: Bachelor's degreeThanks & RegardsAbhisek kumarSource Infotech IncP.O Box 577, EDISON, NJ 08818-0577Email: abhisek.k@sourceinfotech.comPhone: 609-934-3412 | | Hangout: abhishekchoudhary0948",
        "source": "Email",
        "date_posted": "2024-10-25 08:57:18-05:00",
        "unique_id": "192c43a17dfe07c2",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]