[
    {
        "company": "Appian Infotech",
        "job_title": "Azure Cloud Computing Services with Azure API",
        "location": "Phoenix, AZ, USA",
        "full_location": {
            "city": "Phoenix",
            "state": "AZ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5-7 years",
            "degree_required": "Bachelor's or Master's in Computer Science, Engineering, or related fields",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Cloud Computing",
                "Azure Services",
                "Data Modeling",
                "ETL Processes",
                "Data Warehousing"
            ],
            "primary": [
                "Azure Computing",
                "Angular",
                "C#",
                "HTML",
                "SQL",
                "PowerApps",
                "API",
                "Python",
                "Scala",
                ".NET"
            ],
            "secondary": [
                "Problem-Solving",
                "Collaboration",
                "Azure Data Engineer Certification",
                "Azure Solutions Architect Certification"
            ],
            "all": [
                "Cloud Computing",
                "Azure Services",
                "Data Modeling",
                "ETL Processes",
                "Data Warehousing",
                "Azure Computing",
                "Angular",
                "C#",
                "HTML",
                "SQL",
                "PowerApps",
                "API",
                "Python",
                "Scala",
                ".NET",
                "Problem-Solving",
                "Collaboration",
                "Azure Data Engineer Certification",
                "Azure Solutions Architect Certification"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Abhishek Choudhary",
        "email": "abhishek.c@appianinfotech.com",
        "jd": "From: Abhishek Choudhary, Appian Infotech abhishek.c@appianinfotech.com Reply to: abhishek.c@appianinfotech.com Job Title: Azure Cloud Computing Services with Azure APILocation: Phoenix, ArizonaDuration: Long term Contract W2_C2C Job Description (Posting).Mandatory Skills:1.Cloud Computing and Azure Services Proficiency: A deep understanding of cloud computing concepts is crucial. You should be proficient in Azure services, including: Azure Computing, Angular, C#, HTML, SQL, PowerApps, API ; Azure Tech (AKS, Function Apps, KQL, ADF).2. Data Modeling and Database Management: a. Designing effective data models is essential. You'll work with both SQL and NoSQL databases. b. Ensure data is structured and stored optimally for efficient querying and analysis.3. ETL (Extract, Transform, Load) Processes: a. Proficiency in ETL techniques is vital for data integration and processing. b. Extract, transform, and load data efficiently to support analytics and reporting.4.Programming Languages: a. Familiarity with programming languages such as C# , Python, Scala, and .NET is valuable. b. Python, in particular, is widely used for data manipulation and analytics.5.Data Warehousing and Data Lakes: Understand data warehousing concepts and data lakes. These are fundamental for managing large-scale data.6.Problem-Solving and Collaboration: Soft skills matter too! Effective problem-solving and teamwork enhance your ability to drive data-driven decisions.Desired Experience :-1. Overall 5- 7+ years of Data warehousing experience, including:- 1.Minimum of 5 years of experience in Azure Computing, Angular, C#, HTML, SQL, PowerApps, API.2.Education: Relevant degree (Bachelor's or Master's) in Computer Science, Engineering, or related fields. 3.Certifications: Consider certifications related to Azure (e.g., Azure Data Engineer, Azure Solutions Architect). 4.Experience: Proficiency in designing, implementing, and managing data solutions on the Azure cloud platform.a. To develop and deliver ,detailed solutions through consulting project activitiesb. To perform qualitative and/or quantitative analyses to assist in the identification of client issues and the development of client-specific solutionsc. To coordinate with Internal and external stakeholders to ensure effective deliver of client specific solutiond. To design, structure and deliver reports and presentations that are appropriate to the characteristics or needs of the audiencee. To cultivate successful customer relationships. Other RequirementRole-Azure Cloud Developer with experience in Angular, C#, HTML, SQL, PowerAppsLocation-ONSITE ROLE in PHOENIX, AZ (NO REMOTE Option) -- Thanks & Regards Abhishek Choudhary(Technical Recruiter)Appian Infotech Inc.Email- abhishek.c@appianinfotech.comLinkedIn: https://www.linkedin.com/in/abhishek-c-778a3a193/Website - www.appianinfotech.com",
        "source": "Email",
        "date_posted": "2024-10-25 12:29:25-05:00",
        "unique_id": "192c55129c5a1c17",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Azure Data Engineer"
    }
]