[
    {
        "company": "Nukasani Group",
        "job_title": "Project Manager 4 Scrum Master",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10-12 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Best competitive rate"
        },
        "skills": {
            "core": [
                "Scrum",
                "Kanban",
                "Agile project management",
                "Project Management Professional (PMP)",
                "Certified Scrum Master (CSM)"
            ],
            "primary": [
                "Microsoft Project",
                "Visio",
                "MS Office",
                "Team Foundation Server",
                "JIRA",
                "Version One"
            ],
            "secondary": [
                "Software development life cycle models",
                "Interpersonal skills",
                "Analytical skills",
                "Organizational skills",
                "Decision-making skills",
                "SAFe framework"
            ],
            "all": [
                "Scrum",
                "Kanban",
                "Agile project management",
                "Project Management Professional (PMP)",
                "Certified Scrum Master (CSM)",
                "Microsoft Project",
                "Visio",
                "MS Office",
                "Team Foundation Server",
                "JIRA",
                "Version One",
                "Software development life cycle models",
                "Interpersonal skills",
                "Analytical skills",
                "Organizational skills",
                "Decision-making skills",
                "SAFe framework"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Nancy",
        "email": "recruiter5@nukasanigroup.com",
        "jd": "Dear Partner, Good Morning, Greetings from Nukasani Group Inc! We have below urgent long-term contract project immediately available for Project Manager 4 Scrum Master, Richmond, VA, Hybrid. Need submissions you please review the below role, if you are available, could you please send me updated word resume, and below candidate submission format details, immediately. If you are not available, any referrals would be greatly appreciated. Interviews are in progress, urgent response is appreciated. Looking forward for your immediate response and working with you. Candidate Submission Format - needed from you Full Legal Name Personal Cell No ( Not google phone number) Email Id Skype Id Interview Availability Availability to start, if selected Current Location Open to Relocate Work Authorization Total Relevant Experience Education./ Year of graduation University Name, Location Last 4 digits of SSN Country of Birth Contractor Type DOB: mm/dd Home Zip Code Assigned Job Details Job Title: Project Manager 4 Scrum Master Location: Richmond, VA, Hybrid Rate: Best competitive rate *local candidates required *candidate should be able to work onsite up to 3 days/week *please do not submit candidates who were submitted to previous VDOT PM Scrum Master reqs • Drives consistent project delivery through the entire project lifecycle, including project plans, release plans, resource allocation, and management of project risks, scope, schedule, and delivery of value. • Coordinates Agile Ceremonies such as Sprint Planning, Daily Standups, Retrospectives, Sprint Demos, Story Refinement, and Release Planning. • Tracks and communicates project's progress from a schedule, cost, and risk perspective to the project team, stakeholders, and management. • Establishes an environment where the teams can be effective and helps removing obstacles. • Protects the team from outside interruptions and distractions. • Ensures a good relationship between the team and product owner as well as others outside the team. • Tracks and reports team velocity and other project metrics. • Promotes continuous improvement and helps teams to increase productivity. • Helps Product Owner and team with Product backlog management. • Ensures the teams are practicing core Agile principles. • Adheres to VDOT and VITA project management practices as defined. • Additional responsibilities as assigned. Knowledge, Skills, and Abilities: • Solid understanding of software development life cycle models as well as expert knowledge of Agile project management principles and practices. • Ability to work with customers, understand their business practices and manage their expectations. • Ability to set clear performance standards and hold team members accountable, while keeping team engaged and on track. • Ability to help Product Owners to create and prioritize Product Backlog. • Strong interpersonal skills including mentoring, coaching, collaborating, and team building. • Strong analytical, organizational and decision-making skills. • Ability to analyze and document business and system processes. • Ability to balance the competing demands for quality, scope, schedule, and cost. • Well-versed with Scrum and Kanban Agile methodologies. • Expertise with Project Management tools such as Microsoft Project, Visio, and MS Office. • Experience with Agile collaboration tools such as Team Foundation Server, JIRA, Version One, etc. • PMP and CSM Certifications required. • Experience with SAFe framework required. • SAFe Certification preferred.",
        "source": "Email",
        "date_posted": "2024-10-25 07:18:51-05:00",
        "unique_id": "192c3bdaf848fb9e",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]