[
    {
        "company": "Birlasoft",
        "job_title": "Sr. Lead Business Analyst",
        "location": "Houston, TX, USA",
        "full_location": {
            "city": "Houston",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Must have existing work authorization",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SQL",
                "PowerBI",
                "Tableau",
                "Excel"
            ],
            "primary": [
                "Business Analysis",
                "Data Analysis",
                "Requirements Elicitation",
                "Technical Requirements Analysis"
            ],
            "secondary": [
                "Manufacturing",
                "Supply Chain",
                "ERP (Oracle EBS, JDE)",
                "Data Visualization",
                "Dashboards",
                "KPIs",
                "Ad-hoc Reporting"
            ],
            "all": [
                "SQL",
                "PowerBI",
                "Tableau",
                "Excel",
                "Business Analysis",
                "Data Analysis",
                "Requirements Elicitation",
                "Technical Requirements Analysis",
                "Manufacturing",
                "Supply Chain",
                "ERP (Oracle EBS, JDE)",
                "Data Visualization",
                "Dashboards",
                "KPIs",
                "Ad-hoc Reporting"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Kranthi",
        "email": "kranthi@propelsys.com",
        "jd": "From: Kranthi, Propelsys kranthi@propelsys.com Reply to: kranthi@propelsys.com Full time role with Birlasoft Role: Sr. Lead Business Analyst Location: Houston TX (On-site) Position type: Full time Experience 10+ Visa USC GC Linkedin ID must Job Description Documents current and emerging business needs and works with internal and external service providers to define and deliver data and analytics solutions. Participates in sessions to gather business context from Product Owners, analyze, document findings. Documents business requirements, user stories, and technical requirements. Collaborates with internal customers to ensure user requirements are complete and concise, confirming that changes and enhancements meet technical specifications and user requirements. Performs data analysis on different data sources, consolidating multiple data sets and analyzing the data accurately and efficiently. Performs business process analysis to define how data and analytic solutions should be configured to meet those needs. Strong knowledge of SQL, BI Reports and develop ad-hoc analysis within PowerBI, Tableau, Excel, and other applications. Proven experience with business and technical requirements analysis, elicitation, modeling, verification, and methodology development. Maps current processes to the desired state and identifies gaps such as program functions, output requirements, input requirements and sources, data conversion strategies, and system techniques and controls. Assists with the development of test designs and develops test cases. Provide guidance in analytics reporting involving scorecards, dashboards, KPIs, and adhoc reports. 5+ years of experience as a highly technical Business Analyst, or Business Systems Analyst supporting data and analytic software development projects. Required Functional expertise in Manufacturing/ Supply Chain functional area using ERP (Oracle EBS, JDE etc.) Leverage a solid understanding of data structures, domain specific knowledge, and the end-user experience to impact the final data visualization product, which includes dashboards, reports, insights, or analyses.",
        "source": "Email",
        "date_posted": "2024-10-25 09:42:07-05:00",
        "unique_id": "192c442877c05579",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]