[
    {
        "company": "Stellar IT Solutions",
        "job_title": "Laboratory Applications Analyst",
        "location": "Charlotte, NC, USA",
        "full_location": {
            "city": "Charlotte",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "experience_required": "3-5 years",
            "degree_required": "Bachelor’s degree in Computer Science, Information Technology or equivalent education and experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Meditech build",
                "testing and implementation experience",
                "laboratory processes",
                "workflow analysis",
                "application analysis"
            ],
            "primary": [
                "Enhancements",
                "Teamwork",
                "Workflows",
                "Healthcare",
                "Design",
                "Integration",
                "Management Process",
                "Project Implementation",
                "System Testing",
                "Technical Support",
                "Unit Testing",
                "Version Control",
                "Written Communication",
                "Business Analyst",
                "Systems Analyst",
                "Subject matter expertise"
            ],
            "secondary": [],
            "all": [
                "Meditech build",
                "testing and implementation experience",
                "laboratory processes",
                "workflow analysis",
                "application analysis",
                "Enhancements",
                "Teamwork",
                "Workflows",
                "Healthcare",
                "Design",
                "Integration",
                "Management Process",
                "Project Implementation",
                "System Testing",
                "Technical Support",
                "Unit Testing",
                "Version Control",
                "Written Communication",
                "Business Analyst",
                "Systems Analyst",
                "Subject matter expertise"
            ]
        },
        "job_type": [
            "remote",
            "onsite"
        ],
        "contact_person": "Aravind",
        "email": "aravindr@stellarit.com",
        "jd": "From: Aravind, StellarIT Solutions aravindr@stellarit.com Reply to: aravindr@stellarit.com Hi, This is Aravind form Stellar IT Solutions! You intrigued us in your profile; hence I have a Great Opportunity for you with our direct client so kindly view the below job description and let me know your interest to proceed further.Role: Laboratory Applications AnalystLocation: Charlotte, NCJob description:Looking for Meditech with experience building the application (building orders, maintaining ref lab etc). Must have laboratory processes and workflows experience Meditech build, test and implementation experience. Open to remote option.SKILL CATEGORY: EMR / EHS REQUIRED SKILLS:Enhancements, Teamwork, Workflows, Healthcare, Design, Integration, Management Process, Project Implementation, System Testing, Technical Support, Unit Testing, Version Control, Written Communication, Business Analyst, Systems Analyst, Subject matter expertise, Meditech Laboratory Applications AnalystJob Description:The Meditech Laboratory Applications Analyst is responsible for reviewing, analyzing, evaluating, and developing clinical Meditech application tools to meet customer needs; support project implementation activity; document requirements and define scope and objectives. The Analyst’s primary goal is to build and maintain laboratory orders and related functionality for a reference lab interface. Strong communication and teamwork skills are required. This position works under general supervision.Primary Responsibilities:Design, Develop and maintain Lab Orders and related functionality in Meditech Client/Server EHR.Responsible for building and maintaining Laboratory tests/orders.Responsible for building and maintaining Laboratory functionality, including but not limited to service resource modifications, reference ranges, labels, scanning devices, medical device interfaces along with aliasing and error codes.Provide end-user support for hospital applications and systems.Support and maintain Meditech application dictionaries and configurations.Provide technical support for various external interfaces and integrations to 3rd party systems and partner sites.Review, schedule, test, implement and document any system modifications, upgrades or application changes.Troubleshoot system issues to resolution and provide timely and high-quality customer service.Escalate issues to vendor as needed and monitor vendor tickets for resolution.Work with client users and functional teams as needed.Adheres to change management process for break fix and any system changes.Performs system testing to ensure that all product functions work as designed.Assist in documenting detailed description of user needs, program functions and steps required to develop or modify computer programs.Documents all build activities in conjunction with updating vendor provided applications specifications and perform integration and unit testing; adhere to version control processes.Experience collecting user requirements, translating to system feature enhancements, and requesting enhancements of a system administrator.Ability to evaluate and analyze EHR features and functionality for problem resolution.Provide support for the correct operational and clinical processes aligned with client’s best practices.May exercise independent judgment to determine the appropriate course of action to be taken based on the analysis performed and all possible solutions.Successfully engages in multiple initiatives simultaneously.Excellent verbal and written communication skills and the ability to interact professionally with a diverse group, executives, managers, and subject matter experts.Maintains a positive work atmosphere by behaving and communicating in a manner that promotes a favorable working relationship with customers, clients, co-workers and management.Other duties as assigned.Knowledge, Skills and Abilities (KSAs):Meditech build, testing and implementation experience.A minimum of three (3) years of application analysis and coordination experience, OR five (5) years of professional/technical experience in health care involving clinical workflow/operations or clinical systems support preferred.Knowledge of Laboratory processes and workflows required.Experience building and supporting Meditech Client/Server Laboratory modules.Experience with Meditech Client/Server 5.67 a plus.Excellent troubleshooting skills, with the ability to communicate resolutions to customers.Excellent communication, interpersonal, and organization skills.Excellent client, vendor, project team, and employee relationship skills.Well-developed analytical, problem-solving, and multi-tasking skills.Strong work ethic, team and customer service orientation, proven dependability and promptness.",
        "source": "Email",
        "date_posted": "2024-10-25 11:12:01-05:00",
        "unique_id": "192c4b22bffaa268",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]