[
    {
        "company": "DMS Visions, INC",
        "job_title": "GCP full stack developer | Solutions Developer",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Bachelor's or Masters in Computer Science or Engineering",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "12-months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Google Cloud Platform (GCP)",
                "Java",
                "JavaScript",
                "HTML5",
                "CSS"
            ],
            "primary": [
                "BIM 360 API",
                "Autodesk Construction Cloud (ACC)",
                "Google Drive API",
                "App Engine",
                "Apps Script",
                "CloudSQL",
                "BigQuery"
            ],
            "secondary": [
                "TypeScript",
                "Angular",
                "CMS development",
                "Document libraries and interfaces",
                "AODocs API",
                "End-to-end IP lifecycle management",
                "Construction documentation"
            ],
            "all": [
                "Google Cloud Platform (GCP)",
                "Java",
                "JavaScript",
                "HTML5",
                "CSS",
                "BIM 360 API",
                "Autodesk Construction Cloud (ACC)",
                "Google Drive API",
                "App Engine",
                "Apps Script",
                "CloudSQL",
                "BigQuery",
                "TypeScript",
                "Angular",
                "CMS development",
                "Document libraries and interfaces",
                "AODocs API",
                "End-to-end IP lifecycle management",
                "Construction documentation"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Akhilesh",
        "email": "akhilesh@dmsvisions.com",
        "jd": "From: Akhilesh, DMS VISIONS akhilesh@dmsvisions.com Reply to: akhilesh@dmsvisions.com Hi,Hope you are doing well,This is a contract position, Please share with me Updated resume of yours or your consultant if the profile matches this requirement. GCP full stack developer/Solutions DeveloperLocation: 100% remote (must be based in Bay area California or Seattle area Washington)12-monthsIndustry: eCOMMVisa : No h1 Original update 1: we need a GCP full stack developer not a Java full stack developer.So, somebody that has run the whole gambit in Google cloud platform and they are an expert in that.You can even take away full stack developer and just search for GCP experts.That's What we need we need GCP experts with AO docs and all the other stuff that is in bold BIM360, etcWhen submitting, please include all times for tomorrow am, Arizona time, that I can screen them. This is originally slated for 1/1/25, but I think we can start it sooner. So, best case scenario: this won’t begin till November – maybe sooner…. Yes, I said November. JD: Role Summary: The Solutions Developer supports complex, multi-disciplinary data center projects through programming expertise and organizational skill. The primary responsibility of the role is to define, develop, and support knowledge management applications. This role provides hands-on programming of knowledge management solutions, supports the Knowledge Management Senior Technical Project Manager of Solutions & Tools by executing on requirements from internal customers, and supports the entire life cycle of applications and tools. The successful candidate will possess a high degree of software development knowledge, strong communication skills, both verbal and written, collaboration skills, hands-on programming experience, and the ability to self-manage and self-motivate. They must also be able to work in new environments (both business and technical), come up to speed and effectively use new technologies and platforms with minimal supervision and training. Critical Skills and Traits of the Role:· Has software architecture and development experience with multiple languages and platforms, demonstrating flexibility and a broad knowledge of software development· Works with end users and stakeholders to formulate requirements from general descriptions and discusses options and priorities to balance needs and timelines· Handles multiple projects simultaneously, with little or no loss of momentum when context-switching between projects· Documents tasks and plans to a level that they can be assigned to other team members or picked up at a later time and continued without significant ramp-up time· Learn the details of how the applications are used to provide effective support and suggestions for users Primary Responsibilities: Solutions Development· Provide hands-on programming of Knowledge Management solutions· Plan, develop, test, and release solutions for internal KM customers· Balance competing priorities and constraints to produce the best product possible· Perform requirements gathering and project maintenance Coordination· Collaborate with cross-functional teams of customers/users, other systems developers and experts, technical writers, trainers, etc. to build comprehensive systems· Adapt to new environments and information (both business and technical), come up to speed, and effectively use new technologies and platforms with minimal supervision and training Minimum Qualifications & Expertise:· Bachelors or Masters in Computer Science or Engineering· 10+ years’ experience as an individual developer and experience as architect· The ability to work effectively in an extremely fast-paced, ambiguous environment, and implement multiple simultaneous projects· Experience with owning projects from start to finish – self-starter and self-directed· Experience with developing large scale technical solutions in rapidly changing environments· Experience with problem-solving leadership with limited oversight· Relevant experience with Google Drive API, Google Cloud Platform, App Engine, Apps Script, CloudSQL, and BigQuery· Hands-on experience with BIM 360 API and Autodesk Construction Cloud (ACC) including Forge API· Experience with CMS development· Programming experience with JavaScript and related frameworks, Java, HTML5, CSS to develop integrated user interfaces and back end data and document processing· Strong communication skills, both verbal and written Preferred Qualifications:· Experience with knowledge and content management tools and platforms· Experience with document libraries and interfaces· Experience with AODocs API, including configuration and customization of AODocs· Experience with end-to-end IP lifecycle management· Experience with construction documentation· Excellent presentation, influencing, and strategic thinking skills My Notes: Requirements/skills: (Please see above job description) Must haves: Well-rounded full-stack developer that can do the following:o Requirements: join requirement gathering sessions with customers and assist the BA by providing suggestions and recommendations on the requirements.o Coding: participate in scrum sessions and complete assigned tasks and backlog on time.o QA: write unit test scripts and execute them.o Deployments: take a turn periodically to be responsible for deployment activities including code merges, etc. The 3-person team currently has a rotation and they each take turns doing deployment activities. Tech Capabilities:o Javao JavaScripto TypeScripto Google Cloud Platform (GCP)o Database – BigQuery, CloudSQL (these are Google-specific, but we’re actually needing any sort of SQL experience at the database level)· Developing internal tools for doc management; all phases of the lifecycle (document updating, distributing, etc.)· Integration experience with Autodesk platforms, but open to general system integration experience· Good communication skills, adaptable / flexible being able to navigate ambiguity Nice to have: · Hands-on experience with BIM 360 API and Autodesk Construction Cloud (ACC) including Forge API (candidates would have a leg up with this skill set)· Experience as a user/CAD operator is a nice to have but not nearly the weight of integration experience with the platforms· Tech Capabilities:o Angular (UI)o Database – BigQuery, CloudSQL Other Notes:· Will be responsible for building new tools to simplify and improve their knowledge management processes and standards.· Currently they have a large set of excel spreadsheets where they are managing the documentation status (sign offs, approvals, metadata, etc.) and they are building a new tool with a web UI and a DB to capture everything from the spreadsheets.They want to keep track of the relationship of the documents, e.g., parent-child relationship etc.For quick interview and submission, please email me ALL of the following details: 1. First and Last name as it appears on your passport:2. REQUIRED: Anything we should know about you for presentation (this is our chance to showcase why this consultant is amazing compared to their competition):3. Reason you are looking for a change (detailed explanation):4. Communication skills/C-Level interaction (1-10):5. Leadership skills/presence (1-10):6. Hourly rate, all-inclusive (1099 or C2C only at this time):7. US Work Status:8. Resume in MS Word:9. Education and pertinent certs - degree, year, university:10. Availability to start (Remote, PST):11. Email and phone number:12. LinkedIn Profile (must have pic):13. Are you TEAMS/video interview ready (Y/N):14. Current location (city & state): Thank youAkhilesh@dmsvisions.com Direct :- 972-645-0322, Ext :- 110DMS Visions, INC",
        "source": "Email",
        "date_posted": "2024-10-25 14:08:32-05:00",
        "unique_id": "192c534bd1c444d2",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "GCP Data Engineer"
    }
]