[
    {
        "company": "Railroad Commission of Texas",
        "job_title": "Azure Enterprise Architect",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "6+ years",
            "degree_required": "Bachelor's in Computer Science or a related field",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "9+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".NET",
                "SQL",
                "Azure",
                "C#",
                "DevOps"
            ],
            "primary": [
                "CI/CD pipelines",
                "Azure DevOps",
                "SSIS",
                "Microsoft technologies",
                "Networking"
            ],
            "secondary": [
                "Oil & Gas experience",
                "Mainframe Transformation experience",
                "MuleSoft",
                "GoAnywhere",
                "Agile methodologies"
            ],
            "all": [
                ".NET",
                "SQL",
                "Azure",
                "C#",
                "DevOps",
                "CI/CD pipelines",
                "Azure DevOps",
                "SSIS",
                "Microsoft technologies",
                "Networking",
                "Oil & Gas experience",
                "Mainframe Transformation experience",
                "MuleSoft",
                "GoAnywhere",
                "Agile methodologies"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Sunny",
        "email": "sunny@sourceinfotech.com",
        "jd": "From: sunny, Source Infotech Inc sunny@sourceinfotech.com Reply to: sunny@sourceinfotech.com Hi,Hope you are all doing well,Please find the details of Requirement,Title: Azure Enterprise Architect Location: This is a remote role from anywhere within the USDuration: 9+ MonthsClient: Railroad Commission of TexasVisa Status: All visas are workable except CPT, OPT, and H1BInterview: Through Microsoft teams Note:LinkedIn Needed.Resume: Send an updated resume in word format.Minimum Candidate Characteristics: 7 years of .NET, SQL experience 6 years of Azure experience ArchitectureNetworkingDevOps, CI/CD pipelinesC#.NET Core Exceptional Candidate Characteristics: Oil & Gas experienceMainframe Transformation experienceiTexas, MuleSoft, GoAnywhere RRC has issued a request for an Azure Enterprise Architect to support their Mainframe Transformation efforts with Azure infrastructure management, integration development, and DevOps management. The ideal candidates will have industry experience serving Oil & Gas and/or Energy clients and be versed in Azure Architecture/DevOps, .NET, C#, SQL, and SSIS. Responsibilities include (but are not limited to):Architect and implement scalable Azure solutions for Modernization projectsDesign, implement, and maintain CI/CD pipelinesIntegrate Azure solutions with existing systemsEnsure compliance with business and regulatory requirements in the Oil & Gas sector The Worker will apply their expert knowledge of Azure architecture and Microsoft technologies at Railroad Commission of Texas to support the needs of the Mainframe Transformation project teams. The Azure Enterprise Architect will perform advanced analysis and design work involving all technical aspects of supporting, improving, and enhancing RRC’s mainframe modernization project.This position requires strong experience in Azure architecture, including the design and implementation of scalable solutions, as well as proficiency in Microsoft technologies such as .NET Core, C#, MS SQL Server, SSIS and Azure DevOps. The ideal candidate will also be skilled in developing custom integrations and managing infrastructure within Azure environments. We are seeking a proactive team member who will be responsible for enhancing assigned applications, addressing production issues, and ensuring optimal performance of Azure solutions. Work assignments will follow a defined software development life cycle (SDLC) process, utilizing Agile methodologies for effective project delivery. The Azure Enterprise Architect will collaborate with multiple agency stakeholders to ensure that solutions meet business requirements and are delivered error-free, supporting RRC’s regulatory obligations for the Oil and Gas and Energy Industry of Texas. ESSENTIAL FUNCTIONS: Architectural Design: Develop and implement scalable Azure solutions tailored to the needs of the Mainframe Transformation project.Technical Expertise: Leverage strong knowledge of Microsoft technologies, including .NET Core, C#, MS SQL Server, Azure DevOps, and SQL Server Integration Services (SSIS).Collaboration: Work closely with cross-functional teams to ensure seamless integration of Azure solutions with existing systems and applications, including those based on C#, SQL Server, and ASP.NET MVC.DevOps Practices: Design, implement, and maintain CI/CD pipelines using Azure DevOps to automate deployments and streamline development workflows.Custom Integrations: Design and manage custom integrations within Azure environments to enhance application functionality (MuleSoft, Go-Anywhere, SFTP etc.) Performance Optimization: Enhance assigned applications, address production issues, and ensure optimal performance of Azure solutions.ETL Processes: Utilize SSIS for developing and maintaining ETL processes to facilitate data migration and transformation between systems. (Nice to have)Infrastructure Management: Maintain Azure infrastructure for both production and non-production environments, ensuring optimal performance and availability. (Nice to have)Risk Management: Construct risk assessments and remediation plans for complex service proposals and advanced technologies.Environment Setup: Utilize Azure templates to create and configure new environments efficiently.Network Understanding: Understand and manage Azure networking concepts to ensure secure and reliable connectivity between resources.Documentation: Prepare and maintain comprehensive technical documentation, including architecture diagrams, process flows, and design specifications.Subject Matter Expert: Act as a trusted advisor for technical services, providing insights and guidance to both internal and external stakeholders. II. CANDIDATE SKILLS AND QUALIFICATIONSMinimum Requirements:Candidates that do not meet or exceed the minimum stated requirements (skills/experience) will be displayed to customers but may not be chosen for this opportunity.Years Required/Preferred Experience7 Required Experience with Microsoft technologies such as Visual Studio, SQL Server, and ASP.NET MVC7 Required Ability to troubleshoot and resolve complex technical issues7 Required Meticulous attention to detail with an ability to produce high-quality work in a dynamic environment7 Required Highly organized and able to manage multiple tasks at once and meet deadlines7 Required Extensive skill in effective verbal and written communications with stakeholders6 Required At least six [6] years of hands-on experience in Azure architecture and related technologies6 Required At least six [6] years of experience in Azure DevOps, including writing CI/CD pipelines6 Required At six years [6] years of experience in software development using C#6 Required At least Six [6] years of experience in .NET Core development, working in a team environment6 Required Proven technical leadership skills and ability to effectively communicate technical concepts to non-technical stakeholders6 Required Ability to analyze customer service requirements and design service solutions to meet those objectives6 Required Understanding of Azure networking concepts and infrastructure maintenance for production and non-production environments6 Required Ability to create and configure new Azure environments using Azure templates4 Required Graduation from an accredited four-year college or university with a degree in computer science or a related field4 Preferred Experience with PDF generation using iText and familiarity with MuleSoft and GoAnywhere4 Preferred Familiarity with mainframe migration strategies using SSIS as data transformation tool.4 Preferred Knowledge of mainframe technologies and systems is a plus Thanks,SunnyIT RecruiterSource InfoTech Inc.,Email: sunny@sourceinfotech.com",
        "source": "Email",
        "date_posted": "2024-10-25 09:26:46-05:00",
        "unique_id": "192c4630e8610184",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Azure Data Engineer"
    }
]