[
    {
        "company": "Vanguard",
        "job_title": "Python Developer- AWS",
        "location": "Oakland, CA, USA",
        "full_location": {
            "city": "Oakland",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Python",
                "AWS",
                "Portfolio Management"
            ],
            "primary": [
                "AWS CLI",
                "AWS Lambda",
                "AWS S3",
                "Python Scripting"
            ],
            "secondary": [
                "Angular",
                "JavaScript",
                "Great Comms"
            ],
            "all": [
                "Portfolio Management",
                "Stocks",
                "Trading",
                "Investment Concepts",
                "AWS",
                "Python Scripting",
                "Infrastructure",
                "AWS CLI",
                "AWS Lambda",
                "Pulling data from AWS S3",
                "Writing Python Scripts",
                "Angular",
                "JavaScript",
                "Great Comms"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Balram Kumar Singh",
        "email": "balram@spearstaffing.com",
        "jd": "From: Balram Kumar Singh, Spear Staffing LLC balram@spearstaffing.com Reply to: balram@spearstaffing.com Role: Python Developer- AWSClient: VanguardLocation: Oakland, CA (direct indexing provider that vanguard bought out) - 1600 Telegraph Ave - someone who can start at 7am EST – hybrid 3 days a week Tues, Wed, Thurs in CaliIV Process: 2 Rounds (1st Round with Brendan and his architect which will be technical + behavioral and 2nd is portfolio management manager)Contract Length: 12+ monthsTeam Size: 12 members - 4 portfolio managers - rest of the tech team is in Hungary, India, and PA Top Skills: Portfolio Management - (Stocks, Trading, Investment Concepts), Great Comms, AWS, Python Scripting, Infrastructure (AWS CLI, Lambda) Pulling data from AWS S3 - good way to get AWS S3, AWS Lambda, AWS EC2Writing Python ScriptsInfrastructureAngular, JavaScript - making a simple UI - a plus Qualifications- Investment systems knowledge (trading, securities, ect)- Ability to effectively communicate with portfolio managers, work closely with them to rapidly build solutions- Python strongly preferred - Knowledge of AWS services - Github Thanks and regardsBalram Kumar SinghSr Technical Recruiter Phone:- 240-261-2375Email:- balram@spearstaffing.com Website:- www.spearstaffing.com This message and any attachments are intended only for the use of the addressee and may contain information that is privileged and confidential. If the reader of the message is not the intended recipient or an authorized representative of the intended recipient, you are hereby notified that any dissemination of this communication is strictly prohibited. If you have received this communication in error, notify the sender immediately by return email and delete the message and any attachments from your system.",
        "source": "Email",
        "date_posted": "2024-10-25 11:57:46-05:00",
        "unique_id": "192c4ea7bcead3e0",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Python developer"
    }
]