[
    {
        "company": "ZealHire",
        "job_title": "Infrastructure Project Manager with PMP or ITIL",
        "location": "Coraopolis, PA, USA",
        "full_location": {
            "city": "Coraopolis",
            "state": "PA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "7+ years",
            "degree_required": "Bachelor's Degree in Computer Science or equivalent experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "PMP",
                "ITIL",
                "Project Management",
                "Cross-functional Team Management"
            ],
            "primary": [
                "Budget Management",
                "Project Delivery",
                "Technical Requirements Identification"
            ],
            "secondary": [
                "Communication",
                "Leadership",
                "Documentation"
            ],
            "all": [
                "PMP",
                "ITIL",
                "Project Management",
                "Cross-functional Team Management",
                "Budget Management",
                "Project Delivery",
                "Technical Requirements Identification",
                "Communication",
                "Leadership",
                "Documentation"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Raman Arora",
        "email": "raman@zealhire.com",
        "jd": "Hello, My name is Raman Arora and I am a Staffing Specialist at ZealHire. I am reaching out to you on an exciting job opportunity with one of our clients. Job Title - Infrastructure Project Manager with PMP or ITIL Location - Coraopolis, Pennsylvania Job Description: USC/GC need LinkedIn, VISA DL Location: Coraopolis, PA 15106- HYBRID WORK MODEL 2 DAYS IN OFFICE 3 DAYS RESUME Locals or within 60 miles 2 interview process: 1st – with Director, CISO, and Software Manager 2nd- with CIO Why open: Growth Business need: growth and ensure completed projects are documented currently and not impact business Job Responsibilities: Oversee all project budgets Lead all major projects Define project phases to ensure timely delivery Conducts meetings with IT Teams and Business Units Provide project updates and status Manage project issues Complete project status-reviews Lead group of technical resources to ensure projects are documented correctly and moving along per plan Identify technical requirements from Business Units and IT Departments-DBA Team, Software Team and QA Team Qualifications: Education: Bachelor's Degree in Computer Science or equivalent experience a related area (computer science, finance, business administration) (a plus). 7+ years experience in IT field 3-5 years' experience as a Project Manager Expertise in managing cross-functional teams PMP or ITIL Certification Should you be interested, please send me a copy of your resume in word format along with the following details ASAP. Full Name: Current Location: Hourly rate on C2C/W2: Work Authorization: Earliest Available date to start: Date and times available to interview: Two Professional References: (Preferably Supervisory references): Kind Regards, Raman Arora Technical Recruiter ZealHire Inc. Email: Raman@zealhire.com Direct: ​ (332) 287 8468 Ext. 112 https://www.linkedin.com/in/raman-arora-97b749211/ 14 Wall Street 20th Floor | New York, NY 10005 www.zealhire.com",
        "source": "Email",
        "date_posted": "2024-10-25 11:15:45-05:00",
        "unique_id": "192c4968ed7a934c",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]