[
    {
        "company": "Itech US",
        "job_title": "BA with Fund accounting or wealth management experience",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Wealth Management",
                "Fund Accounting",
                "Business Analysis"
            ],
            "primary": [
                "Cost Basis systems",
                "IRS Cost Basis regulations",
                "Documentation of requirements",
                "Testing and validation"
            ],
            "secondary": [
                "Business process analysis",
                "Training",
                "Mentoring",
                "Vendor selection",
                "ROI analysis"
            ],
            "all": [
                "Wealth Management",
                "Fund Accounting",
                "Business Analysis",
                "Cost Basis systems",
                "IRS Cost Basis regulations",
                "Documentation of requirements",
                "Testing and validation",
                "Business process analysis",
                "Training",
                "Mentoring",
                "Vendor selection",
                "ROI analysis"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Bharath",
        "email": "bharath.a@itechus.net",
        "jd": "From: Bharath, Itech US bharath.a@itechus.net Reply to: bharath.a@itechus.net Please Share Resume to Bharath.a@itechus.netRole: BA with Fund accounting or wealth management experienceLocation : Remote (anywhere in US but has to support EST hours) SummaryWealth Management, Fund Accounting domain knowledge is critical for these profiles.Job Profile SummaryElicit, analyze, communicate and validate business/user requirements for processes, policies and information systems. Translate business needs/end-user requirements into functional specifications that describe what the system, process or product/service must do to fulfill the end-user/business requirements. General Duties & ResponsibilitiesFormulates and defines system scope and objectives through research and fact-finding combined with an understanding of applicable business systems and industry requirements.Devises or modifies procedures to solve complex problems considering computer equipment capacity and limitations, operation time and form of desired results.Includes analysis of business and user needs, documentation of requirements and translation into proper system requirement specifications.Influences business partners and service providers regarding priorities, hardware/software selection and/or vendor selection.Analyzes marketplace, industry, company, technology trends and best practices, vendor products and services, etc.Identifies and documents business strategies, objectives and drivers.Analyzes and documents business processes and metrics, and identifies improvement opportunities.Calculates/estimates costs and benefits of alternative actions or solutions to establish their viability/ROI.Re-engineers processes to deliver greater effectiveness and efficiency.Identifies/documents how applications and systems interact to support business processes.Assesses, applies and projects the impact of system changes on users and internal and external clients or stakeholders.Uses knowledge of systems and industry requirements to develop or modify complex information systems.Writes test plans and test cases to ensure changes which are made to the application meet client needs and that application integrity is maintained.Conducts a variety of tests such as system, integration, readiness and acceptance tests. Ensures changes made by programmers are correct.Conducts tests using client data to be certain client needs will be met.Verifies through testing that changes made by programmers to one part of the application do not impact other parts.Reports and reviews testing results.Trains internal employees or external clients on changes, new systems or new procedures. Conducts one-on-one or classroom training depending upon the size or desire of the audience.May mentor, guide, advise and/or check the work of less experienced business systems analysts.Considers business implications of the application of technology to the current business environment.Other related duties assigned as needed. Qualifications & ExperienceBrokerage/Wealth Management industry experienceExperience supporting Cost Basis systems and generating customer tax statementsFull understanding of the IRS Cost Basis regulations, to be able to define requirements to support the tracking of Cost Basis information to accurately produce an IRS form 1099 return.Prior experience of Cost Basis brokerage systems an advantage. ThanksBharath Bharath.a@itechus.net",
        "source": "Email",
        "date_posted": "2024-10-25 12:37:40-05:00",
        "unique_id": "192c4e18f746f1c2",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]