[
    {
        "company": "iTech US Inc.",
        "job_title": ".Net Technical Lead with Google Cloud Platform(GCP)",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "14 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Longterm Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "GCP Google Cloud Platform",
                ".Net"
            ],
            "primary": [
                "Retail Order Management",
                "Google Cloud Spanner (database)"
            ],
            "secondary": [],
            "all": [
                "GCP Google Cloud Platform",
                ".Net",
                "Retail Order Management",
                "Google Cloud Spanner (database)"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Ajay Reddy",
        "email": "ajay.r@itechus.net",
        "jd": "Hello, Hope you are doing well today! My name is Ajay Reddy, and I am a senior recruiter working with ITech US Inc. If you are currently looking for new opportunities. I have an exciting opportunity with one of our clients in Remote. Please let me know if you are interested. Below are the job details for your review. Role:.Net Technical Lead with Google Cloud Platform(GCP)Location: RemoteDuration: Longterm ContractMust Have's:14 yrs experience of these core skills: GCP Google Cloud Platform and .NetRetail Order Mgmt 2 -3 yrs experienceGoogle Cloud Spanner (database)Responsibilities : Lead the planning and execution of multiple projects, ensuring alignment with company goals and objectives. Oversee the development and implementation of solutions using Google Cloud Spanner, GCP, and .Net Core technologies. Provide technical guidance and support to the project team to ensure high quality deliverables. Coordinate with cross functional teams to ensure seamless integration and delivery of project components. Monitor project progress, identify risks, and implement mitigation strategies to ensure timely completion. Develop and maintain project documentation, including project plans, status reports, and risk management plans. Facilitate communication between stakeholders to ensure clear understanding of project requirements and expectations. Conduct regular project reviews and provide updates to senior management on project status and performance. Ensure compliance with company policies, procedures, and standards throughout the project lifecycle. Foster a collaborative and inclusive team environment to drive innovation and continuous improvement. Utilize data driven insights to make informed decisions and optimize project outcomes. Manage project budgets, ensuring efficient allocation of resources and adherence to financial constraints. Drive the adoption of best practices and emerging technologies to enhance project delivery and performance. Qualifications Possess a deep understanding of Google Cloud Spanner, GCP, and .Net Core technologies. Demonstrate strong project management skills with a proven track record of successful project delivery. Exhibit excellent communication and interpersonal skills to effectively collaborate with diverse teams. Show proficiency in risk management and problem-solving techniques. Have experience in developing and maintaining comprehensive project documentation.",
        "source": "Email",
        "date_posted": "2024-10-25 09:34:55-05:00",
        "unique_id": "192c43c716e2b991",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]