[
    {
        "company": "KPG99 Inc",
        "job_title": "Sr. REACT ENGINEER with .net as a backend",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "5+ years",
            "degree_required": "Bachelor’s degree in Computer Science, Software Engineering, or a related field (or equivalent experience)",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 to 12+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "React 18",
                "TypeScript",
                "HTML5",
                "CSS3",
                "GraphQL",
                "REST APIs"
            ],
            "primary": [
                "Redux",
                "React Query",
                "Axios",
                "React Router",
                "Next.js",
                "Jest",
                "React Testing Library",
                "Webpack",
                "Vite",
                "RSPack"
            ],
            "secondary": [
                "SASS",
                "CSS Modules",
                "Styled Components",
                "Material UI",
                "Azure YAML CI/CD pipelines",
                "Azure Bicep/ARM templates",
                "Git",
                "Github",
                "Agile (Scrum and Kanban)"
            ],
            "all": [
                "React 18",
                "TypeScript",
                "HTML5",
                "CSS3",
                "GraphQL",
                "REST APIs",
                "Redux",
                "React Query",
                "Axios",
                "React Router",
                "Next.js",
                "Jest",
                "React Testing Library",
                "Webpack",
                "Vite",
                "RSPack",
                "SASS",
                "CSS Modules",
                "Styled Components",
                "Material UI",
                "Azure YAML CI/CD pipelines",
                "Azure Bicep/ARM templates",
                "Git",
                "Github",
                "Agile (Scrum and Kanban)"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Jyoti Mittal",
        "email": "jyotim@kpgtech.com",
        "jd": "From: Jyoti Mittal, KPG99 Inc jyotim@kpgtech.com Reply to: jyotim@kpgtech.com Hi,My name is Jyoti and I represent KPG99 INC. We work with clients across the USA. I have a very urgent role. If interested then please share with me your updated resume along with below information. NEED INDEPENDENT OR W2 CANDIDATE Job TitleSr. REACT ENGINEER with .net as a backend Duration6 to 12+ months Start date & LocationAsap VisaUSCLocationRichmond, VA Local Note: React Developer with .Net in the backend, but stronger in the front end using React. What you will do – Essential ResponsibilitiesWork with fellow associates to understand the real-life challenges of our Wholesale customers and discover what they need to leverage Carmax as a partner to drive their business’ success.Develop and maintain responsive web applications using React 18 and TypeScript.Collaborate with colleagues in product design, product management and systems architecture to develop experimental solutions and bring great ideas to life.Market your innovative ideas internally and evolve them according to feedback and critique within an agile environment.Collaborate with UX/UI designers and product managers to translate designs into responsive UI components with a focus on user experience and accessibility.Stay up-to-date with modern frontend technologies and integrate best practices into the development process.Ensure high performance of front-end components, manage state efficiently and optimizing for maximum speed and scalability.Troubleshoot and debug applications, identifying performance bottlenecks and implementing solutions.Implement design systems, reusable components, and ensure consistency across the application.Write clean, maintainable, and well-documented code while adhering to best practices.Contribute to module federation and microfrontend architecture (if applicable) for scalable, independent deployments of application features.Conduct code reviews, pair programming, and foster a culture of continuous learning and improvement within the team by providing constructive feedback to peers.Mentor junior engineers, offering technical guidance and leadership when needed, fostering a culture of continuous learning and improvement.Qualifications:Bachelor’s degree in Computer Science, Software Engineering, or a related field (or equivalent experience).5+ years of experience in frontend development with React and TypeScript.Expertise in React 18, including hooks, context, and concurrent features.Experience with GraphQL and/or REST APIs.Proficiency in HTML5, CSS3, and modern styling approaches (e.g., SASS, CSS Modules, Styled Components, Material UI).Experience with modern React libraries for state management, data-fetching, and routing such as Redux, React Query, Axios, React Router etc.Experience with server-side rendering (Next.js) and Progressive Web Apps (PWAs).Solid experience with frontend build toolchain and bundlers (e.g., Webpack, Vite, RSPack etc.).Experience with testing frameworks such as Jest and React Testing Library.Hands-on experience with Module Federation and implementing microfrontend architectures.Knowledge of Azure YAML CI/CD pipelines, Azure Bicep/ARM templates, version control (Git/Github), pull request workflows, and deployment strategies.Strong problem-solving skills and a passion for creating excellent user experiences.Excellent communication and collaboration skills with the ability to work collaboratively in a team.Experience working in Agile (Scrum and Kanban) development environments.",
        "source": "Email",
        "date_posted": "2024-10-25 10:43:10-05:00",
        "unique_id": "192c4cf1d4e568c3",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]