[
    {
        "company": "Parin Technologies LLC",
        "job_title": "Business Analyst",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "15+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 months+",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "requirements elicitation",
                "gap fit analysis",
                "business process reengineering",
                "business systems analysis",
                "Agile development"
            ],
            "primary": [
                "customer service",
                "stakeholder management",
                "facilitation",
                "documentation",
                "data warehousing"
            ],
            "secondary": [
                "relationship building",
                "flexibility",
                "adaptability",
                "financial analysis",
                "risk identification"
            ],
            "all": [
                "requirements elicitation",
                "gap fit analysis",
                "business process reengineering",
                "business systems analysis",
                "Agile development",
                "customer service",
                "stakeholder management",
                "facilitation",
                "documentation",
                "data warehousing",
                "relationship building",
                "flexibility",
                "adaptability",
                "financial analysis",
                "risk identification"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Priyanshi",
        "email": "priyanshi@parintec.com",
        "jd": "From: Priyanshi, Parin Technologies LLC priyanshi@parintec.com Reply to: priyanshi@parintec.com Title: Business AnalystLocation: Lansing, MIHybrid - 2 days onsite from day 1 - Flexible days on site.Duration: 12 months+Interview: Interviews: MS Teams video interview with camera ON. Job DescriptionSeeking a Business Analyst to provide excellent customer service supporting both project and work request needs. This person will have the opportunity to join inflight projects focused on implementing new IT solutions to provide increased efficiencies and public support. These IT solutions leverage current technologies and include working with subject matter experts, vendors, and the public. Key responsibilities include being the liaison between client and the project stakeholders, as well as providing expert facilitation and elicitation to help develop strategy and requirements for future enhancements and related work projects. In addition, as part of the overall support for Agency Partners, this person will be a critical member of the Business Analyst team, participating in various related work requests and contributing to the operational activities of the BA team. The ideal candidate will possess process experience; strong facilitator experience for requirements elicitation; experience with gap fit analysis and requirements refinement for an inflight project.Customer service and being a champion to ease Agency compliance with client policies and practices are key performance expectations for this person. They must be able to quickly gain a working understanding of applicable constraints and enablers and help Agency Partners navigate those for the success for their projects and work requests. A common day would include attendance in various standing meetings for each of the projects, as well as those that include the BA team – being able to confidently speak to current activities in each, listening to understand needs, and helping to provide input that assists in meeting the objectives of the respective meetings. In addition, related work will include preparing for and facilitating discussions with stakeholders to complete analysis and drive to consensus for requirements and priorities. Session outcomes will be captured in notes, specification documents and/or user stories. Welcoming candidates that are self-directed, well organized, confident in their ability to build relationships, quick to come up to speed on new assignments, and able to be flexible and adaptable to changing needs and/or direction. Business Analyst Position General Description:• Facilitation of requirements elicitation meetings; experience with gap fii analysis and requirements refinement.• Reviews, analyzes, and evaluates business systems and user needs. Formulates systems to parallel overall business strategies. Experienced with business process reengineering and identifying new applications of technology to business problems to make business more effective. Familiar with industry standard (including Legacy, Core, and Emerging technologies), business process mapping, and reengineering. Prepares solution options, risk identification, and financial analyses such as cost/benefit, ROI, buy/build, etc. Writes detailed description of user needs, program functions, and steps required to develop or modify computer programs. • Prepare and document Functional and Technical Specifications for reporting and data warehouse work. Assist with business warehouse/intelligence support and enhancements. Develops RFPs. Assist in deployment and management of end-user reporting tools and platforms. Work with IT and business project teams to understand reporting and data warehousing requirements and propose solutions. Document and provide knowledge transfer to the rest of the Enterprise Reporting Team for all solutions. • Reviews, analyzes, and evaluates business systems and user needs. Formulates systems to parallel overall business strategies. Has knowledge of commonly used concepts, practices, and procedures within a particular field. Familiar with relational database concepts, and client-server concepts. Relies on limited experience and judgment to plan and accomplish goals. Performs a variety of tasks. Works under general supervision; typically reports to a project manager. A certain degree of creativity and latitude is required Specific Position Experience Required:• Minimum of 7 years conducting business process review and requirements elicitation and documentation• Minimum of 5 years developing and/or managing user stories on Agile development project(s)• Minimum of 2 years working directly with senior management in facilitating discussions to determine strategy, develop road maps and/or gain consensus to resolve opposing positions• Minimum of 2 years supporting the development of or compliance to statement of work and/or other work agreements/contracts• Minimum of 2 years working on projects developing/implementing IT solutions for public use• Minimum of 1 year working on IT infrastructure projects• Minimum of 1 year working with programs governed by state and/or federal regulations",
        "source": "Email",
        "date_posted": "2024-10-25 12:01:30-05:00",
        "unique_id": "192c4c075f10bc73",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]