[
    {
        "company": "Code Infotek",
        "job_title": ".Net Developer",
        "location": "Montvale, NJ, USA",
        "full_location": {
            "city": "Montvale",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "7-8+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Contract to hire",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Angular (15 or above)",
                ".NET Core (6.0 or above)",
                "C#",
                "Python",
                "SQL/NoSQL"
            ],
            "primary": [
                "Entity Framework",
                "Dapper",
                "Azure Cloud",
                "Agile development",
                "Git"
            ],
            "secondary": [
                "Certification (AZ-900)",
                "Code first approach"
            ],
            "all": [
                "Angular (15 or above)",
                ".NET Core (6.0 or above)",
                "C#",
                "Python",
                "SQL/NoSQL",
                "Entity Framework",
                "Dapper",
                "Azure Cloud",
                "Certification (AZ-900)",
                "Agile development",
                "Git",
                "Code first approach"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Gagan Deshwal",
        "email": "gagan@codeinfotek.com",
        "jd": "From: Gagan Deshwal, Code Infotek gagan@codeinfotek.com Reply to: gagan@codeinfotek.com Title: .Net DeveloperVisa: GC,USC only – USC preferredHybrid – 2 days onsite (Montvale, NJ)Local candidates only – onsite interview requiredLocation:- 75 Chestnut Ridge Road Montvale NJ 07645 United States Note:- Please ONLY SUBMIT RESUME when candidate is 100% available for onsite interview located in Montvale, NJ. This will be a 1.5-2hours in-person interview (Panel interview between 1-3 interviewers) with no exception. ***We do not accept cancellation due to any circumstances. We will cancel vendor relationship if candidate cancel interview after confirming***Please note this role is contract to hire, so candidates should be eligible to convert.• Angular (15 or above REQUIRED)• .NET Core (6.0 or above REQUIRED)Required experience:7-8+ year experience of the followings:Angular (15 or above)C#/Dot Net Core (6.0 or above)PythonSQL/NoSQL App development, entity framework or dapper experienceCode first approach Azure CloudCertification (AZ-900) is a plusexperience working in Agile based developmentexperience in Git branching/Code commit processSummary: Coding, testing and debugging programs according to computer engineering specifications Modifying, expanding and updating applications Communicating with a team that includes analysts, engineers and quality assurance testers in order to coordinate and document application development and testing Developing software prototypesResponsibilities:Review and analyze business requirements and provide technical feasibility and estimates, as well as work closely with Tax business teams, clients, and various technology teams to ensure development of a quality product and a proven record of delivering business value.Take ownership and accountability of development process and the development team through the entire software lifecycle which includes Architecture, Design, Development, DevOps; perform moderately complex bug verification, release testing, and beta support for assigned products.Define and develop enterprise scale solutions leveraging programming technologies like Angular 14+, C#, Python, APIs with SQL/NoSQL as the database backend on the Microsoft Azure cloud.Design and development of solutions that integrate with vendor tools seamlessly utilizing APIs and other integrations using design patterns; prepare and review technical artifacts to help document technical architecture, design and deployment diagramsMentor software developers by reviewing written code and enforcing organizational development standards and coaches more junior colleagues in techniques, processes, and responsibilities.***; Join our team and be part of building robust software development and secure cloud solutions on Azure***Look forward to working with you soon. Thanks & Regards...Gagan DeshwalTechnical Recruiter Email: Gagan@codeinfotek.com11350 Random Hills Rd. Suite 800Fairfax, VA 22030Web:- www.codeinfotek.com",
        "source": "Email",
        "date_posted": "2024-10-25 09:28:43-05:00",
        "unique_id": "192c435afd666cf6",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]