[
    {
        "company": "Sibitalent Corp.",
        "job_title": "Business Analyst",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Bachelor’s degree in Information Technology, Computer Science or Business or equivalent relevant work experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Month Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "business analysis",
                "systems analysis",
                "US Healthcare payer experience",
                "requirements analysis",
                "user acceptance testing"
            ],
            "primary": [
                "client engagement",
                "enterprise application designs",
                "gap analysis",
                "communication skills",
                "business process analysis"
            ],
            "secondary": [
                "task analysis",
                "functional specifications",
                "project Software Development Life Cycles",
                "industry standard Business Analysis Best Practices"
            ],
            "all": [
                "business analysis",
                "systems analysis",
                "US Healthcare payer experience",
                "requirements analysis",
                "user acceptance testing",
                "client engagement",
                "enterprise application designs",
                "gap analysis",
                "communication skills",
                "business process analysis",
                "task analysis",
                "functional specifications",
                "project Software Development Life Cycles",
                "industry standard Business Analysis Best Practices"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Krishna Chaudhary",
        "email": "krishna@sibitalent.com",
        "jd": "Hello, I hope you are doing fine. Please find the below Jd and share your candidate profile. Role: Business Analyst – Healthcare Payer Experience Must Location: Remote Duration:: 12+ Month Contract Job Description Comprehensive experience in client engagement for analyzing business needs and enterprise application designs, and further proposing solutions for the same - in sync with the changing business trends and expectations Good communication skills with the ability to articulate the solutions for the problems posed. Gathers information about the organization’s work processes and information flows. Translates business requirements into functional specifications for the IT organization, manages changes to such specifications, and educates the IT organization on the direction of the business. Has basic understanding of business, market and industry issues facing a specific business unit or function. Supports several simple to moderately complex business processes. Client Interaction, User Documentation, Gap Analysis Identify problems and improvement areas to ensure the product quality and performance is met Qualifications Bachelor’s degree in Information Technology, Computer Science or Business or equivalent relevant work experience in business analysis, systems analysis and/or testing 10+ years of related work experience in business analysis, systems analysis US Healthcare payer experience is a MUST Experience in or expose to business process analysis, Work flow, task analysis, user acceptance testing and requirements analysis Demonstrated ability to elicit, document, analyze and verify requirements Knowledge and experience with user acceptance testing concepts Basic understanding of project Software Development Life Cycles Must demonstrate understanding of industry standard Business Analysis Best Practices",
        "source": "Email",
        "date_posted": "2024-10-25 10:46:38-05:00",
        "unique_id": "192c4cc17ab00db2",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]