[
    {
        "company": "Absolute IT",
        "job_title": "SQL DBA",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Senior-level, 5+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "At least 1 year with possible extension",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SQL Server",
                "Database Administration",
                "Disaster Recovery",
                "High Availability",
                "Database Management"
            ],
            "primary": [
                "Infrastructure DBA support",
                "Patch Management",
                "Database Integrity Checks",
                "Database Replication",
                "Backup Monitoring"
            ],
            "secondary": [
                "Capacity Planning",
                "Database Standards",
                "Troubleshooting",
                "Monitoring Tools",
                "Guideline Drafting"
            ],
            "all": [
                "SQL Server",
                "Database Administration",
                "Disaster Recovery",
                "High Availability",
                "Database Management",
                "Infrastructure DBA support",
                "Patch Management",
                "Database Integrity Checks",
                "Database Replication",
                "Backup Monitoring",
                "Capacity Planning",
                "Database Standards",
                "Troubleshooting",
                "Monitoring Tools",
                "Guideline Drafting"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Devyani Kumari",
        "email": "devyani@absoluting.com",
        "jd": "From: Devyani Kumari, Absolute IT devyani@absoluting.com Reply to: devyani@absoluting.com SQL DBA at Lansing, MI – Onsite interview final roundThis candidate must be within 2 hours of Lansing (verifiable), and able to interview onsite during the 2nd interview.This role will last at least 1 year with possible extension and will be hybrid (2 days onsite a week in Lansing).Candidates must have an updated LinkedIn ID (REQUIRED!!)We can only accept 1 for this so please submit your top candidate for review. In the past state experience has been preferred, if a candidate can’t interview onsite, please do not submitJob Description:The position is responsible for providing Infrastructure DBA support for all SQL Server applications and it is replacement for a Senior Level DBA leaving the team. The intention is to fill this position in the gap between the incumbent DBA leaves and the position is backfilled which will take several months. We cannot afford not having a resource for large and complex application that we support and in that there are several Tier 1 level applications that belong in the Bureau of Labs, Cancer Registry etc.As an Senior-level Database Administrator, the resource, participates in 24x7 software and hardware support for complex applications in several versions of SQL Server, with high availabilty and Disaster Recovery support, following industry and DTMB development standards. Helps develop and/or submit for approval, plans for installation, patch management maintenance, upgrades and support for the Database systems. . Evaluate impacts of change and new technology, recommend solutions to persistent problems, and serves as Agency Services liaison to external consultants. Individual tasks related to the duty: · Follow and enforce database standards, policies & procedures. Research and draft guidelines within the boundaries of current policies and standards.· Monitor space allocation across databases. perform adjustments in test and development environments as necessary and as prescribed by predefined standards/guidelines.· Calculate disk space requirements for existing and/or new installations of existing business needs · Modify DBMS parameters based on capacity changes.· Configure and execute database integrity checks.· Monitor for database integrity checks.· Install database base management software for development and test environments.· Install database patches and service packs for development and test environments.· Monitor and support clustered database environments.· Monitor and support database replication and backup environments.· Implement the strategy to release unused space or repair fragmentation in test and development environments.· Execute (run) scripts provided by Systems Analysts or Database Architect/Designer for creating and modifying database objects (tables, views, constraints, indexes, etc.)· Monitor database back-ups to ensure recoverability. Troubleshoot backup errors.· Monitor database jobs and scheduled processes in development, test and production environments. Participate in troubleshooting. · Monitor database environments (using alert logs, trace files, alert mechanisms, and other tools) for issues and problems with database functionality, connectivity, or downtime.· Follow standards and guidelines for database space allocation based on best practices and implementation considerations based on business requirements.",
        "source": "Email",
        "date_posted": "2024-10-25 07:22:50-05:00",
        "unique_id": "192c3c2f48795287",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "DB Admin"
    }
]