[
    {
        "company": "Morgan Stanley",
        "job_title": "Technical Project Manager / Technical Business Analyst",
        "location": "New York, NY, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Business Analysis",
                "Software Development Life Cycle (SDLC)",
                "Agile Scrum",
                "Waterfall methodologies"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Project Management",
                "Business Analysis",
                "Software Development Life Cycle (SDLC)",
                "Agile Scrum",
                "Waterfall methodologies"
            ],
            "with_experience": [
                "Project Management (10+ years)",
                "Business Analysis (10+ years)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Dilip Kumar",
        "email": "dilip@procorpsystems.com",
        "jd": "From: Dilip Kumar, ProcorpSytems dilip@procorpsystems.com Reply to: dilip@procorpsystems.com #hiringTechnical Project Manager / Technical Business AnalystNYC NY (Onsite)-Only Locals We are looking to hire a talented Project Manager / Technical Business Analyst having 10+ years of experience to join the Wealth Management Product Technology team at Morgan Stanley. The team is responsible for maintaining and building systems for the Home Loans business. The Home Loans Technology platform depends on multiple internal and 3rd party vendor systems that offer unique services in support of mortgage origination and servicing. Home Loans Technology, partnering with the Home Loans Business Change Mgmt, manages the Vendor & Risk Management team to reduce Risk of our internal, vendor & third-party systems; to execute on a comprehensive workflow and oversight model; and to ensure transparency across multiple Technology, Risk, Business & US Banks stakeholders. The role of Project Manager / Technical Business Analyst is to lead the Vendor & RiskManagement team within Technology in onboarding of systems into the firm, providing ongoing maintenance and risk management of systems, and decommissioning systems. Responsibilities· Onboard new vendors for MS Home Loans by conducting vendor assessment/reviews, including information security, architecture, data lifecycle management, BCP, etc.· Ensure vendors implement secure technology solutions, per MS policy (ex: Cloud migrations, Material Changes to architecture or PII Data)· Manage incidents, such as Cyber Security & Production outages, including appropriate communication to stakeholders and adherence to SLAs· Identify risks and plan mitigations· Oversee vendor decommission and offboarding, including managing data security· Interact with business, technology, operations to conduct Business Analysis documentation of current and future state solutions· Assist in the coordination and preparation of key meetings that are required for stakeholders to close critical projects and assessments· Work with global / regional counterparts to provide synergies between regions and ensure the collaboration is intact.· Document work into stories and manage JIRA board for prioritization· Detail the stories with examples and scenarios for clear development / QA understanding· Take the story to definition of ready (DoR) for the squad to discuss in refinement and planning sessions· Prepare material for sprint review with business and other stakeholders· Contribute to domain competence within the squadRequired Skills· At least 10+ years of hand-on Project Management and Business Analyst experience· Extensive experience in Software Development Life Cycle (SDLC) - Verification and Validation, Agile Scrum and Waterfall methodologies used for the design, development, testing, and maintenance of software.",
        "source": "Email",
        "date_posted": "2024-10-25 09:13:34-05:00",
        "unique_id": "192c426b372356f4",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]