[
    {
        "company": "HMG America LLC",
        "job_title": "Sr. Oracle Database Engineer",
        "location": "Overland Park, KS, USA",
        "full_location": {
            "city": "Overland Park",
            "state": "KS",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5-6 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$55/hour"
        },
        "skills": {
            "core": [
                "Database Migration to Cloud",
                "Database Security Management",
                "Database Design",
                "PL/SQL programming",
                "Oracle RDBMS"
            ],
            "primary": [
                "Performance Monitoring and Tuning",
                "Disaster Recovery",
                "Test Data Management",
                "Database Optimization",
                "Task Automation"
            ],
            "secondary": [
                "noSQL",
                "Graph DB",
                "GoldenGate",
                "AWS RDS",
                "ETL tools",
                "scripting",
                "Git",
                "CICD tools"
            ],
            "all": [
                "Database Migration to Cloud",
                "Database Security Management",
                "Database Design",
                "PL/SQL programming",
                "Oracle RDBMS",
                "Performance Monitoring and Tuning",
                "Disaster Recovery",
                "Test Data Management",
                "Database Optimization",
                "Task Automation",
                "noSQL",
                "Graph DB",
                "GoldenGate",
                "AWS RDS",
                "ETL tools",
                "scripting",
                "Git",
                "CICD tools"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "sanjeev",
        "email": "sanjeev@hmgamerica.com",
        "jd": "From: sanjeev, HMG America LLC sanjeev@hmgamerica.com Reply to: sanjeev@hmgamerica.com Sr. Database EngineerOverland Park, KS (day1 onsite - 3 day work from office)Contract Rate : 55/hr MaxEx T Mobile Experience RequiredPlease dont submit the profile if already submitted to HCL before for any position in the last 3-4 Months Mandatory skill: Database Migration to Cloud, Database Security Management , Database Design : Responsibilities• Hands-on driver for Database Migration to Cloud: Oversee the migration of databases to the cloud, ensuring minimal downtime and data integrity.• Database Security Management: Implement and maintain robust security measures to protect sensitive data and ensure compliance with industry standards and regulations. Perform regular security scans on all databases to ensure compliance with security standards and policies. Ensure security defects are resolved within SLA.• Disaster Recovery: Develop and maintain comprehensive disaster recovery plans to ensure data integrity and availability in case of system failures or disasters. Own and drive disaster recovery (DR) plans (for db) and ensure recovery time objectives (RTO) and recovery point objectives (RPO) are met for all databases.• Database Design: Design databases for high availability, scalability, and performance that meet platform SLIs.• Collaboration with Development Teams: Work closely with software development teams to integrate databases with applications and ensure efficient data flow.• Performance Monitoring and Tuning: Continuously monitor database performance and implement tuning measures to optimize query execution and resource utilization. Obtain and analyze Automatic Workload Repository (AWR) reports to identify performance bottlenecks and suggest tuning improvements. Conduct thorough SQL code reviews, optimize queries for performance, and implement best practices.• Test Data Management: Introduce and maintain automated processes to simplify non-production environment (NPE) test data management.• Database Optimization:• Implement data archival and cleanup strategies.• Work with dev teams on identifying and cleanup of deprecated/unused users, objects and schemas to simplify the databases.• Evaluate and propose alternative technologies to simplify the database footprint.• Task Automation Develop automation scripts for routine database tasks. Actively integrate with CI/CD pipelines where possible.Skillso At least 5-6 years of hands-on Oracle RDBMS experience including developing, designing and managing databases independently; Experience in data migration and noSQL esp. Graph DB is good to have.o At least 2-3 years of PL/SQL programming, performing reviews and performance tuning.o At least 1–2-year experience in using GoldenGate for data replication.o At least 1-2 years of experience in creating, managing AWS RDS and integration with application platforms, and IAM role management.o Experience in ETL tools is good to have.o At least 3-4 years of scripting (shell, py, go or similar higher-level programming lang)o Must have on experience with Git & CICD tools, able to navigate and work independently.o Communication - Good communication and articulation skills that adapt to different stakeholders and audience",
        "source": "Email",
        "date_posted": "2024-10-25 10:09:57-05:00",
        "unique_id": "192c45a50899ce77",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Oracle DBA"
    }
]