[
    {
        "company": "1 Point System LLC",
        "job_title": "Sr React Engineer (.Net) III",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "React",
                ".NET",
                "TypeScript"
            ],
            "primary": [
                "GraphQL",
                "REST APIs",
                "React 18",
                "hooks",
                "context",
                "concurrent features"
            ],
            "secondary": [],
            "all": [
                "React",
                ".NET",
                "TypeScript",
                "GraphQL",
                "REST APIs",
                "React 18",
                "hooks",
                "context",
                "concurrent features"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Vikas Gupta",
        "email": "vikas.g@1pointsys.com",
        "jd": "Hi, This side Vikas from 1pointsys. Hope you are doing well, I have a job position for you. Job Title:- Sr React Engineer (.Net) Location:- Richmond, VA (locals only) Job Description:- Strong React experience Must have strong .NET experience in backend Expertise in React 18, including hooks, context, and concurrent features. Experience with GraphQL and/or REST APIs. Typescript experience What you will do – Essential Responsibilities • Work with fellow associates to understand the real-life challenges of our Wholesale customers and discover what they need to leverage Carmax as a partner to drive their business’ success. • Develop and maintain responsive web applications using React 18 and TypeScript. • Collaborate with colleagues in product design, product management and systems architecture to develop experimental solutions and bring great ideas to life. • Market your innovative ideas internally and evolve them according to feedback and critique within an agile environment. • Collaborate with UX/UI designers and product managers to translate designs into responsive UI components with a focus on user experience and accessibility. • Stay up-to-date with modern frontend technologies and integrate best practices into the development process. • Ensure high performance of front-end components, manage state efficiently and optimizing for maximum speed and scalability. • Troubleshoot and debug applications, identifying performance bottlenecks and implementing solutions. • Implement design systems, reusable components, and ensure consistency across the application. • Write clean, maintainable, and well-documented code while adhering to best practices. • Contribute to module federation and microfrontend architecture (if applicable) for scalable, independent deployments of application features. • Conduct code reviews, pair programming, and foster a culture of continuous learning and improvement within the team by providing constructive feedback to peers. • Mentor junior engineers, offering technical guidance and leadership when needed, fostering a culture of continuous learning and improvement.",
        "source": "Email",
        "date_posted": "2024-10-25 10:22:47-05:00",
        "unique_id": "192c4660e11c5be9",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]