[
    {
        "company": "kk soft tech",
        "job_title": "Java Developer with AWS and Typescript",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "2+ years",
            "degree_required": "High School Diploma, GED, or High School Equivalency",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "AWS",
                "Typescript"
            ],
            "primary": [
                "Scripting languages such as Python",
                "GitHub",
                "GitLab",
                "SonarQube",
                "JUnit",
                "Spring Boot"
            ],
            "secondary": [
                "Wire Mock",
                "Mockito",
                "Postman",
                "REST Assured",
                "Cypress",
                "Ready API",
                "Jenkins",
                "Circle CI",
                "ECS",
                "EKS",
                "S3",
                "Lambda",
                "SQS/SNS",
                "PostgreSQL",
                "Dynamo",
                "Sagemaker",
                "Athena",
                "RESTful APIs",
                "micro-services",
                "VersionOne",
                "Agility"
            ],
            "all": [
                "Java",
                "AWS",
                "Typescript",
                "Scripting languages such as Python",
                "GitHub",
                "GitLab",
                "SonarQube",
                "JUnit",
                "Spring Boot",
                "Wire Mock",
                "Mockito",
                "Postman",
                "REST Assured",
                "Cypress",
                "Ready API",
                "Jenkins",
                "Circle CI",
                "ECS",
                "EKS",
                "S3",
                "Lambda",
                "SQS/SNS",
                "PostgreSQL",
                "Dynamo",
                "Sagemaker",
                "Athena",
                "RESTful APIs",
                "micro-services",
                "VersionOne",
                "Agility"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "sushant kumar",
        "email": "sushant.s@kksoftwareassociates.com",
        "jd": "From: sushant kumar, kk soft tech sushant.s@kksoftwareassociates.com Reply to: sushant.s@kksoftwareassociates.com Java Developer with AWS and TypescriptLocation : Atlanta/GA Local will be interview FirstRelocation will work but passport number is mandatory Required Resource : Immediate Day 1: Onsite ->(5/Days per week ) – Written Commitment Key Skill : Java , AWS, TypescriptJava (Backend and Automation Testing), AWS, Scripting languages such as Python High School Diploma, GED, or High School Equivalency 2+ years’ experience in Java, Full-stack development experience is required Experience working with GitHub and/or GitLab, SonarQube, JUnit, Spring Boot Skilled in writing, designing unit test cases using TDD and BDD methodologies Hands on experience of virtualizing services for test automation using tools such as Wire Mock, Mockito etc. Automation-minded: Hands on experience of designing and writing automated tests for backend applications and data flow, using tools such as Postman, REST Assured, Cypress, Ready API etc. Hands on experience of working with continuous integration tools such Jenkins, Circle CI. Broad hands on experience in AWS Cloud serverless components and ability to build and maintain cloud data processing systems (i.e. ECS, EKS, S3, Lambda, SQS/SNS, PostgreSQL, Dynamo, Sagemaker, Athena, etc.) Experience using relational and object databases and web service development standards and practices, including RESTful APIs, micro-services, and services Experience working in an agile development environment using workload management tools like VersionOne/Agility Expert troubleshooting and deployment experience with strong understanding of transforming business and functional requirements into efficient technical solutions Experience with system integrations, optimizing performance and data integrity Strong technical and non-technical communication skills. Assures smooth flowing, timely transmission of critical information. Excellent judgment and problem-solving skills; individual should be able to resolve urgent problems in a calm and quick manner and display a high degree of initiative and drive • Ability to be effective in a high stress environment Be flexible and embrace challenges that are outside of your comfort zone",
        "source": "Email",
        "date_posted": "2024-10-25 12:50:33-05:00",
        "unique_id": "192c4ed588dd09bf",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]