[
    {
        "company": "Techrooted INC",
        "job_title": "Program Manager",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management"
            ],
            "primary": [
                "IT Data Governance",
                "Data Warehouse Implementation/Solicitation",
                "Procurement (RFP/SOW)",
                "Vendor Management",
                "Multi-projects and/or Program Management",
                "Clear and concise communication skills"
            ],
            "secondary": [],
            "all": [
                "Project Management",
                "IT Data Governance",
                "Data Warehouse Implementation/Solicitation",
                "Procurement (RFP/SOW)",
                "Vendor Management",
                "Multi-projects and/or Program Management",
                "Clear and concise communication skills"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Amandeep Kaur",
        "email": "amandeep@techrooted.com",
        "jd": "From: Amandeep Kaur, Techrooted INC amandeep@techrooted.com Reply to: amandeep@techrooted.com Hi, This is Aman, Technical Recruiter at Techrooted, we have an excellent job opportunity for you. Please let me know if you are interested then share your updated resume along with your contact details so that we can proceed further. Program ManagerLocation: Lansing, MI (Need Local to MI only who can go onsite for 2 days (Tue & Wed) per week; HYBRID)USC GC GCEAD H4EAD onlyDuration : 12+ MonthsInterviews: In-person REQUIRED, second round through Teams.LinkedIn profile is must.High-Level Job DutiesEstablish and monitor project controlling methods to insure timely knowledge and awareness of changes to project and/or program cost, quality, or schedule.Provide planning and reporting to insure the successful completion of assigned projects according to the sponsor’s goals and objectives. Planning should adhere to the State of Michigan’s Methodology (SUITE) and the Agency’s project prioritization process. Planning and reporting span the entire lifecycle of the project from initiation to close.Direct and coordinate day to day activities, tasks, and deliverables required from the project team according to the project plan.Perform miscellaneous functions as needed to contribute to the overall operation and objectives of the Department of Technology, Management, and Budget (DTMB). Project DetailsMDOT – DIWD P3 System Integrator Solicitation (SI)Document requirements and develop a Statement of Work (SOW) to procure a vendor contract for SI servicesMDOT – DIWD P3 Independent Verification and Validation (IV&V)Document requirements and develop a Statement of Work (SOW) to procure a vendor contract for IV&V services Top Skills & Years of Experience Required: 10+ years of Project Management experience Beneficial experience, ranked by priority:1. IT Data Governance – 2 years 2. Data Warehouse Implementation/Solicitation – 2 years 3. Procurement (RFP/SOW) – 1 year 4. Vendor Management – 1 year 5. Multi-projects and/or Program Management (will be multiple DIWD projects rolled into a DIWD program) – 1 year6. Clear and concise communication skills required. Regards Amandeep KaurSr. Technical RecruiterE: Amandeep@techrooted.com TechRooted Inc.14 Wall Street 20th Floor | New York, NY 10005www.techrooted.com/",
        "source": "Email",
        "date_posted": "2024-10-04 07:58:30-05:00",
        "unique_id": "192579c3c857c4d8",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]