[
    {
        "company": "Smart IT Frame",
        "job_title": "Technical Delivery Manager",
        "location": "Bellevue, WA, USA",
        "full_location": {
            "city": "Bellevue",
            "state": "WA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Delivery",
                "Stake Holder Management",
                "RFI",
                "RFP",
                "Risk Management",
                "Cloud Management and Support",
                "Application Development and support",
                "DevOPS"
            ],
            "primary": [],
            "secondary": [
                "Domain Experience (If any) – Telco Preferred",
                "Prior UST experience"
            ],
            "all": [
                "Delivery",
                "Stake Holder Management",
                "RFI",
                "RFP",
                "Risk Management",
                "Cloud Management and Support",
                "Application Development and support",
                "DevOPS",
                "Domain Experience (If any) – Telco Preferred",
                "Prior UST experience"
            ],
            "with_experience": [
                "Delivery (10+ years)",
                "Stake Holder Management (10+ years)",
                "RFI (10+ years)",
                "RFP (10+ years)",
                "Risk Management (8+ years)",
                "Cloud Management and Support (5+ years)",
                "Application Development and support (5+ years)",
                "DevOPS (5+ years)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Syed Ashik",
        "email": "ashik@smartitframe.com",
        "jd": "From: Syed Ashik, Smart IT Frame ashik@smartitframe.com Reply to: ashik@smartitframe.com Hi,Greetings from Smart IT Frame, Hope you are doing well!Smart IT Frame specializes in enabling you with your most critical line of resources. Whether it is for permanent staffing, contract staffing, contract-to-hire or executive search, we understand the importance of delivering the most suitable talent; on time and within budget. With our Core focus in emerging technologies, we have provided global technology workforce solutions in North America, Canada &amp; India. We take pride in delivering specialized talent, superior performance, and seamless execution to meet the challenging business needs of customers worldwide. Title: Technical Delivery ManagerLocation: Bellevue, WADuration: Contract Job Description: Mandatory AreasMust Have Skills –Delivery – 10+ Yrs of ExpStake Holder Management –10+ Yrs of ExpRFI, RFP –10+ Yrs of Exp –Risk Management –8+ Yrs of ExpCloud Management and Support - 5+ YearsApplication Development and support – 5+ YearsDevOPS – 5+ Yrs of Exp –Good To have Skills –Domain Experience (If any) – Telco PreferredMust have Certifications –Prior UST experience – UST is looking for a Technical Delivery Manager to be part of Telecommunications vertical, to manage the delivery of a US based Telco customer engagements. UST's customer engagements includes Application development, DevOps, Operations across Internal facing applications (custom build and Third party), Wireless customer applications, Enterprise Data Services. The technology landscape involved are primarily on Java microservices, AWS and Azure Cloud services, Data services on Azure and Snowflake, API Gateways, API Security products, enterprise tools. Ideal candidate needs to have a good engineering mindset, understanding and strong command on these technology landscape to manage the delivery of these engagements working closely with the UST Agile Scrum team and with the customer on a daily basis. Single Point of contact for customer for any UST Delivery related matters. Point contact for the respective UST Project leads for any Delivery related suggestions, guidance Ensure delivery excellence, technical thought leadership to the customer Work with customer and UST Leads on a daily basis, reviewing the daily progress of the engagement, suggest course corrections, bring in innovative ideas, mitigate risks and issues. Prepare customer status reports and present it on a weekly, monthly and quarterly basis. Develop and track metrics/KPIs to detect the project health and trends and drive corrective measures Should be able to articulate the business outcome delivered to the customer. Monitor the delivery processes being followed in each of the engagement, take measures to address any gaps. Identify revenue growth opportunities and responsible for the expansion of the assigned portfolios Provide technical thought leadership, creative solutioning ideas for RFI, RFP response Drive innovation, best practices Collaborate with UST internal teams and ecosystem to bring in the necessary help for the development team and to address the customer needs. • Excellent communication skills and interpersonal skills Establish strong connect with customer and be the trusted person",
        "source": "Email",
        "date_posted": "2024-10-04 09:33:18-05:00",
        "unique_id": "19257f3045acc823",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]