[
    {
        "company": "Insoursys",
        "job_title": ".NET micro services Solution Architect",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ Years",
            "degree_required": "Bachelor's degree in computer science or engineering",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".NET microservices",
                "open banking",
                "architecture standards",
                "cloud architecture",
                "integration patterns"
            ],
            "primary": [
                "cross functional solutions",
                "financial applications",
                "AWS",
                "Azure",
                "enterprise architecture frameworks"
            ],
            "secondary": [
                "communication skills",
                "leadership skills",
                "AI",
                "ML",
                "Bizzdesign",
                "LeanIX"
            ],
            "all": [
                ".NET microservices",
                "open banking",
                "architecture standards",
                "cloud architecture",
                "integration patterns",
                "cross functional solutions",
                "financial applications",
                "AWS",
                "Azure",
                "enterprise architecture frameworks",
                "communication skills",
                "leadership skills",
                "AI",
                "ML",
                "Bizzdesign",
                "LeanIX"
            ],
            "with_experience": [
                ".NET microservices",
                "open banking",
                "cloud architecture",
                "integration patterns"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Tejaswi Athili",
        "email": "tejaswi_athili@insoursysinc.com",
        "jd": "Role: .NET microservices design and open banking exposure Solution Architect\nLocation: CT_NY_NJ _ Hybrid .NET microservices design and open banking exposure\nMAJOR DUTIES & RESPONSIBILITES\nProvide sound solutions and architecture for key business initiatives and own a portfolio of applications that span across consumer and commercial banking domains. Build and maintain architecture standards and best practices. Understand business drivers and business capabilities (future and current state) and determine corresponding enterprise system design and change requirements to drive the organization's targeted business outcomes. Guide and influence product owners, designers, and developers in implementing sound architecture choices (Buy vs. Build, or Real-time vs. Batch) Work with Enterprise architecture in establishing standards and evaluate products and contribute to EA initiatives. Design and lead the implementation solutions across a group or specific business applications or technologies based on enterprise business strategy, business capabilities and business requirements. Manage and develop the architecture for a broader scope of projects, working closely with application architects that manage and design architecture for a single project or initiative. Provide consulting support to application architects within projects to ensure the project is aligned with the proposed solution and overall enterprise architecture. Monitor the current-state solution portfolio to identify deficiencies through aging of the technologies used by the application, or misalignment with business requirements. Understand the technology trends and the practical application of existing, new, and emerging technologies (like AI, ML, automation) to enable new and evolving business and operating models. Analyze the business-IT environment (run, grow and transform the business) to detect critical deficiencies, and recommend solutions for improvement (systems of record, differentiation, and innovation). Analyze the technology industry, competitors, and market trends, and determine their potential impact on the enterprise.\nEDUCATION, EXPERIENCE & SKILLS\nRequired: bachelor’s degree in computer science or engineering\nPreferred: master’s degree in engineering or business\nRequired 10+ Years' experience as a solutions or application architect. Experience designing cross functional solutions in Financial/Banking sector applications. Preferred: Experience in core banking systems like Fiserv, digital banking platform and open banking standards Experience in cloud architecture – AWS and/or Azure Knowledge of enterprise architecture frameworks (e.g., TOGAF, Zachman) and methodologies. Proficiency in evaluating and recommending emerging technologies and best practices. Excellent communication and leadership skills, with the ability to collaborate effectively with cross-functional teams and stakeholders. Relevant certifications (e.g., TOGAF, AWS Certified Solutions Architect, or equivalent) preferred. Have in depth knowledge in integration patterns and expertise in design of web services developing real-time API integration. Understanding of SAFe and LPM process Design and implement applications in one of the major cloud technologies (AWS, AZURE, or GCP) Motivated and driven by achieving long-term business outcomes. Displays intellectual curiosity and integrity. Experience with EA tools like Bizzdesign, LeanIX etc Experience with AI and ML implementations would be a great advantage.",
        "source": "Email",
        "date_posted": "2024-10-04 08:01:44-05:00",
        "unique_id": "192579f334d63e86",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]