[
    {
        "company": "GTech LLC",
        "job_title": "Senior Power BI and Azure Analytics Developer",
        "location": "Bronx, NY, USA",
        "full_location": {
            "city": "Bronx",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party",
                "contract"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Must have existing work authorization",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SQL",
                "DAX",
                "Power BI Semantic Model Development",
                "Azure Data Factory",
                "Python",
                "Data Ingestion",
                "Ellucian Banner"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "SQL",
                "DAX",
                "Power BI Semantic Model Development",
                "Azure Data Factory",
                "Python",
                "Data Ingestion",
                "Ellucian Banner"
            ],
            "with_experience": []
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Juhi Sonwal",
        "email": "jsonwal@greattechglobal.com",
        "jd": "HelloHope you are having a wonderful day!!! My name is Juhi Sonwal and I am a part of recruitment team at GTech LLC. I came across your profile and wanted to see if you would be interested in the Senior Power BI and Azure Analytics Developer. Job TitleSenior Power BI and Azure Analytics DeveloperJob LocationBronx, New YorkWork ModeHybridJob TypeC2CJob Duration3Interview ProcessVideo CallRecruiter InstructionsVisa: USC, GCJob Description:- Overview:We are seeking a Senior Power BI and Azure Analytics Developer . This position has reopened due to the previous candidate falling ill. The ideal candidate will possess a strong background in data analytics, specifically with Power BI and Azure.Critical Skills Required:SQL: Advanced-level data querying (DML) skills, primarily working with Oracle.DAX: Advanced-level DAX expertise.Power BI Semantic Model Development: A solid understanding of dimensional modeling.Azure Data Factory: Experience in data movement and transformation.Python: Proficiency in developing Azure Function Apps.Data Ingestion: Experience with data ingestion via APIs and programmatically.Ellucian Banner: Experience with Ellucian Banner and some knowledge of the Higher Ed domain is crucial.",
        "source": "Email",
        "date_posted": "2024-10-04 17:14:04-05:00",
        "unique_id": "19259f88d08a329d",
        "emp_type": [
            "third party",
            "contract"
        ],
        "tag": "Azure Data Engineer"
    }
]