[
    {
        "company": "ARK Infotech Spectrum",
        "job_title": "IT Sr. Project Manager – GxP Validation",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "12+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "GxP Validation",
                "Cloud Implementation",
                "Regulatory Compliance",
                "Stakeholder Communication"
            ],
            "primary": [
                "Healthcare Systems Integration",
                "Budget Management",
                "Risk Management",
                "Cross-Functional Team Leadership",
                "Change Control Management"
            ],
            "secondary": [
                "Computer System Validation",
                "Presentation Skills",
                "Documentation Management",
                "Leadership Skills",
                "Testing of System Requirements"
            ],
            "all": [
                "Project Management",
                "GxP Validation",
                "Cloud Implementation",
                "Regulatory Compliance",
                "Stakeholder Communication",
                "Healthcare Systems Integration",
                "Budget Management",
                "Risk Management",
                "Cross-Functional Team Leadership",
                "Change Control Management",
                "Computer System Validation",
                "Presentation Skills",
                "Documentation Management",
                "Leadership Skills",
                "Testing of System Requirements"
            ],
            "with_experience": [
                "GxP Validation",
                "Cloud Implementation"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Sandeep Siliveru",
        "email": "siliveru@arkinfotechspectrum.com",
        "jd": "From: sandeep, ARK Infotech Spectrum siliveru@arkinfotechspectrum.com Reply to: siliveru@arkinfotechspectrum.com Hi,This is Sandeep from Ark Infotech Spectrum and please find the job description below which suits your profile and let us know your interest for this positionPP Num (Except USC) & LinkedIN Mandotary for Submission Job Title: - IT Sr. Project Manager – GxP ValidationClient: Implementation: Duration: 6+ MonthsExperience level: 12+ yearsLocation: USA (Remote) Job Summary: Our Project Management practice group is currently seeking a Sr IT Project Manager who has strong experience with cloud based solutions to support one of our global Healthcare devices/Life Science clients, based out of Kalamazoo, MI.In this role, the Sr IT Project Manager will be responsible for the Regulatory and compliance aspects of a cloud based implementation. A successful candidate would leverage effective project management practices, working collaboratively with various divisions and cross functional teams globally while delivering cost-effective implementation exceeding stakeholder expectations.Responsibilities and Duties: Independently Lead the detailed planning and management of the project from inception to project completionAbility to understand Validation, Transparency Laws, Integration of Healthcare/Pharma systems/Legacy systemsExperience with working in validated systems and nuances of computer system validationExperience managing large project involving multiple IT teams and systemsGxP validation processStakeholder communication and presentation experienceManage scope, budget, and schedule for project success.Create, maintain, and share all project related documents like charter, plan, risk register, issue list, presentations etc.Establish and maintain the project information in PPM toolMeet budgetary objectives and adjust project constraints based on financial analysisDevelop comprehensive project plans to be shared with clients as well as other staff membersUse and continually develop leadership skillsEstablish cadence and project status communications with stakeholders Manage the Change Control process for assigned projectsEnsure project milestones and targets are met by actively managing project on a day to day basis through appropriate resource, issue, and risk managementSuccessfully deliver assigned projects to targets (on time, on budget, and in scope)Lead cross-functional team meetings and ensure capture of discussion points and action itemsLead and participate in testing of system requirements, as neededWork with business managers to propose and justify new technology-based business improvements Basic QualificationsSenior Level 12+ years of experienceEast coast – can travel to Mahwah NJ or Kalamazoo MI location for milestone meetings5+ years’ experience with GxP Validation /Regulatory/Compliance Pharma experienceCloud implementation experience Disclaimer:: We're currently in the process of reviewing all applications thoroughly. If your profile matches what we're looking for, we'll reach out to discuss the next steps in the hiring process. However, if you do not hear from us, please understand that we are unable to move forward with your application at this time. Sandeep SiliveruSr. US IT Specialist| ARK InfoTech Spectrum Inc.,: linkedin.com/in/sandeep-siliveru-✪-5759b023b (Primary): linkedin.com/in/siliveru-sandeep-6a6120185 (Secondary)𝙽𝚘𝚝𝚎 : Our Solution. Your Success !",
        "source": "Email",
        "date_posted": "2024-10-04 11:30:20-05:00",
        "unique_id": "192585e2cadd133f",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]