[
    {
        "company": "Yochana IT Solutions Inc",
        "job_title": "Business Systems Analyst (BSA)",
        "location": "Fremont, CA, USA",
        "full_location": {
            "city": "Fremont",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "7+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SAP",
                "analytical skills",
                "problem-solving skills",
                "agile methodologies",
                "waterfall methodologies"
            ],
            "primary": [
                "SAP ECC",
                "SAP S/4",
                "system integrations",
                "data migrations",
                "Source to Settle (S2S)",
                "Procure to Pay (P2P)",
                "MRP",
                "PO Management",
                "Supplier Collaboration",
                "Sub-contracting",
                "communication skills",
                "stakeholder management"
            ],
            "secondary": [
                "large data handling in Excel",
                "SQL",
                "SAP Ariba",
                "Transportation Management Systems (TMS)",
                "BI tools"
            ],
            "all": [
                "SAP",
                "analytical skills",
                "problem-solving skills",
                "agile methodologies",
                "waterfall methodologies",
                "SAP ECC",
                "SAP S/4",
                "system integrations",
                "data migrations",
                "Source to Settle (S2S)",
                "Procure to Pay (P2P)",
                "MRP",
                "PO Management",
                "Supplier Collaboration",
                "Sub-contracting",
                "communication skills",
                "stakeholder management",
                "large data handling in Excel",
                "SQL",
                "SAP Ariba",
                "Transportation Management Systems (TMS)",
                "BI tools"
            ],
            "with_experience": [
                "SAP (7+ years)",
                "SAP ECC (5+ years)",
                "SAP S/4 (5+ years)"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Ajay",
        "email": "ajaym@yochana.com",
        "jd": "From: Ajay, Yochana IT ajaym@yochana.com Reply to: ajaym@yochana.com HiHope you are doing well. I Ajay representing Yochana IT Solutions Inc, one of the fastest growing IT staffing and services firm, specializing in staff augmentation for end-to-end Enterprise IT Solutions. I saw your profile and understand that you may be looking for new job opportunities. Below are some of the priority roles that I am currently hiring for. Let me know if you're interested in any of the roles. Also, please feel free to spread the word within your network – if anyone interested or looking for a change can reach out to me directly.Hiring Type – Contract Appreciate your help !!Business Systems Analyst (Order Management & Execution) – Fremont, CA – Hybrid – We are seeking a skilled Business Systems Analyst (BSA) to lead and support our digital transformation efforts, particularly in system integrations between SAP ECC and SAP S/4. In this role, you will collaborate with Global Information Systems (GIS) teams and various business units to analyze, design, and optimize system interfaces, workflows, and data migrations. You will work across multiple domains, such as Planning, Fulfillment, Supply Chain, and Manufacturing, while managing cross-functional tasks and dependencies. Key responsibilities include writing software requirements, designing solutions, testing, and ensuring seamless implementation of ERP systems. The ideal candidate will have over 7 Years of SAP experience, strong analytical and problem-solving skills, and experience in both agile and waterfall methodologies. Experience with SAP S/4 and prior conversion projects from SAP ECC are preferred. Senior Business Systems Analyst (Supply Chain Management) – Fremont, CA – Hybrid – We are seeking an experienced Business Systems Analyst (BSA) with expertise in Source to Settle (S2S) processes within SAP ECC and S/4 environments to support a Business/Digital Transformation Project. The ideal candidate will have strong hands-on experience in S2S and Procure to Pay (P2P) processes, including MRP, PO Management, Supplier Collaboration, and Sub-contracting. They will collaborate with business partners, system analysts, and technical teams to design, develop, and implement solutions, while managing cross-functional dependencies. Responsibilities include translating business requirements into functional specs, supporting the full project lifecycle from design through deployment, and providing post-go-live support. Candidates should have over 10 Years of SAP experience, with at least 5 Years in ECC and S/4 (MM, PP), along with strong communication, problem-solving, and stakeholder management skills. Experience with SAP ECC to S/4 conversions and large data handling in Excel/SQL is a plus. Senior Business Systems Analyst (Supplier Collaboration) – Fremont, CA – Hybrid – We are seeking a dynamic Business Systems Analyst (BSA) with over 10 Years of SAP experience, including 5+ Years in ECC & S/4 (MM, PP) and SAP Ariba. In this role, you'll analyze and solve complex business problems using re-engineered processes and automated solutions. You’ll design integration capabilities, collaborate on Supplier Collaboration systems, and support Procure to Pay (P2P) processes such as RFQ, PO Management, Sub-contracting, and Supplier Collaboration. You’ll work across project phases, from requirements gathering to post-go-live support, using both waterfall and agile methodologies. Strong problem-solving, communication, and stakeholder management skills are essential, along with expertise in SAP, BI tools, and SQL. Experience with SAP S4 functionalities and Transportation Management Systems (TMS) is preferred. Thanks & Regards,AjayYochana IT Solutions INC,23000 Commerce Dr, Farmington hills, MI-48335Let’s Challenge The Status Quo",
        "source": "Email",
        "date_posted": "2024-10-04 09:44:03-05:00",
        "unique_id": "19257fcdfbe43806",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]