[
    {
        "company": "Resource Logistics, Inc.",
        "job_title": "Senior Technical Lead",
        "location": "Charlotte, NC, USA",
        "full_location": {
            "city": "Charlotte",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5-8 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Python",
                "Data Science",
                "Machine Learning"
            ],
            "primary": [
                "Predictive Analysis",
                "Time Series Algorithms",
                "Anomalies Detection",
                "Random Forest",
                "Isolation Forest",
                "LSTM",
                "BERT",
                "GPT",
                "TensorFlow",
                "PyTorch",
                "MLOPS"
            ],
            "secondary": [
                "Deep Learning",
                "Neural Networks",
                "Supervised Learning",
                "Unsupervised Learning"
            ],
            "all": [
                "Python",
                "Data Science",
                "Machine Learning",
                "Predictive Analysis",
                "Time Series Algorithms",
                "Anomalies Detection",
                "Random Forest",
                "Isolation Forest",
                "LSTM",
                "BERT",
                "GPT",
                "TensorFlow",
                "PyTorch",
                "MLOPS",
                "Deep Learning",
                "Neural Networks",
                "Supervised Learning",
                "Unsupervised Learning"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Ashok Huria",
        "email": "ashok.huria@resource-logistics.com",
        "jd": "AI ML and strong hands on Python. Location CaliforniaCity Charlotte, NCContract Job Description (Posting). We need to add 2 resources to implement some of the advanced features (Predictive Analysis using iONA).It is AIML resource with Python programming experience.Min 5- 8 years of experience Python Strong in Data science and Machine Learning , must know time series algos, Anomalies detection and prediction algos like Radom forest isolation, LSTM etc. Strong understanding of frameworks like BERT, GPT or transformer models, Supervised and unsupervised ML techniques, frameworks like TensorFlow, PyTorch, etc, Experience with cloud platforms, Experience with MLOPS , Basic knowledge of deep learning and neural networks. (1.) To be responsible for providing technical guidance to a team of developers, enhancing their technical capabilities and increasing productivity.(2.) To conduct comprehensive code reviews, establish and oversee quality assurance processes, performance optimization , implementation of best practices and coding standards to ensure succeful delivery of complex projects. (3.) To ensure process compliance in the assigned module, and participate in technical discussionsorreview as a technical consultant for feasibility study (technical alternatives, best packages, supporting architecture best practices, technical risks, breakdown into components, estimations).(4.) To collaborate with stakeholders to define project scope, objectives, deliverables and accordingly prepare and submit status reports for minimizing exposure and closure of escalations.Skill (Primary) Data Science-Advanced Analytics-PythonJob Family DevelopmentBand E2Job Senior Technical LeadRequisition Source New Project/Extension Other Requirement This is for Wells. Need 5 days onsite in Charlotte, NC, need local or nearby onlyJunior resource of 5+ years will work. Should have proven projects on upcoming technologies like AI ML and strong hands on Python.Predictive Analysis using iONA needed Submit along with skill matrix Ashok HuriaAccount ManagerResource Logistics, Inc.39 Milltown Road, East Brunswick, NJ 08816Cell: (732) 289-3139",
        "source": "Email",
        "date_posted": "2024-10-04 15:11:48-05:00",
        "unique_id": "1925928ed3a0d13d",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Python developer"
    }
]