[
    {
        "company": "sternsolservices.com",
        "job_title": "Sr. Security Project Manager",
        "location": "Fremont, CA, USA",
        "full_location": {
            "city": "Fremont",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "12+ years",
            "degree_required": "BS or MS degree in Computer Science or related",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Information Security expertise",
                "IT Policies and Standards",
                "Disaster Recovery",
                "Vulnerability Management",
                "Business Resilience",
                "Applications Security",
                "DevSecOps"
            ],
            "primary": [
                "Project tracking tools (Microsoft Project/Azure DevOps/JIRA)",
                "Agile/SCRUM Methodologies"
            ],
            "secondary": [
                "Security process improvement",
                "Project management practice"
            ],
            "all": [
                "Information Security expertise",
                "IT Policies and Standards",
                "Disaster Recovery",
                "Vulnerability Management",
                "Business Resilience",
                "Applications Security",
                "DevSecOps",
                "Project tracking tools (Microsoft Project/Azure DevOps/JIRA)",
                "Agile/SCRUM Methodologies",
                "Security process improvement",
                "Project management practice"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Anvit",
        "email": "anvit@sternsolservices.com",
        "jd": "From: Anvit, sternsolservices.com anvit@sternsolservices.com Reply to: anvit@sternsolservices.com Job Title: Sr. Security Project ManagerLocation: Fremont, CA (Hybrid Onsite)Duration: Long Term Note: Need local folks only. Requirements:Possess strong Information Security expertise, Understanding of IT Policies and Standards.Support IT Disaster Recovery exercise being part of the BUIT, able to coordinate with multiple project/application teamsCollaborate with multiple work streams and InfoSec to disseminate the security requirements for the solutions that are implemented.Work with different IT towers (Infrastructure, Development, Data Analytics, End User support) to align on the security requirements across the board.Strong technical background with an understanding of the enterprise applications landscape with applications developed on SAP and Non-SAP stackWorks with business units to understand the overall business success criteria and scale security requirements for operational excellence.Support security standards and policies are correctly implemented in the solutions developed.Ability to identify overall business needs and be able to work through exception management use cases.Ability to partner with multiple stakeholders and influence project decisions.Must be able to demonstrate the skills and ability to build effective and productive relationships both with clients and internal teams.Familiarity with security process improvement and project management practice.Able to handle multiple projects with competing priorities.Support technology architecture design review efforts. Minimum QualificationBS or MS degree in Computer Science or relatedMinimum of 12 years + of total experience in security portfolioExperience in the areas of Vulnerability Management, Business Resilience, Disaster Recovery, Applications Security, and DevSecOps. Preferred Qualifications/SkillsExperience with Project tracking tools like Microsoft Project/Azure DevOps/JIRAExperience with Agile/SCRUM MethodologiesCertifications: InfoSec – Security+, Certified in CyberSecurity, SSCP, or CISSP",
        "source": "Email",
        "date_posted": "2024-10-04 08:48:17-05:00",
        "unique_id": "19257c9d0edd58bf",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]