[
    {
        "company": "Nukasani Group",
        "job_title": "Java Developer",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "HS Diploma or GED",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Best competitive rate"
        },
        "skills": {
            "core": [
                "Java",
                "JavaScript",
                "Java Beans",
                "JSP",
                "JMS",
                "J2EE",
                "Spring Boot",
                "Hibernate"
            ],
            "primary": [
                "CSS",
                "DHTML",
                "HTML",
                "XML",
                "SOAP",
                "REST",
                "RPC",
                "Kubernetes",
                "Docker",
                "Swagger",
                "Jira",
                "Maven"
            ],
            "secondary": [
                "FHIR",
                "Ruby",
                "AZURE",
                "AWS",
                "508 Compliance",
                "Agile frameworks"
            ],
            "all": [
                "Java",
                "JavaScript",
                "Java Beans",
                "JSP",
                "JMS",
                "J2EE",
                "Spring Boot",
                "Hibernate",
                "CSS",
                "DHTML",
                "HTML",
                "XML",
                "SOAP",
                "REST",
                "RPC",
                "Kubernetes",
                "Docker",
                "Swagger",
                "Jira",
                "Maven",
                "FHIR",
                "Ruby",
                "AZURE",
                "AWS",
                "508 Compliance",
                "Agile frameworks"
            ],
            "with_experience": [
                "Java (5+ years)",
                "JavaScript",
                "Spring Boot",
                "Hibernate"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Nancy",
        "email": "recruiter5@nukasanigroup.com",
        "jd": "From: Nanacy, nukasanigroup recruitment@nukasanigroup.com Reply to: recruitment@nukasanigroup.com Dear Partner,Good Morning ,Greetings from Nukasani group Inc !, We have below urgent long term contract project immediately available for ** Java Developer, Remote* need submissions you please review the below role, if you are available, could you please send me updated word resume, and below candidate submission format details, immediately. If you are not available, any referrals would be greatly appreciated.Interviews are in progress, urgent response is appreciated. Looking forward for your immediate response and working with you. **Candidate Submission Format - needed from you**Full Legal NamePersonal Cell No ( Not google phone number)Email IdSkype IdInterview AvailabilityAvailability to start, if selectedCurrent LocationOpen to RelocateWork AuthorizationTotal Relevant ExperienceEducation./ Year of graduationUniversity Name, LocationLast 4 digits of SSNCountry of BirthContractor Type DOB: mm/dd Home Zip CodeAssigned Job DetailsJob Title :Java DeveloperLocation: RemoteRate : Best competitive rateRole: Java DeveloperLocation: Remote**Immigration status: USC, GC.**Clearance: Public Trust (preferred).**The Opportunity:** Join us in our mission to revolutionize federal healthcare through technology. As a Java Developer, you will be instrumental in designing and implementing full-stack solutions that modernize the Veterans Administration's systems. This role transcends mere coding; it's about leveraging a holistic view of software development to address complex challenges and deliver impactful results in an Agile environment.**Your Role and Responsibilities:**Design, develop, and deploy transformative applications using Java technologies, ensuring alignment with the project’s architectural and design principles.Engage in the entire Agile development lifecycle, from conception to deployment, focusing on creating efficient, scalable solutions.Utilize advanced development techniques and tools such as microservices, domain-driven design, and n-tier architectures to solve challenging problems.Collaborate with cross-functional teams to identify system improvements and enhancements, advocating for best practices in software development.Serve as a mentor to team members, sharing knowledge and fostering a culture of continuous learning and improvement.Ensure solutions are scalable, resilient, and aligned with future technology enhancements and architectural evolutions.**Qualifications:**5+ years of experience in software development, with a strong focus on Java and related technologies (JavaScript, Java Beans, JSP, JMS, J2EE, Spring Boot, Hibernate, CSS, DHTML, HTML, XML).Experience in API styles (SOAP, REST, RPC) and understanding of software development principles for web applications.Experience with containerization tools (Kubernetes, Docker) and familiarity with Swagger, Jira, or Maven.Ability to work remotely within the United States, including the District of Columbia.Ability to obtain and maintain a Public Trust or Suitability/Fitness determination based on client requirementsHS Diploma or GED **Preferred Qualifications:**Experience with FHIR, Ruby, AZURE, and AWS (IaaS and PaaS).Knowledge of 508 Compliance requirements and Agile frameworks.Bachelor’s degree in a relevant field and/or SAFe Certification.",
        "source": "Email",
        "date_posted": "2024-10-04 11:47:52-05:00",
        "unique_id": "192586e3a15990d9",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]