[
    {
        "company": "KK Software Associates LLC",
        "job_title": "SAP Project Management based on SAP ACTIVATE",
        "location": "Dallas, TX, USA",
        "full_location": {
            "city": "Dallas",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "10 & Above",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SAP Project Management",
                "SAP ACTIVATE",
                "S/4 HANA",
                "OTC experience"
            ],
            "primary": [
                "Keynote",
                "Jira",
                "PMP certified"
            ],
            "secondary": [],
            "all": [
                "SAP Project Management",
                "SAP ACTIVATE",
                "S/4 HANA",
                "OTC experience",
                "Keynote",
                "Jira",
                "PMP certified"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Priya Mishra",
        "email": "priya.m@kksoftwareassociates.com",
        "jd": "Hello,Hope you are doing good. This is Priya from KK Software Associates LLC. We are the Preferred vendor for the clients.I found your resume suitable for one of the job opportunities we currently have.Please find the detailed job description and please do let me know if you are interested in this opening: Job Title: SAP Project Management based on SAP ACTIVATELocation- Dallas, TX OR Sunnyvale, CA (Day -1 onsite)(ContractExperience (Years): 10 & AboveRole DescriptionProject Manager having OTC experience with at least 1 S/4 HANACompetencies: Digital : SAP Project Management based on SAP ACTIVATEProject Manager having OTC experience with at least 1 S/4 HANA migration/Implementation experience.? Ability to work with PMO, techical, and functional teams to gather requirements on project timeline, put project build plan for systems, and deliver the environments in support of project timeline.? Provided technical management oversight to support the project planning and execution for infrastructure and build activities, delivery of environments for development phase, integration, user acceptance, and performance test phases, and dress rehearsal, to cutover? Clear understanding of project life cycle of System Conversion projects and dual landscape management from Development, Integration Test, User Acceptance Test, Dress Rehearsal, and Cutover.Desirable Skills: ? Keynote and Jira, PMP certified? Jira could be mandatory for few PM positions.",
        "source": "Email",
        "date_posted": "2024-10-04 10:28:53-05:00",
        "unique_id": "1925825e87aa8e5a",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]