[
    {
        "company": "Siri Info Solutions",
        "job_title": "Java Architect with JBPM",
        "location": "Houston, TX, USA",
        "full_location": {
            "city": "Houston",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "12+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long term contract – 2 Years +",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "JBPM",
                "Node JS",
                "Angular",
                "CI-CD",
                "AWS",
                "Data Integration",
                "Multithreading"
            ],
            "primary": [
                "Jenkins",
                "Ansible",
                "Artifactory",
                "Spring",
                "Hibernate",
                "IBatis",
                "Entity Framework",
                "log4j/log4net"
            ],
            "secondary": [
                "data streaming technologies",
                "AMQ",
                "message-oriented architecture",
                "thread safety",
                "Business Communication"
            ],
            "all": [
                "Java",
                "JBPM",
                "Node JS",
                "Angular",
                "CI-CD",
                "AWS",
                "Data Integration",
                "Multithreading",
                "Jenkins",
                "Ansible",
                "Artifactory",
                "Spring",
                "Hibernate",
                "IBatis",
                "Entity Framework",
                "log4j/log4net",
                "data streaming technologies",
                "AMQ",
                "message-oriented architecture",
                "thread safety",
                "Business Communication"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "John Papatla",
        "email": "john.p@siriinfo.com",
        "jd": "Hello,Hope you are doing well!! Greeting from Siri Info Solutions.I am John with Siri Info Solutions. We Siri Info Solutions is a global staff augmentation firm providing a wide-range of talent on-demand and total workforce solutions. We have an immediate opening for the below position with one of our premium clients. Title: Java Architect with JBPM Location: Houston, TX - Day 1 Onsite Duration: Long term contract – 2 Years + Must Have: Java, JBPM, Node JS, Angular, CI-CD, AWS, Data Integration, Multithreading Description: Day 1 Onsite in Houston Client Office. 3 Days in a week mandatory in office: Tue, Wed, & Thurs. Client is looking for someone who can architect and develop solutions of his own and lead the work independently. At least 12+ years Expertise in handling component deployment and maintenance of Node JS and Angular/Angular JS application. Strong knowledge of Java technologies and experience of handling process manager tool like JBPM / Red Hat PAM. Strong experience in CI-CD using Jenkins, Ansible and Artifactory and AWS deployments. Strong hands-on development experience using Java frameworks and/or a variety of open-source frameworks, including Entity Framework, log4j/log4net, Spring, Hibernate, IBatis, distributed caching software (both open source and commercial) Expertise with data streaming technologies like AMQ etc. for batch mode data processing. Good knowledge on Data Integration using message-oriented architecture Experience with multithreading and thread safety Good in Business Communication",
        "source": "Email",
        "date_posted": "2024-10-04 14:02:22-05:00",
        "unique_id": "19258e95b5d6e02e",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]