[
    {
        "company": "Schrilltech",
        "job_title": "SAP Business Analyst with Dot Net Exp",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10 years",
            "degree_required": "Bachelor’s degree in Business Administration, Information Technology, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SAP",
                ".NET",
                "Requirements Gathering",
                "Functional Documentation",
                "Test Case Development",
                "Testing Execution",
                "Process Mapping"
            ],
            "primary": [
                "Analytical skills",
                "Problem-solving abilities",
                "Written communication skills",
                "Verbal communication skills",
                "Experience with process mapping"
            ],
            "secondary": [
                "Manufacturing experience",
                "Collaboration with teams",
                "Test Data Preparation"
            ],
            "all": [
                "SAP",
                ".NET",
                "Requirements Gathering",
                "Functional Documentation",
                "Test Case Development",
                "Testing Execution",
                "Process Mapping",
                "Analytical skills",
                "Problem-solving abilities",
                "Written communication skills",
                "Verbal communication skills",
                "Experience with process mapping",
                "Manufacturing experience",
                "Collaboration with teams",
                "Test Data Preparation"
            ],
            "with_experience": [
                "SAP (10 years)",
                ".NET"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Sanaullah",
        "email": "sanaullah@schrilltech.com",
        "jd": "Hi There, Please have a look below JD and let me know if you are interested in joining a new project. SAP Business Analyst with Dot Net Exp _Remote Contractual Role Key Responsibilities:Requirements Gathering: Engage with business stakeholders to collect and analyze requirements for SAP solutions, ensuring alignment with organizational goals.Functional Documentation: Write comprehensive functional design documents (FD) that detail system requirements, specifications, and business processes.Test Case Development: Develop and document test cases based on functional requirements to validate system functionality.Testing Execution: Conduct various testing phases, including system integration testing (SIT) and user acceptance testing (UAT), ensuring the quality and reliability of SAP solutions.Test Data Preparation: Create and manage test data sets necessary for conducting rigorous testing.Process Mapping: Develop process flow diagrams to illustrate business processes and system interactions, enhancing stakeholder understanding.Collaboration with Teams: Work closely with development teams, project managers, and other stakeholders to facilitate successful SAP implementations.Manufacturing Experience: Utilize prior manufacturing experience to provide insights and recommendations throughout the project lifecycle.Qualifications/Education: Bachelor’s degree in Business Administration, Information Technology, or a related field.Experience:10 years of experience as a Business Systems Analyst, specifically within SAP.Proficiency in .NET technologies and familiarity with install base concepts.Experience in manufacturing environments is a plus. Skills:Strong analytical and problem-solving abilities.Excellent written and verbal communication skills.Proficient in creating functional specifications and test cases.Experience with process mapping and flow diagram creation. Please share below detail,Attach your resume ::Work Authorization ::Best Hourly Rate or Employer :: Warm Regards,Sanaullah",
        "source": "Email",
        "date_posted": "2024-10-04 09:43:51-05:00",
        "unique_id": "19257fcb08d0d9f7",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]