[
    {
        "company": "Tek Inspirations LLC",
        "job_title": "C2H - BSA/Data Analyst",
        "location": "Philadelphia, PA, USA",
        "full_location": {
            "city": "Philadelphia",
            "state": "PA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "6-8 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SQL",
                "Data Warehousing",
                "Data Profiling",
                "Data Mapping",
                "Healthcare Insurance"
            ],
            "primary": [
                "Business Requirement Documents",
                "Functional Requirement Documents",
                "Mapping Documents",
                "Complex SQL Queries",
                "Verbal Communication",
                "Written Communication"
            ],
            "secondary": [
                "Source-to-Target Mapping",
                "Testing Support",
                "Production Readiness Verification"
            ],
            "all": [
                "SQL",
                "Data Warehousing",
                "Data Profiling",
                "Data Mapping",
                "Healthcare Insurance",
                "Business Requirement Documents",
                "Functional Requirement Documents",
                "Mapping Documents",
                "Complex SQL Queries",
                "Verbal Communication",
                "Written Communication",
                "Source-to-Target Mapping",
                "Testing Support",
                "Production Readiness Verification"
            ],
            "with_experience": [
                "SQL (6-8 years)",
                "Data Warehousing",
                "Healthcare Insurance"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Payal Shrivastava",
        "email": "payal.shrivastava@tekinspirations.com",
        "jd": "Urgent Requirement (W2) Reminders: All candidates are required to be onsite 3 days/week (Tues. Wed. Thurs.) Must reside in the tri-state area (PA, NJ, DE) and be commutable to center city Philadelphia. Candidates living in New York will NOT be considered. Job Title: C2H - BSA/Data Analyst Hybrid Role: Required to come onsite 3 days a week. (Tues. Wed. Thurs.) Engagement Type: Contract to Hire, Start date: ASAP Location: The candidate must live in the PA, NJ, DE area (No exceptions), and must be commutable to the office. Candidates living in New York will not be considered. The hiring manager will only consider local candidates with the potential to convert to FTE. Work Address: 1901 Market St. Philadelphia, PA 19103 W2 Only Job Description: This is a BSA/Data Analyst with strong Data Warehouse and advanced SQL experience. SQL - Must be able to join tables and be expert level. Previous Healthcare Insurance experience required. The Business System Analyst role on the EIM - Data Warehouse team requires experience in creating Business Requirement Documents, Functional Requirement Documents and Mapping documents for the development of ETL applications. This role requires extensive SQL experience in writing complex queries across multiple tables, data analysis and profiling skills for the creation of the mapping documents and further discussion with data modelers for the necessary table designs. The ideal candidate should have all of the above skills at expert level along with strong verbal and written communication skills to work with various stakeholders, gather and formulate business requirements and translate the same to the technical team. Other preferred experience includes Source-to-Target mapping, health insurance knowledge and general data warehousing. The candidate will also be comfortable enough to support testing, production readiness verification and ensuring accuracy after the deployments. This might include weekend and off hours support.",
        "source": "Email",
        "date_posted": "2024-10-04 10:47:46-05:00",
        "unique_id": "192584e992b2e03c",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]