[
    {
        "company": "Tek Inspiration",
        "job_title": "Full Stack Java AWS Developer",
        "location": "Seattle, WA, USA",
        "full_location": {
            "city": "Seattle",
            "state": "WA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "12+ years",
            "degree_required": "Bachelor's degree in Computer Science, Software Engineering, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 Months+",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "J2EE",
                "Spring",
                "JavaScript",
                "AWS"
            ],
            "primary": [
                "EC2",
                "S3",
                "RDS",
                "Lambda",
                "Docker",
                "Kubernetes",
                "CI/CD"
            ],
            "secondary": [
                "Data structure",
                "Algorithms",
                "Problem solving",
                "Open-source contributions"
            ],
            "all": [
                "Java",
                "J2EE",
                "Spring",
                "JavaScript",
                "AWS",
                "EC2",
                "S3",
                "RDS",
                "Lambda",
                "Docker",
                "Kubernetes",
                "CI/CD",
                "Data structure",
                "Algorithms",
                "Problem solving",
                "Open-source contributions"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Sahanbaz Khan",
        "email": "sahanbaz.khan@tekinspirations.com",
        "jd": "Job Description –Position: Full Stack Java AWS DeveloperLocation: Seattle, WA (all 5 days a week onsite is must)Duration: 6 Months+MOI: SKYPE This is a turnaround position. Need qualified resumes faster.Note-Hiring manger is Indian, PV is Technical and take technical screening Video call.candidate must have extra ordinary communization skill who can answer technical question. Need LinkedIn with profile picNeed only local candidates within 1-hour distance Note: Please share the resume of candidates coming from Healthcare domain experience. Java, J2EE, Spring, JavaScript with AWS cloud. qualifications:Bachelor's degree in Computer Science, Software Engineering, or a related field.12+ years pf experience in Java, J2EE, Spring, JavaScript.3+ years of experience developing web applications using AWS technologies (EC2, S3, RDS, Lambda, etc.).Strong coding skills.AWS cloud: ECS far gate, S3, DDB, API Gateway.Good Data & Database skills.Problem solving: Data structure, Algorithms. Must Qualifications:Experience with healthcare domain knowledge or applications.Knowledge of containerization technologies (Docker, Kubernetes).Experience with CI/CD pipelines and DevOps practices.Contributions to open-source projects.Position Summary:We are seeking a talented Full Stack Java AWS Developer to join our team and contribute to the development of innovative healthcare applications.The ideal candidate will have a strong foundation in Java development, experience with AWS cloud technologies, and a passion for creating high-quality software. Responsibilities:Design, develop, and maintain robust and scalable Java-based applications for healthcare clients.Collaborate with cross-functional teams (product management, design, QA) to deliver high-quality solutions.Leverage AWS cloud technologies (EC2, S3, RDS, Lambda, etc.) to build scalable and efficient applications.Implement best practices for software development, including code reviews, testing, and documentation.Stay up to date with the latest trends and technologies in the healthcare and software development industries.",
        "source": "Email",
        "date_posted": "2024-10-04 18:11:49-05:00",
        "unique_id": "1925a076aff974b5",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]