[
    {
        "company": "State of IA",
        "job_title": "Lead DevOps-Upskilling Partner",
        "location": "Des Moines, IA, USA",
        "full_location": {
            "city": "Des Moines",
            "state": "IA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "747908",
            "experience_required": "10 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "10 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "TFS",
                "Azure DevOps",
                "GitHub",
                "C#",
                "ASP.NET",
                "MVC",
                ".NET Core",
                "Security Practices",
                "Test Automation",
                "T-SQL",
                "MS SQL",
                "Technical Leadership",
                "Code Quality Tools",
                "Code Branching"
            ],
            "primary": [
                "ADO",
                "GitHub Actions",
                "Static Code Analysis",
                "Encryption",
                "SonarQube",
                "Checkmarx",
                "GitHub Advanced Security",
                "Unit Testing",
                "Integration Testing",
                "Selenium",
                "NUnit",
                "xUnit",
                "TypeScript",
                "Angular"
            ],
            "secondary": [
                "Mentorship",
                "Stakeholder Communication",
                "CI/CD",
                "Automation",
                "Query Tuning",
                "Database Optimization"
            ],
            "all": [
                "TFS",
                "Azure DevOps",
                "GitHub",
                "C#",
                "ASP.NET",
                "MVC",
                ".NET Core",
                "Security Practices",
                "Test Automation",
                "T-SQL",
                "MS SQL",
                "Technical Leadership",
                "Code Quality Tools",
                "Code Branching",
                "ADO",
                "GitHub Actions",
                "Static Code Analysis",
                "Encryption",
                "SonarQube",
                "Checkmarx",
                "GitHub Advanced Security",
                "Unit Testing",
                "Integration Testing",
                "Selenium",
                "NUnit",
                "xUnit",
                "TypeScript",
                "Angular",
                "Mentorship",
                "Stakeholder Communication",
                "CI/CD",
                "Automation",
                "Query Tuning",
                "Database Optimization"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "manindra",
        "email": "manindra@schrilltech.com",
        "jd": "Hi Good Morning,Hope you are doing wellWe have a position for the below requirement. Role: Lead DevOps-Upskilling PartnerLocation: Des Moines, IA || RemoteJob Id: 747908Experience: 10 Years & AboveClient:State of IADuration: 10 MonthsProvide three (3) professional references [REQUIRED] on the candidate's resume with Contact Name, Title, Contact, and Relation to the candidate. Lead DevOps Engineer with experience mentoring and upskilling experience. . Must be technically sound with TFS and ADO transformations to GitHub. Must be a savvy business communicator who can influence stakeholders and lead teams. *** NOTE: Only submit candidates who have the following 3 MUST HAVE’S*** 1. The candidate must have TFS (Team Foundation Server) to GitHub transformation experience.2. The candidate must have ADO (Azure DevOps) to GitHub transformation experience, including wikis and dashboards3. The candidate must be both technically sound as well as a savvy business communicator who can influence stakeholders and lead team. The ideal candidate will play a critical role in migrating applications from TFS/ADO to GitHub, establishing DevOps best practices, and mentoring developers. Requirements:1. C#, ASP.NET, MVC, .NET Core (8+ years): Strong experience in the Microsoft technology stack is required. This role is primarily DevOps-focused, but you’ll need to understand the code well enough to mentor teams and drive best practices. While .NET Core isn’t currently in use, you may help introduce it into future projects.2. Security Practices (8+ years): You will implement security practices like static code analysis and encryption. Experience with security tools (e.g., SonarQube, Checkmarx, GitHub Advanced Security) and maintaining compliance with standards (e.g., ADA) is a plus.3. TFS, Azure DevOps, GitHub Enterprise, GitHub Actions (5+ years): A deep understanding of TFS, Azure DevOps, GitHub, and CI/CD tools is required. You will lead the migration from TFS/ADO to GitHub, building out automation and best practices from scratch.4. Test Automation & TDD (5+ years): You’ll implement automated testing, improve test coverage, and ensure reliability through unit and integration tests. Teams are not yet using tools like Selenium, NUnit, or xUnit, and you’ll be responsible for setting these up.5. T-SQL and MS SQL (8+ years): Strong skills in query tuning and database optimization and automation are required. The focus will be on query optimization and automating database-related tasks.6. Technical Leadership & Mentorship (5+ years): Experience in mentoring and leading developers is crucial. You’ll establish and enforce code review standards, guide development practices, and provide technical leadership in DevOps strategies.7. Code Quality & Security Scanning Tools (4+ years): Familiarity with tools such as GitHub Advanced Security, Dependabot, and Snyk will help you integrate security and code quality into the pipeline.8. Code Branching, Merging, and Release Optimization (5+ years): Experience in optimizing the code branching and release management processes is essential.9. TypeScript/Angular, Client-Based Authorization (2+ years): While the immediate focus is not on front-end technologies, knowledge of TypeScript and Angular is a plus. You may work with teams that use these technologies in the future.",
        "source": "Email",
        "date_posted": "2024-10-04 10:18:43-05:00",
        "unique_id": "192581d0245bfcb2",
        "emp_type": [
            "third party"
        ],
        "tag": ".net developer"
    }
]