[
    {
        "company": "Maintec",
        "job_title": "SCRUM Master",
        "location": "Omaha, NE, USA",
        "full_location": {
            "city": "Omaha",
            "state": "NE",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Mid Level",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SCRUM Master",
                "Project Management",
                "JIRA",
                "Agile Team Facilitation"
            ],
            "primary": [
                "Collaboration with Stakeholders",
                "Backlog Refinement",
                "Sprint Planning",
                "Daily Stand-Up",
                "Showcases",
                "Retrospective"
            ],
            "secondary": [
                "SAP Project Management",
                "Atlassian Tools",
                "MS SharePoint",
                "MS Teams"
            ],
            "all": [
                "SCRUM Master",
                "Project Management",
                "JIRA",
                "Agile Team Facilitation",
                "Collaboration with Stakeholders",
                "Backlog Refinement",
                "Sprint Planning",
                "Daily Stand-Up",
                "Showcases",
                "Retrospective",
                "SAP Project Management",
                "Atlassian Tools",
                "MS SharePoint",
                "MS Teams"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Arun Kumar",
        "email": "arun.p@maintec.com",
        "jd": "Hi , We have a position open for our client , please have a look into the job description below and share me your updated resume . Job Role : SCRUM Master Location : Omaha, NE (LOCAL profiles needed ) BELOW 10 Years of profiles Needed MUST HAVE: CORE SCRUM MASTER / PROJECT MANAGEMENT SKILLS, Experience With JIRA, Effective At Collaborating With Stakeholders, Business Partners And Technical Team Members To Facilitate SCRUM CEREMONIES – Backlog Refinement, Sprint Planning, Daily Stand-Up, Showcases And Retrospective. Advocate For Autonomous, Self-Organizing, Empowered, And Continuously Improving Agile Team(S). Assists With Agile Training And Coaching, Promoting Accountability And Transparency Across All Levels Of The Organization. Proactive in solving problems / impediments to help their team(s) succeed and deliver business value. Have Experience With In-House And Vendor Implementations. GOOD TO HAVE: SAP PROJECT MANAGEMENT, ATLASSIAN TOOLS, MS SHAREPOINT / TEAMS EXPERIENCE EXPERIENCE LEVEL: Mid Level SCRUM MASTER / PROJECT MANAGER ONSHORE LOCATION: CANDIDATE IS EXPECTED TO ADHERE TO UP WORKING SCHEDULE AND BE ONSITE FOR COLLABORATION SESSIONS AND TEAM MEETINGS. DESIRED PROFILE: \" Serves As Scrum Master For 2-3 Agile Teams\" Organizes And Facilitates Agile Team Activities And Ceremonies (e.g. Planning, daily stand-up, backlog refinement, showcase, and retrospectives).\" in a scaled agile model, facilitates scaled planning for the team-e.g. Pre-planning/preparation, pi planning events and represents the team at broader planning and coordination sessions.\" Comfortable Experimenting With A Variety Of Approaches Based On Need & Fit. Promotes The Use Of/Experimentation With Quality/Engineering Practices.\" Collaborates With The Product Owner(S) To Ensure The Team Has A Healthy Product And Sprint Backlog.\" Coaches The Team Towards The Importance Of Regular Sprint Showcase To Demonstrate Finished Work To Stakeholders And Celebrates Team Achievements.\" Manages And Helps The Team Implement Areas Of Improvement As Identified In The Retrospective.\" Facilitates Dependency Management/Risk Management/Impediment Removal For The Team.\" Works With Product Owners And Program Managers To Understand The Product Roadmap, Priorities, And Schedules To Guide Delivery.\" Understands And Utilizes Lean-Agile Metrics To Help Teams Continually Improve. Assesses The Agile/Scrum Maturity Of The Team & Coaches The Team To Higher Levels Of Maturity.\" Coaches Team Members And Partners With Other Scrum Masters Regarding Adoption Of Agile Standards, Tools, And Best Practices To Improve Collaboration And Self-Management, PROMOTING Healthy Interactions Both With Team And With External Stakeholders.\" Support The Team In Using Agile Planning And Development Tools (e.g. JIRA, SHAREPOINT, M365, ETC.).\" Awareness Of Agile Technology Practices, Techniques, And DevOps (E.G., User Stories, Test Driven Development, Continuous Integration, Continuous Testing, Pairing, Automated Testing).\" Knowledge On Agile Development Methodology Thank You & Regards,Arun Kumar/ Lead US IT Recruiter",
        "source": "Email",
        "date_posted": "2024-10-04 08:11:53-05:00",
        "unique_id": "19257b337ea6fec0",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Scrum Master"
    }
]