[
    {
        "company": "Yochana",
        "job_title": "Java full stack developer",
        "location": "Phoenix, AZ, USA",
        "full_location": {
            "city": "Phoenix",
            "state": "AZ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "9+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Full Stack Development"
            ],
            "primary": [
                "Technical Guidance",
                "Code Reviews",
                "Quality Assurance",
                "Performance Optimization",
                "Best Practices"
            ],
            "secondary": [
                "Project Management",
                "Stakeholder Collaboration",
                "Technical Consulting"
            ],
            "all": [
                "Java",
                "Full Stack Development",
                "Technical Guidance",
                "Code Reviews",
                "Quality Assurance",
                "Performance Optimization",
                "Best Practices",
                "Project Management",
                "Stakeholder Collaboration",
                "Technical Consulting"
            ],
            "with_experience": [
                "Java (9+ years)",
                "Technical Guidance"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Abhishek",
        "email": "abhishek@yochana.com",
        "jd": "Hello, Hope you are doing Well! I'm currently staffing for an Java full stack developer at Phoenix, AZ (Onsite) . Below you will find the job description, if you are qualified and interested please send me your Updated Word Document Resume to abhishek@yochana.com My apologies if this position is not an ideal fit, we'll keep you in mind for other suitable positions and referrals would be appreciated. Thank you in advance. Role : Java full stack developer Location : Phoenix, AZ Experience : 9+ years Need locals Only To be responsible for managing technology in complex projects, providing technical guidance and ensuring successful delivery of solutions. To be responsible for providing technical guidance to a team of developers, enhancing their technical capabilities and increasing productivity. To conduct comprehensive code reviews, establish and oversee quality assurance processes, performance optimization, implementation of best practices and coding standards to ensure successful delivery of complex projects. To ensure process compliance in the assigned module, and participate in technical discussions or review as a technical consultant for feasibility study (technical alternatives, best packages, supporting architecture best practices, technical risks, breakdown into components, estimations). To collaborate with stakeholders to define project scope, objectives, deliverables and accordingly prepare and submit status reports for minimizing exposure and closure of escalations.",
        "source": "Email",
        "date_posted": "2024-10-04 10:47:16-05:00",
        "unique_id": "1925836c18e6f270",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]