[
    {
        "company": "NYS ITS (DCJS)",
        "job_title": "Business Analyst",
        "location": "Albany, NY, USA",
        "full_location": {
            "city": "Albany",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "HBITS-06-13610",
            "experience_required": "84 months",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "30 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "business requirements elicitation",
                "test plan development",
                "test case execution",
                "defect tracking",
                "criminal justice processing"
            ],
            "primary": [
                "process modeling",
                "user acceptance testing",
                "functional testing",
                "system documentation",
                "automated testing"
            ],
            "secondary": [
                "statistical reporting",
                "fingerprint identification processing",
                "criminal history updating",
                "Sex Offender management",
                "tracking of Wanted/Missing persons",
                "Offender Supervision initiatives"
            ],
            "all": [
                "business requirements elicitation",
                "test plan development",
                "test case execution",
                "defect tracking",
                "criminal justice processing",
                "process modeling",
                "user acceptance testing",
                "functional testing",
                "system documentation",
                "automated testing",
                "statistical reporting",
                "fingerprint identification processing",
                "criminal history updating",
                "Sex Offender management",
                "tracking of Wanted/Missing persons",
                "Offender Supervision initiatives"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Yogesh Dahiya",
        "email": "yogeshd@sspearhead.com",
        "jd": "From: Yogesh Dahiya, SSPEARHEAD INC yogeshd@sspearhead.com Reply to: yogeshd@sspearhead.com Hi, Hope you are doing good. Please have a look on below position and let me know if you are interested? Required Documentation: Make sure you if you are fine with this job then please share the below details at the time submission time.If you are not going to provide these details then please don’t apply for this job.1: Passport mandatory for these visa’s ( EAD, GC and H1B)2: Visa stamping copy required for H1 B3: Must be provide 3 references with full name, email id, client name and phone number. Job Description:Job Id: HBITS-06-13610Role: IT SpecialistClient: NYS ITS (DCJS)Duration: 30 monthsLocation: Albany, NY (50% Onsite)There is only 1 round interview direct client.Qualifications This individual will be expected to provide expertise and hands-on participation in the following activities: Work with end users and/or review/analyze existing documentation or system artifacts to document business system requirements and processes, develop process models, and document requirements for the development/implementation of an exception tracking system for improved processing of disposition updating errors/exceptions.Analyze and document current disposition business processes to identify root cause of error that prevent dispositions from updating properly to the Criminal History Repository.Update existing disposition processing documentation, update and execute test cases with recommended changes to disposition processing to provide more accurate disposition data in the Criminal History Repository and streamline the notification of exceptions.Develop or maintain system requirements in detailed, clear and well organized functional documents (business requirements documents, business or system use cases, reports) and/or process flow diagrams.Develop or maintain test plans and detailed test cases. Develop or maintain training or user acceptance testing plans and Tier 1 support guides.Develop detailed functional and system tests from documented system requirements. Ensure appropriate test coverage by mapping system requirements to test cases. Develop or contribute to the development of regression tests and/or user acceptance tests.Execute functional and system tests, including regression tests. Participate in user acceptance testing.Identify and document application defects and track to resolution, performing retesting as required.Identify and document deficiencies in system documentation (e.g., missing or ambiguous requirements) identified during the testing process. IT SpecialistWorks in the field of Information Technology, experienced in the usage and support of a collection of development platforms, technical architectures or business applications and products that run on those platforms - beyond that of a Programmer.Expert 84+ Months: Candidate is able to provide guidance to large teams and/or has extensive industry experience and is considered at the top of his/her field. 84 months experience eliciting/extracting detailed business requirements from customer/project stakeholders or system artifacts.24 months experience with systems related to criminal justice processing (including but not limited to: statistical reporting, disposition processing, fingerprint identification processing, criminal history updating, Sex Offender management, tracking of Wanted/Missing persons, or initiatives related to Offender Supervision.84 months experience developing/maintaining test plans and detailed test cases, executing those tests, validating test results, and logging/tracking related defects.24 months experience using Client Quality Center/ALM24 months experience with automated testing and/or Quick Test Pro/Unified Functional Testing UFT E-mail is the best way to reach me, if I don’t pick your call. Thanks & RegardsYogesh DahiyaSspearhead Inc",
        "source": "Email",
        "date_posted": "2024-10-04 11:28:01-05:00",
        "unique_id": "192585c0a8e41700",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]