[
    {
        "company": "Vyze Inc",
        "job_title": "Product Manager",
        "location": "Reston, VA, USA",
        "full_location": {
            "city": "Reston",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Bachelor's Degree in Computer Science or related technical field",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "12 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Agile",
                "SAFe",
                "Kanban",
                "Scrum",
                "Software Development Life Cycle (SDLC)"
            ],
            "primary": [
                "Process improvements",
                "Assessments",
                "Audits",
                "Quality controls",
                "Metrics and analytics"
            ],
            "secondary": [
                "Project Management",
                "Quality Assurance",
                "Process Improvement Plans",
                "Communication"
            ],
            "all": [
                "Agile",
                "SAFe",
                "Kanban",
                "Scrum",
                "Software Development Life Cycle (SDLC)",
                "Process improvements",
                "Assessments",
                "Audits",
                "Quality controls",
                "Metrics and analytics",
                "Project Management",
                "Quality Assurance",
                "Process Improvement Plans",
                "Communication"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Shrasti Singh",
        "email": "shrasti@vyzeinc.com",
        "jd": "From: shrasti singh, vyzeinc shrasti@vyzeinc.com Reply to: shrasti@vyzeinc.com Job Description -Job Title- Product ManagerLocation: Reston, VA (100% Remote role)Duration- 12 monthsVisa- All Visa acceptable except H1B .Candidate must be local to DMV areaC2H Job Description:ESSENTIAL FUNCTIONS:50% Create audit checklists and Agile (SAFe, Kanban, Scrum) and waterfall methodologies. Conduct assessments of products/programs/projects (medium to complex) within the organization to ensure compliancy to published standards, processes, and/or templates for SAfe, Kanban, Scrum practices. Identify process and procedural issues based upon audit findings and initiate resolution to these problems. Communicate with internal audit peers and management regarding status, audit issues and deadlines. Conduct trainings and presentations on process governance and improvement topics. Collect objective evidence of quality related data and/or trends. Monitor and track quality action items and/or track quality issues through resolution. Participate in Audit processes for compliancy and uniformity to ensure deliverables to the customer are consistent. Ensures Quality Service Level Requirements (SLR’s) are adhered for assigned programs/projects.30% Develops departmental materials including SOP's to maintain process libraries outlining governance, change management, auditing, reporting and metrics. Conducts reviews, walkthroughs, assessments, and inspections to evaluate the effectiveness of current processes/procedures, techniques, systems, and associates for medium to complex projects. Participate in workgroups.20% Conducts internal consistency checks ensuring uniform and fair auditing practices throughout the department, across all lines of business. Preparation of QA reports. Assist in the preparation of senior level presentations. Process change requests reporting and tracking.QualificationsTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonableaccommodations may be made to enable individuals with disabilities to perform the essential functions.Education Level: Bachelor's DegreeEducation Details: Computer Science or related technical fieldExperience: 5 years’ Experience in Software Development Life Cycle (SDLC) from initiation to completion with focus on process improvements, assessments, audits and quality controlsIn Lieu of EducationIn lieu of a Bachelor's degree, an additional 4 years of relevant work experience is required in addition to the required work experience.Qualifications3 years of experience with 1 year as product managementProcesses, practices are follows when it comes to PMLC and SDLCProcess assessments, auditAudits on project planning, risk management, closeoutAudits on product teams ensuring all the Kanban practices are being followedPMLC and SDLC on Agile, SAFe background – MUST HAVEMetrics and analytics background is plusProject Management assessment Quality gates – enterprise quality gates, reviewing risks, assessments, quality gates, process governanceIf you want to change or add new process will have to go through governance processProcess asset library – where you store all the processesWorked in product based company, product management background – MUST HAVECommunication is keyKnowledge, Skills and Abilities (KSAs)Hands on experience of Agile, Spiral and Waterfall methodologies, AdvancedFunctional knowledge of SAFe and Product managementProven experience in creating and delivering trainings and presentationsProven experience with the execution and administration of Quality/Process Improvement best practices, AdvancedExperience working with Program/Project Quality Assurance/Process Improvement Plans, AdvancedExperience working with Quality Gates or Quality Checkpoints as part of the SDLC, AdvancedAbility to gather information and resolve issues independently, AdvancedAbility to identify, manage and track progress of small to medium complexity projects to support organizational long range business objectives, AdvancedExperience with quality assurance and process improvement, and methodologies and practices in an IT project development, custom software solutions and maintenance environment, Advanced",
        "source": "Email",
        "date_posted": "2024-10-04 13:35:54-05:00",
        "unique_id": "19258d11e99df5e2",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]