[
    {
        "company": "NYS ITS (DCJS)",
        "job_title": "Software Architect",
        "location": "Albany, NY, USA",
        "full_location": {
            "city": "Albany",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "HBITS-06-13611",
            "experience_required": "84 months",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "30 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "JEE",
                "IBM WebSphere Portal",
                "XML",
                "XSLT"
            ],
            "primary": [
                "UI standards",
                "development methodology",
                "coding and style guides",
                "performance test planning",
                "data analysis"
            ],
            "secondary": [
                "Object Oriented Architecture",
                "Service Oriented Architecture",
                "data structures",
                "algorithms",
                "JEE Design Patterns",
                "hybrid cloud applications"
            ],
            "all": [
                "Java",
                "JEE",
                "IBM WebSphere Portal",
                "XML",
                "XSLT",
                "UI standards",
                "development methodology",
                "coding and style guides",
                "performance test planning",
                "data analysis",
                "Object Oriented Architecture",
                "Service Oriented Architecture",
                "data structures",
                "algorithms",
                "JEE Design Patterns",
                "hybrid cloud applications"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Yogesh Dahiya",
        "email": "yogeshd@sspearhead.com",
        "jd": "From: Yogesh Dahiya, SSPEARHEAD INC yogeshd@sspearhead.com Reply to: yogeshd@sspearhead.com Hi, Hope you are doing good. Please have a look on below position and let me know if you are interested? Required Documentation: Make sure you if you are fine with this job then please share the below details at the time submission time.If you are not going to provide these details then please don’t apply for this job.1: Passport mandatory for these visa’s ( EAD, GC and H1B)2: Visa stamping copy required for H1 B3: Must be provide 3 references with full name, email id, client name and phone number. Job Description:Job Id: HBITS-06-13611Role: Software Architect Client: NYS ITS (DCJS)Duration: 30 monthsLocation: Albany, NY (50% Onsite)There is only 1 round interview direct client.Qualifications This individual will be expected to participate in the following activities: Implement Integrated Justice (IJ) Portal standards related to application technologies, including UI standards, development methodology, and coding and style guides.Act as the primary technical liaison with technical infrastructure teams to resolve problems and implement solutions to technical issues impacting application performance.Work with the Infrastructure teams to execute activities such as performance test planning and execution failure failover planning and execution, endurance testing and deployment planning and testing.Provide the analysis, design, and code reviews for enterprise applications using JAVA/JEE, JSF, XML, XSLT and for the IBM Portal/WebSphere Application development software. Perform oversight of development activities which may include data analysis, data access, data structures, data manipulation, preparing logical database models, testing and implementation.Prepare, and/or review technical documentation such as designs, schemas, etc., as appropriate. Provide technical guidance to teams of developers.Assist technical teams with remediation of Public Safety end-of-life (EOL) applications/systems Software ArchitectMakes high-level design choices and dictates technical standards, including software coding standards, tools, and platforms. Designs multi-leveled architecture or component interactions of a large scale software system.Expert 84+ Months: Candidate is able to provide guidance to large teams and/or has extensive industry experience and is considered at the top of his/her field. 84 months of experience with designing and implementing scalable multi-tier applications using Object Oriented/Service Oriented Architecture involving data structures, algorithms, and JEE Design Patterns.84 months of experience with designing and developing quick Proof of Concept using the latest technology stack and presenting the POC to various project stakeholders.60 months of experience with Developing and deploying applications in IBM WebSphere Portal 6.1, WebSphere Application Servers 6.0 or higher, or JBoss Application Server 7 or higher, and/or Windows Server 2019 or higher.60 months of experience with analyzing system performance data to identify potential issues with the application or environment and participating in meetings with management or other team members to discuss test results or design changes to improve the application performance.60 months of experience with creating technical documentation that includes high & low-level application designs, performance test plans, architectural standards, guidelines, networks, and ER diagrams.60 months experience in designing hybrid cloud applications (shared data/application/services hosted on both on-premises and AWS/Azure/Google cloud) E-mail is the best way to reach me, if I don’t pick your call. Thanks & RegardsYogesh DahiyaSspearhead Inc",
        "source": "Email",
        "date_posted": "2024-10-04 12:48:23-05:00",
        "unique_id": "19258dd749cc9a5a",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]