[
    {
        "company": "Veridian Tech Solutions",
        "job_title": "Senior Optimizely Architect",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Bachelor’s degree in computer science, Software Engineering, or related field (or equivalent experience)",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Optimizely CMS",
                ".NET",
                "Web Experimentation"
            ],
            "primary": [
                "Performance optimization",
                "Security",
                "Scalability",
                "Front-end technologies",
                "Excellent communication skills",
                "Problem-solving skills",
                "Attention to detail"
            ],
            "secondary": [
                "Healthcare industry experience",
                "Optimizely certifications",
                "Knowledge of accessibility standards",
                "Familiarity with Azure cloud services",
                "DevOps practices"
            ],
            "all": [
                "Optimizely CMS",
                ".NET",
                "Web Experimentation",
                "Performance optimization",
                "Security",
                "Scalability",
                "Front-end technologies",
                "Excellent communication skills",
                "Problem-solving skills",
                "Attention to detail",
                "Healthcare industry experience",
                "Optimizely certifications",
                "Knowledge of accessibility standards",
                "Familiarity with Azure cloud services",
                "DevOps practices"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Rishav Kumar",
        "email": "rishav@veridiants.com",
        "jd": "From: Rishav Kumar, Veridian Tech Solutions rishav@veridiants.com Reply to: rishav@veridiants.com Hello,I hope this message finds you well. I am excited to share with you the job description for the Senior Optimizely Architect position. Please find the details of the position below:Job Description: Project Overview: We are seeking a highly skilled and experienced Senior Optimizely Architect to lead the development of a public platform for our healthcare client using the Optimizely content management system. The ideal candidate must be the subject matter expert, serving as the face to the client and providing hands-on leadership in development efforts.Top Skills Required: Extensive experience with Optimizely CMS and Web Experimentation, including in-depth knowledge of their capabilities, limitations, and best practices for implementation.Proven track record of architecting and delivering large-scale Optimizely-based solutions, with a focus on performance optimization, security, and scalability.Strong hands-on development skills, particularly in .NET and front-end technologies, combined with the ability to lead and mentor a development team.Industry Experience:Experience in building large websites using Optimizely CMS. Healthcare Industry is a plus. Location: Candidates can work anywhere within the US closest to a PS office. Work does not require onsite. Travel: For this phase (until December) – there may be a need to travel to client location once and at PS location maybe once. Client located in Pacific West Coast. Candidates must be okay with occasional travel – travel costs will be expensed. Required QualificationsExtensive experience with Optimizely CMS and Web Experimentation, including in-depth knowledge of their capabilities and limitationsProven track record of architecting and delivering large-scale Optimizely-based solutionsStrong hands-on development skills, particularly in .NET and front-end technologiesExcellent communication skills, able to explain complex technical concepts to both technical and non-technical stakeholdersExperience leading and mentoring development teams - Strong problem-solving skills and attention to detailBachelor’s degree in computer science, Software Engineering, or related field (or equivalent experience)Preferred QualificationsExperience in the healthcare industryOptimizely certificationsKnowledge of accessibility standards and their implementation inOptimizely - Familiarity with Azure cloud services and DevOps practices. Thanks & Regards, Rishav Kumar Veridian Tech Solutions, Inc.11931 Wickchester Ln. Suite 150. Houston, Texas, 77043, US📧 rishav@veridiants.com",
        "source": "Email",
        "date_posted": "2024-10-04 12:25:10-05:00",
        "unique_id": "19258905ff5bbf80",
        "emp_type": [
            "third party"
        ],
        "tag": ".net developer"
    }
]