[
    {
        "company": "GVR INFO TEK",
        "job_title": "Senior Java Developer",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "8+ years",
            "degree_required": "Bachelor's in Computer Science, Software Engineering, or a related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Spring",
                "Hibernate",
                "SQL",
                "RESTful web services",
                "SOAP web services"
            ],
            "primary": [
                "JavaScript",
                "ReactJS",
                "HTML",
                "CSS",
                "Agile",
                "Scrum",
                "API design",
                "Java concurrency",
                "Multithreading"
            ],
            "secondary": [
                "NoSQL",
                "Low code development",
                "Database query tuning",
                "Software design patterns",
                "Debugging",
                "Problem-solving",
                "Performance optimization",
                "Java security principles"
            ],
            "all": [
                "Java",
                "Spring",
                "Hibernate",
                "SQL",
                "RESTful web services",
                "SOAP web services",
                "JavaScript",
                "ReactJS",
                "HTML",
                "CSS",
                "Agile",
                "Scrum",
                "API design",
                "Java concurrency",
                "Multithreading",
                "NoSQL",
                "Low code development",
                "Database query tuning",
                "Software design patterns",
                "Debugging",
                "Problem-solving",
                "Performance optimization",
                "Java security principles"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Tarun Kumar",
        "email": "tarun.kumar@gvrinfotek.com",
        "jd": "From: Tarun Kumar, GVR INFO TEK tarun.kumar@gvrinfotek.com Reply to: tarun.kumar@gvrinfotek.com Senior Java DeveloperDuration: 6+ MonthsLocation: Hybrid- Richmond, VA Local candidates only.Visa: EAD/GC/USCMOI: must be able to interview onsite unless otherwise noted. Must have LinkedIn Page with photo and current location and dl visa(SSN,DOB) in submission. If you represent your candidate location so I need local proof in submission.Resumes must be less than 5 pages, or they won’t be considered.Send proof of residence with resume - driver’s license, state-issued ID or copy of rental agreement/deed are strongly preferred (one page), no utility bills The client is seeking an exceptionally skilled Java Developer with experience building web applications in Java. In this role, you will design, create, and implement various Java-based solutions. Java Developers are responsible for analyzing user requirements and business objectives, determining application features and functionality, and recommending changes to existing Java-based applications, among other duties. This position is hybrid-telework with a minimum of three (3) assigned days per week at the Downtown Richmond office.Qualifications:-8+ years of hands-on experience in software development.-2+ years of experience guiding and mentoring junior developers.-A bachelor’s degree in computer science, software engineering, or a related field.-In-depth knowledge and proficiency in the Java programming language.-Comprehensive knowledge of Java frameworks such as Spring, Hibernate, and others.-Extensive Knowledge of software design patterns and the ability to apply them in real-world scenarios.-Experience with JavaScript-based web development technologies (e.g., ReactJS).-Familiarity with front-end technologies like HTML, CSS, and JavaScript.-Experience in designing and implementing RESTful and SOAP web services.-Understanding of API design principles.-Strong debugging skills and the ability to troubleshoot complex issues.-Deep understanding of relational and document databases.-Strong skills with Structured Query Language (SQL).-Knowledge of software development methodologies (e.g., Agile, Scrum).-Strong analytical and problem-solving skills.-Understanding of Java concurrency and multithreading concepts.-Experience optimizing Java applications for performance and scalability.-Awareness of Java security principles and best practices.Preferred:-12+ years of hands-on experience in software development and design.-4+ years of experience guiding and mentoring junior developers.-A master’s degree in computer science, software engineering, or a related field.-Experience with NoSQL database design and development.-Experience with low code development (e.g. Mendix, Salesforce),-Experience designing complex software systems.-Extensive experience tuning database queries.-In-depth knowledge about relational and document database design.",
        "source": "Email",
        "date_posted": "2024-10-04 10:59:53-05:00",
        "unique_id": "19258424c5f67e68",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]