[
    {
        "company": "ATLANTIS IT GROUP",
        "job_title": "Technical Business Analyst",
        "location": "Houston, TX, USA",
        "full_location": {
            "city": "Houston",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "4-8 years",
            "degree_required": "Bachelor’s degree in Computer Science, Information Systems, Business Administration, or related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "1 year",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "business analysis",
                "SQL",
                "data analysis",
                "reporting tools",
                "utility-specific software"
            ],
            "primary": [
                "process modeling",
                "use case documentation",
                "gap analysis",
                "Cloud technologies",
                "Agile methodologies"
            ],
            "secondary": [
                "PowerBI",
                "MS Excel",
                "JIRA",
                "Azure DevOps",
                "regulatory compliance"
            ],
            "all": [
                "business analysis",
                "SQL",
                "data analysis",
                "reporting tools",
                "utility-specific software",
                "process modeling",
                "use case documentation",
                "gap analysis",
                "Cloud technologies",
                "Agile methodologies",
                "PowerBI",
                "MS Excel",
                "JIRA",
                "Azure DevOps",
                "regulatory compliance"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Tejashwini",
        "email": "teja@atlantisitgroup.com",
        "jd": "From: TEJASHWINI, ATLANTIS IT GROUP teja@atlantisitgroup.com Reply to: teja@atlantisitgroup.com Job Title: Technical Business AnalystLocation: Houston, TX 77002Position: Hybrid (3 days from office and 2 days remote)Duration: 1 year Key Responsibilities:Business Requirements Gathering: Collaborate with stakeholders across departments (Operations, Customer Service, Engineering) to elicit, analyze, and document business requirements for IT solutions.Technical Specifications: Translate business requirements into technical specifications, including process flows, system designs, and use cases.Stakeholder Communication: Act as a liaison between business units, IT teams, and external vendors to ensure alignment on project goals, timelines, and deliverables.Solution Evaluation: Work with development teams to assess the feasibility of technical solutions and ensure they meet business needs and industry regulations.Data Analysis & Reporting: Perform detailed data analysis to identify trends, system improvements, and optimization opportunities within IT systems (e.g., billing systems, asset management systems).Project Coordination: Support project management activities by tracking project milestones, managing risks, and ensuring timely communication between teams.Testing and Quality Assurance: Develop and execute test plans, ensuring new systems or changes meet business and operational needs through user acceptance testing (UAT).Regulatory Compliance: Ensure that IT systems and processes comply with industry regulations and standards, including energy and environmental guidelines.Continuous Improvement: Monitor and assess the performance of existing systems, identifying opportunities for upgrades or enhancements to improve utility services and operational efficiency. Required Skills & Experience:Technical Skills:Proficiency in business analysis tools and techniques, such as process modeling, use case documentation, and gap analysis.Experience with SQL, data analysis, and reporting tools (e.g., PowerBI, MS Excel, PP, Word) for extracting and analyzing data.Familiarity with IT systems architecture, enterprise applications, and databases (Legacy Web, ERP, CRM, Billing Systems).Experience working with utility-specific software (e.g., GIS, SCADA, AMI systems) is a strong advantage.Exposure to Cloud technologies (e.g., Azure, AWS) and DevOps practices.Understanding of Agile methodologies (Scrum/Kanban) and related tools (JIRA, Azure DevOps). Business Skills:Strong ability to translate business needs into technical requirements and solutions.Experience in working in cross-functional teams, facilitating workshops, and engaging stakeholders from various departments.Excellent verbal and written communication skills, with the ability to present complex technical concepts to non-technical stakeholders.Strong problem-solving and analytical skills with attention to detail. Industry Experience:Prior experience working in the utility sector (electricity, gas, water) or industries with complex regulatory environments is highly preferred.Knowledge of regulatory compliance frameworks and practices in the utility industry. Qualifications:Bachelor’s degree in Computer Science, Information Systems, Business Administration, or related field.4-8 years of experience in a similar role (business analysis, technical analysis, or systems analysis).Certifications in Business Analysis (CBAP, CCBA), Agile (CSM, CSPO), or ITIL are a plus. Personal Attributes:Strong attention to detail and a passion for delivering high-quality work.Self-motivated with the ability to work independently and as part of a team.Ability to manage multiple projects simultaneously and meet deadlines.Strong interpersonal and collaboration skills to work across diverse teams.",
        "source": "Email",
        "date_posted": "2024-10-04 10:51:54-05:00",
        "unique_id": "1925898d0570d186",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]