[
    {
        "company": "Vyzeinc",
        "job_title": "C# .Net Core Developer III with ReactJS",
        "location": "Birmingham, AL, USA",
        "full_location": {
            "city": "Birmingham",
            "state": "AL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "7+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "C#",
                ".Net Core",
                "ReactJS",
                "AWS",
                "API Development"
            ],
            "primary": [
                "Microservices",
                "POSTMAN"
            ],
            "secondary": [
                "Banking/financial background",
                "Team Lead experience"
            ],
            "all": [
                "C#",
                ".Net Core",
                "ReactJS",
                "AWS",
                "API Development",
                "Microservices",
                "POSTMAN",
                "Banking/financial background",
                "Team Lead experience"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Chandan singh",
        "email": "csingh@vyzeinc.com",
        "jd": "From: Chandan singh, Vyzeinc csingh@vyzeinc.com Reply to: csingh@vyzeinc.com Hi,Hope you are doing well.Please find below position if you haveany matching candidate as per requirement.Please send me updated resume with candidate information. For vendor emailingJob Description -Job Description -Position: C# .Net Core Developer III with ReactJSLocation: Hybrid Atlanta, Charlotte, Nashville, Birmingham but Most preference to Birmingham Locals Duration: 6 Months C2H MOI: SkypeNOTE: Please read the JD thoroughly and make a point heavy resume everything should be there. Need 10+ points per skill.NOTE: AWS experience with AWS Developer Cert is a must. Job Description: Our client is in the Financial/ Banking sector, and they are looking for a C# .Net Core Developer with ReactJS. This is for a crucial Banking and Finance project with the marketing and product team. They will be creating new features and enhancing old features for the web application. They are looking for a developer with at least 7+ years' experience and would love someone with familiarity with designing secure interfaces with either banking, financial service.Required Skills:Need A point heavy at least 15+ points per skill, heavy banking resume within 6 pages. 5+ years' experience as a C# Net. Core DeveloperMust have ReactJSHands on AWS experience with AWS Developer CertAPI Development experienceKnowledge of Micro servicesKnowledge of POSTMANBonus Skills Banking/financial backgroundTeam Lead experience Regards, Chandan singh Email: csingh@vyzeinc.com",
        "source": "Email",
        "date_posted": "2024-10-04 12:00:03-05:00",
        "unique_id": "1925879613b11945",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]