[
    {
        "company": "Largeton Inc.",
        "job_title": "Salesforce Business Analyst",
        "location": "Franklin, TN, USA",
        "full_location": {
            "city": "Franklin",
            "state": "TN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "8-10 years",
            "degree_required": "Bachelor's degree in business or information systems preferred",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Salesforce",
                "Business Analysis",
                "Communication Skills",
                "Interpersonal Skills",
                "Customer Focus"
            ],
            "primary": [
                "Salesforce.com Administrator Certification",
                "Operational Experience with Salesforce.com"
            ],
            "secondary": [
                "Business Processes",
                "CRM Best Practices"
            ],
            "all": [
                "Salesforce",
                "Business Analysis",
                "Communication Skills",
                "Interpersonal Skills",
                "Customer Focus",
                "Salesforce.com Administrator Certification",
                "Operational Experience with Salesforce.com",
                "Business Processes",
                "CRM Best Practices"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Manisha Gupta",
        "email": "manisha@largeton.us",
        "jd": "Hello!Hope you are doing well.I would like to share job description with you. Please review and help us to find suitable candidate. Job Title: Salesforce Business Analyst Work Location: Franklin, TN (Onsite)Joining : Immediately Mandatory Skill (Must Haves) :Job Description Salesforce Business AnalystExcellent verbal and written communication skills requiredExcellent interpersonal skills with a demonstrated ability to work in a cross functional team environment requiredStrong customer focus ability to probe customer needs and translate customer requirements into system specifications required8-10 years of business analyst experience requiredStrong business acumen superb knowledge of business processes and CRM best practice required1 years of strong operational experience with Salesforce.com preferredSalesforce.com administrator certification a strong plusBachelors degree in business or information systems preferred ResponsibilitiesManage the collection and implementation of business process requirements for Salesforces.comWork in a cross functional environment with various business groups IT and end users to identify document and communicate business processesCreate Requirements for maintaining and enhancing visual layouts workflow rules and business logic layer to streamline and enhance business processes and improve user experienceWork with the development teams to implement and integrate third party products applications on the force.com platformWork with IT and Salesforce.com and other 3rd party vendors to maintain smooth operation and performance of the platformCoordinate and lead user acceptance tests with the business units and end users against business requirementsMaintain key system metrics to track trends in usage adoption and data integrityTrain end users prepare related documentation requirements training materials process and data flows use cases functional design etc participate in cross functional teams communicate key messages or address critical questions from the user base involving the CRMPerform system administrator function of the Salesforce.com CRM application Responsible for maintaining functional areas of contacts relationship accounts opportunities dashboards and reportsCreate and execute queries and reports maintain user roles security and profilesSkillsSalesforce-business/Functional Analysis Thanks, and RegardsManisha GuptaLARGETON INC. 13800 Coppermine Rd,Herndon, VA 20171 Disclaimer: Largeton is an equal opportunity employer. There is no discrimination based on race, color, religion, sex, national origin, age, disability, or any other protected status.",
        "source": "Email",
        "date_posted": "2024-10-04 12:53:03-05:00",
        "unique_id": "19258d585c999408",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]