[
    {
        "company": "LiveMindz",
        "job_title": "Lead Data Software Engineer",
        "location": "Arlington, VA, USA",
        "full_location": {
            "city": "Arlington",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "9+ years",
            "degree_required": "Bachelor’s or Master’s in CS, or a related STEM field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "JavaScript",
                ".NET/C#",
                "React",
                "Redux",
                "Typescript",
                "SQL Server"
            ],
            "primary": [
                "Python",
                "Scala",
                "Spark",
                "Data Modeling",
                "Hadoop",
                "Hive",
                "Impala",
                "Airflow",
                "NiFi",
                "Scoop"
            ],
            "secondary": [
                "Agile methodologies",
                "DevOps practices",
                "CI/CD",
                "Fuzzy/entity matching",
                "Data ingestion",
                "Data unification",
                "Machine learning systems",
                "SQL",
                "Parallel Data Processing",
                "Message Queuing",
                "Distributed Systems",
                "Data security",
                "Splunk"
            ],
            "all": [
                "Java",
                "JavaScript",
                ".NET/C#",
                "React",
                "Redux",
                "Typescript",
                "SQL Server",
                "Python",
                "Scala",
                "Spark",
                "Data Modeling",
                "Hadoop",
                "Hive",
                "Impala",
                "Airflow",
                "NiFi",
                "Scoop",
                "Agile methodologies",
                "DevOps practices",
                "CI/CD",
                "Fuzzy/entity matching",
                "Data ingestion",
                "Data unification",
                "Machine learning systems",
                "SQL",
                "Parallel Data Processing",
                "Message Queuing",
                "Distributed Systems",
                "Data security",
                "Splunk"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Darshana Sakroo",
        "email": "darshanas@livemindz.com",
        "jd": "From: Darshana Sakroo, LiveMindz darshanas@livemindz.com Reply to: darshanas@livemindz.com Job Title: Lead Data Software Engineer: Location: Arlington, VA (ONSITE)Finance industry 9+ years exp Primary: Java, JavaScript, .NET/C#, React, Redux, Typescript, and SQL ServerPlus: Expertise in using Python or Scala, Spark, Data Modeling, Hadoop platforms & tools (Hive, Impala, Airflow, NiFi, Scoop), SQL Full stack engineering experience in an agile production environment. Proficiency with Java, JavaScript, .NET/C#, React, Redux, Typescript, and SQL Server or other object oriented languages, front-end frameworks, and/or relational database technologies Experience leading the design and implementation of complex features. Experience leading a large project and working with other data and software engineers. Experience working in enterprise databases and ensure follow industry best practices around data privacy. Experience in anonymizing data, data product development, analytical models, and AI governance. Effective communication and collaboration skills to work with both technical and non-technical stakeholders. Flexible to work with global offices across several time zones. Outstanding problem-solving skills and the ability to navigate complex data challenges. Experience with agile methodologies, DevOps practices, and CI/CD.The following is a plus: Experience with fuzzy /entity matching and categorization. Experience with end-to-end lifecycle of data management including data ingestion, modeling, unification, production, and customer adoption. Experience in building and deploying production-level data-driven applications and data processing workflows/pipelines and /or implementing machine learning systems at scale. Expertise in using Python or Scala, Spark, Data Modeling, Hadoop platforms & tools (Hive, Impala, Airflow, NiFi, Scoop), SQL to build Big Data products & platforms. Experience with SQL, Parallel Data Processing, Message Queuing & Distributed Systems. Knowledge of data security and multiple sources of data. Familiarity with industry best practices for collection and use of data. Strong technologist eager to learn new technologies and frameworks Project management skills and a demonstrated ability to understand complex information product constructs. Knowledge of Splunk or other alerting and monitoring solutions. Be able to engage and drive conversations with customers as neededNice to have: Bachelor’s or Master’s in CS, or a related STEM field Experience in working with Cloud (e.g., Azure, AWS) Experience participating in complex engineering projects in an Agile setting e.g. Scrum",
        "source": "Email",
        "date_posted": "2024-10-04 13:46:26-05:00",
        "unique_id": "1925923347071743",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]