[
    {
        "company": "Intelligenz IT",
        "job_title": "AWS Cloud Lead / AWS Architect with API Lambda and Python",
        "location": "Alameda, CA, USA",
        "full_location": {
            "city": "Alameda",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long term contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "API Design and Development",
                "Architectural Guidance",
                "Technologies and Frameworks",
                "Performance and Scalability",
                "Security and Compliance",
                "Documentation and Testing"
            ],
            "primary": [
                "AWS Cognito",
                "DynamoDB",
                "AWS Amplify",
                "Okta",
                "OWASP best practices"
            ],
            "secondary": [
                "CSRF",
                "Access tokens",
                "Encryption",
                "Decryption",
                "GDPR",
                "HIPAA"
            ],
            "all": [
                "API Design and Development",
                "Architectural Guidance",
                "Technologies and Frameworks",
                "Performance and Scalability",
                "Security and Compliance",
                "Documentation and Testing",
                "AWS Cognito",
                "DynamoDB",
                "AWS Amplify",
                "Okta",
                "OWASP best practices",
                "CSRF",
                "Access tokens",
                "Encryption",
                "Decryption",
                "GDPR",
                "HIPAA"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Mohit Jaiswal",
        "email": "mohit.jaiswal@intelligenzit.com",
        "jd": "From: Mohit Jaiswal, Intelligenz IT mohit.jaiswal@intelligenzit.com Reply to: mohit.jaiswal@intelligenzit.com Hi,I hope you and your family are doing well.I have a good position for you with my client. This point of time I don't know whether you are looking for a new job or not. But just thought if I can share the details and then confirm from you about your interest level for the opportunity. If you are interested and an available consultant, send me your most updated resumes in word format and contact details.Job Title: AWS Cloud Lead / AWS Architect with API Lambda and PythonLocation: Alameda CA (100% on-site from day 1)Duration: Long term contractNote : Client is not looking DevOps Engineer. Please share AWS Lead or AWS ArchitectPlease don't share DevOps Engineer ProfilesJD/Description of Role*Job Overview: As an API / Solutions Architect, you will be responsible for designing, developing, and maintaining complex API solutions that meet the requirements as well as adhere to established architectural principles, standards, and patterns.He / She will collaborate closely with cloud engineering platform team to work on API and Devops tools. He / she will collaborate with software developers, system architects, product managers, and stakeholders, to ensure APIs are robust, scalable, and secure.Pimary (Must have skills)*API Design and Development:Lead the design and development of APIs that enable integration between various software systems, applications, and data sources.Define API standards, best practices, and guidelines to ensure consistency across APIs.Evaluate existing APIs for reusability and integration feasibility.Architectural Guidance:Provide technical leadership and guidance on API architecture, design decisions, and implementation strategies.Collaborate with solution architects and development teams to integrate API solutions into larger systems or platforms.Technologies and Frameworks:Use of Okta for authentication make use of CSRF and Access tokensImplement security framework including encryption / decryption of passwordsExperience working with AWS Cognito, DynamoDB, AWS Amplify,Make use of OWASP best practicesPerformance and Scalability:Design APIs with a focus on performance, scalability, reliability, and security.Conduct performance tuning and optimization of APIs to handle high traffic and large volumes of data.Security and Compliance:Implement security measures such as authentication, authorization, encryption, and data protection mechanisms in APIs.Ensure APIs comply with organizational security standards and industry regulations (e.g., GDPR, HIPAA).Documentation and Testing:Create comprehensive API documentation including specifications, usage guidelines, and examples.Collaborate with QA teams to define and execute API testing strategies, including functional, integration, and performance testing.Continuous Improvement:Stay updated on emerging technologies, industry trends, and best practices related to APIs and integration.Drive initiatives for continuous improvement of API development processes, tools, and methodologies.Regards,Mohit JaiswalIntelligenz ITWork : 646-502-7441Maillot: Mohit.Jaiswal@Intelligenzit.com",
        "source": "Email",
        "date_posted": "2024-10-04 10:39:20-05:00",
        "unique_id": "192582f789ffbcf7",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]