[
    {
        "company": "TEK INSPIRATIONS",
        "job_title": "NGS Database Administrator II",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5-7+ years",
            "degree_required": "Bachelor’s degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 Months Contract-to-Hire",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "PostgreSQL",
                "PL/pgSQL",
                "AWS",
                "SQL",
                "Database Administration"
            ],
            "primary": [
                "Performance Tuning",
                "Data Modeling",
                "Agile",
                "Java",
                "Database Design"
            ],
            "secondary": [
                "Health IT Systems",
                "Electronic Data Interface (EDI)",
                "270/271 Transactions",
                "Medicare/Medicaid Data",
                "SAFe Certifications"
            ],
            "all": [
                "PostgreSQL",
                "PL/pgSQL",
                "AWS",
                "SQL",
                "Database Administration",
                "Performance Tuning",
                "Data Modeling",
                "Agile",
                "Java",
                "Database Design",
                "Health IT Systems",
                "Electronic Data Interface (EDI)",
                "270/271 Transactions",
                "Medicare/Medicaid Data",
                "SAFe Certifications"
            ],
            "with_experience": [
                "PostgreSQL (3+ years)",
                "AWS RDS Aurora PostgreSQL (3+ years)",
                "Database Administration (3+ years)",
                "Data Modeling (2+ years)",
                "Agile/Scrum (2+ years)"
            ]
        },
        "job_type": [
            "contract"
        ],
        "contact_person": "Arudhi Singh",
        "email": "arulhi.singh@tekinspirations.com",
        "jd": "From: ARUDHI SINGH, TEK INSPIRATIONS arudhi.singh@tekinspirations.com Reply to: arudhi.singh@tekinspirations.com Hi,Hope you are doing great!!!Job Description -Candidate should have strong job knowledge, good communication skills, and be prepared for a video interview. During the call, they must specifically highlight their skills, and their resume should include all relevant points, showcasing 5-6 key skills.Duration: 6 Months Contract-to-Hire NGS Database Administrator II5-7 + years Industry ExperienceJob Description:Background: Responsible for the maintenance of production, test and development databases. Brings solid understanding of database administration. Supports development team from a database design and development perspective. Responsible for database administration or engineering activities, ensure optimal performance on PostgreSQL environments. Responsible for the installation, maintenance, configuration, and integrity of PostgreSQL architecture.Performance tuning of the queries. Provide support to the application developers, including, but not limited to data refresh, SQL and PL/pgSQL performance tuning and best practice recommendations. Must conduct code reviews with application developers in Java.Ensure the long-term requirements of systems operations and administration are included in the overall database systems planning of the organization. Perform many related database functions across one or more teams, including designing, implementing, and maintaining new databases, backup/recovery and configuration management. Required Qualifications: Bachelor’s degree 5+ years of experience as a DBA / developer for complex and high-volume data warehouse projects.Must have AWS certification 3+ Years - Strong PL/PGSQL or PL/SQL experience is a plus. 3+ Years - Experience in Postgres SQL, AWS RDS Aurora PostgreSQL.3+ Years - Hands-on experience with Postgres database administration, performance tuning and production support in a high volume, customer-facing apps/environment.2+ Years - Data modeling experience 2+ years - Experience working in Agile/ Scrum programs with multi-disciplinary development teams Excellent written, verbal, and interpersonal communication skills Manages time extremely well, can quickly sense when issues need to be addressed Strong attention to detail and focus on task completion. Able to obtain a U.S. Federal Position of Trust clearance designation. Must be able to perform code reviews in Java.Must have Agile/ SAFe experience and be able to talk to it with real examples. Will be highly scrutinized by Prime Partner. Preferred Qualifications 2+ Years - Experience with health IT systems with Electronic Data Interface (EDI) processing 2-3+ Years - Experience with 270/271 transactions and/or other X12 data formats (Big Plus) Experience with healthcare data, specifically Medicare/Medicaid Prime Softrams is BIG on SAFe certifications since they will be doing 2-3 week Sprints. Public Trust Clearance eligible in addition to standard background check.We have what’s needed in the job description. What we’re finding is that the candidates are not able to effectively demonstrate that knowledge through specific examples. These are in no particular order. • SQL/Query Skills – We are finding that candidates are lacking in basic SQL skills.• Experience working in an AWS RDS/Aurora environment• Database Management Systems (DBMS): Good understanding of one or more DBMS platforms, particularly PostgreSQL, PL/SQL, PL/PGSQL. They should have good experience in tasks such as installation, configuration, maintenance, and troubleshooting of these systems.• Database Design and Modeling: Experience creating efficient database schemas, understanding of how relational databases operate, defining relationships between tables, ensuring data integrity, optimizing database structures for performance.• Migration Experience – Migration of data from existing databases to AWS.Finally, the candidate must have development/engineering experience. Hope this helps. Regards,Arudhi Singh",
        "source": "Email",
        "date_posted": "2024-10-04 14:58:03-05:00",
        "unique_id": "1925972fdef91b0c",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Oracle DBA"
    }
]