[
    {
        "company": "DataSync",
        "job_title": "Software Architect",
        "location": "Indianapolis, IN, USA",
        "full_location": {
            "city": "Indianapolis",
            "state": "IN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "4-year applicable degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Core Java",
                "Java EE",
                "Spring MVC Framework",
                "Spring Core",
                "Spring Security",
                "Spring Data Persistence"
            ],
            "primary": [
                "Migration of applications to AWS",
                "Containerization platform using Docker/Kubernetes",
                "Delivery using Agile Scrum Development Framework",
                "Maven build tools",
                "Selenium automation"
            ],
            "secondary": [
                "Vue.js",
                "React",
                "Angular JavaScript framework",
                "jQuery",
                "CSS Frameworks like Bootstrap",
                "REST/SOAP API Clients and Web Services",
                "Weblogic or similar App/web server administration",
                "Working knowledge of Cloud Services like AWS/Azure",
                "Oracle PL/SQL",
                "Linux server configuration and management",
                "Linux scripting",
                "Web Application Server-side Configuration and Deployment"
            ],
            "all": [
                "Core Java",
                "Java EE",
                "Spring MVC Framework",
                "Spring Core",
                "Spring Security",
                "Spring Data Persistence",
                "Migration of applications to AWS",
                "Containerization platform using Docker/Kubernetes",
                "Delivery using Agile Scrum Development Framework",
                "Maven build tools",
                "Selenium automation",
                "Vue.js",
                "React",
                "Angular JavaScript framework",
                "jQuery",
                "CSS Frameworks like Bootstrap",
                "REST/SOAP API Clients and Web Services",
                "Weblogic or similar App/web server administration",
                "Working knowledge of Cloud Services like AWS/Azure",
                "Oracle PL/SQL",
                "Linux server configuration and management",
                "Linux scripting",
                "Web Application Server-side Configuration and Deployment"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Prince Kumar",
        "email": "prince.kumar@idctechnologies.com",
        "jd": "Hello, Hope You are doing good,Please find the below job description and let me know your interest ASAP: Note: Looking for Candidate local to Indiana Client: DataSyncJob Titles: Software ArchitectPosition location: Indianapolis, IN 46241 ((Hybrid)Position Type: ContractInterview Type - In PersonJob Description:ABOUT THE ROLE Short Description-Architect, design & develop scalable architecture systems for Java-based applications. Build and maintain highly complex, high-volume, scalable, maintainable, and extensible software on a Java/J2EE application stack using full software development. Full Job Description -Architect, design & develop scalable architecture systems for Java-based applications. Build and maintain highly complex, high-volume, scalable, maintainable, and extensible software on a Java/J2EE application stack using full software development. POSITION AND EXPERIENCE DESCRIPTIONProvides architectural and big-picture oversight for the development of new or enhanced software products. Responsible for ensuring quality and consistency of the software architecture across the system and providing day-to-day technical guidance to the development teams. Defines the system, technical, and application architectures for major areas of development and recommends courses of action to maintain cost-effectiveness and competitiveness. Stays up to date on business initiatives and objectives, particularly as these relate to infrastructure and development architecture issues. Researches and implements best practices frameworks/capability models that will control costs, provide higher quality, and/or increase predictability of service delivery. Researches new technology and development tools to remain abreast of current and emerging technology.4-year applicable degree,10+ years of experience with designing, developing implementing, and maintaining Java-based software and applications, contributing to all stages of the software development lifecycle. Skills Matrix -Strong record of successful architecture, design, and delivery across large-scale software systems with a successful track record of delivery.Core Java and Java EE including but not limited to usage of Collections, Lambdas, Streams, and Concurrency best practicesSpring MVC Framework, Spring Core, Spring Security, Sprint Data PersistenceMigration of applications to AWS, improving scalability and performanceIDEs like Eclipse/IDEA/NetbeansXML Documents, XML Schemas, JSON documentsDesign Patterns, Data Structures and Algorithms, JDBCVue.js/React/Angular JavaScript framework, jQuery, JavascriptCSS Frameworks like Bootstrap, Angular, or similarREST/SOAP API Clients and Web ServicesWeblogic or similar App/web server administrationContainerization platform using Docker/KubernetesWorking knowledge of Cloud Services like AWS/Azure Oracle PL/SQL and the ability to develop and use stored proceduresDelivery using Agile Scrum Development FrameworkMaven build toolsSelenium automationLinux server configuration and management, Linux scriptingWeb Application Server-side Configuration and Deployment If Interested, kindly revert with your Updated Resume with the below required information to proceed further. Candidate Full Legal NameFirst NameMiddle NameLast Name Current location (city, state or ZIP) Mobile number Alternate Number E-mail ID Master’s Degree with University Name, Location and Pass out Year) Bachelor’s Degree with University Name, Location and Pass out Year) Can you work independently or need sponsorship to work in USA Total Years of experience in USA Relocation or ready to work from Client (Onsite) LinkedIn ID If you find you are not interested, but know someone who would be a good fit, please either pass on my contact information to them or forward their contact details to me.",
        "source": "Email",
        "date_posted": "2024-10-04 10:13:54-05:00",
        "unique_id": "192581901c826a20",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]