[
    {
        "company": "MRC Global",
        "job_title": "Finance, Documents and Warehouse B2B/A2A; Business analyst",
        "location": "Houston, TX, USA",
        "full_location": {
            "city": "Houston",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Proven experience as a Business Analyst in a B2B or e-commerce environment.",
            "degree_required": "Bachelor's degree in Finance, Accounting, Business, Information Systems or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "B2B integrations",
                "A2A integrations",
                "Data Analysis",
                "Documentation",
                "Quality Assurance"
            ],
            "primary": [
                "Financial acumen",
                "Technical expertise",
                "Problem-solving skills",
                "Communication skills",
                "Interpersonal skills"
            ],
            "secondary": [
                "Knowledge of B2B integration tools",
                "Proficiency in data analysis and reporting tools",
                "Understanding of finance and supply chain processes",
                "Project management skills",
                "Detail-oriented",
                "Organized"
            ],
            "all": [
                "B2B integrations",
                "A2A integrations",
                "Data Analysis",
                "Documentation",
                "Quality Assurance",
                "Financial acumen",
                "Technical expertise",
                "Problem-solving skills",
                "Communication skills",
                "Interpersonal skills",
                "Knowledge of B2B integration tools",
                "Proficiency in data analysis and reporting tools",
                "Understanding of finance and supply chain processes",
                "Project management skills",
                "Detail-oriented",
                "Organized",
                "Experience with EDI",
                "Experience with Oracle Fusion ERP",
                "Experience with document management applications",
                "Experience with middleware applications",
                "Familiarity with pipe, valve, and fitting products"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Kunal Bhatt",
        "email": "kunal.bhatt@rconsultinginc.com",
        "jd": "From: Kunal Bhatt, Resource Consultings kunal.bhatt@rconsultinginc.com Reply to: kunal.bhatt@rconsultinginc.com Job Title: Finance, Documents and Warehouse B2B/A2A; Business analyst Duration: 6 monthLocation: Houston and Dallas & Austin Need local Company: MRC GlobalJob Summary:MRC Global, a global leader in the distribution of pipe, valve, and fitting products, is looking for a finance, documents, and warehouse professional to join our ERP implementation team. Oracle Fusion ERP will require implementation of B2B integrations (XML/EDI) with banks and A2A integrations (document management and warehouse) within MRC Global’s application landscape MuleSoft. The ideal candidate will possess strong financial acumen, technical expertise, and exceptional problem-solving skills. Key Responsibilities:1. B2B Bank Integrations: Manage the integration of financial systems with various banking platforms, including electronic banking interfaces, online payment gateways, and treasury management systems.2. A2A Application Integrations: Lead the integration of document management and warehouse applications with ERP (Oracle Fusion) and MuleSoft.3. Data Analysis: Analyze financial data, transactional information, and related reports to identify opportunities for process improvement and ensure data integrity.4. Documentation: Create and maintain detailed documentation of integration processes, best practices, and workflows to ensure consistency and knowledge transfer within the team.5. Quality Assurance: Conduct thorough testing and validation of integrated systems to ensure compliance with regulatory standards, data security, and operational reliability.6. Issue Resolution: Investigate and resolve any issues related to applications and bank integrations promptly, working closely with internal teams, vendors, and financial institutions.7. Compliance and Risk Management: Ensure compliance with financial regulations and data security standards. Assist in the development and maintenance of risk management protocols.8. Collaboration: Collaborate with internal teams, customers, and vendors to facilitate smooth integrations, gather requirements, and manage project timelines.9. Training: Provide training and support to internal finance and operations teams on integrated systems and best practices. Qualifications:• Bachelor's degree in Finance, Accounting, Business, Information Systems or a related field.• Proven experience as a Business Analyst in a B2B or e-commerce environment.• Strong analytical and problem-solving skills.• Excellent communication and interpersonal skills.• Knowledge of B2B integration tools and platforms.• Proficiency in data analysis and reporting tools.• Understanding of finance, order processing systems and supply chain processes.• Project management skills.• Ability to adapt to changing technology and industry trends.• Detail-oriented and highly organized. Preferred Qualifications:• Experience with EDI (Electronic Data Interchange) and API integration.• Experience with Oracle Fusion ERP• Experience with document management applications like OnBase• Experience with middleware applications like MuleSoft, webMethods, etc.• Familiarity with pipe, valve, and fitting products or the industrial distribution industry.",
        "source": "Email",
        "date_posted": "2024-10-04 16:23:39-05:00",
        "unique_id": "19259bb4f743f9a1",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]