[
    {
        "company": "Tanisha Systems Inc",
        "job_title": "Business Analyst",
        "location": "Greensboro, NC, USA",
        "full_location": {
            "city": "Greensboro",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "6-8 years",
            "degree_required": "Masters Degree or Bachelor's degree or foreign equivalent",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "P&C Insurance",
                "Mortgage Domain",
                "System Development Life Cycle (SDLC)",
                "Business Requirement Analysis"
            ],
            "primary": [
                "Agile",
                "Scrum",
                "Data Flows",
                "Workflow Processes",
                "Communication Skills",
                "Stakeholder Management",
                "SQL"
            ],
            "secondary": [
                "ACORD",
                "JSON",
                "XML",
                "APIs",
                "MS Word",
                "Excel",
                "Visio",
                "MS Project",
                "PowerPoint",
                "SharePoint",
                "Quality Center",
                "Rally",
                "JIRA",
                "MicroStrategy",
                "Tableau",
                "Qlik",
                "Logical Reasoning",
                "AI Awareness"
            ],
            "all": [
                "Business Analysis",
                "P&C Insurance",
                "Mortgage Domain",
                "System Development Life Cycle (SDLC)",
                "Business Requirement Analysis",
                "Agile",
                "Scrum",
                "Data Flows",
                "Workflow Processes",
                "Communication Skills",
                "Stakeholder Management",
                "SQL",
                "ACORD",
                "JSON",
                "XML",
                "APIs",
                "MS Word",
                "Excel",
                "Visio",
                "MS Project",
                "PowerPoint",
                "SharePoint",
                "Quality Center",
                "Rally",
                "JIRA",
                "MicroStrategy",
                "Tableau",
                "Qlik",
                "Logical Reasoning",
                "AI Awareness"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Jitendra Kashyap",
        "email": "jitendra@tanishasystems.com",
        "jd": "From: Jitendra Kashyap, Tanisha Systems Inc jitendra@tanishasystems.com Reply to: jitendra@tanishasystems.com HiHope you are doing well! My name is Jitendra Kashyap, and I am a Staffing Specialist at Tanisha Systems Inc.We have urgent openings for one of our Client. If you are interested and available in the job market, please respond to my mail with your updated resume along with best time and number to reach.Role: Business Analyst Location: Greensboro, NCContract : W2 /C2C JD: Looking for Business Analysts in P&C domain (Personal and Commercial lines) to be part of our Insurance Practice Candidates must have experience working in projects related to lines of businesses – Business owner’s, Commercial Property, Commercial Automobile, General Liability, Workers Compensation, Personal Automobile, Homeowners, Personal Umbrella etc. Required Qualification:Masters Degree with Minimum 6 Years of Experience or Bachelor’s degree or foreign equivalent with Minimum 8 Years of experience required. At least 8 years of Experience in the full System Development Life Cycle (SDLC) on a variety of technologies and platforms preferably in Property and Casualty and or Life Insurance At least 8 years of Experience with modeling business processes, data flows, and workflow processes depicting relationships between Insurance data entities. 6-8 years of Experience and familiarity with P&C insurance domain is a must. Experience and familiarity with Mortgage domain is a must, experience in Mortgage servicing is preferredWorking knowledge of Business Analysis Standards (i.e. IIBA best practices)Familiarity with industry standards and technologies, such as ACORD, JSON, XML, and APIs.Strong oral & written communication skills, Business stakeholder managementMust have performed business requirement analysis, use case modeling from a business analysis/consulting standpoint. Experience and desire to work in a management consulting environment Preferred Qualification • At least 6-8 Years’ experience in one or more of the following skills in P&C / Life Insurance domain -• Scrum/Agile experience in a SBA / TBA role or similar on an Agile Team environment.• Excellent understanding of how to operate in an Agile Team setting.• Strong collaboration skills• Applied experience with large scale, complex IT projects • Familiarity with multiple software development methodologies• Proficient in MS Word, Excel, Visio, MS Project, and PowerPoint. Knowledge of SharePoint, Quality Center, Rally and JIRA a plus. • Demonstrated ability to understand and work across multiple business domains in support of projects• Ability to partner with development teams that support various technology platforms• Database/SQL experience/SQL expertise..• Familiarity with industry standards and technologies, such as ACORD, JSON, XML, and APIs.• Prior experience working with tools like MicroStrategy, Tableau, and Qlik.• Special combination of technical skill and business acumen, along with a high degree of confidence.• Logical reasoning and deduction skills• AI awarenessPlease reply to me with your updated resume and required details:Full Name(as per legal Docs):Contact number:Work authorization:Current Location:-Expected hourly rate/salary:Open to relocate: Phone interview availability: Waiting for your earliest response…. With warm regards, Jitendra KashyapSenior RecruiterTanisha Systems Inc.[99 Wood Ave South Suite # 308, Iselin, NJ 08830]Email: jitendra@tanishasystems.comWeb: www.tanishasystems.comE-Verify, Certified Minority Business Enterprise MBE, Dun & Bradstreet CREDIBILITY CORP Certified",
        "source": "Email",
        "date_posted": "2024-10-04 09:18:23-05:00",
        "unique_id": "19257e5633de215f",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]