[
    {
        "company": "KK Software LLC",
        "job_title": "PM (Cash Management & Global Banking)",
        "location": "Jersey City, NJ, USA",
        "full_location": {
            "city": "Jersey City",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Business Analysis",
                "Cash Management",
                "Global Banking"
            ],
            "primary": [
                "General banking knowledge",
                "General IT knowledge",
                "Consulting experience"
            ],
            "secondary": [],
            "all": [
                "Project Management",
                "Business Analysis",
                "Cash Management",
                "Global Banking",
                "General banking knowledge",
                "General IT knowledge",
                "Consulting experience"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Shubham Gautam",
        "email": "shubham.g@kksoftwareassociates.com",
        "jd": "From: Shubham Gautam, KK Software LLC shubham.g@kksoftwareassociates.com Reply to: shubham.g@kksoftwareassociates.com Hi Folks,Hope my email finds you well!!I Shubham Gautam, a recruitment associates for KK Software LLC. I have some urgent critical client requirements. So kindly do support me with genuine candidature to build a well relationship and business as well. Role: PM (Cash Management & Global Banking). Location: Jersey City, NJ (Hybrid)Mode: C2C Note: More experienced PM profiles who has experience in Cash Management and governance. PM - JD and Role expectation:Provide the efforts for Project Management to support USD Acceleration Plan. Provide project plans, status report, track issues and risks, budget/actuals tracking, testing co-ordination, implementation plan preparation and oversight.Experienced project manager to coordinate GB IT activities related to USD Acceleration Program. PM will manage SDLC and support program governance Client’s GB IT Management will provide strategy & coaching to allow smooth integration of PM into organization. Skills10+ experience as Project Manager and Business Analyst Experience in Cash Management & Global BankingGeneral banking knowledge, general IT knowledge Consulting experience Role Expectation/expected deliverablesCreate Project Plans for prioritized projectsCreate & Deliver regular status reports to managementTrack project Risks & IssuesManage project budget versus actual spendCoordinate Test planning & executionPlan Implementation Tasks",
        "source": "Email",
        "date_posted": "2024-10-04 15:31:11-05:00",
        "unique_id": "192593aaa2864c2c",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]