[
    {
        "company": "GVR Infotek LLC",
        "job_title": "Business Analyst – Data Warehouse",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 months with rolling extensions",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SQL querying",
                "data analysis",
                "reporting",
                "business intelligence"
            ],
            "primary": [
                "communication skills",
                "stakeholder management",
                "data governance",
                "quality assurance"
            ],
            "secondary": [
                "cloud architecture",
                "Master Person Identifier (MPI)",
                "data dictionaries",
                "process streamlining"
            ],
            "all": [
                "SQL querying",
                "data analysis",
                "reporting",
                "business intelligence",
                "communication skills",
                "stakeholder management",
                "data governance",
                "quality assurance",
                "cloud architecture",
                "Master Person Identifier (MPI)",
                "data dictionaries",
                "process streamlining"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Ankur Chaudhary",
        "email": "ankur.chaudhary@gvrinfotek.com",
        "jd": "From: Ankur Chaudhary, GVR Infotek LLC ankur.chaudhary@gvrinfotek.com Reply to: ankur.chaudhary@gvrinfotek.com Hi,Please find the below Job Description :-Title: Business Analyst – Data WarehouseLoctation : Richmond, Virginia Work schedule is HYBRID (2 days onsite a week)MOI : Interview is ONSITE/IN-PERSONContract :Length of contract is 12 months with rolling extensionsOur client CAI/Department of Behavioral Health and Developmental Sciences is looking for an Enterprise Data Warehouse Project for a HYBRID position based out of Richmond, VA. Summary:• Senior Business Analyst will support DBHDS' project to design and implement a new Enterprise Data Warehouse (EDW) and data exchange.• Sr. Business Analyst is needed to work on Enterprise Data Warehouse (EDW) Modernization project within the Data Exchange Program.• This project will replace the existing data warehouse with a new cloud architecture, integrate with a variety of source systems, and implement a Master Person Identifier (MPI) to link individuals across data sources.• Connections to source systems will be configured and reports will be refactored.Responsibilities:• Senior Business Analyst will support DBHDS' project to design and implement a new Enterprise Data Warehouse (EDW) and data exchange.Short Description: DBHDS – Sr Business Analyst is needed to work with stakeholders and vendor team to ensure that business and technical requirements are gathered and delivered for the Data Exchange and Modernization Program. This project will replace the existing data warehouse with a new cloud architecture, integrate with a variety of source systems, and implement a Master Person Identifier (MPI) to link individuals across data sources. Report requirements will also need to be documented.FULL JOB DESCRIPTION This role will coordinate extensively with internal and external stakeholders to gather and document business and technical requirements, analyze business needs, and analyze and document the data to be ingested into the new data platform.Activities include:Creating data dictionaries with input from data stewards; meeting with stakeholders to document report requirements; working with the business and IT to understand and document current business processes and identifying opportunities to streamline processes and reporting. This position will also oversee quality assurance processes to ensure that the delivered solutions meet business requirements and adhere to data governance and security standards. This role requires an experienced analyst who is skilled in listening, understanding, and communicating with business and technical stakeholders. SQL querying skills and experience with data analysis, reporting and business intelligence is required. Excellent communication skills and the ability to take initiative and ownership over their work is a must.",
        "source": "Email",
        "date_posted": "2024-10-01 10:44:54-05:00",
        "unique_id": "192491995fef37ce",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]