[
    {
        "company": "KPG99 INC",
        "job_title": "Oracle DBA",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 + years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "database administration",
                "performance tuning",
                "monitoring/alerting",
                "backup/recovery",
                "Linux/Unix shell commands"
            ],
            "primary": [
                "Ansible",
                "Terraform",
                "CI/CD",
                "GHA",
                "GitHub",
                "Jenkins"
            ],
            "secondary": [
                "team player",
                "goal oriented",
                "professional",
                "collaborative",
                "multi-tasking"
            ],
            "all": [
                "database administration",
                "performance tuning",
                "monitoring/alerting",
                "backup/recovery",
                "Linux/Unix shell commands",
                "Ansible",
                "Terraform",
                "CI/CD",
                "GHA",
                "GitHub",
                "Jenkins",
                "team player",
                "goal oriented",
                "professional",
                "collaborative",
                "multi-tasking"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Kailash Negi",
        "email": "kn@kpgtech.com",
        "jd": "From: Kailash Negi, KPG99 kn@kpgtech.com Reply to: kn@kpgtech.com Role : Oracle DBA - 6 openingsLocation : RemoteInterview : VideoDuration : 6 months to start Only send candidates you know and trustImportant Skills· Soft – team player, goal oriented, professional and can successfully move in a fast-paced environment ResponsibilitiesThis senior role requires expertise in database administration and the ability to work in a fast-paced collaborative environment. We provide support for on-premises and cloud databases (IaaS and DBaaS) including critical Tier 1 and Tier 2 systems that utilize high availability solutions with replication.This resource will support the design, implementation, and maintenance of database environments. You will ensure integrity and high availability of the database environments in your charge. Responsibilities include but are not limited to build/management of on-prem VM and as-a-service cloud implementations, monitoring/alerting setup and admin, application consulting, performance tuning, version upgrades, automations, architecture, access methods and reviews, backup/recovery, vendor coordination/ticketing, and team mentoring and knowledge sharing. As part of the DBA team you will collaborate with peer DBAs, project teams, application contacts to support and maintain current implementations as well as new builds/requirements. The role will assist in assuring that the Database implementations are secure, compliant, and adhere to minimum security requirements as set by client. You will use your knowledge and experience in the Database space to support application requirements and make recommendations for improving existing and future processes. You will aid in reviewing new enhancements, features, products for future use and planning. Common Required Qualifications:· Advanced knowledge of performance tuning, monitoring/alerting, observability, dashboarding· Advanced knowledge of process/query analysis, buffer tuning, client/server connectivity and database consistency checks · Advanced knowledge of maintenance routines, upgrades, patching· Experience in handling physical/logical backups & restores and data refreshes.· Experience in Linux/Unix shell commands or Windows PowerShell or Python· Experience in OS fine tuning with regards to Network I/O, Disk· Should be able to collaborate with DBA peers and mentor, work well in a team and independently· Should be able to multi-task i.e. parallelize multiple environment build / data migration· Should be able to work off-hours for application release support, Linux patching support, maintenance windows· Experienced with security and data compliance aspects of database· Well versed with latest version of database Preferred qualificationsExperience with automation via Ansible, TerraformExperience with deployments (CI/CD) with GHA, GitHub, Jenkins · 5 + years of experience as a Oracle DBA· Experience in installation, configuration & operations of non-RAC and multi-node RAC environment with standby database synchronized using physical data guard· Experience in managing disks with ASM · Experience in usage of OEM and setting up alerts· Experience in managing database backup/recovery, data movement using RMAN, data pump & Flashback.· Experience in performance tuning with ADDM, AWR, index optimizations, partitioning, stats pack.· Experienced in Golden Gate with configuration and troubleshooting issues· General familiarity with Oracle 23ai architecture & capabilities Thanks and Regards,Kailash Negi | KPG99 INCNote: KPG99 does not endorse undesired email. If you do not want to receive our mails, please reply with",
        "source": "Email",
        "date_posted": "2024-10-01 11:25:43-05:00",
        "unique_id": "19248e9ebf6f217b",
        "emp_type": [
            "third party"
        ],
        "tag": "Oracle DBA"
    }
]