[
    {
        "company": "Adventa tech",
        "job_title": ".NET Web Developer III",
        "location": "Madison, WI, USA",
        "full_location": {
            "city": "Madison",
            "state": "WI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "8+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "12 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".NET Framework",
                "MVC",
                "Angular",
                "C#",
                "VB.Net",
                "Javascript",
                "Bootstrap",
                "Oracle",
                "SQL"
            ],
            "primary": [
                "Visual Studio",
                "Azure DevOps",
                "Technical documentation",
                "GIS",
                "Esri JavaScript APIs"
            ],
            "secondary": [],
            "all": [
                ".NET Framework",
                "MVC",
                "Angular",
                "C#",
                "VB.Net",
                "Javascript",
                "Bootstrap",
                "Oracle",
                "SQL",
                "Visual Studio",
                "Azure DevOps",
                "Technical documentation",
                "GIS",
                "Esri JavaScript APIs"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Sradha Suman Nayak",
        "email": "sradha@adventatech.com",
        "jd": "From: Sradha Suman Nayak, Adventa tech sradha@adventatech.com Reply to: sradha@adventatech.com Job Title:.NET Web Developer IIILocation: WI ( Hybrid )Duration: 12 monthsMode of Interview: Virtual via MS TeamsVisa : GC, USC, TN VISA, OPT, EADNote: LinkedIn idVisa copy and DLNeed candidates local to wisconsin or relocation from nearby states onlyMust have all the experience mentioned below8+ years of experience with application development skillsets including Analysis and Development within Microsoft .Net Framework. Also, the candidate will have 8+ years coding experience in .Net framework with MVC including Angular, C#, VB.Net, Javascript and Bootstrap. Job Description:Basic Functions: .NET Web Developer IIIThe Department of Natural Resources seeks to hire a Microsoft .NET Web Developer III to design, develop, test, implement and maintain features for applications in .NET in support of External Services Division (EX), Bureau of Community Financial Assistance. The developer needs to provide reliable, responsive support and updates to these systems. This work requires work for a candidate with advanced developer skillsets and experience. The candidate must have proven work experience with application development, user interface development for custom applications and database development. The person hired for this position must work closely with team members for application solutions, development plans, and ensure effective integration among information systems and the IT infrastructure. This may include working with Third Party Technologies. An important part of the position will be to understand the interactions between applications, and services within the DNR environment, and evaluate the impact of changes or additions. The candidate should be motivated to stay on top of technological advancements to ensure that solutions are continuously improved, supported, and aligned with industry and agency standards as well as emerging business requirements. The candidate must understand user and process requirements and ensure those requirements can be achieved through high quality deliverables. The candidate for this position will need to rely on experience and judgment to plan and accomplish goals and be able to perform a variety of tasks. Top Skills (5) & Years of Experience:• Advanced level application development skillsets including Analysis and Development within Microsoft .Net Framework. (8+ yrs)• Coding experience in .Net framework with MVC including Angular, C#, VB.Net, Javascript and Bootstrap. (8+ yrs)• Experience coding applications in Angular (2 years)• Experience developing applications with Oracle backend databases including experience writing stored procedures and SQL. (8+ yrs)• Experience working in Visual Studio as well as Azure DevOps including keeping work items updated in addition to code management. Nice to Have:• Experience writing technical documentation.• Previous work experience at DNR or other government agency.• Experience with GIS, especially Esri JavaScript APIs. Additional Details:• State Government experience would be a plus.• Work hours are during business hours between 7:00 – 5:00pm.• Must have reliable internet provided at own expense for working remotely.• State holidays are not paid unless part of work agreement. No overtime and no weekend differential. • At the end of the contract, the equipment must be returned. If it cannot be dropped off in person or if DNR Equipment is damaged during the contract, replacement and shipping is done at supplier’s expense. Special notes: This position is for 20 hours per week. Hybrid, on a weekly basis, currently 60% remote and 40% in the office. Madison, WI. Hybrid requirement is weekly not monthly. New contractor must start on site for a five-day orientation/onboarding. Work cannot be conducted outside the United States. Interview Process:• 1st Round Interview - A virtual interview will be scheduled via Microsoft Teams with audio and camera required along with reliable internet. Audio and video must be in sync. 60 Minutes• Top candidates will move onto next step:- 2nd Round Interview - A virtual interview will be scheduled via Microsoft Teams with audio and camera required along with reliable internet. Audio and video must be in sync. 60 Minutes- A 20-minute technical exam will be held right after the 2nd round. Camera, audio and screen-sharing are required. Applicants should ensure they are able to screen-share.",
        "source": "Email",
        "date_posted": "2024-10-01 12:31:37-05:00",
        "unique_id": "19249255d0a98913",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]