[
    {
        "company": "Techgene",
        "job_title": "Technical Writer",
        "location": "Des Moines, IA, USA",
        "full_location": {
            "city": "Des Moines",
            "state": "IA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time"
            ],
            "job_code": "747895",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Technical Writing",
                "Documentation Standardization",
                "Business Analysis"
            ],
            "primary": [
                "Incident Response Planning",
                "Project Coordination",
                "Stakeholder Engagement"
            ],
            "secondary": [
                "Process Analysis",
                "Requirements Elicitation",
                "Functional Specifications"
            ],
            "all": [
                "Technical Writing",
                "Documentation Standardization",
                "Business Analysis",
                "Incident Response Planning",
                "Project Coordination",
                "Stakeholder Engagement",
                "Process Analysis",
                "Requirements Elicitation",
                "Functional Specifications"
            ],
            "with_experience": []
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Manvith",
        "email": "manvith.c@techgene.com",
        "jd": "From: Manvith, Techgene manvith.c@techgene.com Reply to: manvith.c@techgene.com Technical Writer (747895) 200 E Grand Des Moines, IA 50319 | Web Cam Interview Only| Remote The Business Consultant supports the State of Iowa’s Office of the Chief Information Officer (OCIO), Security Operations Center (SOC). The purpose of this position is to provide technical writing support, standardization of documentation, and business support across the SOC. The Business Consultant will initially focus on the development, consolidation, and standardization of the following artifacts for incident responders: · Computer Security Incident Response Plan (CSIRP).· SOC Incident Playbooks.· Standardization of Incident Reports.· RACI (Responsible, Accountable, Consulted, and Informed) grids per playbook.· Website guidance for workforce members reporting security incidents to the SOC.The Business consultant will assist in the definition and measurement of SOC Service Level Agreements (SLA), Memorandum of Understanding (MOU), Memorandum of Agreement (MOA), and other formal documentation to support the SOC. Integrate Key Performance Indicators (KPI) and develop status reporting for stakeholder consumption. · Provide business analysis, process analysis, and project coordination services. Develop business cases, business impact statements, and integrate security prioritization metrics to drive business decisions.· Provide information security function task tracking, develop resource estimates, and provide priority schedules. Coordinate with service suppliers to ensure deliverables are clearly defined, priorities are identified, tracked, and reported to meet the functions needs.· Analyze business processes, procedures, and organization structure in order to identify problems and determine solutions. Elicit requirements from stakeholders, analyze the requirements, document, and create functional specifications as required.",
        "source": "Email",
        "date_posted": "2024-10-01 07:11:55-05:00",
        "unique_id": "19247fe07c0fb032",
        "emp_type": [
            "full-time"
        ],
        "tag": "BA/Scrum Master/PM"
    }
]