[
    {
        "company": "Pivotal Technologies, Inc",
        "job_title": "Back end Java Developer",
        "location": "Lawrenceville, GA, USA",
        "full_location": {
            "city": "Lawrenceville",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Bachelor’s Degree in Computer Science, Information Systems, Analytics, or a related technical field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "8+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Python",
                "React",
                "SQL Server",
                "RESTful APIs"
            ],
            "primary": [
                "Agile development methodologies",
                "Version control systems",
                "Git",
                "GitHub Enterprise",
                "Advanced JavaScript Frameworks",
                "Cloud Platform Experience",
                "DevOps Practices",
                "Testing and Monitoring"
            ],
            "secondary": [
                "Strong problem-solving abilities",
                "Strong communication skills"
            ],
            "all": [
                "Java",
                "Python",
                "React",
                "SQL Server",
                "RESTful APIs",
                "Agile development methodologies",
                "Version control systems",
                "Git",
                "GitHub Enterprise",
                "Advanced JavaScript Frameworks",
                "Cloud Platform Experience",
                "DevOps Practices",
                "Testing and Monitoring",
                "Strong problem-solving abilities",
                "Strong communication skills"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Rajesh Kumar",
        "email": "rajesh.kumar@pivotal-technologies.com",
        "jd": "From: Rajesh Kumar, Pivotal Technologies, Inc rajesh.kumar@pivotal-technologies.com Reply to: rajesh.kumar@pivotal-technologies.com Position: Back end Java DeveloperLocation: Lawrenceville, GAVisa : Any Not H1BRole : OnsiteInterview mode : Onsite*Local candidates needed Back end Java developer for Gwinnett County Government. 100% on site in Lawrenceville, GA. Candidates must be local to Atlanta now. Face to face interview required. Our client is seeking a Web Applications Developer for an onsite contract opportunity in Lawrenceville, GA.As a Web Applications Developer, you will take on the responsibility of contributing to the design, implementation, and support of applications used by the client. You will work on complex projects and begin to take ownership of specific features or modules, collaborating with cross-functional teams to deliver impactful solutions.Contract Duration: 8+ Months Required Skills & ExperienceBachelor’s Degree in Computer Science, Information Systems, Analytics, or a related technical field AND 5 years of hands-on experience in software development, particularly in full stack development OR an equivalent combination of education and experience sufficient to successfully perform the essential duties of the job as listed.Valid driver’s license.Proficiency with Python, React, and other modern programming languages and frameworks.Experience with SQL Server or other relational databases, including schema design and query optimization.Familiarity with development tools and practices, including CI/CD and automated testing.Understanding of RESTful APIs, web services, and modern network communication.Experience with Agile development methodologies.Proven ability to work effectively in a team and contribute to project success.Proficient in version control systems, particularly Git and GitHub Enterprise.Strong communication skills and the ability to adapt to evolving user requirements.Advanced JavaScript Frameworks: Experience with frameworks like Angular or Vue.js.Cloud Platform Experience: Experience deploying applications on cloud platforms like AWS, Azure, or Google Cloud.DevOps Practices: Familiarity with tools like Docker, Kubernetes, or Jenkins for automating deployment and optimizing the development process.Testing and Monitoring: Experience with testing methodologies and monitoring tools to ensure software reliability.Soft Skills: Strong problem-solving abilities and the ability to communicate technical concepts clearly.",
        "source": "Email",
        "date_posted": "2024-10-01 09:40:27-05:00",
        "unique_id": "1924886c4163d4ab",
        "emp_type": [
            "contract"
        ],
        "tag": "Java Dev"
    }
]