[
    {
        "company": "IBM/Paypal",
        "job_title": "Informatica MDM and SAP MDG Business System Analyst",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "8 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Informatica MDM",
                "SAP MDG",
                "Business Analysis",
                "Data Governance",
                "Data Management"
            ],
            "primary": [
                "Customer Service Skills",
                "Written and Verbal Communication Skills",
                "System and Software Development",
                "Technical Application Architecture Design",
                "Testing Methodologies"
            ],
            "secondary": [
                "Multi-tasking",
                "MS PowerPoint",
                "MS Excel",
                "Project Management",
                "Data Quality"
            ],
            "all": [
                "Informatica MDM",
                "SAP MDG",
                "Business Analysis",
                "Data Governance",
                "Data Management",
                "Customer Service Skills",
                "Written and Verbal Communication Skills",
                "System and Software Development",
                "Technical Application Architecture Design",
                "Testing Methodologies",
                "Multi-tasking",
                "MS PowerPoint",
                "MS Excel",
                "Project Management",
                "Data Quality"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "SAPNA",
        "email": "sapna@itecsus.com",
        "jd": "Urgent need. IBM/Paypal. Any visa. Phone + Video interview. . 100% Remote. -----------------------------------------------------------------------------------------------Position: Informatica MDM and SAP MDG Business System Analyst Location: Anywhere in US. 100% Remote Job DescriptionThe MDM Business System Analyst (BSA) position requires a strong understanding of Master Data Management concepts, industry data standards, and data governance that support Finance operations. The BSA collaborates with Product managers, Operational Managers, and external vendors to ensure consistent data management and accurate information flow to support core product functions, such as Payments, as well as corporate functions such as Accounting, FP&A, Treasury, and Regulatory reporting. Basic Qualifications:At least 8 years past professional Business Analyst or consulting experiencePreferred Technical Capabilities: (experience that will help this person be successful)Experience with Informatica MDM and SAP MDG.Strong customer service skills, ability to elicit and clearly document complex business requirements and reconcile differences between multiple business/technical stakeholdersExcellent written and verbal communication skillsStrong understanding and experience of system and software development, technical application architecture design and testing methodologiesAbility to multi-task and work quickly, managing their own progress on multiple projects/work streams at onceExperience with master data and data quality in relation to product /data considerations is a big plusExperience in managing small to medium projects is a big plus.Adapt learning new technologies and an end user perspectiveProficient with MS PowerPoint and MS ExcelProject management experience organizing tasks and tracking deliverables.",
        "source": "Email",
        "date_posted": "2024-10-01 11:24:37-05:00",
        "unique_id": "19248eabff46c3da",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]