[
    {
        "company": "Yochana IT Solutions Inc.",
        "job_title": "MDM BSA ( Reltio and Informatica MDM )",
        "location": "San Jose, CA, USA",
        "full_location": {
            "city": "San Jose",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "enterprise data projects",
                "analytical skills",
                "problem solving skills",
                "programming",
                "SQL",
                "data modeling"
            ],
            "primary": [
                "communication skills",
                "partnering with engineering",
                "partnering with business",
                "partnering with operations"
            ],
            "secondary": [
                "master data management concepts",
                "Reltio",
                "SAP MDG",
                "Informatica MDM",
                "Tableau",
                "Power BI",
                "Looker"
            ],
            "all": [
                "enterprise data projects",
                "analytical skills",
                "problem solving skills",
                "programming",
                "SQL",
                "data modeling",
                "communication skills",
                "partnering with engineering",
                "partnering with business",
                "partnering with operations",
                "master data management concepts",
                "Reltio",
                "SAP MDG",
                "Informatica MDM",
                "Tableau",
                "Power BI",
                "Looker"
            ],
            "with_experience": [
                "SQL",
                "data modeling"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Gopi Chand",
        "email": "gopi@yochana.com",
        "jd": "Hello, I’m a Technical Recruiter with Yochana Solutions Inc., a national IT staffing solutions provider with 14 plus years of experience delivering value to leading companies across the U.S and Canada. I'm currently staffing for MDM BSA ( Reltio and Informatica MDM ) – San Jose, CA / Austin, TX / NYC, NY ( Onsite ). Below you will find the job description, if you are qualified and interested please send me your Updated Word Document Resume. My apologies if this position is not an ideal fit, we'll keep you in mind for other suitable positions and referrals would be appreciated. Thank you in advance. Role: MDM BSA Location: San Jose, CA / Austin, TX / NYC, NY ( Onsite ) Vendor / Client: Direct Vendor Duration: Contract Job Summary: Responsibilities Partner with the teams to design, develop and deliver data, analytics and master data management systems supporting various Google business processes (finance, legal, marketing, sales etc) Document Business/Functional requirements Participate in implementation projects (e.g., requirements documentation, use case development, functional design, test documentation/execution, UAT support, and production support). Partner with technical teams to develop, deliver and test the systems Participate and provide updates in project status meeting, scrum and planning meetings Minimum skills: Experience working on enterprise data projects (data warehouses/master data management, others) Strong analytical and problem solving skills Experience in programming and SQL Hands on experience on data modeling (Conceptual, logical and physical) Excellent communication skills with a demonstrated track record of effectively partnering with engineering, business, and operations teams Preferred skill Deep knowledge of master data management concepts Implementation experience with tools like Reltio, SAP MDG or Informatica MDM Visualization expertise in tools like Tableau, Power BI, Looker etc Ability to operate in a complex environment of multiple projects and stakeholders and to participate in several projects simultaneously.",
        "source": "Email",
        "date_posted": "2024-10-01 09:44:35-05:00",
        "unique_id": "19248b626fd310c7",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]