[
    {
        "company": "Tech Brand Staffing LLC",
        "job_title": "IA-DOM-DOIT-BA2-SOC Technical Writer (747895)",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "747895",
            "experience_required": "4 Years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Excellent organizational skills",
                "Proven ability to work with diverse audiences",
                "Excellent writing and composition skills",
                "Knowledge of project management",
                "Ability to resolve issues in complex situations"
            ],
            "primary": [
                "Ability to work effectively with customers",
                "Ability to solve complex problems",
                "Commitment to fostering a diverse working environment",
                "Ability to work independently and as part of a team"
            ],
            "secondary": [],
            "all": [
                "Excellent organizational skills",
                "Proven ability to work with diverse audiences",
                "Excellent writing and composition skills",
                "Knowledge of project management",
                "Ability to resolve issues in complex situations",
                "Ability to work effectively with customers",
                "Ability to solve complex problems",
                "Commitment to fostering a diverse working environment",
                "Ability to work independently and as part of a team"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Zara Khan",
        "email": "info@techbrandstaffing.com",
        "jd": "From: Zara, Tech Brand Staffing.LLC info@techbrandstaffing.com Reply to: info@techbrandstaffing.com Greetings,Hope you're doing great,This is Zara from Tech Brand Staffing LLC. I've been retained by a top employer to help them recruit for a new IA-DOM-DOIT-BA2-SOC Technical Writer (747895) position. Please review the below job description and reply back with your updated resume and desired rate.Title: IA-DOM-DOIT-BA2-SOC Technical Writer (747895)Duration: 12 Months ContractLocation: RemoteSecurity Operations Center Technical Writer needed. The Business Consultant supports the State of Iowa’s Office of the Chief Information Officer (OCIO), Security Operations Center (SOC). The purpose of this position is to provide technical writing support, standardization of documentation, and business support across the SOC. The Business Consultant will initially focus on the development, consolidation, and standardization of the following artifacts for incident responders:· Computer Security Incident Response Plan (CSIRP).· SOC Incident Playbooks.· Standardization of Incident Reports.· RACI (Responsible, Accountable, Consulted, and Informed) grids per playbook.· Website guidance for workforce members reporting security incidents to the SOC.The Business consultant will assist in the definition and measurement of SOC Service Level Agreements (SLA), Memorandum of Understanding (MOU), Memorandum of Agreement (MOA), and other formal documentation to support the SOC. Integrate Key Performance Indicators (KPI) and develop status reporting for stakeholder consumption.· Provide business analysis, process analysis, and project coordination services. Develop business cases, business impact statements, and integrate security prioritization metrics to drive business decisions.· Provide information security function task tracking, develop resource estimates, and provide priority schedules. Coordinate with service suppliers to ensure deliverables are clearly defined, priorities are identified, tracked, and reported to meet the functions needs.· Analyze business processes, procedures, and organization structure in order to identify problems and determine solutions. Elicit requirements from stakeholders, analyze the requirements, document, and create functional specifications as required.Candidate Requirements:· Excellent organizational skills with a focus on accuracy, detail, and follow-through; punctual and meets deadlines; effectively prioritizes tasks to meet expectations.· Proven ability to work with diverse audiences and translate technical information into non-technical information.· Excellent writing and composition skills including grammar; punctuation and spelling; ability to organize; express and communicate ideas clearly in writing.· Knowledge of project management, conflict resolution, and incident escalation preferred.· Ability to work effectively with customers to solve business challenges while balancing the need for confidentiality, integrity, and availability.· Ability to resolve issues in a variety of complex situations which require complex judgments and solutions based on sophisticated analytical thought.· Ability to solve complex problems, convey both oral and written instruction, and handle multiple task interruptions while providing services in a professional and courteous manner.· Must be an individual of high integrity and be a model of unwavering integrity to others.· Commitment to fostering a diverse working environment.· Ability to work independently, as part of a team of peers, and also to support and contribute to a multidisciplinary team environment.Required / Desired SkillsSkillRequired / DesiredAmountof ExperienceExcellent organizational skills with a focus on accuracy, detail, and follow-through; punctual and meets deadlines; effectively prioritizes tasks to mRequired4Years Proven ability to work with diverse audiences and translate technical information into non-technical information.Required4YearsExcellent writing and composition skills including grammar; punctuation and spelling; ability to organize; express and communicate ideas clearly in wrRequired4Years Knowledge of project management, conflict resolution, and incident escalation preferred.Required4YearsAbility to work effectively with customers to solve business challenges while balancing the need for confidentiality, integrity, and availability.Required4Years Ability to resolve issues in a variety of complex situations which require complex judgments and solutions based on sophisticated analytical thought.Required4YearsAbility to solve complex problems, convey both oral and written instruction, and handle multiple task interruptions while providing services in a profRequired4Years Must be an individual of high integrity and be a model of unwavering integrity to others.Required4YearsCommitment to fostering a diverse working environment.Required4Years Ability to work independently, as part of a team of peers, and also to support and contribute to a multidisciplinary team environment.Required4Years",
        "source": "Email",
        "date_posted": "2024-10-01 08:45:24-05:00",
        "unique_id": "192486713e92f2f6",
        "emp_type": [
            "contract"
        ],
        "tag": "BA/Scrum Master/PM"
    }
]