[
    {
        "company": "IDC Technologies",
        "job_title": "Scrum Master",
        "location": "Greenwood Village, CO, USA",
        "full_location": {
            "city": "Greenwood Village",
            "state": "CO",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Scrum Framework",
                "SAFe",
                "lean-agile practices"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Scrum Framework",
                "SAFe",
                "lean-agile practices"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "John Joseph",
        "email": "john.joseph@idctechnologies.com",
        "jd": "HI, Hope you are doing well. We have an urgent opening for the below role with Contract position for our clients, kindly Check the below job description and let me know your interest. Title – Scrum MasterLocation: Greenwood Village, CO (onsite 4 days/wk) |Domain: Telecom (preferably) Job Description • Must be a real agilist with true knowledge of Scrum Framework; familiarity with scaling frameworks in general and in particular SAFe. • Must hold current and relevant certifications from SAFe and/or Scrum Alliance (or another truly legitimate Scrum organization, no diploma mills) Are you truly passionate about Scrum and lean-agile practices? Have you put in your dues leading Scrum on technical delivery teams? Do you not just talk the talk – but really walk the walk? Do you have technical chops yourself or have you worked with engineers long enough to understand their ways? What can you teach us about the essence of this role and how can you help us elevate our game?We are not looking for project managers or other career professionals looking to break into technology and the Scrum Master role. We need a fully formed career Scrum Master, someone ready to hit the ground running, but who also understands this is a journey of continuous learning, and there are always opportunities to improve or grow in the role.Come to your interview: prepared to discuss the details of this job description; ready to walk through technical and process scenarios and questions; able to speak to your real-life professional experiences as they pertain to these points and the role; eager to tell us who you are, why you would be a fit for this role, and the reasons you are passionate about lean-agile. How do you feel about the state of lean-agile in 2024; tell us; it matters! Responsibilities for Scrum Master Lead the Scrum team in using lean-agile and Scrum practicesHelping the product owner and development team to achieve customer satisfactionLead the Scrum and development teams in self-organization",
        "source": "Email",
        "date_posted": "2024-10-01 10:06:38-05:00",
        "unique_id": "19248a227fdb9212",
        "emp_type": [
            "contract"
        ],
        "tag": "BA/Scrum Master/PM"
    }
]