[
    {
        "company": "TTData LLC",
        "job_title": "Sr. Business Analyst",
        "location": "Piscataway, NJ, USA",
        "full_location": {
            "city": "Piscataway",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "15+ Years",
            "degree_required": "Bachelor's Engineering degree in Computer Science/Technology, Master of Computer Application or equivalent preferred",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Analytical Skills",
                "Problem-Solving",
                "Communication",
                "Interpersonal Skills"
            ],
            "primary": [
                "UML",
                "BPMN",
                "Agile",
                "Scrum",
                "SDLC",
                "Project Management"
            ],
            "secondary": [
                "Data Analysis",
                "Excel",
                "Power BI",
                "Tableau"
            ],
            "all": [
                "Business Analysis",
                "Analytical Skills",
                "Problem-Solving",
                "Communication",
                "Interpersonal Skills",
                "UML",
                "BPMN",
                "Agile",
                "Scrum",
                "SDLC",
                "Project Management",
                "Data Analysis",
                "Excel",
                "Power BI",
                "Tableau"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Balaji V",
        "email": "balaji@ttdatas.com",
        "jd": "From: Balaji, TTDATAS balaji@ttdatas.com Reply to: balaji@ttdatas.com Hi Amudha,Hi ALL,Greetings from TTData LLC..!!I hope you are doing well. I do have a job opening for Sr. Business Analyst position for our client based out at Piscataway, NJPlease find the below requirement kindly share me updated profile along with contact details asap.Role:: Sr. Business AnalystLocation:: Piscataway, NJ(Onsite)Contract Type:: C2H PositionOnly: GC/GC EAD/H4 EAD/L2S/GC/GC EAD/E3 EAD/J3 EAD/ TN EAD Position Overview: The Business Analyst is responsible for leading the analysis of business needs and translating them into technical requirements and solutions. This role involves working closely with stakeholders, project managers, and development teams to deliver effective solutions that meet business objectives. Key Responsibilities: Collaborate with stakeholders to understand business needs and objectives. Conduct workshops and surveys to gather detailed business requirements. Analyze and document business processes, workflows, and systems to identify areas for improvement. Ensure solutions are aligned with business goals and comply with regulatory and organizational standards. Serve as the primary point of contact between business units and IT teams. Facilitate communication and collaboration among stakeholders to ensure project alignment and clarity. Develop test plans, test cases, and conduct user acceptance testing (UAT) to ensure solutions meet business requirements. Identify defects and work with development teams to resolve issues promptly. Ensure the quality and functionality of solutions before deployment. Recommend and implement process improvements to enhance efficiency and effectiveness. Mentor and provide guidance to junior business analysts and team members. Qualifications: Bachelor's Engineering degree in Computer Science/Technology, Master of Computer Application or equivalent preferred. Proven experience (15+ Years) in a client-facing role. Strong analytical and problem-solving skills, with a keen attention to detail. Excellent communication and interpersonal skills, with the ability to work effectively with diverse teams and stakeholders. Proficiency in business analysis tools and methodologies, such as UML, BPMN, and Agile/Scrum. Experience with software development lifecycle (SDLC) processes and project management practices. Familiarity with data analysis and visualization tools (e.g., Excel, Power BI, Tableau) is an advantage. Key Competencies: Ability to adapt to changing project requirements and environments. Strong collaborative skills to work effectively with cross-functional teams. Keen attention to detail to ensure project deliverables meet quality standards. Ability to analyze complex business problems and develop innovative solutions. Strong verbal and written communication skills to effectively interact with stakeholders and present findings. Understanding of IT systems, software development, and data analysis tools. Ability to manage multiple projects simultaneously and deliver results within deadlines. Capability to lead cross-functional teams and mentor junior analysts. Additional Requirements: Availability: Flexibility to work outside regular business hours as needed to meet project deadlines. Travel: Willingness to travel to client site as required Thanks & RegardsBalaji V",
        "source": "Email",
        "date_posted": "2024-10-01 12:10:47-05:00",
        "unique_id": "19249130f468259d",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]