[
    {
        "company": "Parmesoft",
        "job_title": "Sr ETL Developers",
        "location": "Frisco, TX, USA",
        "full_location": {
            "city": "Frisco",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "",
            "experience_required": "12+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Informatica",
                "Data Engineering",
                "AWS",
                "Snowflake",
                "SQL",
                "Python"
            ],
            "primary": [
                "Data pipelines",
                "Data quality",
                "Data profiling",
                "CICD",
                "Jenkins",
                "Data solutions"
            ],
            "secondary": [
                "Dataiku",
                "Agile methodologies",
                "Mentoring",
                "Data security",
                "Auditing processes"
            ],
            "all": [
                "Informatica",
                "Data Engineering",
                "AWS",
                "Snowflake",
                "SQL",
                "Python",
                "Data pipelines",
                "Data quality",
                "Data profiling",
                "CICD",
                "Jenkins",
                "Data solutions",
                "Dataiku",
                "Agile methodologies",
                "Mentoring",
                "Data security",
                "Auditing processes"
            ],
            "with_experience": [
                "Informatica (7 years)",
                "Data Engineering (12+ years)",
                "AWS (4 years)",
                "Snowflake (5 years)",
                "SQL (5 years)",
                "Python (5 years)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Shanu Francis",
        "email": "shanu.f@parmesoft.com",
        "jd": "Hi,This is Shanu Francis from Parmesoft. We have an immediate opening for -Sr ETL Developers - Frisco TX(ONSITE)with my client. So, Please have a look on the Job Description below and reply me back if you are interested.Position: -Sr ETL Developers - Frisco TX(ONSITE)Location: - Frisco TX(ONSITE)Long term ContractJob Description:12+ years of experience in Technology, Data Engineering field in architecting, developing end-to-end scalable data applications and data pipelines; work with product manager and scrum masters and lead the team in assisting the story creations and sprint deliverables7 years of experience leading and developing automated Informatica data pipelines with at least4 years Informatica cloud (IICS) and relevant knowledge in data profiling, data quality, catalog tools7 years of experience working in enterprise data warehouse solutions and platforms, and working knowledge of different databases (e.g., RDBMS, Snowflake), S3 Datalake, CICD, Jenkins and AWS cloud technologies5 years of experience designing, implementing automated data solutions using Snowflake lakehouse; building workflows, developing, and scheduling ETL processes using programming SQL or Python 5 years of experience mentoring another technologist5 years of experience implementing data solutions by adopting, recommending and improving CICD, change management, data security, auditing processes4 years of experience working with software engineering best practices across the development lifecycle, including agile methodologies, coding standards, code reviews, source management, build processes and testing AWS or Informatica or Snowflake certification is preferred Experience with Dataiku is a plus.",
        "source": "Email",
        "date_posted": "2024-10-01 09:49:05-05:00",
        "unique_id": "192488e1ac06fe9a",
        "emp_type": [
            "contract"
        ],
        "tag": "AWS Data Engineer"
    }
]