[
    {
        "company": "Tekinspirations",
        "job_title": "Microsoft Dynamics Business Analyst",
        "location": "Chicago, IL, USA",
        "full_location": {
            "city": "Chicago",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "8+ years",
            "degree_required": "Bachelor's degree in computer science, marketing, business administration or relevant field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6-month contract to hire",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Microsoft Dynamics CRM",
                "Business Analysis",
                "Functional Analysis"
            ],
            "primary": [
                "Sales and Marketing",
                "CRM Implementation",
                "Design Meetings",
                "Training"
            ],
            "secondary": [
                "Mining Industry",
                "Heavy Industries",
                "Fluent in English",
                "French"
            ],
            "all": [
                "Microsoft Dynamics CRM",
                "Business Analysis",
                "Functional Analysis",
                "Sales and Marketing",
                "CRM Implementation",
                "Design Meetings",
                "Training",
                "Mining Industry",
                "Heavy Industries",
                "Fluent in English",
                "French"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Akash Sharma",
        "email": "akash.s@tekinspirations.com",
        "jd": "From: Akash Sharma, Tekinspirations akash.s@tekinspirations.com Reply to: akash.s@tekinspirations.com Job Title: Microsoft Dynamics Business Analyst MOI : Skype Duration: 6-month contract to hire Location: Chicago, IL 60607 – hybrid work model (Need local candidates) This position is located in our Chicago office with work performed at client site in Chicago; however, a hybrid-working model is acceptable. Candidates will be required to work onsite as often as requested by the client. Candidates in Montreal may also be considered. Number of Positions: 1 JOB OVERVIEW Looking for experienced lead Microsoft Dynamics CRM Business/Functional Analyst with experience in the Mining/Heavy industries preferred along with experience in the Sales and Marketing area of CRM implementation. The lead functional analyst for CRM-Dynamics will be expected to: Gather business needs/requirements Act as a bridge between business and IT teams Design the dynamics modules, Conduct design meetings/workshops Work with the technical team to develop the design Work with the testing team Conduct some training for the end users. Future duties and responsibilities: Gather business needs/requirements Act as a bridge between business and IT teams Design the dynamics modules, Conduct design meetings/workshops Work with the technical team to develop the design Work with the testing team Conduct some training for the end users. Required qualifications to be successful in this role 8+ year of experience working with Microsoft dynamics marketing and sales CRM Implementation 8+ year of experience working as a Business/Functional Analyst Minimum Education Required: Bachelors degree in computer science, marketing, business administration or relevant field. Fluent in English – French a plus",
        "source": "Email",
        "date_posted": "2024-10-01 12:06:08-05:00",
        "unique_id": "192490d7cc61ccc5",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]