[
    {
        "company": "3K Technologies",
        "job_title": "Business analyst",
        "location": "Tallahassee, FL, USA",
        "full_location": {
            "city": "Tallahassee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "financial background",
                "FLAIR application",
                "PALM application",
                "business process improvement",
                "Azure DevOps"
            ],
            "primary": [
                "user stories",
                "functional requirements",
                "user interface design",
                "SQL queries",
                "testing"
            ],
            "secondary": [
                "project management",
                "coaching",
                "mentoring",
                "data analysis",
                "troubleshooting"
            ],
            "all": [
                "financial background",
                "FLAIR application",
                "PALM application",
                "business process improvement",
                "Azure DevOps",
                "user stories",
                "functional requirements",
                "user interface design",
                "SQL queries",
                "testing",
                "project management",
                "coaching",
                "mentoring",
                "data analysis",
                "troubleshooting"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Sanjay",
        "email": "sanjay@3ktechnologies.com",
        "jd": "From: sanjay, 3ktechnologies sanjay@3ktechnologies.com Reply to: sanjay@3ktechnologies.com HI ALL,Job Title: Business analystLocation:Tallahassee,FL(Onsite)Duration: Long TermNote : Only Local Candidates PreparedDescriptionPreferences will be given to candidates with the following: • A financial background. • Experience with the Florida Accounting Information Resource (FLAIR) application. • Experience with the Florida Planning, Accounting, and Ledger Management (PALM) application. • Candidates are required to attend in-person project meetings. Preference will be given to candidates that are local to Tallahassee, FL.Work under the direction of the Agency’s designated project manager. Participate in and lead activities as directed by the Agency. • Work on large, complex projects that have enterprise-wide impact and require subject matter expertise of multiple process improvement areas and mastery of process improvement tools. • Work as a project team member on one or more projects to facilitate process improvements involving multiple business areas and/or state agencies. • Elicit, identify, analyze, and document business processes and requirements for business units and/or sister agencies. Translate business requirements into user stories and/or functional requirements. Document requirements and/or user stories and other work items in Azure DevOps. Design user interface screens. • Analyze the business processes and make recommendations for business process improvements. This requires a high level of understanding of the organization’s business systems and processes. • Serve as the primary liaison between internal and external users and technical resources to translate business needs into technical requirements. • Understand technical problems and solutions in relation to the current, as well as the future business environment. • Develop meeting summaries, requirements documentation, screen designs, and other project documentation within required timeframes. • Develop and maintain test plans and scripts for testing. • Lead testing efforts for each release in dev and beta environments. • Coordinate with the functional owner and developers to research anomalies, identify root cause, and troubleshoot through resolution. • Capture and document metrics in support of the user acceptance testing and recommend improvements. • Assess current testing processes; recommend and implement process improvements, including automation where practical. • Provide estimates for assigned tasks. • Create and manage SQL queries and analyze data to respond to ad hoc requests, troubleshoot, test, or investigate anomalies, as needed. • Adapt to changes in daily work plans based on customer support needs. • Assist in the completion of status reporting and escalation of issues to management. • Coach and mentor junior staff. • Comply with AHCA’s Division of IT Information Systems Development Methodology (ISDM) standards and formats on all work products. Comply with Project Management Oversight RuleThanks & RegardsSanjaySenior Technical Recruiter1114 Cadillac Ct, Milpitas, CA 95035www.3ktechnologies.com|sanjay@3ktechnologies.com",
        "source": "Email",
        "date_posted": "2024-10-16 14:51:24-05:00",
        "unique_id": "19297031e5731041",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]