[
    {
        "company": "KK Software Associates LLC",
        "job_title": "Scrum Master - Agile Way of Working, Data Warehouse",
        "location": "Raleigh, NC, USA",
        "full_location": {
            "city": "Raleigh",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "8-10 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Agile Way of Working",
                "Data Warehouse",
                "Scrum Master"
            ],
            "primary": [
                "PowerPoint preparation",
                "Dashboard preparations"
            ],
            "secondary": [
                "Servant leadership",
                "Coaching",
                "Mentoring",
                "Risk management",
                "Project planning"
            ],
            "all": [
                "Agile Way of Working",
                "Data Warehouse",
                "Scrum Master",
                "PowerPoint preparation",
                "Dashboard preparations",
                "Servant leadership",
                "Coaching",
                "Mentoring",
                "Risk management",
                "Project planning"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Priya Mishra",
        "email": "priya.m@kksoftwareassociates.com",
        "jd": "From: Priya Mishra, KKsoftwareassociates priya.m@kksoftwareassociates.com Reply to: priya.m@kksoftwareassociates.com Hello,Hope you are doing good. This is Priya from KK Software Associates LLC. We are the Preferred vendor for the clients.I found your resume suitable for one of the job opportunities we currently have.Please find the detailed job description and please do let me know if you are interested in this opening:Job Title: Scrum Master - Agile Way of Working, Data WarehouseLocation- Raleigh, NC-Day 1 OnsiteContractExperience (Years): 8-10Role Description:• The role will include collaborating with partners from business, operations, technology, and risk management functions to manage and drive scalable solutions.• Serve as the primary communication lead, articulating program vision and progress to all stakeholders, including executive leadership.• Build and oversee a robust Agile Program management, Project planning and principls to ensure seamless operation and alignment of large-scale projects• Facilitating PI planning, backlog refinement, and iteration planning and project plan updates to senior management. • Ensure effective execution of program increments and adherence to Agile principles and practices.• Facilitating key ceremonies like PI planning and Scrum of Scrums• Identifying and resolving dependencies, risks, and impediments impacting train delivery through servant leadership and influencing skills.• Manage risk and resolve issues that affect program scope, quality, and schedule• Mentor and develop team members, fostering a culture of high performance and continuous improvement• Enabling teams through coaching and mentoring.• Promoting an Agile mindset focused on innovation and learning.• Strong in Power point preparation for Management reporting. • Strong in Dashboard preparations.Competencies: Agile Way of Working, Data WarehouseKeywords: Scrum Master, Safe Agile Thanks & Regards…,Priya MishraLead US IT Recruiter8751 Collin McKinney Pkwy, # 1302, McKinney, TX 75070555 Metro Place North, Suite # 100, Dublin, OH 43017Direct: (469) 325-3090Email: Priya.m@kksoftwareassociates.comWeb: www.kksoftwareassociates.com",
        "source": "Email",
        "date_posted": "2024-10-16 16:01:17-05:00",
        "unique_id": "192974319bda2de4",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Scrum Master"
    }
]