[
    {
        "company": "Pivotal",
        "job_title": "Business Analyst",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "3 years",
            "degree_required": "Associate’s Degree or some college",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Exposure to Complex IT web Applications",
                "Experience in a professional office environment",
                "Experience as a business analyst supporting a software development project",
                "Ability to lead meetings and conduct training",
                "Proficiency with MS Office",
                "Experience working as a liaison between the development team and project manager"
            ],
            "primary": [
                "Experience with Azure DevOps"
            ],
            "secondary": [
                "Knowledge and understanding of the Software Development Lifecycle",
                "Project management skills",
                "Experience with Microsoft SharePoint",
                "Experience with Salesforce Platform",
                "Experience with MS Dynamics"
            ],
            "all": [
                "Exposure to Complex IT web Applications",
                "Experience in a professional office environment",
                "Experience as a business analyst supporting a software development project",
                "Ability to lead meetings and conduct training",
                "Proficiency with MS Office",
                "Experience working as a liaison between the development team and project manager",
                "Experience with Azure DevOps",
                "Knowledge and understanding of the Software Development Lifecycle",
                "Project management skills",
                "Experience with Microsoft SharePoint",
                "Experience with Salesforce Platform",
                "Experience with MS Dynamics"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Mayank Mer",
        "email": "mayank.mer@pivotal-technologies.com",
        "jd": "Need local to MI only || 3 previous employment references Position Business Analyst Location Lansing, MI Duration 6+ Months Visa USC NOTE: Local candidates only. NO RELOCATION ALLOWED. Hybrid Role with 2 days onsite from day 1 - Tuesday and Wednesday Local ONLY. Note- Please ask for 3 previous employment references. Description: Our client is looking for a Business Analyst to assist with the Agency Services Application Development and Support team who supports multiple applications. This role would consist of supporting maintenance activities for applications as well as multiple larger projects. They are looking for someone who understands and has experience with the software development lifecycle as they will be managing work requests to support operational support needs for web applications and gather requirements for project initiatives. This role is the liaison between the technical team and the business client. This will be about 90% of the time for this resource. This is a senior position so the selected candidate will possess leadership skills including but not limited to the ability to delegate tasks to the team, effective communication and be comfortable leading requirement meetings with business and other technical resources. Tasks Facilitates meetings with the technical team and business client. Gathers requirements and project specifications by leading requirement sessions independently Maintain backlog of work items in Azure DevOps Manage project tasks, timelines, and communication between business product owner and development team associated with the Change Management lifecycle Track sprints and ticket progress in Azure DevOps Ensures the team is adhering to the department change management policies Maintains documentation on the project SharePoint Site. Must be detail oriented and a critical thinker Provide management with information such as project status reports and resource demand projections.",
        "source": "Email",
        "date_posted": "2024-10-16 12:41:49-05:00",
        "unique_id": "192968c7a884b1af",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]