[
    {
        "company": "TTDATA LLC",
        "job_title": "Microsoft CDP Architect",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "12+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "CDP implementation",
                "customer profile segmentation",
                "ETL",
                "SQL",
                "data modeling"
            ],
            "primary": [
                "Adobe Experience Platform",
                "Segment",
                "Tealium",
                "Redpoint",
                "Treasure Data",
                "data quality",
                "identity resolution",
                "digital marketing",
                "digital analytics",
                "customer360",
                "MarTech"
            ],
            "secondary": [
                "Product Owner Role",
                "business vision articulation",
                "KPI creation",
                "User Acceptance Testing",
                "stakeholder communication"
            ],
            "all": [
                "CDP implementation",
                "customer profile segmentation",
                "ETL",
                "SQL",
                "data modeling",
                "Adobe Experience Platform",
                "Segment",
                "Tealium",
                "Redpoint",
                "Treasure Data",
                "data quality",
                "identity resolution",
                "digital marketing",
                "digital analytics",
                "customer360",
                "MarTech",
                "Product Owner Role",
                "business vision articulation",
                "KPI creation",
                "User Acceptance Testing",
                "stakeholder communication"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Ganesh",
        "email": "ganesh@ttdatas.com",
        "jd": "From: Ganesh, TTDATA LLC ganesh@ttdatas.com Reply to: ganesh@ttdatas.com Role: Microsoft CDP ArchitectLocation: RemoteContract Responsibilities – Build the overarching strategy and high-level plan for CDP implementation, ingestion from data sources, customer profile synthetization into traits and audiences, journey orchestration and integration with downstream systemsShould be able to design and build integration with external systems/data sources leveraging the CDP integration featuresUnderstand dependencies amongst data sources and destinations and provide inputs to building architecture and design documentsBring best practices for CDP and Journey orchestration to the engagement. Work with internal and CDP vendor professional services to execute Omni channel use cases Desired skills – At least 1-2 implementations of CDP platforms like Adobe Experience Platform, Segment, Tealium, Redpoint, Treasure Data etc.Overall 12+ years of experience, with at least 5+ years of crafting customer-centric datasets (i.e. CRM, Call Center, Marketing, Offline, Point of Sale, etc.)Should have strong understanding of customer profile segmentation and experience in 360 degree view of customers in CDP for further analytical processing and decision makingStrong understanding of ETL, Data quality / Cleansing and Identity resolutionStrong and hands-on knowledge of SQL, Data modeling, and Data warehouseKnowledge of digital marketing, digital analytics, customer360, MarTech space is a big plus Expert in handling Product Owner Role for a Data Management Program specifically Customer Data PlatformExpert in articulating business vision and use cases for Customer Data PlatformShould have worked as a Business Analyst or Product owner for a Customer Data Platform (Microsoft CI, Tealium, Treasure Data, Redpoint etc.)Should be able to articulate Epics & User Stories to formulate roadmap for Customer Data Platform ProgramShould be able to create KPIs to measure successShould be able to translate the business requirements of Customer Data Platform to Technical teamsShould be able to liaison between Implementation and the Customer Business TeamShould be able to support User Acceptance Testing with the business user for Customer Data PlatformManage stakeholder communication, gather feedback, and address concernsDrive successful deployment and adoption of data products GaneshAccount ManagerTTDATA LLCEmail: ganesh@ttdatas.com Disclaimer: Under Bills.1618 Title III passed by the 105th U.S. Congress this mail cannot be considered spam as long as we include contact information and a REMOVE link for removal from our mailing list. To be removed from our mailing list reply with \"remove\" and include your \"original email address/addresses\" in the subject heading. We will immediately update it accordingly. We apologize for the inconvenience if any caused",
        "source": "Email",
        "date_posted": "2024-10-16 14:04:25-05:00",
        "unique_id": "19296d8184803689",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]