[
    {
        "company": "Dia Software Solutions",
        "job_title": "Project Manager 4 - MOD PRODUCT LINE",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "5+ years",
            "degree_required": "Bachelor’s degree in computer science, Systems Engineering, Management Information Systems, Project Management or Finance/Business",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "1 year with extension possible",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "PMP Certification",
                "Scaled Agile",
                "Waterfall Project Management",
                "IT infrastructure delivery",
                "Project Management"
            ],
            "primary": [
                "VITA Certification",
                "Agile Scrum Master Certification",
                "Safe® Scrum Master Certification",
                "Microsoft Office Products"
            ],
            "secondary": [],
            "all": [
                "PMP Certification",
                "Scaled Agile",
                "Waterfall Project Management",
                "IT infrastructure delivery",
                "Project Management",
                "VITA Certification",
                "Agile Scrum Master Certification",
                "Safe® Scrum Master Certification",
                "Microsoft Office Products"
            ],
            "with_experience": [
                "PMP Certification",
                "Scaled Agile",
                "Waterfall Project Management",
                "IT infrastructure delivery",
                "Project Management"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Sayyad Akif Husain",
        "email": "sayyad.husain@diasoftwaresolutions.com",
        "jd": "From: Sayyad Akif Husain, Dia Software Solutions sayyad.husain@diasoftwaresolutions.com Reply to: sayyad.husain@diasoftwaresolutions.com Hi,I hope this message finds you well! I am reaching out to you on an exciting Direct client opportunity with one of our clients. Can you please go through the requirements and let me know if you are interested in this position?Job Title: Project Manager 4 - MOD PRODUCT LINELocation: 1401 E Broad Street, Richmond, VA – 23219HybridExperience: 5+ yearsDuration: 1 year with extension possibleInterviews: In Person Interview Complete Description:PMP CERTIFICATION REQUIRED with experience in Scaled Agile environment, VITA certification is preferred. Virginia Department of Transportation (VDOT) Asset Management Division is seeking a senior technical Project Manager to manage and deliver complex IT Project(s) with multiple teams and work streams coordinated to an aggressive delivery schedule. Project Manager is responsible for the outcome of the assigned projects. The Project Manager leads the team through the Commonwealth Standard for Project Management for successful completion of the project phases: PreselectInitiation PlanningExecution and ControlCloseout. The selected candidate willServe as a hands-on technical project manager with development staff and business groupsCoordinate and communicate with Information Technology Division management and staff to coordinate work staff and resourcing.Communicate timelines and expectations to technical and business staffFacilitate multi-functional technical team collaboration.Collaborate with vendors, consultants, and contractors in the execution of projects, including contract management, and work with procurement office(s).Adhere to VDOT and VITA project management practices and governance requirements.Coordinate with VDOT and VITA project management offices.Maintain project budget, plans, tasks, schedules, risks, and status and disseminate information to team members and customers as defined in the communication plan.Ensure documentation of requirements and use cases, facilitate design workshops for assigned project.Ensure preparation of test objectives, test plans and test cases for assigned project.Provide the management of project milestones and deliverables for on-time and on-budget delivery.Define, measure, and clearly communicate progress with project metrics.Support system and application training efforts. Fill the above skills in the below box and have consultant to complete SKILLS MATRIXSkillRequiredAmount of ExperienceExperienceExperience managing large Multi Stream projects valued at $10M or greater each.Required 8 Years Experience in IT infrastructure delivery (Networking, physical plant, vendor management, site provisioning)Required8 Years PMP CertificationRequired Experience in both Scaled Agile and Waterfall Project ManagementRequired8 Years VITA CertificationHighly desired Agile Scrum Master Certification Desired Safe® Scrum Master CertificationDesired Microsoft Office Products (Word, Excel, Access, Outlook, Visio, PowerPoint, Project Server)Required8 Years Experience managing projects with high visibility and high stakes Required8 Years Experience managing projects that had to coordinate with at least one external team.Required8 Years Experience managing a project as part of a larger program and under PMO governance. Required8 Years Bachelor’s degree in computer science, Systems Engineering, Management Information Systems, Project Management or Finance/BusinessRequired4 Years",
        "source": "Email",
        "date_posted": "2024-10-16 13:44:52-05:00",
        "unique_id": "1929750fe6c2b1bc",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]