[
    {
        "company": "Stellar Consulting",
        "job_title": "SQL Data base Administrator",
        "location": "Chicago, IL, USA",
        "full_location": {
            "city": "Chicago",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Bachelor's degree in computer or information sciences or similar field preferred",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Microsoft SQL Server",
                "T-SQL programming",
                "Database Design",
                "SQL Statement Tuning"
            ],
            "primary": [
                "Integration Services",
                "Reporting Services",
                "Analysis Services",
                "Always-On Availability Groups",
                "Cloud Database Services",
                "AWS",
                "Azure",
                "PowerShell",
                "Python"
            ],
            "secondary": [
                "Oracle",
                "MySQL",
                "PostgreSQL",
                "Datadog",
                "Cloud automation deployment",
                "Networking concepts in cloud"
            ],
            "all": [
                "Microsoft SQL Server",
                "T-SQL programming",
                "Database Design",
                "SQL Statement Tuning",
                "Integration Services",
                "Reporting Services",
                "Analysis Services",
                "Always-On Availability Groups",
                "Cloud Database Services",
                "AWS",
                "Azure",
                "PowerShell",
                "Python",
                "Oracle",
                "MySQL",
                "PostgreSQL",
                "Datadog",
                "Cloud automation deployment",
                "Networking concepts in cloud"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Shekhar Das",
        "email": "shekhar@stellarconsulting.com",
        "jd": "From: Shekhar, Stellar Consulting !! shekhar@stellarconsulting.com Reply to: shekhar@stellarconsulting.com Job Title: SQL Data base AdministratorLocation: Chicago, IL or Atlanta, GA (Onsite from Day one)Duration: Long Term Responsibilities You are good at managing and operating Microsoft SQL Server database instances, optimizingconfiguration settings, performing database backups & restores, developing and running optimization tasks, composing automation scripts for repetitive tasks, etc.Experience with the most recent releases of SQL Server including the related products of Integration Services, Reporting Services, and Analysis Services. Perform research of viable technical and/or non-technical solutions Minimum Qualifications / Skills Bachelor's degree in computer or information sciences or similar field preferredExperience in managing SQL Server databases, T-SQL programming, knowledge of third form normalization design principals and indexing best practices. We would welcome experience inOracle and/or other DBMSs to help support RtB Preferred Qualifications/ Skills Solid MS SQL Server DBA experience (SQL 2012-2019Strong Database Design skillsExpertise in SQL Statement TuningExperience with native transactional Data ReplicationExperience in configuring Always-On Availability Groups (incl. Windows Clustering)Experience with deploying and managing Cloud Database Services (AWS/Azure preferred) like AWS DynamoDB, AWS RDS, Azure SQL, Azure Cosmos DBExperience with Cloud automation deployment (e.g., Terraform for SQL RDS)Good understanding of networking concepts in cloud (VPCs, Subnets, Security Groups, etc)Strong T-SQL Programming capabilitiesPowerShell and/ or Python scripting capabilitiesFamiliarity with Oracle Database technology (versions 11g, 12c, 18c, and 19c) a plusFamiliarity with Datadog as a monitoring and analytics toolFamiliarity with MySQL and PostgreSQL a plusMaintain database securityMaintain Server and DB AuditingExcellent troubleshooting and problem-solving abilities.",
        "source": "Email",
        "date_posted": "2024-10-16 07:59:32-05:00",
        "unique_id": "192958a0a0dbafb6",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "DB Admin"
    }
]