[
    {
        "company": "Nukasani Group",
        "job_title": "Business Analyst AT with PUBLIC TRUST CLEARANCE",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "2+ years",
            "degree_required": "Bachelor’s degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Best competitive rate"
        },
        "skills": {
            "core": [
                "requirements gathering",
                "business analysis",
                "communication with stakeholders"
            ],
            "primary": [
                "Agile",
                "Scrum methodology",
                "intake processes"
            ],
            "secondary": [
                "Master’s degree"
            ],
            "all": [
                "requirements gathering",
                "business analysis",
                "communication with stakeholders",
                "Agile",
                "Scrum methodology",
                "intake processes",
                "Master’s degree"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Bhavani",
        "email": "bhavaniATnukasanigroupusa.com",
        "jd": "Dear Partner,Good Morning ,GreetingsfromNukasanigroupInc!,Wehavebelowurgentlongtermcontractprojectimmediatelyavailable for Business Analyst AT, with PUBLIC TRUST CLEARANCE Remote need submissions you please review the below role, if you are available, could you please send me updated word resume, and below candidate submission format details, immediately. If you are not available, any referrals would be greatly appreciated.Interviews are in progress, urgent response is appreciated. Looking forward for your immediate response and working with you. Candidate Submission Format - needed from you Full Legal Name Personal Cell No ( Not google phone number) Email Id Skype Id Interview Availability Availability to start, if selected Current Location Open to Relocate Work Authorization Total Relevant Experience Education./ Year of graduation University Name, Location Last 4 digits of SSNCountry of Birth Contractor Type DOB: mm/dd Home Zip Code Assigned Job Details Job Title :Business Analyst AT with PUBLIC TRUST CLEARANCELocation: Remote Rate : Best competitive rate Are you looking for an opportunity to establish processes and support technology innovation? You know that true progress is made at the intersection of business and tech, and as an IT Business Analyst, you’ll develop your skills in both. Here, you’ll have the chance to work with an Agile team as they develop digital products to support your clients’ most pressing missions. We’re looking for someone like you to help propel business analytics and processes forward, as well as delve into technology trends to deliver user-friendly client experiences.As an IT Business Analyst, you’ll work to develop leading-edge applications, websites, and products. Working with your team of architects, developers, and testers, you’ll identify clients’ business needs, gather user requirements, and develop user stories. You’ll understand the overall direction and nuanced user needs clearly, and you’ll guide your team as they fulfill these needs by creating deployable features. Together, you’ll deliver high business-value products to end users. This position is open to remote delivery anywhere within the U.S., to include the District of Columbia. You Have: 2+ years of experience with requirements gathering and business analysis. Ability to directly and clearly communicate with stakeholders to develop specific requirements for enhancements and future features. Ability to work with the development team to ensure document deliveries. Ability to obtain and maintain a Public Trust or Suitability/Fitness determination based on client requirements. Bachelor’s degree Nice If You Have: Experience in an Agile environment Experience with Scrum methodology Knowledge of intake processes Master’s degree Thanks regards Bhavani |Technical recruitment| Nukasani Group |1001 E Chicago Ave, Unit B 111, Naperville IL 60540.Email: bhavaniATnukasanigroupusa.com People, Process, Technology Integrator. An E-Verified Company",
        "source": "Email",
        "date_posted": "2024-10-16 21:59:30-05:00",
        "unique_id": "192988b086105897",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]