[
    {
        "company": "Farm Bureau",
        "job_title": ".Net Developer- FAST Integration",
        "location": "West Des Moines, IA, USA",
        "full_location": {
            "city": "West Des Moines",
            "state": "IA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "6+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Must have existing work authorization",
            "notice_period": "Not specified",
            "duration": "Contract to Hire (6-12 month conversation timeline)",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".Net (C#)",
                "Webservice integrations",
                "SQL"
            ],
            "primary": [
                "Integration experience",
                "API expertise",
                "Production support",
                "Troubleshooting"
            ],
            "secondary": [
                "Java",
                "Web",
                "Mobile",
                "Reporting/Analytics",
                "Legacy",
                "Policy System experience",
                "Data-In/Data-Out integration"
            ],
            "all": [
                ".Net (C#)",
                "Webservice integrations",
                "SQL",
                "Integration experience",
                "API expertise",
                "Production support",
                "Troubleshooting",
                "Java",
                "Web",
                "Mobile",
                "Reporting/Analytics",
                "Legacy",
                "Policy System experience",
                "Data-In/Data-Out integration"
            ],
            "with_experience": [
                ".Net (C#)",
                "Webservice integrations",
                "SQL"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "sunil yadav",
        "email": "sunil.yadav@excelhirestaffing.com",
        "jd": "From: sunil yadav, Excel hire staffing sunil.yadav@excelhirestaffing.com Reply to: sunil.yadav@excelhirestaffing.com Farm Bureau.Net Developer- FAST IntegrationLocation: Hybrid- West Des Moines, IA (90 days onsite for training then hybrid) Visa: Contract to Hire (6-12 month conversation timeline)—MUST be able to convert to FTE without sponsorshipInterview: 1-2 Rounds (Locals must be willing to go onsite for interview) Submission Details Needed:- Proof of Address: Locals to Des Moines or to Iowa are priority as the manager chose two locals when he had this role open before. Documentation of current residency will need to be provided with candidate submissions- Candidate Visa Documents: Must be able to provide current documentation showing candidate can convert to FTE without sponsorship Manager Notes: (READ THESE CAREFULLY TO IDENTIFY STRONG CANDIDATE)\"They are looking for someone that has strong integration experience, part of a build team with Web Service integration and API’s expertise. FAST is a definite plus, but he isn’t really expecting to find that so having Policy System experience with strong data-In/data-out integration experience would work too. They will be doing production support, enhancements and troubleshooting.\" Job Description:6+ years of experience. Application Developer that translates application storyboards and use cases into functional FBL applications. Designs, builds, and maintains efficient, reusable, and reliable code. Ensures the best possible performance, quality, and responsiveness of FBL's applications. Identifies bottlenecks and bugs, and devises solutions to these problems. Helps maintain code quality, organization, and automatization. Proficient in applicable languages, with a good knowledge of appropriate ecosystems. Familiar with various design and architectural patterns. Has skills for writing reusable code libraries. Possesses knowledge of applicable patterns, concepts, frameworks, and services. Has knack for writing clean, readable code. Understands the fundamental design principles behind a scalable application. Understands the class loading mechanisms. Languages/development type may include, but not be limited to, Java, .Net, Web, Mobile, Reporting/Analytics, and legacy. Additional details: .Net (C#) experience required. Experience w/ designing, developing and supporting Webservice integrations. Strong SQL skills required. Knowledge/experience with integrations with the FAST (Life / Annuities) policy admin application a plus. Contractor duties (\"What you'll do\"): This resource will analyze, design, develop, administer, implement and support the FAST product and integration services. This resource will also maintain adequate documentation to support team processes and ensure work is completed following appropriate steps.",
        "source": "Email",
        "date_posted": "2024-10-16 12:48:55-05:00",
        "unique_id": "19296ea0acc65940",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]