[
    {
        "company": "Innozatech LLC",
        "job_title": "Oracle DBA",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Senior-level",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle",
                "PostgreSQL",
                "Database Architecture",
                "Database Security",
                "Performance Tuning"
            ],
            "primary": [
                "Database Installation",
                "Database Configuration",
                "Backup and Recovery",
                "Data Migration",
                "High Availability"
            ],
            "secondary": [
                "Red Hat Linux",
                "Automation",
                "Scripting",
                "ETL",
                "Compliance"
            ],
            "all": [
                "Oracle",
                "PostgreSQL",
                "Database Architecture",
                "Database Security",
                "Performance Tuning",
                "Database Installation",
                "Database Configuration",
                "Backup and Recovery",
                "Data Migration",
                "High Availability",
                "Red Hat Linux",
                "Automation",
                "Scripting",
                "ETL",
                "Compliance"
            ],
            "with_experience": [
                "Oracle (Senior-level)",
                "PostgreSQL (Senior-level)"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Irfan",
        "email": "irfan@innozatech.com",
        "jd": "From: Irfan, Innozatech LLC irfan@innozatech.com Reply to: irfan@innozatech.com We are looking for senior-level database administrator with advanced expertise in both Oracle and PostgreSQL, along with a deep understanding of database architectures, security principles, and performance tuning methodologies. The candidate should also have strong problem-solving skills, attention to detail, and the ability to work under pressure while managing multiple complex database systems. The candidate must also be willing to participate in a rotational 24x7 on-call Production Support. 1. Database Installation and Configuration · Install, configure, and maintain Oracle Multi-Tenant Architecture and PostgreSQL database servers. · Set up instances, database parameters, and schema objects. · Perform upgrades and patch management to ensure databases are up-to-date with the latest features and security patches. · Experience Red Hat Linux Operating Systems. 2. Database Architecture and Design · Collaborate with development teams to design and implement efficient, scalable database solutions. · Create database structures, including tables, views, indexes, and constraints. · Define data storage, indexing strategies, and partitioning schemes for optimal performance. 3. Database Performance Monitoring and Tuning · Monitor database performance and system resource utilization to ensure high availability. · Identify bottlenecks, analyze slow queries, and tune databases for optimal performance. · Utilize tools like Oracle AWR, PostgreSQL pg_stat_statements, and other performance analysis tools. · Implement performance improvements such as indexing, query optimization, and caching mechanisms. 4. Backup and Recovery · Implement and manage backup and disaster recovery strategies (e.g., RMAN for Oracle, pg_dump for PostgreSQL). · Ensure data integrity and availability through regular backups and replication. · Perform recovery tasks in the event of database corruption or failure. 5. Security Management · Configure and maintain database security, ensuring appropriate user permissions and roles are in place. · Encrypt sensitive data, ensure secure connections, and apply security best practices. · Monitor for potential security threats and resolve vulnerabilities in both Oracle and PostgreSQL environments. 6. Capacity Planning and Scalability · Analyze and forecast future database storage requirements. · Plan for scalability, ensuring the databases can handle increasing workloads and data growth. · Optimize database storage and processing capabilities, balancing performance with cost. 7. Data Migration and Integration · Perform data migrations between Oracle, PostgreSQL, and other databases. · Develop and manage ETL (Extract, Transform, Load) processes for data movement and transformation. · Ensure data consistency and integrity during migration and integration efforts. 8. High Availability and Clustering · Implement and manage high availability solutions such as Oracle Data Guard Replication, RAC and PostgreSQL streaming replication or clustering. · Configure failover mechanisms to minimize downtime in case of hardware or software failure. 9. Database Troubleshooting and Issue Resolution · Resolve database-related incidents such as connectivity issues, slow performance, and data corruption. · Provide technical support to development and operations teams for database-related problems. · Perform root cause analysis and implement preventive measures. 10. Automation and Scripting · Automate routine database administration tasks using scripts (e.g., Bash, PowerShell, PL/SQL for Oracle, PL/pgSQL for PostgreSQL). · Develop automation tools for monitoring, backups, and performance tuning. 11. Collaboration and Documentation · Work closely with development, DevOps, and infrastructure teams to support application and system requirements. · Document database configurations, processes, and procedures. · Provide training and mentoring to junior DBAs or development teams on database best practices. 12. Compliance and Auditing · Ensure databases comply with relevant regulatory standards (e.g., GDPR, SOX, HIPAA). · Regularly audit database security, usage, and access logs. · Manage and maintain database audit trails and security logs. 13. Innovation and Continuous Improvement · Stay current with new database technologies, tools, and techniques. · Propose and implement improvements to database systems, increasing efficiency, performance, and security.",
        "source": "Email",
        "date_posted": "2024-10-16 09:44:53-05:00",
        "unique_id": "1929616b9d3e1840",
        "emp_type": [
            "third party"
        ],
        "tag": "Oracle DBA"
    }
]