[
    {
        "company": "State of Indiana",
        "job_title": "Senior Project Manager",
        "location": "Indianapolis, IN, USA",
        "full_location": {
            "city": "Indianapolis",
            "state": "IN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "749280",
            "experience_required": "5 years",
            "degree_required": "Associate’s Degree or equivalent experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Agile",
                "Waterfall SDLC",
                "Budget Management",
                "Stakeholder Management"
            ],
            "primary": [
                "Relationship Management",
                "Resource Management",
                "Tactical Execution",
                "Policy Implementation",
                "Team Leadership"
            ],
            "secondary": [
                "Communication Skills",
                "Mentorship",
                "Attention to Detail",
                "Judgment",
                "Collaboration"
            ],
            "all": [
                "Project Management",
                "Agile",
                "Waterfall SDLC",
                "Budget Management",
                "Stakeholder Management",
                "Relationship Management",
                "Resource Management",
                "Tactical Execution",
                "Policy Implementation",
                "Team Leadership",
                "Communication Skills",
                "Mentorship",
                "Attention to Detail",
                "Judgment",
                "Collaboration"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Tarun Verma",
        "email": "tarun.v@wiseq.net",
        "jd": "From: TARUN Verma, WISE EQUATION SOLUTION INC tarun.v@wiseq.net Reply to: tarun.v@wiseq.net Title: IN-IOT Senior Project Manager (749280) Location : (Indiana Government Center North) 46204 - Hybrid- Locals OnlyDuration : Long Term ContractClient : State of IndianaInterview type: Webcam only Job Summary:Senior PM will support an enterprise-level Windows Server 2016 upgrade initiative. Job Description: General Responsibilities:• Responsible for relationship management, project planning, resource management, tactical execution, and the creation and / or oversight of final project deliverables• Collaborate with senior management, stakeholders, and the team to meet business objectives and provide professional leadership & mentorship fostering respect and trust to inspire others to pursue excellence.• Review, revise, and implement policies, practices, standards, and tools that support IOT project efforts• Work directly with senior managers and staff supporting all facets of IOT’s service delivery• Manage staff and teams, as neededJob Requirements:• 5 years Project management experience OR Associate’s Degree and four years of project management experience.• Certification as a Project Management Professional by the Project Management Institute or similar professional designation preferred.• Extensive experience overseeing multiple projects to successful conclusion• Experience with technology projects using various development methodologies, including agile and waterfall SDLCs• Ability to manage projects of relative high complexity and dollar value• Demonstrated capacity to maintain tact, diplomacy, and mindfulness in engagement with highly visible and highly demanding stakeholders at a variety of levels• Strong knowledge of, and documented experience with, exceptional delivery of products and services to a wide range of users, with an emphasis on (but not restricted to) successful delivery in one or more level of government• Ability to handle multiple high-visibility, high-priority initiatives effectively, independently, and under competing constraints• Exceptional professional presence, including the strong ability to communicate publicly to a variety of audiences• Develop, monitor, and maintain project plans• Ability to establish and manage project budget with the understanding of all financial implications/issues• Coordinate and monitor activities of all stakeholders to ensure timelines and budgets are met• Communicate project status to management and project stakeholders• Able to perform more varied and difficult tasks• Able to work in a collaborative team environment to obtain best results• Ability to delegate work, set clear direction, and manage workflow• Ability to effectively give feedback, provide guidance or corrective action, coach, and develop employee skillsetsWork is broad in scope requiring extensive judgment in adopting techniques to meet the information technology requirements, specifications, standards, and procedures of a complex enterprise-wide system. Work requires attention to detail and understanding of the impact that IT service delivery has across not only the Executive Branch, but also the State of Indiana broadly. As the backbone of the State’s IT operations, IOT’s efforts have a direct, critical role in facilitating government services from agencies to the citizenry. This position carries both high visibility and high expectations, requiring exceptional knowledge, and relationship building. The selected candidate will be counted upon to be an exceptional representative of IOT to stakeholders at all levels, at all times.",
        "source": "Email",
        "date_posted": "2024-10-16 12:29:47-05:00",
        "unique_id": "19296817657230ae",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]