[
    {
        "company": "STELLENT IT",
        "job_title": "IT Project Manager",
        "location": "Albany, NY, USA",
        "full_location": {
            "city": "Albany",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6 Months Contract to Hire",
            "rate": "Not specified"
        },
        "skills": {
            "core": [],
            "primary": [],
            "secondary": [],
            "all": []
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Akshit Sisonia",
        "email": "akshit@stellentit.com",
        "jd": "From: Akshit, Stellentit akshit@stellentit.com Reply to: akshit@stellentit.com Hi Hope you are doing well Job Title – IT Project ManagerLocation – Albany, NY (5 days a week onsite - Need local candidates)Duration : 6 Months Contract to HireNo H1b Job Description-The ideal candidate will be responsible for designing, implementing, managing, and evaluating IT projects across our organization. In order to do this successfully, this person should feel comfortable handling multiple tasks at a time. Day to Day:Looking for an IT Project Manager for a major Pharmaceutical client in Albany, NY. The New Technology Introduction Group for leading large scale issues and on-going projects across the GMP environment. This role will comprise of supporting full life cycle deployment within IT and identify areas for improvement, and ensuring all IT requirements are appropriately tracked. The team is looking for someone with a go-getter mentality and a solutions based thinking that can help drive the overall application development and infrastructure. Thanks & RegardsAkshit Sisonia - Sr. Technical RecruiterEmail- akshit@stellentit.com STELLENT IT – A Nationally Recognized Minority Certified Enterprise\"Happiness can be found, even in the darkest of times, if one only remembers to turn on the light.\" - JK Rowling",
        "source": "Email",
        "date_posted": "2024-10-16 09:42:13-05:00",
        "unique_id": "19295ed0902198ca",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]