[
    {
        "company": "Paramount Software Solutions",
        "job_title": "Applications Development Analyst (C. Advanced)",
        "location": "Tallahassee, FL, USA",
        "full_location": {
            "city": "Tallahassee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long-Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".NET",
                "C#",
                "ASP.NET",
                "SQL",
                "Blazor"
            ],
            "primary": [
                "MVC",
                "Web API",
                "DevOps",
                "Azure DevOps",
                "GitHub"
            ],
            "secondary": [
                "Data mapping",
                "Application architecture",
                "Data integration",
                "Data visualization",
                "Customer support"
            ],
            "all": [
                ".NET",
                "C#",
                "ASP.NET",
                "SQL",
                "Blazor",
                "MVC",
                "Web API",
                "DevOps",
                "Azure DevOps",
                "GitHub",
                "Data mapping",
                "Application architecture",
                "Data integration",
                "Data visualization",
                "Customer support"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Jitendra Singh",
        "email": "jitendra@paramountsoft.net",
        "jd": "From: Jitendra Singh, Paramount Software Solutions jitendra@paramountsoft.net Reply to: jitendra@paramountsoft.net Applications Development Analyst (C. Advanced)Tallahassee, FL (Onsite)Long-Term The activities these candidates will be tasked with include, but are not limited to the following:·Collaborate with business analysts, project managers, and stakeholders to understand the functional and non-functional requirements of the application.·Translate business requirements into architectural designs that align with business goals.·Design the overall system architecture, and define how different components of the interact.·Design, develop, and implement software applications using the .NET framework and C#.·Utilize ASP.NET (or ASP.NET Core) for web application development, including MVC, Web API, and·Blazor for client-side and server-side programming.·Develop and optimize SQL queries, stored procedures, and functions.·Develop user interfaces and ensure the front end is responsive, accessible, and user-friendly.·Review code, architecture, and design to ensure they meet the standards.·Analyze and optimize the performance of the application.·Design strategies for scaling the application efficiently as user demand grows.·Ensure the application adheres to security best practices and compliance requirements.·Implement DevOps practices such as continuous integration and continuous delivery·(CI/CD) via Azure DevOps and GitHub repositories. This position is to provide technical guidance and expertise in supporting the department in developing, architecting, and maintaining systems, apis, data mappings, and monitoring high-volume complex data integration processes. Minimum Required KSAs:·5+ years of experience in .NET/.NET core application development (recent experience preferred),·5+ years of experience in DDL, DML T-SQL skills, advanced stored procedure writing skills, tables, primary keys, foreign keys, constraints, indexes, transactions, process logging, and error handling.·3+ years of experience with application design, including Data mapping.·3+ years of experience in application architecture and data integration.·3+ years of analyzing and interpreting large datasets, including cleaning, transforming, and visualizing data.·3+ years of Experience in testing high-volume of complex data integration processes.·1+ years of Experience using Blazor·Familiarity with system catalog views, and Azure Cloud·Ability to provide excellent customer support; meticulous quality of work and work product.",
        "source": "Email",
        "date_posted": "2024-10-16 15:13:05-05:00",
        "unique_id": "1929716f77f4a253",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]