[
    {
        "company": "InfoTech Spectrum Inc.",
        "job_title": "Dot Net Developer",
        "location": "Montvale, NJ, USA",
        "full_location": {
            "city": "Montvale",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "7-8+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Angular",
                "C#",
                "Dot Net Core",
                "Python",
                "SQL",
                "NoSQL",
                "Azure Cloud"
            ],
            "primary": [
                "Entity Framework",
                "Dapper",
                "Agile",
                "Git"
            ],
            "secondary": [
                "Certification (AZ-900)",
                "Code first approach"
            ],
            "all": [
                "Angular",
                "C#",
                "Dot Net Core",
                "Python",
                "SQL",
                "NoSQL",
                "Azure Cloud",
                "Entity Framework",
                "Dapper",
                "Agile",
                "Git",
                "Certification (AZ-900)",
                "Code first approach"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Minu Roy",
        "email": "minu.roy@infotechspectrum.com",
        "jd": "Role:- Dot Net Developer\nLocation:- Montvale, NJ (Local Candidates only) (Hybrid role that will need to be located in Montvale, need to work in office up to 2 days a week)\nInterview Type:- onsite interview required (USC, GC only)\nJob Description:- Required experience:7-8+ year experience of the followings: Angular (15 or above) C#/Dot Net Core (6.0 or above) Python SQL/NoSQL App development, entity framework or dapper experience Code first approach Azure Cloud Certification (AZ-900) is a plus experience working in Agile based development experience in Git branching/Code commit process\nSummary: Coding, testing and debugging programs according to computer engineering specifications Modifying, expanding and updating applications Communicating with a team that includes analysts, engineers and quality assurance testers in order to coordinate and document application development and testing Developing software prototypes\nResponsibilities: Review and analyze business requirements and provide technical feasibility and estimates, as well as work closely with Tax business teams, clients, and various technology teams to ensure development of a quality product and a proven record of delivering business value. Take ownership and accountability of development process and the development team through the entire software lifecycle which includes Architecture, Design, Development, DevOps; perform moderately complex bug verification, release testing, and beta support for assigned products. Define and develop enterprise scale solutions leveraging programming technologies like Angular 14+, C#, Python, APIs with SQL/NoSQL as the database backend on the Microsoft Azure cloud. Design and development of solutions that integrate with vendor tools seamlessly utilizing APIs and other integrations using design patterns; prepare and review technical artifacts to help document technical architecture, design and deployment diagrams. Mentor software developers by reviewing written code and enforcing organizational development standards and coaches more junior colleagues in techniques, processes, and responsibilities.",
        "source": "Email",
        "date_posted": "2024-10-16 14:39:53-05:00",
        "unique_id": "19296f89044265ce",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]