[
    {
        "company": "Techgene Solutions, LLC",
        "job_title": "Senior Application DB2 Database Administrator",
        "location": "Charleston, WV, USA",
        "full_location": {
            "city": "Charleston",
            "state": "WV",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "5+ years",
            "degree_required": "Bachelor’s degree in Computer Science or a related field from an accredited institution, or a minimum of 5 years of equivalent work experience.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "DB2 database management",
                "SQL optimization",
                "disaster recovery procedures",
                "data modeling"
            ],
            "primary": [
                "database maintenance",
                "access control",
                "technical assistance",
                "collaboration"
            ],
            "secondary": [
                "communication skills",
                "cross-functional teamwork"
            ],
            "all": [
                "DB2 database management",
                "SQL optimization",
                "disaster recovery procedures",
                "data modeling",
                "database maintenance",
                "access control",
                "technical assistance",
                "collaboration",
                "communication skills",
                "cross-functional teamwork"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Jatin Keshav",
        "email": "jatin.k@techgene.com",
        "jd": "From: Jatin Keshav, Techgene Solutions LLC jatin.k@techgene.com Reply to: jatin.k@techgene.com Position: Senior Application DB2 Database AdministratorLocation- Charleston, West Virginia (Onsite)Duration- 12+ months ***Ideal candidate should be from West Virgnia, Ohio, Pennsylvania or Virginia*** Job Summary:We are looking for a highly experienced Senior Application DB2 Database Administrator responsible for the maintenance, management, and optimization of DB2 database systems. The ideal candidate will have significant expertise in database management, SQL optimization, and disaster recovery procedures, and will collaborate closely with technical teams to ensure the efficient operation of DB2 systems.Key Responsibilities:DB2 Database Maintenance & Management: Oversee the maintenance and management of DB2 databases, ensuring performance, availability, and security of the databases.Access Control: Manage permissions for DB2 databases, ensuring that only authorized personnel have access to sensitive data and database operations.Technical Assistance: Provide assistance to programming staff in debugging triggers, procedures, functions, and packages, ensuring seamless database functionality and integration.SQL Optimization: Optimize SQL execution for DB2 SQL procedures, functions, packages, and triggers to ensure high performance and efficiency.Data Modeling: Perform Data Modeling tasks, ensuring that the database structures align with business needs and system requirements.Disaster Recovery: Develop and implement disaster recovery procedures to ensure the quick recovery and restoration of database systems in the event of data loss or corruption. Experience Requirements:Minimum of 5 years of experience with DB2 database systems maintenance and management.5+ years of experience managing permissions in DB2 databases.5+ years of experience providing technical assistance for debugging database triggers, procedures, functions, and packages.5+ years of experience optimizing SQL execution for DB2 systems.5+ years of experience in Data Modeling for database systems.5+ years of experience in developing and performing disaster recovery procedures for DB2 databases. Educational Requirements:Bachelor’s degree in Computer Science or a related field from an accredited institution, or a minimum of 5 years of equivalent work experience. Skills and Competencies:Technical Proficiency: Deep understanding of DB2 database architecture and functionality, with proven experience in managing, optimizing, and securing DB2 systems.SQL Expertise: Strong skills in optimizing SQL execution and resolving performance bottlenecks in DB2 procedures, triggers, and functions.Communication Skills: Excellent verbal and written communication skills for interacting with stakeholders such as project managers, business analysts, database administrators, application analysts, and business policy staff.Collaboration: Ability to work effectively with cross-functional technical teams to meet project goals and business needs.",
        "source": "Email",
        "date_posted": "2024-10-16 18:03:33-05:00",
        "unique_id": "19297b307181452c",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "DB Admin"
    }
]