[
    {
        "company": "Vyze Inc",
        "job_title": "Non-IT Program/Project Manager",
        "location": "Owings Mills, MD, USA",
        "full_location": {
            "city": "Owings Mills",
            "state": "MD",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Bachelor's degree in business administration or a related field.",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "12+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Verbal and written communication skills",
                "Problem-solving skills",
                "Attention to detail",
                "Interpersonal skills",
                "Leadership and mentoring skills",
                "Knowledge of production processes",
                "Knowledge of business and management principles",
                "Knowledge of computer software"
            ],
            "primary": [
                "Strong ability to work independently",
                "Strong knowledge of quality control",
                "Strong knowledge of resource allocation",
                "Strong knowledge of production methods"
            ],
            "secondary": [],
            "all": [
                "Verbal and written communication skills",
                "Problem-solving skills",
                "Attention to detail",
                "Interpersonal skills",
                "Leadership and mentoring skills",
                "Knowledge of production processes",
                "Knowledge of business and management principles",
                "Knowledge of computer software",
                "Strong ability to work independently",
                "Strong knowledge of quality control",
                "Strong knowledge of resource allocation",
                "Strong knowledge of production methods"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Rohit Kumar Singh",
        "email": "rksingh@vyzeinc.com",
        "jd": "From: Rohit Kumar Singh, Vyze Inc rksingh@vyzeinc.com Reply to: rksingh@vyzeinc.com Hi,Hope you are doing well today! Myself Rohit Kumar Singh working as Technical recruiter at Vyze Inc. I have an exciting opportunity with one of our client. If interested send me your updated resume with contact details. Visa:-Location:-Job Description -Job Title: Non-IT Program/Project ManagerLocation: Owings Mills, MD Hybrid Duration: 12+ months Visa: USC/GC/GC EAD Summary:The main function of a non-IT project manager is to plan, direct, or coordinate activities in fields such as engineering, research and development, financial systems, product roll-out, etc., or any other non-IT based project.Job Responsibilities:- Coordinate projects, make detailed plans to accomplish goals, and direct the integration of technical activities.- Present and explain proposals, reports, and findings to clients.- Recruit employees, assign, direct, and evaluate their work, and oversee the development and maintenance of staff competence.- Analyze technology, resource needs, and market demand to plan and assess the feasibility of projects.- Confer with management, production, and marketing staff to discuss project specifications and procedures.- Review and recommend or approve contracts and cost estimates.- Direct, review, and approve product designs and changes.- Consult or negotiate with clients to prepare project specifications. Skills:- Verbal and written communication skills, problem-solving skills, attention to detail, and interpersonal skills.- Strong ability to work independently and manage one's time.- Strong leadership and mentoring skills necessary to provide support and constructive performance feedback.- Strong knowledge of production processes, quality control, costs, and other techniques for maximizing the effective manufacture and distribution of goods.- Strong knowledge of business and management principles involved in strategic planning, resource allocation, and production methods.- Strong knowledge of computer software, such as MS Word, MS PowerPoint, MS Project, Visio, etc. Education/Experience:- Bachelor's degree in business administration or a related field.- PMI or PMP certification preferred. Best RegardsRohit Kumar Singh",
        "source": "Email",
        "date_posted": "2024-10-16 11:23:03-05:00",
        "unique_id": "19296445d85585af",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]