[
    {
        "company": "Vyze",
        "job_title": "Technical Project Manager",
        "location": "Woodbury, MN, USA",
        "full_location": {
            "city": "Woodbury",
            "state": "MN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years of technology project management experience",
            "degree_required": "Bachelor’s degree in computer science/Information Technology, Business, or related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 months+",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Cybersecurity",
                "Vendor Management",
                "Communication",
                "Relationship Management"
            ],
            "primary": [
                "Technical Project Management",
                "Networking",
                "Firewalls",
                "Agile",
                "Waterfall",
                "Documentation",
                "Business Analysis",
                "Requirements Gathering"
            ],
            "secondary": [
                "PMP",
                "Prince 2",
                "Scrum Master",
                "Microsoft PowerPoint",
                "Visio",
                "Word",
                "Project",
                "Excel",
                "Service Now"
            ],
            "all": [
                "Project Management",
                "Cybersecurity",
                "Vendor Management",
                "Communication",
                "Relationship Management",
                "Technical Project Management",
                "Networking",
                "Firewalls",
                "Agile",
                "Waterfall",
                "Documentation",
                "Business Analysis",
                "Requirements Gathering",
                "PMP",
                "Prince 2",
                "Scrum Master",
                "Microsoft PowerPoint",
                "Visio",
                "Word",
                "Project",
                "Excel",
                "Service Now"
            ],
            "with_experience": [
                "Project Management",
                "Cybersecurity",
                "Vendor Management",
                "Technical Project Management",
                "Networking",
                "Firewalls"
            ]
        },
        "job_type": [
            "remote",
            "onsite"
        ],
        "contact_person": "Aditya Raghuvanshi",
        "email": "araghuvanshi@vyzeinc.com",
        "jd": "Job Description -Need local or nearby candidates with LinkedIn Must Have manufacturing Client Experinces Technical Project Manager- BackfillClient – NA6 months+Locations: -Remote but onsite on Wednesdays in Woodbury, MN but per the hiring manager, soon more on-site days will be mandatory for everyone.Skype Where have candidates missed the mark? Previous candidate has experience that translated really well; however he has a tough time asking for help and would get stuck. Additionally, he did not handle presentations to the C-level team well and that was the last straw for the client.Important Skills: This person will need to be a technical PM – about 75% of role is PM and 25% technical. Needs to understand basic networking, remote access, and someone who has had prior experience with Cyolo would be amazing -he didn’t think Cyolo would be very realistic because it is a fairly new technology. The PM who is going to be able to hit the ground running will have had prior experience working in a manufacturing environment. Certifications: PMP or Prince 2; Scrum Master a plus Position requires PM with experience managing Cybersecurity projects, vendor management skills, and excellent communication and relationship management skills. Previous experience with large scale deployment and migration of technology services across a large Enterprise. Ideally, Project Management experience leading the upgrade of firewalls - strong understanding/knowledge of firewalls. • 10+ years of technology project management experience • Proven skills in various Project Management methodologies such as Waterfall & Agile• Solid documentation skills related to business analysis and requirements gathering • Strong written and verbal communication skills with ability to relate complex information to both technical and non-technical audiences.• Proficiency with Microsoft PowerPoint, Visio, Word, Project Strong Excel, Service Now, or related applications. • • Confident and articulate self-starter, team player with a high level of commitment and enthusiasm. • Ability to work in a high-pressure environment while juggling multiple tasks. • Highly flexible with appropriate sense of urgency and commitment for critical deliverables.• Excellent attention to detail and organizational skills• Displays strong leadership skills, with a proven track record of leading projects at times of change• Bachelor’s degree in computer science/Information Technology, Business, or related field• Certification in project management such as PMP and Scrum Master",
        "source": "Email",
        "date_posted": "2024-10-16 13:05:36-05:00",
        "unique_id": "19296d9f327142fd",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]