[
    {
        "company": "Magicforce",
        "job_title": "Azure Data Solution Architect with OPEN Ai Exp",
        "location": "Raleigh, NC, USA",
        "full_location": {
            "city": "Raleigh",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "15+ years overall IT experience and 3+ years of relevant Microsoft Azure architecture, design & delivery experience",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Microsoft Azure architecture",
                "Logic App",
                "Function App",
                "Key Vault",
                "Azure ML",
                "Azure AI Search",
                "Azure Open AI"
            ],
            "primary": [
                "cloud architecture styles",
                "cloud migration approaches",
                "migration roadmaps"
            ],
            "secondary": [],
            "all": [
                "Microsoft Azure architecture",
                "Logic App",
                "Function App",
                "Key Vault",
                "Azure ML",
                "Azure AI Search",
                "Azure Open AI",
                "cloud architecture styles",
                "cloud migration approaches",
                "migration roadmaps"
            ]
        },
        "job_type": [],
        "contact_person": "Saikiran",
        "email": "saikiran@magicforce.us",
        "jd": "From: saikiran, Magicforce saikiran@magicforce.us Reply to: saikiran@magicforce.us Hi Greetings from Magic force!!! My name is Saikiran we have a job opportunity for you as a Azure Data Solution Architect with OPEN Ai Exp of our client based at Raleigh, NC please find the Job description below, if you are available and interested, please send us your word copy of your resume with following detail to saikiran@magicforce.us Job Title: Azure Data Solution Architect with OPEN Ai ExpLocation: Raleigh, NC Duration: 12+ monthsStart Date: ASAP Roles and Responsibilities:15+ years overall IT experience and 3+ years of relevant Microsoft Azure architecture, design & delivery experienceConsulting experience with large-scale implementations on Microsoft AzureExperience in Logic App, Function App, Key Vault, AD groups, Azure ML, Azure AI Search, Azure Open AIExperience in Creating solutions, presenting and articulating winning prepositions for Microsoft AzureWell versed with cloud architecture styles and design patternsExperience in developing cloud migration approaches, defining migration roadmaps and providing estimates If you are interested in this position, kindly fill the details and revert back to me ASAP. Requirement id / Title Full Name Work Authorization and validity Present location Passport Number Contact Number E-mail Address SSN Number Last 4 digits DOB LinkedIn ID Currently on the project (Yes / No) Availability to join the project Availability for onsite / remote Overall, USA IT experience Overall relevant IT experience Bill rate Year of arrival in USA and the employer’s name Is the USA working experience mentioned in the resume, correct? Highest degree and passing year Is the candidate submitted for the same client earlier? Thanks, and Regards: SaikiranTechnical Recruitersaikiran@magicforce.us",
        "source": "Email",
        "date_posted": "2024-10-16 11:14:40-05:00",
        "unique_id": "192963cb033ef473",
        "emp_type": [
            "third party"
        ],
        "tag": "Azure Data Engineer"
    }
]