[
    {
        "company": "State of VA",
        "job_title": "CoE Program Manager",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "20 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Agile",
                "Waterfall",
                "SAFe",
                "Kanban",
                "Microsoft Project On-Line"
            ],
            "primary": [
                "Leadership",
                "Communication",
                "Risk Management",
                "Change Management",
                "Training Development",
                "Knowledge Management"
            ],
            "secondary": [
                "Microsoft Office",
                "SharePoint",
                "Microsoft Teams",
                "Microsoft Planner",
                "Power BI",
                "Business Process Improvement"
            ],
            "all": [
                "Project Management",
                "Agile",
                "Waterfall",
                "SAFe",
                "Kanban",
                "Microsoft Project On-Line",
                "Leadership",
                "Communication",
                "Risk Management",
                "Change Management",
                "Training Development",
                "Knowledge Management",
                "Microsoft Office",
                "SharePoint",
                "Microsoft Teams",
                "Microsoft Planner",
                "Power BI",
                "Business Process Improvement"
            ]
        },
        "job_type": [
            "onsite",
            "remote"
        ],
        "contact_person": "Chandan singh",
        "email": "csingh@vyzeinc.com",
        "jd": "From: Chandan singh, Vyzeinc csingh@vyzeinc.com Reply to: csingh@vyzeinc.com Hi,Hope you are doing well.Please find below position if you haveany matching candidate as per requirement.Please send me updated resume with candidate information. For vendor emailingJob Description -Tittle: CoE Program ManagerMOI: Skype Visa: No H1B & CPT Client: State of VA **Local Richmond, VA candidates required due to onsite requirement**This position requires onsite 3 days a week with 2 remote**Contractor will be responsible for purchasing parking through VDOT’s Parking Management Office or procuring their own parkingVDOT is seeking a senior, experienced Center of Excellence Program Manager to join the Project & Product Delivery Center of Excellence Team. This position is located in Richmond, Virginia.This position will lead strategic direction for assigned program area. Candidate will lead and manage the CoE team. Candidate will provide guidance to project teams using Waterfall, Agile, SAFe, and Kanban methodologies. This includes working with other Program Managers, Project Managers, Scrum Masters, and Release Train Engineers (RTEs) to ensure they comply with VDOT and VITA procedures. This position’s specific responsibilities and duties will include, but are not limited to:Oversee initiatives for the assigned program.Oversee work in assigned program to ensure consistent process and quality standards.Assign resources to complete deliverables.Assign resources to support processes.Recommend changes to systems/processes as appropriate.Compliance with VDOT and VITA policies, standards, and guidelines.Work with peers and subordinates to define strategic direction for assigned program.Identify gaps, trends, patterns and implement process improvements as neededBe an expert in VDOT and VITA project management procedures and requirements.Be an expert in the use of the division core project management tool, Microsoft Project On-Line (POL).Assist in developing training objectives and needs on VDOT and VITA project management procedures and best practices.Develop project management processes, tools, templates, and training, drawing on common project management methodology, the PMBOK and established VDOT and VITA methodologies.Establish and maintain Agile Project Management, Scaled, Kanban and Waterfall Project Management frameworks and their supporting practices Create new and enhanced procedures to capture best practices and mature the project management process.Manage the knowledgebase of project management reference materials to ensure accuracy, relevancy and currency.Monitor projects for compliance with established policies and procedures.Monitor projects to detect risks and issues and escalate as needed to ensure appropriate mitigation is applied to keep the project on-track.Guide project managers in identifying and managing risks.Guide project managers in managing organizational change.Guide project managers in defining critical path and managing schedule.Guide project managers in managing budget. Minimum Qualifications10 years' experience leading and managing direct reports. Set direction and strategy for the assigned teamAbility to interact effectively with customers and project team members.Knowledge of project management tools, methods and practices.Ability to communicate effectively orally and in writing.Ability to program and create custom reports using IT application standard tools.PMP certificationVITA Project Manager Certification (can be obtained within 120 days of hire) is a plus but not required.Advanced skills using Microsoft Project Professional.15 years of combined experience with scrum, Agile, SAFe, Product Line and Waterfall methodologies.15 years experience managing complex projects with multiple workstreams and high organizational change.Must be able to quickly and easily adapt to changing priorities, embracing changes to deliver leadership and guidance.Experience creating and managing knowledge bases, job aids and training programs.Strong functional understanding of MS Project, Project Server, SharePoint, Microsoft Teams, Microsoft Planner and Power BIAbility to assess project risks and issues, and determine mitigation required to contain or resolve them. Demonstrated understanding of project portfolio and lifecycle management processes Demonstrated understanding of governance processes, procedures and policies for project management.Demonstrated understanding of organizational change.Demonstrated understanding of how to manage the project critical path.Demonstrated strong facilitation and collaboration skills.Demonstrated skills in developing new processes that incorporate best practices and address stakeholder needs.Demonstrated ability to create clear and concise written procedural documentation. Demonstrated understanding of procurement and vendor managementAbility to articulate thoughts and ideas in support of initiatives that are being newly developed. Ideal candidates would be self-starters who can articulate thoughts and ideas in support of initiatives that are being newly developed**Skill Required / Desired Amount of Experience Experience managing and leading direct reports: Required: 10 YearsExperience managing and providing guidance to project teams: Required: 10 YearsProject Management experience: Required: 20 YearsExperience providing training to project managers and project teams: Required: 10 YearsMicrosoft Office products (Word, Excel, Access, Outlook, Visio, PowerPoint, Project Server), Microsoft Project/POL experience: Required: 10 YearsExperience working in a PMO office: Required: 15 YearsExperience working in a remote and local team environment: Required: 5 YearsExperience reporting metrics: Required: 8 YearsBusiness process improvement experience: Required: 5 YearsExperience managing complex projects with multiple workstreams and high organizational change: Required: 15 YearsRegards, Chandan singh Email: csingh@vyzeinc.com",
        "source": "Email",
        "date_posted": "2024-10-16 08:33:21-05:00",
        "unique_id": "19295ac8ac095890",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]