[
    {
        "company": "Stellent IT",
        "job_title": "Technical Network Project Manager",
        "location": "Orange, CT, USA",
        "full_location": {
            "city": "Orange",
            "state": "CT",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Minimum of 7 years of experience in network engineering and project management",
            "degree_required": "Bachelor’s degree in computer science, Information Technology, or a related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "network engineering",
                "project management",
                "KPI analysis",
                "client relationship management",
                "team management"
            ],
            "primary": [
                "firewalls: Checkpoint, Palo Alto, Cisco ASA, Firepower",
                "routing protocols: MPLS, BGP4, EIGRP",
                "cloud platforms: AWS, Azure",
                "Cisco (LAN/WAN/WLAN)",
                "Fortinet (WAN, SDWAN)",
                "Infoblox (DHCP, IPAM, DNS)"
            ],
            "secondary": [
                "Zscaler",
                "Akamai",
                "CCNP Certification",
                "load balancers",
                "NTP",
                "remote networking",
                "Wi-Fi",
                "DNS/DHCP",
                "datacenter networking",
                "WAN optimizers",
                "VPNs",
                "proxies",
                "Networking Management Systems: Prime Infrastructure & Catalyst Centre & BMC Entuity",
                "NetScout",
                "RedHat Ansible Tower"
            ],
            "all": [
                "network engineering",
                "project management",
                "KPI analysis",
                "client relationship management",
                "team management",
                "firewalls: Checkpoint, Palo Alto, Cisco ASA, Firepower",
                "routing protocols: MPLS, BGP4, EIGRP",
                "cloud platforms: AWS, Azure",
                "Cisco (LAN/WAN/WLAN)",
                "Fortinet (WAN, SDWAN)",
                "Infoblox (DHCP, IPAM, DNS)",
                "Zscaler",
                "Akamai",
                "CCNP Certification",
                "load balancers",
                "NTP",
                "remote networking",
                "Wi-Fi",
                "DNS/DHCP",
                "datacenter networking",
                "WAN optimizers",
                "VPNs",
                "proxies",
                "Networking Management Systems: Prime Infrastructure & Catalyst Centre & BMC Entuity",
                "NetScout",
                "RedHat Ansible Tower"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Priyanka",
        "email": "priyanka@stellentit.com",
        "jd": "From: priyanka, Stellent IT priyanka@stellentit.com Reply to: priyanka@stellentit.com Technical Network Project ManagerOrange, CT (Onsite/Only local or nearby)VISA: ANYPosition OverviewWe are seeking a highly skilled and experienced Technical Network Project Manager with a robust technical background in network engineering. The ideal candidate will possess a blend of technical expertise and project management skills to lead and coordinate network-related projects effectively. This role involves managing daily operations, ensuring service delivery, analyzing key performance indicators, and maintaining strong client relationships.Key ResponsibilitiesOn-Call and Scheduling: Organize on-call rotations and scheduled jobs, ensuring adequate staffing during holidays and adherence to company policies, especially concerning “work in-place”.Daily Work Management: Establish daily priorities, assign tasks as needed, and work collaboratively with the team. Ensure a fair distribution of work, prompt triage of incidents, and management of the shared mailbox.Tool and Procedure Access: Ensure all team members have access to the necessary tools and procedures to perform their tasks effectively.Assign tasks and develop procedural documentation.Reporting: Compile and ensure the delivery of monthly service and project hours reports. Deliver postmortem reports for major incidents requiring L3 intervention.KPI Analysis: Track and analyze key performance indicators, report findings, and suggest improvements. Monitor the Configuration Management Database (CMDB) for changes affecting the group.Liaison and Meetings: Serve as the primary contact for L3 incidents and tasks, manage service queues (including Net Sec and VoIP), and foster strong client relationships. Attend weekly and daily control meetings as required.Remote Coordination: Offer remote coordination and Level 2 technical support coordination for Iberdrola Mexico.Training and Well-Being: Identify and communicate training needs to the L3 and Vodafone teams. Monitor the team’s well-being and report concerns to Vodafone when necessary. Preferred / Optional Technical SkillsExperience with firewalls: Checkpoint, Palo Alto, Cisco ASA, Firepower, and familiarity with NERC/CIP environments and Bluecoat ProxyKnowledge of Zscaler and AkamaiCCNP CertificationProficiency in routing protocols: MPLS, BGP4, EIGRPExperience with cloud platforms: AWS and AzureUnderstanding of load balancers, NTP, remote networking, Wi-Fi, DNS/DHCP, datacenter networking, WAN optimizers, VPNs, and proxiesFamiliarity with Cisco (LAN/WAN/WLAN), Fortinet (WAN, SDWAN), and Infoblox (DHCP, IPAM, DNS)Experience with Networking Management Systems:Prime Infrastructure & Catalyst Centre & BMC Entuity (Corporate NMS)NetScout (under implementation) & RedHat Ansible TowerRequired Project Management SkillsSkilled in leading effective, goal-focused meetings with well-documented key insights and action items.Proficient in overseeing technical teams within a fast-paced, matrix-based organizational structure.Experienced in handling high-maintenance clients and adept at conflict resolution.Willing to work weekends and participate in global meetings beyond standard U.S. business hours.QualificationsBachelor’s degree in computer science, Information Technology, or a related fieldMinimum of 7 years of experience in network engineering and project managementUSC / GC preferredExperience leading project teams including Network Engineers and other technical resourcesStrong leadership and team management skillsExcellent analytical and problem-solving abilitiesEffective communication and interpersonal skillsAbility to work in a fast-paced, dynamic environment",
        "source": "Email",
        "date_posted": "2024-10-16 15:19:19-05:00",
        "unique_id": "192971cad3e87899",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]