[
    {
        "company": "CVS",
        "job_title": "QA Data Analyst",
        "location": "Woonsocket, RI, USA",
        "full_location": {
            "city": "Woonsocket",
            "state": "RI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Proven experience as a QA Analyst or in a similar role, particularly in cloud migration projects.",
            "degree_required": "Bachelor’s degree in Computer Science, Information Technology, or related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ Months (with potential to convert after 6 months)",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SQL",
                "Excel"
            ],
            "primary": [
                "test data management",
                "data analysis",
                "cloud-based solutions",
                "Google Cloud Platform"
            ],
            "secondary": [
                "Python",
                "communication",
                "scheduler platforms"
            ],
            "all": [
                "SQL",
                "Excel",
                "test data management",
                "data analysis",
                "cloud-based solutions",
                "Google Cloud Platform",
                "Python",
                "communication",
                "scheduler platforms"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Yash Tiwari",
        "email": "yash.tiwari@infotechspectrum.com",
        "jd": "Hello My name is Yash Tiwari, and I am a Staffing Specialist at Infotech Spectrum. I am reaching out to you on an exciting job opportunity with one of our clients. Title: QA/Data Analyst Location: 1 CVS Drive , Woonsocket, RI 02895 Team: Analytics & Behavioral Changes - RX Data Warehouse Why Open: - Assist with GCP Data Migration Start: ASAP Duration: 6+ Months (with potential to convert after 6 months) Interview Process: 1 Round Pannel – Live SQL Coding Job Summary: CVS is seeking a detail-oriented QA Analyst with expertise in SQL programming, Excel, and test data management to support our GCP migration project. The ideal candidate will have a strong background in quality assurance processes, data analysis, and cloud-based solutions, ensuring the accuracy and performance of our applications during and after migration. Key Responsibilities: 1. Develop and execute comprehensive test plans, test cases, and test scripts for applications being migrated to Google Cloud Platform (GCP). 2. Utilize SQL to validate and verify data integrity, model correctness, and system functionality post-migration. 3. Collaborate with development teams to identify and resolve defects and issues related to data migration and application performance. 4. Maintain and manage test data in Excel, including creating, updating, and documenting datasets required for testing. 5. Perform regression, functional, and performance testing to ensure applications operate seamlessly after migration. 6. Document testing results, anomalies, and defects; provide detailed reports and insights to stakeholders. 7. Work closely with project managers, business analysts, and other stakeholders to understand requirements and deliver quality assurance across the project lifecycle. 8. Participate in code reviews and quality assessments to enhance software quality. 9. Stay updated with industry best practices and emerging trends in QA methodologies and cloud technologies. Qualifications: 1. Bachelor’s degree in Computer Science, Information Technology, or related field.2. Proven experience as a QA Analyst or in a similar role, particularly in cloud migration projects.3. Strong proficiency in SQL for data validation, querying, and analytics.4. Advanced knowledge of Excel for data manipulation, reporting, and analysis.5. Familiarity with Google Cloud Platform and its services (e.g., BigQuery, Cloud Storage) is preferred.6. Solid understanding of software testing methodologies and best practices.7. Excellent analytical, problem-solving, and communication skills.8. Ability to work independently and collaboratively in a fast-paced environment. Must Have: • SQL - Ability to code - Ability to test code - Ability to understand code - Ability to speak on code • Excel • Scheduler platforms • Communication • Python – is a plus!",
        "source": "Email",
        "date_posted": "2024-10-16 14:13:38-05:00",
        "unique_id": "19296e086f4b770c",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "GCP Data Engineer"
    }
]