[
    {
        "company": "Sonitalent Corp",
        "job_title": "Senior Business Process Consultant",
        "location": "Washington, DC, USA",
        "full_location": {
            "city": "Washington",
            "state": "DC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "3+ years",
            "degree_required": "Bachelor's degree in finance, accounting, business administration, economics, engineering, mathematics, statistics or a related technical or quantitative field",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Excel",
                "SQL",
                "Tableau",
                "Process Mapping"
            ],
            "primary": [
                "Data Analysis",
                "Business Process Mapping",
                "Stakeholder Engagement",
                "Requirement Gathering",
                "Business Process Engineering"
            ],
            "secondary": [
                "Analytical Thinking",
                "Problem-solving",
                "Communication Skills",
                "Customer Outreach",
                "Programming Language",
                "Automated Testing Tools"
            ],
            "all": [
                "Excel",
                "SQL",
                "Tableau",
                "Process Mapping",
                "Data Analysis",
                "Business Process Mapping",
                "Stakeholder Engagement",
                "Requirement Gathering",
                "Business Process Engineering",
                "Analytical Thinking",
                "Problem-solving",
                "Communication Skills",
                "Customer Outreach",
                "Programming Language",
                "Automated Testing Tools"
            ],
            "with_experience": [
                "Excel (3+ years)",
                "SQL (3+ years)",
                "Tableau (3+ years)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Akash Kumar",
        "email": "akash.kumar@sonitalentcorp.com",
        "jd": "From: Akash Kumar, Sonitalent Corp akash.kumar@sonitalentcorp.com Reply to: akash.kumar@sonitalentcorp.com HiHope you are doing well,We are looking for “Senior Business Process Consultant”. Please let me know if you are looking for this role and send me your updated resume also. Job Title: Senior Business Process Consultant Location: ONSITE - Candidate MUST be local to the DC Duration: 6+ monthsInterview: Phone/ Skype-2RoundsVisa: NoH1B, CPT &OPTLinkedIn Must haveJob Description: Candidate must complete/return the skill matrix below. Key Responsibilities… Stakeholder Engagement: Work closely with program teams to ensure alignment between business goals and system functionalities. Requirement Gathering: Collaborate with stakeholders to understand business needs and document technical and functional requirements that align with DLCP’s goals. Process Analysis and Improvement: Evaluate existing business processes, gather and analyze data, and recommend improvements that drive efficiency and reduce operational risks. Business Process Mapping: Develop detailed workflow charts, diagrams, and process documentation to visualize business operations and identify areas for re-engineering. Business Process Engineering/Re-Engineering: Work closely with IT and Data Teams to visualize DLCP’s Business Architecture and implementing Data Driven organization Data Analysis and Reporting: Use tools like Tableau, SQL, and Excel to analyze operational data, create 1 Use or disclosure of this data is subject to the restrictions on the title page of this proposal or quotation. CDSLLC reports, and identify trends that inform decision-making. Testing and Validation: Assist in validating new processes and systems through testing and user acceptance reviews, ensuring they meet business and functional requirements. Customer Outreach: Assist in developing and designing Customer outreach programs that promote DLCP’s goals and increase customer engagement Solicit the team for reporting needs, areas of opportunity, dashboard requests, and cost reduction opportunities. Consult on the analysis of an application, troubleshoots system problems, and recommend solutions. Basic Qualifications… Education: Bachelor's degree in finance, accounting, business administration, economics, engineering, mathematics, statistics or a related technical or quantitative field Experience: 3+ years of business analyst, data analyst or similar role experience preferably in government or regulatory environment Technical Skills: 3+ years of Excel (including VBA, pivot tables, array functions, power pivots, etc.). Proficiency in SQL and process mapping software (e.g., Visio, Miro, Draw.io etc), and data visualization tools such as Tableau, Seaborn etc. Experience with any programming language and automated testing tools is a plus. Soft Skills: Strong analytical thinking, problem-solving abilities, excellent communication skills, and the ability to work cross-functionally with teams. MINIMUM EDUCATION/CERTIFICATION REQUIREMENTS: Bachelor’s degree in finance, accounting, business administration, economics, engineering, mathematics, statistics, or related field or equivalent experience CLIENT REQUIREMENTSItemSkillsRequired orYears ofCandidate's Years of Exp.DesiredExperience1Bachelor's degree in IT, finance, business administration, economics, engineering, related field or equivalent experienceRequired15 211-15 yrs. Business process re-engineering experienceRequired11 3Navigate Ambiguity and Competing priorities - Managing tasks effectively in uncertain and fast-paced environmentsRequired11 4Business process reengineering and identifying new applications of technology to business problems to make business more effective.Required11 5Write detailed descriptions of user needs, program functions, and steps required to develop or modify programs.Required10 6Use tools like Tableau, SQL, and Excel to analyze operational data, create reports, and identify trends that inform decision-making.Required8 7Solicit the team for reporting needs, areas of opportunity, dashboard requests, and cost reduction opportunities.Highly Desired10 8Assist in validating new processes and systems through testing and user acceptance reviews, ensuring they meet business and functional requirements.Highly Desired10 9Consult on the analysis of an application, troubleshoots system problems, and recommend solutionsHighly Desired8 10Assist in developing and designing Customer outreach programs that promote DLCP’s goals and increase customer engagementDesired10 11Analytical Thinking and Communication - Ability to analyze complex data, extract insights, and communicate findings to stakeholdersDesired11 12Working with IT and Data Teams to analyze business architecture and implement data within the organization.Desired8 Thanks & Regards--Akash KumarTechnical Recruiter, Sonitalent CorpDirect:8596593266 || https://www.linkedin.com/in/akash-kumar-151a8025a/akash.kumar@sonitalentcorp.comWebsite: https://www.sonitalentcorp.com/5404 Merribrook Lane, Prospect, KY, USA.",
        "source": "Email",
        "date_posted": "2024-10-16 09:32:46-05:00",
        "unique_id": "19295e46ffd7cf90",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]