[
    {
        "company": "teamware solutions",
        "job_title": "Senior Database Admin",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "12+ years",
            "degree_required": "Bachelor’s degree in Computer Science, Information Technology, or related field (or equivalent experience)",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$60/hr on C2C"
        },
        "skills": {
            "core": [
                "MS SQL Database Management",
                "Oracle Database Management",
                "Database High Availability",
                "Database Security",
                "Database Performance Tuning",
                "Database Backup and Recovery",
                "Database Monitoring and Alerts",
                "Database Patching and Upgrades",
                "Database Automation and Scripting",
                "Database Documentation"
            ],
            "primary": [
                "Microsoft SQL Server architecture",
                "Oracle database architecture",
                "Database high availability solutions",
                "Database security best practices",
                "SQL and PL/SQL scripting",
                "Database clustering and load balancing"
            ],
            "secondary": [
                "Analytical skills",
                "Problem-solving ability",
                "Communication skills",
                "Leadership abilities",
                "Database migrations",
                "Database consolidations",
                "Performance enhancements"
            ],
            "all": [
                "MS SQL Database Management",
                "Oracle Database Management",
                "Database High Availability",
                "Database Security",
                "Database Performance Tuning",
                "Database Backup and Recovery",
                "Database Monitoring and Alerts",
                "Database Patching and Upgrades",
                "Database Automation and Scripting",
                "Database Documentation",
                "Microsoft SQL Server architecture",
                "Oracle database architecture",
                "Database high availability solutions",
                "Database security best practices",
                "SQL and PL/SQL scripting",
                "Database clustering and load balancing",
                "Analytical skills",
                "Problem-solving ability",
                "Communication skills",
                "Leadership abilities",
                "Database migrations",
                "Database consolidations",
                "Performance enhancements"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Archana Kamaraj",
        "email": "archana.kamaraj@twsol.com",
        "jd": "Hello All, Kindly share the resume Role : MS SQL database admin Location : Remote 12+ years - $60/hr on C2C Job Description : Responsibilities Candidate will be using MS SQL Database Management. Candidate will plan, install, configure, and upgrade Microsoft SQL Server instances and databases. Candidate have to monitor database performance, resource usage, and implement optimizations for better efficiency. Candidate have to use Oracle Database Management: Candidate will possess in-depth knowledge of Oracle database architecture, installation, and administration. Candidate will manage Oracle databases, including installation, configuration, and performance tuning. Candidate will be responsible for Database High Availability and Disaster Recovery: Candidate have to implement and support database high availability solutions, such as SQL Server always on Oracle Data Guard, or similar technologies. Candidate have to develop and test disaster recovery strategies to ensure data availability and business continuity. Candidate will be responsible for Database Security. Candidate have to enforce security measures, access controls, and encryption to protect sensitive data. Candidate will perform periodic security audits and vulnerability assessments. Candidate will be responsible for Database Performance Tuning: Candidate will identify and resolve complex performance bottlenecks, slow queries, and resource contention issues in SQL Server and Oracle databases. Candidate will optimize database configurations and SQL queries for optimal performance. Candidate will be responsible for Database Backup and Recovery. Candidate will develop and maintain comprehensive backup and recovery strategies for SQL Server and Oracle databases. Candidate will perform regular backups and test recovery procedures to ensure data recoverability. Candidate will be responsible for Database Monitoring and Alerts Candidate will set up proactive monitoring and alerting for database health and performance issues. Candidate will respond to alerts and incidents promptly to minimize service disruptions. Candidate will be responsible for Database Patching and Upgrades. Candidate will plan and execute SQL Server and Oracle database patching and version upgrades following best practices. Candidate will be responsible for Database Automation and Scripting. Candidate will develop and maintain automation scripts and workflows to streamline routine database management tasks. Candidate will be responsible for Database Documentation. Candidate will create and maintain detailed documentation of database configurations, procedures, and troubleshooting steps. The Role Offers Candidate will be able to learn fast about new technologies and tools. Work independently contributing to the success of assigned project(s). Candidate will able to participate in discussions with project teams to understand the application design, build process and help deploy applications in target environments. The role gives an opportunity to showcase candidates’ strong analytical skills and problem-solving ability. The role offers to lead efforts to diagnose and resolve complex database-related issues. Candidate will be able to collaborate with level 1 and level 2 support and other teams to address escalated incidents The role offers to lead database-related projects, such as database migrations, consolidations, and performance enhancements Essential Skills Candidate must have proven experience as a level 3 MS SQL Database Administrator with advanced knowledge of Oracle databases. Candidate must have in-depth understanding of Microsoft SQL Server architecture, configuration, and performance tuning. Candidate should have strong proficiency in Oracle database architecture, installation, configuration, and administration. Candidate must have expertise in database high availability solutions for both SQL Server and Oracle databases. Candidate must have familiarity with database security, backup, and recovery best practices. Candidate must have proficiency in SQL and PL/SQL scripting and automation for routine tasks. Candidate should have experience with database clustering and load balancing technologies is advantageous. Candidate must have strong problem-solving and analytical skills to diagnose and resolve complex database issues. Candidate must have excellent communication and leadership abilities to guide junior team members and collaborate with cross-functional teams. Oracle or Microsoft SQL Server certifications (e.g., Oracle Database Administrator Certified Professional, Microsoft Certified Solutions Expert) are preferred. Essential Qualification. Bachelor’s degree in Computer Science, Information Technology, or related field (or equivalent experience).",
        "source": "Email",
        "date_posted": "2024-10-16 13:56:53-05:00",
        "unique_id": "19296d1347e4ca98",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "DB Admin"
    }
]