[
    {
        "company": "CAI/VDOT",
        "job_title": "ERP Developer",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "14 Years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12–24-month contract with rolling extensions",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "C#",
                ".NET",
                "SQL Server"
            ],
            "primary": [
                "Angular",
                "Blazor",
                "Web API",
                "CSS3",
                "HTML5",
                "TFS",
                "JQuery"
            ],
            "secondary": [
                "Automated Builds using Microsoft Team Foundation",
                "Agile SDLC best practices"
            ],
            "all": [
                "C#",
                ".NET",
                "SQL Server",
                "Angular",
                "Blazor",
                "Web API",
                "CSS3",
                "HTML5",
                "TFS",
                "JQuery",
                "Automated Builds using Microsoft Team Foundation",
                "Agile SDLC best practices"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Navya Gupta",
        "email": "navya@stellentit.com",
        "jd": "From: navya gupta, Stellentit navya@stellentit.com Reply to: navya@stellentit.com Hello, I hope you are doing well! Kindly acknowledge me, are you Comfortable with this Position then please share me your updated resume. Position Title: ERP Developer Client: CAI/VDOT Location: 1401 E Broad St, Richmond, VA (VDOT Central Office) Position Status: 12–24-month contract with rolling extensions Schedule: HYBRID Contract Overview: Our client CAI/VDOT is looking for an ERP Developer for a HYBRID position based out of Richmond, VA. TOP MUST HAVES:**Mgr requests vendors ONLY submit candidates who already live in Richmond, VA.**ALL interviews ONSITE.**Assignment to be extended, possibly 24 months.**Contractor will be responsible for purchasing parking through VDOT’s Parking Management Office or procuring their own parking. C# .NET development experience. Strong database development experience using SQL Server. Experience with Source Control using TFS. Angular or Blazor experience. Responsibilities: VDOT-AMD is seeking a Developer with 14 yrs or more .Net Web application development. Experience and fluency with C#, Angular or Blazor, SQL Server, JQuery, CSS3 and HTML5 experience. VDOT is seeking a Full Stack Senior ERP Developer/Programmer with .Net Applications Development experience who will be responsible for managing, programming, testing, debugging and analyzing complex software requirements to design and develop high quality components using the .NET Core framework. The ERP Developer will be programming the current budget and spend plan tool that is used agency wide for financial and budget management for the Maintenance Program. The Senior Developer is expected to program using best practices, prioritize programming work effectively and write system documentation as required. The successful candidate should have strong programming and communication skills to be effective in both technical and business requirement discussions. Ability to develop, program and code in .NET Core environment applications and backend services using C#, Web API, Java Script, JQuery, Angular or Blazor and CSS. Design, develop and program using appropriate software design patterns to attain high reusability and maintainability. Write effective unit tests and integration tests to ensure high quality software delivery. In-depth knowledge and skills in programming, system design patterns, tiered architecture, and testing practices. Understanding of key business processes and competitive strategies related to the IT function. Work with project architect, project manager, business owner and system analysts to clarify the requirements and then implement them. Participate in Agile SDLC. Requirements: 14 Years – C# .NET development experience. 14 Years – Strong database development experience using SQL Server. 12 Years – Excellent troubleshooting skills. 10 Years – Experience with Source Control using TFS. 5 Years – Angular or Blazor experience. 5 Years – Experience with Web API. 5 Years – Experience with CSS3 and HTML5. 5 Years – Experience with Automated Builds using Microsoft Team Foundation. 5 Years – Experience with Agile SDLC best practices.",
        "source": "Email",
        "date_posted": "2024-10-16 10:00:00-05:00",
        "unique_id": "19295fb334d8cae9",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]