[
    {
        "company": "United Software Group",
        "job_title": "Techno Functional Business Analyst",
        "location": "Bala Cynwyd, PA, USA",
        "full_location": {
            "city": "Bala Cynwyd",
            "state": "PA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Insurance Principles",
                "Data Analytics",
                "Policy Administration Systems"
            ],
            "primary": [
                "Guidewire",
                "DuckCreek",
                "Majesco",
                "Oneshield",
                "Commercial Property & Casualty Insurance"
            ],
            "secondary": [
                "End User Support",
                "Configuration Management",
                "Change Management",
                "Mentoring",
                "System Integration"
            ],
            "all": [
                "Business Analysis",
                "Insurance Principles",
                "Data Analytics",
                "Policy Administration Systems",
                "Guidewire",
                "DuckCreek",
                "Majesco",
                "Oneshield",
                "Commercial Property & Casualty Insurance",
                "End User Support",
                "Configuration Management",
                "Change Management",
                "Mentoring",
                "System Integration"
            ],
            "with_experience": [
                "Business Analysis (5+ years)",
                "Policy Administration Systems"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Sudheer Vangaala",
        "email": "sudheer.v@usgrpinc.com",
        "jd": "HiThis is Sudheer from United Software Group Inc. Hope you’re doing great today.I have an opening for the below requirement. If you’re interested please let me know. Title: Techno Functional Business Analyst Location: Bala Cynwyd, PA. (Hybrid - 2/3 days per week onsite)Duration: 6+ Months Job Description:We are seeking a Techno Functional Business Analyst with experience in insurance policy domain. 5+ years of business analysis experience in the Commercial Property & Casualty insuranceThe ideal candidate will have a strong understanding of insurance principles & practices, with the ability to analyze & interpret policy data to ensure accuracy. Knowledge in insurance rating systems and policy administration systems is highly desirable.strong technology experience with policy administration solutions. Experience with Guidewire or DuckCreek or Majesco or Oneshield or any Property & Casualty Policy Administration Systems.Responds to production support issues by performing initial triage and analysis, providing end user support including documenting workarounds and, if necessary, escalating to IT and notifying impacted parties.Investigates and uses data analytics to determine how solutions or processes are performing after deployment and recommends improvements to support change management or maximize efficiencies as applicable.Lead review sessions for completed business/functional requirements with key business users focused on gaining consensus and final business approval.Mentors other Business Analysts, assisting in supporting consistent business analysis practices across all projects and lines of business.Provide support in diagnosing and resolving configuration-related issues during the testing phase, ensuring defects are accurately identified, documented, and effectively addressed.Work closely on system integration efforts, defining the specifications for how the system should interface with other platforms to ensure seamless interoperability.Collaborate with technical teams to translate business requirements into detailed technical specifications, ensuring developers have a clear understanding of the necessary customizations and configurations.Configuration of the application to support client requirements, with minimum support.",
        "source": "Email",
        "date_posted": "2024-10-16 11:39:16-05:00",
        "unique_id": "1929653534bc9851",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]