[
    {
        "company": "RCI",
        "job_title": "Product Owner (Remote)",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "12+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "$50/hr on C2C (Max)"
        },
        "skills": {
            "core": [
                "SQL",
                "Data Analysis",
                "Data Warehousing",
                "Business Intelligence",
                "Data Governance"
            ],
            "primary": [
                "Product Owner",
                "Data Analyst",
                "Agile",
                "Data Integration",
                "Data Visualization"
            ],
            "secondary": [
                "Excellent Communication Skills",
                "Presentation Skills",
                "Listening Skills",
                "API's",
                "Real Time Services"
            ],
            "all": [
                "SQL",
                "Data Analysis",
                "Data Warehousing",
                "Business Intelligence",
                "Data Governance",
                "Product Owner",
                "Data Analyst",
                "Agile",
                "Data Integration",
                "Data Visualization",
                "Excellent Communication Skills",
                "Presentation Skills",
                "Listening Skills",
                "API's",
                "Real Time Services"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Prakash Singh",
        "email": "prakash@rconsultinginc.com",
        "jd": "From: Prakash Singh, RCI prakash@rconsultinginc.com Reply to: prakash@rconsultinginc.com Job Title: Product Owner (Remote) Duration: 6+ Months Contract to hire Interview mode: Phone and Skype (Can work PST or EST hours) Pay rate: $50/hr on C2C (Max) Visa: USC or GC only Experience level: 12+ years Client must have notes: Product owner/ Data Analyst with Heavy SQL- 10+ years needed with banking/financial experience and this is mandatory. They need someone VERY STRONG in SQL—who has done Product Owner work. The initial interview is all technical around SQL. Can work PT or ET hours. 6 months contract to start and then, if all goes well, likely extension 2 rounds of interviews—first one is VERY technical and all about SQL Excellent comm skills as they will be talking to biz stakeholders Required experience: Experience as Data Product Owner or business data analyst in Agile environment. Deep expertise and minimum 10+ years of experience in Customer Data, Data warehouse and Analytics. Hard-core data analyst with broad experience desired in data warehousing, business intelligence (BI), data governance & data integration. Data wizard with hands on data analysis, profiling and superior PL/SQL skills. Excellent presentation, listening, and writing skills with ability to lead workstreams independently. Qualifications: Min 10 + years of total experience as data analyst needed, financial services and banking experience is preferred. Excellent written and verbal communication skills with both internal and external stakeholders. Experience with data modelling, data analysis, data visualization, API’s and real time services preferred. Full understanding and hands on experience of waterfall and agile development practices.",
        "source": "Email",
        "date_posted": "2024-10-16 13:57:04-05:00",
        "unique_id": "19296d15cff67142",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]