[
    {
        "company": "Kappium",
        "job_title": "Java Solutions Architect - Payment Systems",
        "location": "Washington, DC, USA",
        "full_location": {
            "city": "Washington",
            "state": "DC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "5+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "AWS",
                "SOA",
                "Microservices Architecture",
                "RESTful APIs"
            ],
            "primary": [
                "Architectural Modeling",
                "Service-Oriented Architecture",
                "Enterprise Information Management",
                "Software Design",
                "Payment Systems"
            ],
            "secondary": [
                "Cloud-Native Applications",
                "Databases"
            ],
            "all": [
                "Java",
                "AWS",
                "SOA",
                "Microservices Architecture",
                "RESTful APIs",
                "Architectural Modeling",
                "Service-Oriented Architecture",
                "Enterprise Information Management",
                "Software Design",
                "Payment Systems",
                "Cloud-Native Applications",
                "Databases"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Himanshu",
        "email": "himanshu@kappium.com",
        "jd": "From: Himanshu, Kappium himanshu@kappium.com Reply to: himanshu@kappium.com Job Title: Java Solutions Architect - Payment SystemsWashington DCHybrid Role Job DescriptionAs a Senior Solutions Architect in Washington, DC, you will leverage your expertise in architectural modeling, service-oriented architecture, enterprise information management, and software design to develop innovative solutions for complex business problems. Your role will involve working as a Solution Architect for large-scale, heterogeneous IT programs, particularly in the payments industry or with payment gateways. You will have demonstrated experience in designing and implementing SOA and services in an enterprise setting, with a strong background in Java and over 5 years of software development experience. Additionally, you will have proven experience with Amazon Web Services (AWS) and cloud-native applications, as well as a solid understanding of microservices architecture, RESTful API design, and databases.Responsibilities:Architect solutions grounded in state-of-the-art principles of architectural modeling and service-oriented architecture.Serve as the Solution Architect for large-scale, heterogeneous IT programs.Develop solutions that effectively solve business problems.Design and implement SOA and services in an enterprise setting.Leverage experience in the payments industry or with payment gateways.Utilize over 5 years of software development experience, with a strong focus on Java.Apply proven experience with AWS and cloud-native applications.Understand and design microservices architecture and RESTful APIs.Maintain a good understanding of databases",
        "source": "Email",
        "date_posted": "2024-10-16 13:44:44-05:00",
        "unique_id": "19297505de3406e0",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]