[
    {
        "company": "Veolia",
        "job_title": "Sr Project Manager (Infrastructure Services) (Hybrid)",
        "location": "Paramus, NJ, USA",
        "full_location": {
            "city": "Paramus",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Bachelor's degree in Computer Science, Management Information Systems or related field",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ Months Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "PMI certification",
                "LEAN",
                "Six Sigma",
                "project management",
                "communication"
            ],
            "primary": [
                "PMLC",
                "SDLC",
                "Waterfall",
                "Iterative",
                "SCRUM",
                "infrastructure systems",
                "cloud computing",
                "analytical skills",
                "Google Suite",
                "Project Management tools"
            ],
            "secondary": [
                "utilities industry experience",
                "major infrastructure projects",
                "ITIL certification"
            ],
            "all": [
                "PMI certification",
                "LEAN",
                "Six Sigma",
                "project management",
                "communication",
                "PMLC",
                "SDLC",
                "Waterfall",
                "Iterative",
                "SCRUM",
                "infrastructure systems",
                "cloud computing",
                "analytical skills",
                "Google Suite",
                "Project Management tools",
                "utilities industry experience",
                "major infrastructure projects",
                "ITIL certification"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Prakash Singh",
        "email": "prakash@rconsultinginc.com",
        "jd": "From: Prakash Singh, RCI prakash@rconsultinginc.com Reply to: prakash@rconsultinginc.com Please mentioned location as per DL and Visa statusJob Title: Sr Project Manager (Infrastructure Services) (Hybrid)Location: Paramus, NJDuration: 6+ Months ContractInterview mode: Phone and Skype (Locals only)Visa: USC or GC onlyExperience level: 10+ years Client Notes:Must report to the Paramus office 2-3 days a week and when needed (local Candidates)Looking for candidates who are PMI certified with LEAN / Six Sigma experience. Summary:The Senior Project Manager role is to plan, execute and finalize projects with high quality deliverables according to deadlines and within budget. This includes acquiring resources and coordinating the efforts of team members and third-party contractors to deliver solutions according to plan. The Project Manager will work with stakeholders to define the project’s objectives and provide status updates on achievements throughout the project lifecycle. This individual will also manage issues and escalations, providing updates and support to both internal and external customers as needed. In addition, the project manager will gather and analyze data in support of business cases, proposed projects, and systems requirements. Other activities include the following:Work with executives and senior leaders to create and maintain a plan to achieve the strategic vision and objectives of the project.Partner with business and technology partners to define project scope, design solutions and create other deliverables that support business goals.Estimate the resources and participants needed to achieve project goals.Draft and submit budget proposals, track financials and recommend subsequent budget changes where necessary.Identify and mitigate risks, resolve issues or escalate through proper channels.Identify and manage project dependencies and critical paths.Plan, schedule and maintain project milestones using appropriate tools and project team meetings.Produce regular status and ad hoc reports for the Steering Committee and other audiences.Partner with business to coordinate user acceptance testing, communications and training.Ensure and/or develop required documentation on projects, including deliverables to describe installation, support model and operating procedures.Knowledge of Lean/Six Sigma and continuous improvement processesOther duties as required or directed to ensure the achievement of project and other business objectives. Required Skills:Exceptional verbal and written communications; persuasive and motivating.Ability to drive discussions to elicit vision, goals, requirements and other business information from executives and managementStrong understanding of project and software development life cycles (i.e. PMLC, SDLC; Waterfall, Iterative; SCRUM, etc.)Understanding of infrastructure systems, networks, Cloud, personal computing, system engineering, information risk and security guidelines, and architecture standards.Ability to quickly troubleshoot problems that may arise in work products as well as manage a range of activities in a busy, fast-changing operating environment.Strong analytical skills applied to understanding business functionality, technical solutions and support requirements.Proficient in Google Suite of Applications, especially Google Slides and Sheets as well as Project Management tools Education/Equivalent:Experience in Utilities (water or electric) industries preferredExperience in major infrastructure and application deployment projectsBachelor's degree in Computer Science, Management Information Systems or related fieldPMP, ITIL, Lean/Six Sigma certifications Work Experience Needed:At least 7 years of technology project management experience working closely with technology teams, the business and third-parties.Experience leading business technology discussions, projects and programs including coordinating meetings and presenting project deliverablesExperience working in a PMO structured environment with standard documentation and tools.",
        "source": "Email",
        "date_posted": "2024-10-16 09:40:14-05:00",
        "unique_id": "19295eaa4a4fd62a",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]