[
    {
        "company": "Spar Information Systems",
        "job_title": "Sr Java Developer",
        "location": "Alpharetta, GA, USA",
        "full_location": {
            "city": "Alpharetta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "BS Engineering/Computer Science or equivalent experience required; advanced degree preferred",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Azure",
                "Data Manipulation",
                "Data Analysis",
                "Problem-Solving"
            ],
            "primary": [
                "Software Engineering",
                "Technical Documentation",
                "Mentoring",
                "Architecture Development",
                "Troubleshooting"
            ],
            "secondary": [
                "Oral Communication",
                "Written Communication",
                "Research Skills",
                "Time Management",
                "Mathematical Aptitude"
            ],
            "all": [
                "Java",
                "Azure",
                "Data Manipulation",
                "Data Analysis",
                "Problem-Solving",
                "Software Engineering",
                "Technical Documentation",
                "Mentoring",
                "Architecture Development",
                "Troubleshooting",
                "Oral Communication",
                "Written Communication",
                "Research Skills",
                "Time Management",
                "Mathematical Aptitude"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Rahul B",
        "email": "rahul@sparinfosys.com",
        "jd": "From: Rahul, Spar Information Systems rahul@sparinfosys.com Reply to: rahul@sparinfosys.com Hi Associate, Hope you are doing good. I have urgent requirement kindly let me know if you have any resource available. Role: Sr Java DeveloperLocation: Alpharetta, GADuration: 12+ Months Job description:This is a senior level position to be a part of the team, serving as a leader and subject matter expert on the integration Responsibilities will include working with developers and architects as well as potentially being involved with internal users through proof-of-concept or project efforts. Key Responsibilities: • Work effectively with team members or internal users to create or understand requirements, troubleshoot issues, and deliver solutions. • Follow architectural standards, required development processes, and coding best practices. • Participate in development and evolution of architecture. • Mentor other software developers, including but not limited to coding assistance, code reviews, and process guidance. • Design and/or work with complex data models. • Resolve complex technical issues. • Keep abreast of new technology developments, both internally and externally. • Create, maintain, and/or review technical documentation for internal users. • All other duties as assigned. Experience (US only) and Education: • 10+ years of Software Engineering experience• BS Engineering/Computer Science or equivalent experience required; advanced degree preferred Required Skills: • Expert core Java knowledge and development experience, not limited to frameworks. • Advanced problem-solving skills involving identifying, researching, and coordinating the resources necessary to troubleshoot complex issues and find effective, strategic solutions. • Strong data manipulation and data analysis skills. • Considerable experience working with constructing and troubleshooting applications deployed in Azure • Ability to effectively prioritize tasks, manage time, and cope with change. • Strong research skills: ability to quickly learn and make use of new languages, tools, or technologies. • Aptitude for mathematical aspects of computer science. • Exceptional oral and written communication skills.",
        "source": "Email",
        "date_posted": "2024-10-16 10:04:00-05:00",
        "unique_id": "19295fed4c8c55ff",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]