[
    {
        "company": "Magicforce",
        "job_title": "GCP Engineer",
        "location": "Denver, CO, USA",
        "full_location": {
            "city": "Denver",
            "state": "CO",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Google Big Query",
                "Google Cloud Platform",
                "Advanced SQL",
                "Scripting language (Python/R)",
                "Terraform",
                "Kubernetes"
            ],
            "primary": [
                "CI/CD Pipelines",
                "Agile methodologies",
                "BI tools (Tableau, Power BI)",
                "Cloud deployments",
                "Cloud solution environment"
            ],
            "secondary": [
                "Clickstream database",
                "Google Analytics",
                "Adobe Analytics",
                "API Wrapper",
                "Model setup with GCP",
                "Object-Oriented Programming",
                "Automated unit testing",
                "Emerging technologies",
                "Well-architected framework",
                "Cloud Storage",
                "Cloud SQL",
                "Cloud DNS",
                "Load Balancing",
                "Cloud Functions",
                "Spanner",
                "BQ",
                "PubSub",
                "Cloud Run",
                "Anthos",
                "Compute Engine"
            ],
            "all": [
                "Google Big Query",
                "Google Cloud Platform",
                "Advanced SQL",
                "Scripting language (Python/R)",
                "Terraform",
                "Kubernetes",
                "CI/CD Pipelines",
                "Agile methodologies",
                "BI tools (Tableau, Power BI)",
                "Cloud deployments",
                "Cloud solution environment",
                "Clickstream database",
                "Google Analytics",
                "Adobe Analytics",
                "API Wrapper",
                "Model setup with GCP",
                "Object-Oriented Programming",
                "Automated unit testing",
                "Emerging technologies",
                "Well-architected framework",
                "Cloud Storage",
                "Cloud SQL",
                "Cloud DNS",
                "Load Balancing",
                "Cloud Functions",
                "Spanner",
                "BQ",
                "PubSub",
                "Cloud Run",
                "Anthos",
                "Compute Engine"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Saikiran",
        "email": "saikiran@magicforce.us",
        "jd": "From: saikiran, Magicforce saikiran@magicforce.us Reply to: saikiran@magicforce.us Hi Greetings from Magic force!!! My name is Saikiran we have a job opportunity for you as a GCP Engineer of our client based at Denver, Co(Day 1 Onsite) please find the Job description below, if you are available and interested, please send us your word copy of your resume with following detail to saikiran@magicforce.us Job Title: GCP EngineerLocation: Denver, Co(Day 1 Onsite)Duration: 12+ monthsStart Date: ASAP Roles and Responsibilities:As an GCP Engineer with .Net/Java, you will be a part of an Agile team to build healthcare applications and implement new features while adhering to the best coding development standards.Mandatory skillsGoogle Big Query Experience and Google Cloud Platform Good to have skills: -Experience in working on CI/CD Pipelines using GitLabResponsibilities: -Candidate has mandatory experience on GCP, and GCP Services is good to have. Google Big Query Experience and Google Cloud Platform. Design and develop the ETL framework using Big Query.Expertise in Big Query concepts like Nested Queries, Clustering, Partitioning, etc. Working Experience of Clickstream database, Google Analytics/ Adobe Analytics. Should be able to automate the data load from Big Query using APIs or scripting language. Good experience in Advanced SQL concepts. Expertise in Google Big Query & Google Cloud Platform. Experience in Advanced SQL, Scripting language (Python/R).Hands-on experience in BI tools (Tableau, Power BI) Excellent analytical thinking, analysis, and problem-solving skills. Knowledge of other GCP services is a plus Candidate should be familiar with GCP services, API Wrapper, Model setup with GCP Hands on experience with Terraform and Kubernetes is good to have. Strong Object- Oriented Programming Skills - Proficiency writing automated unit testing code - Good Should have experience of working in Agile /Scrum team Should have experience in demonstrating the user stories to client during Sprint Review Design, implement, manage and maintain cloud-based systems Support the design and migration of existing applications to GCP Plan, provision, deploy and maintain a Cloud solution environment Proactively monitor security, performance, and costs while responding to alerts, working with development and service delivery teams to resolve Support Cloud deployments, monitoring the health of environments, providing maximum system performance to users and sustaining system uptime standards. Ensures the security of cloud resources by implementing access controls, encryption, and monitoring Collaborates with cross-functional teams to support application and infrastructure requirements Troubleshoot incidents, identify root causes, fix, and document problems, and implement preventive measures Apply an understanding of emerging technologies, industry best practices, and system requirements to recommend and document specific elements of architecture including compute and storage components, networking and related appliances, and third-party software and programs Support opportunities for process improvement, re-imagining, and automation in cloud, and employ practices intended to improve customer satisfaction and reduce costs Prioritize and complete assigned duties expeditiously and within approved windows Deploys, implements and configures cloud environments in accordance with best practices and security guidelines by applying knowledge of programming languages. Stay abreast of latest GCP offerings and make recommendations to leadership. Understanding of and experience with the six pillars of a well-architected framework Experience with or conceptual understanding of the analysis, deployment, integration, optimization, troubleshooting, and consultation of the following disciplines or technologies is required: GCP, GKE, Cloud Storage, Cloud SQL, Cloud DNS, Load Balancing, Cloud Functions, Spanner, BQ, PubSub, Cloud Run, Anthos, Compute Engine, GKE, GCP storage options Ability to inspire and instil confidence in peers and colleagues by fulfilling service demand with a high degree of quality and intentionality Ability to convey information and ideas clearly, concisely, and persuasively using terminology and jargon appropriate for the intended audience. If you are interested in this position, kindly fill the details and revert back to me ASAP. Requirement id / Title Full Name Work Authorization and validity Present location Passport Number Contact Number E-mail Address SSN Number Last 4 digits DOB LinkedIn ID Currently on the project (Yes / No) Availability to join the project Availability for onsite / remote Overall, USA IT experience Overall relevant IT experience Bill rate Year of arrival in USA and the employer’s name Is the USA working experience mentioned in the resume, correct? Highest degree and passing year Is the candidate submitted for the same client earlier? Thanks, and Regards: SaikiranTechnical Recruitersaikiran@magicforce.us",
        "source": "Email",
        "date_posted": "2024-10-16 10:35:47-05:00",
        "unique_id": "192966b4b3028ffd",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "GCP Data Engineer"
    }
]