[
    {
        "company": "NYS and OCFS department",
        "job_title": ".Net Developer with BizTalk",
        "location": "Albany, NY, USA",
        "full_location": {
            "city": "Albany",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "HBITS-06-13635",
            "experience_required": "84 months",
            "degree_required": "Bachelor's Degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "30 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "ASP.net MVC",
                "VB.Net",
                "PL/SQL",
                "C#",
                "BizTalk"
            ],
            "primary": [
                "Oracle Database administration",
                "N-Tier .net web applications"
            ],
            "secondary": [],
            "all": [
                "ASP.net MVC",
                "VB.Net",
                "PL/SQL",
                "C#",
                "BizTalk",
                "Oracle Database administration",
                "N-Tier .net web applications"
            ],
            "with_experience": [
                "N-Tier .net web applications (84 months)",
                "PL/SQL writing packages stored procedures and triggers (72 months)",
                "BizTalk (72 months)",
                "C# (72 months)",
                "Oracle Database administration, design and architecture (72 months)"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Yogesh Dahiya",
        "email": "yogeshd@sspearhead.com",
        "jd": "From: Yogesh Dahiya, SSPEARHEAD INC yogeshd@sspearhead.com Reply to: yogeshd@sspearhead.com Hi, Hope you are doing good. Please have a look on below position and let me know if you are interested? Required Documentation: Make sure you if you are fine with this job then please share the below details at the time submission time.If you are not going to provide these details then please don’t apply for this job.1: Passport mandatory for these visa’s ( EAD, GC and H1B)2: Visa stamping copy required for H1 B3: Must be provide 3 references with full name, email id, client name and phone number. Job Description:Job Id: HBITS-06-13635Role: Systems DeveloperClient: NYS and OCFS department. Duration: 30 monthsLocation: Albany, NY (Hybrid)There is only 1 round interview direct client.Qualifications Daily tasks will include: Work in coordination with a team of developers to write the new Facility Application Management system in ASP.net MVC.Work with Business Analyst on analysis and logical design.Perform unit testing and correct all identified bugs.Perform complex VB.Net coding.Assist with responding to CCFS data requests.The individual in this position will work under the direction of a Technical Lead, Project Manager & Software Architect.Perform writing of complex stored procedures/triggers in an Oracle database utilizing PL/SQL Systems Developer: Fingerprint Processing Information System projectDevelops and implements applications and programs for the backend processing systems used in businesses and organizations.Expert 84+ months: Candidate is able to provide guidance to large teams and/or has extensive industry experience and is considered at the top of his/her field. 84 months experience developing N-Tier .net web applications 72 months experience with PL/SQL writing packages stored procedures and triggers. 72 months experience utilizing BizTalk 72 months experience developing in C# 72 months experience with Oracle Database administration, design and architecture Bachelor's Degree E-mail is the best way to reach me, if I don’t pick your call. Thanks & RegardsYogesh DahiyaSspearhead Inc",
        "source": "Email",
        "date_posted": "2024-10-16 15:01:17-05:00",
        "unique_id": "19297a1e5be603f6",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]