[
    {
        "company": "Verra Mobility",
        "job_title": "PL/SQL Developer",
        "location": "Mesa, AZ, USA",
        "full_location": {
            "city": "Mesa",
            "state": "AZ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "7+ Years",
            "degree_required": "BS in Computer Science or related degree, or equivalent work experience.",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle PL/SQL",
                "SQL",
                "Performance Tuning",
                "Database Design",
                "Data Modeling"
            ],
            "primary": [
                "PL/SQL Packages",
                "Stored Procedures",
                "Functions",
                "Triggers",
                "Data Migration"
            ],
            "secondary": [
                "Agile",
                "Scrum",
                "TDD",
                "Continuous Integration",
                "Source Control Management"
            ],
            "all": [
                "Oracle PL/SQL",
                "SQL",
                "Performance Tuning",
                "Database Design",
                "Data Modeling",
                "PL/SQL Packages",
                "Stored Procedures",
                "Functions",
                "Triggers",
                "Data Migration",
                "Agile",
                "Scrum",
                "TDD",
                "Continuous Integration",
                "Source Control Management"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Vinita Singh",
        "email": "vinita.singh@tekinspirations.com",
        "jd": "From: Vinita Singh, Tek Inspirations vinita.singh@tekinspirations.com Reply to: vinita.singh@tekinspirations.com Job Description - * Need Candidate LinkedIn profile with public photo.Job Title: PL/SQL DeveloperVisa :- USC & GCCity: Mesa AZ (MUST BE LOCAL CANDIDATE)Company: Verra MobilityNeed a strong, PL/SQL developer.Job Desc: Position Overview:We are seeking a PL/SQL Developer candidate to contribute to the development and quality of our future and existing technology products. This position will participate developing and maintaining applications , written in Oracle PL/SQL. To be successful in this role, you must display robust interpersonal skills, have a high aptitude for technical learning. Be approachable and willing to engage quickly, multi-task efficiently, demonstrate discipline and initiative to consistently solve complex problems in a fluid, fast-paced environment while maintaining a high level of composure, transparency, and professionalism during daily interaction with peers, customers, management, and external partners. Essential ResponsibilitiesDevelop, validate, and maintain large, enterprise class, applications written in Oracle PL/SQLOracle database full life cycle development including data modeling, database architecture, SQL and PL/SQL development, unit testing and support.Tune application SQL queries for performance optimizationEvaluate existing database structures and recommend improvementsAbility to work on multiple projects and be flexible to adapt to changing requirementsAbility to turn high-level requirements into a working system through iterative developmentCreate acceptance criteria, develop automated test frameworks, and validate work productsProvide technical assistance by responding to inquiries regarding errors, problems, or technical questions; train end users and technical support staff as requiredConvert user stories into application logic; reports, printed outputs, and interfaces with other systemsAnalyze, install, and test upgrades of products; monitor performance of applications and/or programs after implementation, taking appropriate actions as required Develop detailed technical analysis and design specifications based on functional requirements.Collaborate heavily with fellow developers, designers and analysts to solve problems.Contribute in the architecture and implementation of changes across our product base.Job Requirements: Qualifications BS in Computer Science or related degree, or equivalent work experience. 7+ Years' Experience with relational database and Oracle PL/SQL concepts7+ Years' Experience in Development of PL/SQL Packages, Stored Procedures, Functions, Triggers, SQL statements in Oracle11g/12c7+ Years' Experience with Performance Tuning and optimizing SQL, PL/SQL code to reduce execution time or improve efficiency7+ Years' Experience with database design, data migration and data modeling Expertise in using Oracle PL/SQL Collections, Bulk techniques, Analytical Functions to increase performanceExperience analyzing complex business applications, developing logic flow charts, and translating detailed design into softwareExperience with development life cycle; requirements gathering, analysis, design, coding, unit testing, and acceptance testingExperience with enterprise level software development tools Experience with creating automated testing process Understanding of software development processes and methodologies including, Agile, Scrum, TDD, and Continuous IntegrationExperience working with source control management tools.",
        "source": "Email",
        "date_posted": "2024-10-16 16:22:29-05:00",
        "unique_id": "19297567edc86660",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Oracle DBA"
    }
]