[
    {
        "company": "Tek Inspirations LLC",
        "job_title": "Curam Developer",
        "location": "New York City, NY, USA",
        "full_location": {
            "city": "New York City",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Computer Science degree or Information Technology, engineering related",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Curam",
                "Java",
                "J2EE",
                "SQL",
                "JavaScript"
            ],
            "primary": [
                "Cloud (AWS, Azure, GCP)",
                "Modern UI/UX design",
                "Data architecture",
                "ETLs",
                "DevOps"
            ],
            "secondary": [
                "React.js",
                "Angular",
                "CSS",
                "JDBC",
                "XML",
                "XSL",
                "EJB",
                "RSA",
                "UNIX",
                "NT operating systems",
                "Oracle",
                "DB2",
                "Websphere",
                "Weblogic",
                "Kubernetes",
                "Docker",
                "CI/CD",
                "Jenkins",
                "Pipelines",
                "Ansible",
                "Chef",
                "Puppet",
                "Packer",
                "Terraform",
                "Agile Scrum Master"
            ],
            "all": [
                "Curam",
                "Java",
                "J2EE",
                "SQL",
                "JavaScript",
                "Cloud (AWS, Azure, GCP)",
                "Modern UI/UX design",
                "Data architecture",
                "ETLs",
                "DevOps",
                "React.js",
                "Angular",
                "CSS",
                "JDBC",
                "XML",
                "XSL",
                "EJB",
                "RSA",
                "UNIX",
                "NT operating systems",
                "Oracle",
                "DB2",
                "Websphere",
                "Weblogic",
                "Kubernetes",
                "Docker",
                "CI/CD",
                "Jenkins",
                "Pipelines",
                "Ansible",
                "Chef",
                "Puppet",
                "Packer",
                "Terraform",
                "Agile Scrum Master"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Shubham Singh",
        "email": "shubham@tekinspirations.com",
        "jd": "Hello,I Hope you are great in good health and sprit 🙂 !!Note : Urgent Curam Developer Opportunity in NY location Need Candidate with Java and Modern Data Experience with Cloud ( AWS, Azure, GCP) ideally in a health and human services agency Experience.Job Description -Role: Curam DeveloperLocation: NYC , NY – Preference for local candidates Hybrid-2-3 days/week on-siteDuration: 6+ monthsMOI: Skype Our direct client is searching for a Technical Consultant with Curam product experience to join their NYC-based team on a high-profile project, providing architecture guidance and design for solutions using the Cúram platform. Must Have Required Experience: 5 years of experience- Experience in applications design/development principles- Experience with Curam services delivery, including batch, online, rules, workflows, web services- Experience in Java/J2EE/JEE development, JDBC, SQL, XML, XSL, CSS, JavaScript- Experience with EJB, RSA, UNIX and NT operating systems, Oracle or DB2 databases, Websphere or Weblogic- Experience in modern UI/UX design and user research practices, tools, languages (e.g. React.js, Angular, CSS, JavaScript) Preferred Experience:- Computer Science degree or Information Technology, engineering related- Ability to apply data architecture and data government best practices (ideally in a health and human services agency), ETLs, BI platform, data integration, data quality assessments, data migration strategies and load management techniques- Cloud experience / delivery of applications with AWS, Azure, IBM Cloud, and other, Kubernetes/Docker- DevOps, development/integration tooling SCM, CI/CD and/or Jenkins, Pipelines(Azure or AWS), Ansible/Chef/Puppet, Packer/Terraform- Experience in delivery of applications on Cloud with AWS, Azure, IBM Cloud, and other - Experience on containers using Kubernetes, Helm charts - Ability to apply data architecture and data government best practices (ideally in a health and human services agency), ETLs, BI platform, data integration, data quality assessments, data migration strategies and load management techniques- Agile Scrum Master experience Regards!! Shubham SinghTechnical Recruiter| IT Healthcare & InformaticsTEK Inspirations LLC | 13573 Tabasco Cat Trail, Frisco, TX 75035 Email: shubham@tekinspirations.com II Phone: +1 469-498-0636Whats'up No. :+91-(953-232-0892) Disclaimer: If you are not interested in receiving our e-mails then please reply with a \"REMOVE\" in the subject line to remove@tekinspirations.com. And mention all the e-mail addresses to be removed with any e-mail addresses,which might be diverting the e-mails to you. We are sorry for the inconvenience",
        "source": "Email",
        "date_posted": "2024-10-16 09:53:27-05:00",
        "unique_id": "192960d4c1706113",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]