[
    {
        "company": "tek inspirations llc",
        "job_title": "Project Manager",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "6 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Agile",
                "Scrum",
                "Jira"
            ],
            "primary": [
                "Healthcare background",
                "State agency experience",
                "Development experience",
                "Data warehouse applications",
                "Database reporting features"
            ],
            "secondary": [
                "PMP Certification",
                "State of Texas Project Delivery Framework",
                "State Procurement and Contracting"
            ],
            "all": [
                "Project Management",
                "Agile",
                "Scrum",
                "Jira",
                "Healthcare background",
                "State agency experience",
                "Development experience",
                "Data warehouse applications",
                "Database reporting features",
                "PMP Certification",
                "State of Texas Project Delivery Framework",
                "State Procurement and Contracting"
            ],
            "with_experience": [
                "Project Management (6+ years)",
                "Agile (3+ years)",
                "Scrum (3+ years)",
                "Development (3+ years)",
                "Jira (1+ year)"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Sahanbaz Khan",
        "email": "sahanbaz.khan@tekinspirations.com",
        "jd": "From: Sahanbaz khan, tek inspirations llc sahanbaz.khan@tekinspirations.com Reply to: sahanbaz.khan@tekinspirations.com Job Description -Job tittle : Project Manager Location :Remote for TX-based candidates onlyDuration: 12+ monthsImportant note – My Vendor is habitual to do control F in resume; So, its important that the resume should have each and every points in good numbers. Please mentioned perfect job title as well; He reject the resume on the basis of job title and lack in communication basis. Must Have: As always, previous background in healthcare will be needed and state agency experience is must. Responsibilities: This Project Manager contractor position is part of the Administrative Applications Production Data Services team and will be working on the development and implementation of modifications and enhancements to the Financial Data Warehouse. This position will perform the duties of project management including the implementation of standard project management industry practices for Agile teams. Understands the PMI framework as well as how to establish a project organization and methodology within Agile (Scrum) organizations. Understands business and technical objectives of a project and works closely with multiple key project stakeholders. Communicates to clients and IT teams. Creates project charters, work plans, and other related project artifacts, as necessary. Provides technical support both during work hours and on-call, as necessary. Must be able to comprehend and communicate complex technical designs and implementations as well as complex business processes. Develops and makes presentations as required to leadership and oversight entities. Project managers are the people in charge of a specific project or projects within a company. As the project manager, your job is to plan, budget, oversee and document all aspects of the specific project you are working on. Project managers might work by themselves or be in charge of a team to get the job done. Must Have Qualifications: Minimum Requirements:Candidates that do not meet or exceed the minimum stated requirements (skills/experience) will be displayed to customers but may not be chosen for this opportunity. YearsRequired/PreferredExperience6RequiredProject Management experience for large-scale enterprise implementations6RequiredState of Texas or similar Federal/State Project Management experience3RequiredAgile (Scrum) experience3RequiredDevelopment experience3RequiredJira Experience1PreferredPMP Certification1PreferredState of Texas Project Delivery Framework experience1PreferredExperience with data warehouse applications and/or database reporting features1PreferredState Procurement and Contracting experience",
        "source": "Email",
        "date_posted": "2024-10-16 12:26:08-05:00",
        "unique_id": "19296fcee29968f3",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]