[
    {
        "company": "Softcom Systems",
        "job_title": "Web Backend Engineer or AWS Cloud Developer or Full Stack Developer",
        "location": "Phoenix, AZ, USA",
        "full_location": {
            "city": "Phoenix",
            "state": "AZ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Preferably a BS or MS degree in computer science, computer engineering, or other technical discipline.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "AWS",
                "SQL",
                "Microservices",
                "Angular",
                "Vert.x",
                "RxJava",
                "Kotlin"
            ],
            "primary": [
                "RESTful APIs",
                "NoSQL DBs",
                "React",
                "JavaScript Frameworks",
                "HTML5",
                "CSS3",
                "Docker",
                "Kubernetes",
                "OpenShift",
                "Kafka",
                "Aurora",
                "AWS Glue",
                "Redshift",
                "Jenkins",
                "Ansible",
                "NodeJS",
                "AngularJS",
                "Typescript",
                "Spring MVC"
            ],
            "secondary": [
                "Business Intelligence",
                "Analytics",
                "Agile",
                "Scrum",
                "Test-Driven Development",
                "Waterfall",
                "Debugging",
                "Troubleshooting",
                "Communication Skills"
            ],
            "all": [
                "Java",
                "AWS",
                "SQL",
                "Microservices",
                "Angular",
                "Vert.x",
                "RxJava",
                "Kotlin",
                "RESTful APIs",
                "NoSQL DBs",
                "React",
                "JavaScript Frameworks",
                "HTML5",
                "CSS3",
                "Docker",
                "Kubernetes",
                "OpenShift",
                "Kafka",
                "Aurora",
                "AWS Glue",
                "Redshift",
                "Jenkins",
                "Ansible",
                "NodeJS",
                "AngularJS",
                "Typescript",
                "Spring MVC",
                "Business Intelligence",
                "Analytics",
                "Agile",
                "Scrum",
                "Test-Driven Development",
                "Waterfall",
                "Debugging",
                "Troubleshooting",
                "Communication Skills"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Manasa.N",
        "email": "manasa@softcomsystems.com",
        "jd": "From: Manasa.N, Softcom Systems manasa@softcomsystems.com Reply to: manasa@softcomsystems.com Hi, Hope you are doing well.We are looking for Web Backend Engineer/ AWS Cloud Developer/ Full Stack Developer – Phoenix, AZ/ Atlanta, GA (Onsite)– Contract one of our Clients. If you are available and interested then please give me a call back at Desk: 609-333-9000 EX: 64 or you can E-Mail me at manasa@softcomsystems.com There are 3 positions in total please check and let me know which one you would be interested. #Position 1: Role: Web Backend EngineerLocation: Phoenix, AZ (Onsite)Duration: Contract Primary Skills: Vert.x / RxJava / Kotlin Qualifications:Preferably a BS or MS degree in computer science, computer engineering, or other technical discipline.10+ years of software development experience.Ability to effectively interpret technical and business objectives and challenges and articulate solutions.Willingness to learn new technologies and exploit them to their optimal potential.Skilled in the delivery methodology used by the team (Agile, Scrum, AgileXP, Test-Driven Development, Waterfall, etc.).Active engineering experience in a complex environment with ability to deal with ambiguous/under-defined problems.Expertise in building fault-tolerant, scalable solutions that are performed at a global enterprise scale. 6+ Years of experience with Java, Reactive Programming using RxJava, Vert.x.5+ Expertise with integrating RESTful APIs.Experience working with database technologies including NoSQL DBs.Experience with Kotlin programming language.Experience with Web technologies like React, JavaScript Frameworks, HTML5, CSS3 is a plus.Past working experiences with other languages are a plus. #Position 2 Position: AWS Cloud Developer (Java)Locations: Atlanta, GA (Onsite)Duration: Contract Interview: (F2F interview required). Mandatory Skills: Java, SQL, Microservices, Strong AWS, Angular, CloudFormation, CloudWatch, Lambda, Job description: Experience in AWS is must Proficiency with Java, SQL, Microservices and Angular.Experience working with streaming data and data extraction from different databases Oracle DB2 MySQL etc Experienced with deploying and managing infrastructures based on Docker Kubernetes or OpenShift Experience with scalable data extraction tools is a plus Experience working with Kafka Aurora AWS Glue Redshift is a plus Understanding of data engineering real time streaming andor eventing and json parsingExperience with automating application deployment continuous delivery and continuous integration Jenkins Ansible etc Experience building micro services and API architecture Debugging troubleshooting skills Must be flexible and have a passion to learn and collaborate with colleagues Must have strong oral and written communication skills Business Intelligence Analytics experience a plus Embraces diverse people thinking and styles Consistently makes safety and security of self and others the priority #Position 3 Position Full Stack Developer (UI, Node/Angular/AWS) Location Atlanta, GA (Onsite / L2 interview will be onsite in any of the LTIMindtree office)Duration Contract Interview: (F2F interview required). Primary Skills: UI, NodeJS/AngularJS/AWS Lambda Job Description• Min 10+ year of Experience on AWS Lambda and UI development using Angular Node JS Typescript• Experience using various design patterns preferably MVC Singleton Facade and Factory• Experience with using Spring MVC frameworks Eclipse Java JPA JSON JavaScript and API Restful• Should have diverse experience of utilizing Java tools in business Web and client server environments including Java Platform J2EE JDBC technologies and Api gateway platform• Web services SOAP based or Restful exposure Experience Responsibilities• Delivering and designing web solutions on highlevel architecture• Developing push notifications and other interactive web features• Building interactive consumer data through a variety of systems and RESTfully abstract to the user interface with a Nodejs backend feature• Addressing and resolving technical issues• Working with product managers and development teams to innovate software solutions• Designing the frontend and backend architecture• Writing effective MEAN based APIs• Building web applications and features that offer a mobile responsive design• Testing web software and applications to ensure they are active and efficient• Using both HTML and CSS computer systems• Exploring alternative ideas and providing suggestions for the MEAN opensource stack• Regulating application and software deployment• Validating the quality of the code• Automating essential unit tests• Prioritizing backlog duties and managing the completion of a development project Thanks & Regards, Manasa.NSenior Technical RecruiterSoftcom Systems, Inc.Desk: 609-333-9000 EX: 64Email: manasa@softcomsystems.comWebsite: www.softcomsystems.com",
        "source": "Email",
        "date_posted": "2024-10-16 12:38:18-05:00",
        "unique_id": "1929689441ba1d64",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]