[
    {
        "company": "TEK Inspirations LLC",
        "job_title": "Dot Net Application Developer",
        "location": "Hartford, CT, USA",
        "full_location": {
            "city": "Hartford",
            "state": "CT",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10-11 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Microsoft .NET Certification",
                "Power Platform Development Certification",
                "VB.NET",
                "Java/J2EE",
                "API development"
            ],
            "primary": [
                "Microsoft Power Platform",
                "Integrated Development Environments (IDEs)",
                "SQL queries",
                "SDLC proficiency"
            ],
            "secondary": [
                "Legacy System Conversion",
                "Legacy Application Support",
                "API Integration",
                "Data Model Design",
                "Development Standards",
                "Best Practices in systems deployment",
                "Communication & Leadership",
                "Operating systems",
                "Databases",
                "Application servers",
                "Network protocols"
            ],
            "all": [
                "Microsoft .NET Certification",
                "Power Platform Development Certification",
                "VB.NET",
                "Java/J2EE",
                "API development",
                "Microsoft Power Platform",
                "Integrated Development Environments (IDEs)",
                "SQL queries",
                "SDLC proficiency",
                "Legacy System Conversion",
                "Legacy Application Support",
                "API Integration",
                "Data Model Design",
                "Development Standards",
                "Best Practices in systems deployment",
                "Communication & Leadership",
                "Operating systems",
                "Databases",
                "Application servers",
                "Network protocols"
            ],
            "with_experience": [
                "VB.NET",
                "Java/J2EE",
                "API development"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Saurabh Kesarvani",
        "email": "saurabh.kesarvani@tekinspirations.com",
        "jd": "Job Description -Need candidates active LinkedIn and local candidates only and Need genuine visa please.Title- Dot Net Application DeveloperDuration- 6+ MonthsLocation- Hartford, CT - Hybrid [ Local ]Visa- USC&GC Only.MOI - Skype.Min 10 to 11yrs exp. required.*Note this is a hybrid position where the candidate will need to be required to be in the office a couple times throughout the week.· Microsoft .NET Certification: Candidates must possess a valid certification in Microsoft .NET development, demonstrating expertise in building, deploying, and maintaining applications using the .NET framework. This certification ensures proficiency in various .NET technologies and best practices for software development.· Power Platform Development Certification: A certification in Microsoft Power Platform development is required, verifying the candidate's ability to create custom business solutions using Power Apps, Power Automate, Power BI, and Power Virtual Agents. This certification reflects the ability to develop and integrate low-code/no-code solutions that enhance organizational workflows.· Legacy System Conversion: Assist in converting legacy .NET applications to the Microsoft Power Platform, ensuring smooth integration with Power Apps, Power Pages, and portals while maintaining full functionality and performance.· Legacy Application Support: Provide ongoing maintenance and support for existing .NET legacy applications, addressing technical issues, performing updates, and ensuring continued operation and performance.· API Integration: Develop and implement robust API integration solutions to connect external applications and systems, ensuring secure and efficient data exchange across platforms.· Data Model Design: Collaborate with database administrators (DBAs) to design efficient data models, optimize queries, and maintain data integrity across both legacy systems and new Power Platform applications.· SDLC Proficiency: Exhibit expertise in the Software Development Life Cycle (SDLC), with experience in both waterfall and agile methodologies, ensuring timely project delivery and alignment with project goals. · Development Standards: Follow established development practices, proactively identifying opportunities for process improvements to enhance overall development quality and efficiency.Technical Expertise:Proficiency in programming languages such as VB.NET, Java/J2EE, and API development.Strong experience with Microsoft Power Platform (Power Apps, Power Pages, Portals).Hands-on experience in setting up Integrated Development Environments (IDEs) and writing unit and feature tests.Ability to run and optimize SQL queries, contributing to both development and testing efforts.Best Practices & Operational Knowledge: Demonstrated knowledge of best practices in systems deployment, testing, operations, administration, and disaster recovery. Communication & Leadership: Strong verbal and written communication skills, with the ability to manage tasks proactively and work independently. Additional Qualifications: Experience in operating systems, databases, application servers, programming languages, and network protocols is a plus. Relevant technical certifications or additional training in these areas is highly desirable.",
        "source": "Email",
        "date_posted": "2024-10-16 09:35:45-05:00",
        "unique_id": "192962007eabae4f",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]