[
    {
        "company": "Source Infotech Inc",
        "job_title": "Business Analyst",
        "location": "Bellevue, WA, USA",
        "full_location": {
            "city": "Bellevue",
            "state": "WA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "7+ years",
            "degree_required": "Bachelor's or Master's in Information Systems, Business, or Engineering",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "API",
                "Mobile Apps",
                "Requirements Documentation",
                "Process Mapping"
            ],
            "primary": [
                "Wireframes",
                "Workflows",
                "Use Case Diagrams",
                "Collaboration",
                "Analytical Skills"
            ],
            "secondary": [
                "Training Materials",
                "User Training",
                "Communication Skills",
                "Project Management",
                "Relationship Building"
            ],
            "all": [
                "Business Analysis",
                "API",
                "Mobile Apps",
                "Requirements Documentation",
                "Process Mapping",
                "Wireframes",
                "Workflows",
                "Use Case Diagrams",
                "Collaboration",
                "Analytical Skills",
                "Training Materials",
                "User Training",
                "Communication Skills",
                "Project Management",
                "Relationship Building"
            ],
            "with_experience": [
                "Business Analysis (7+ years)",
                "API",
                "Mobile Apps"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Bhavya Chaturvedi",
        "email": "bhavya.c@sourceinfotech.com",
        "jd": "From: Bhavya, Source infotec inc bhavya.c@sourceinfotech.com Reply to: bhavya.c@sourceinfotech.com Business Analystlocation: Bellevue WA day 1 onsite, prefer local to WA profiles.interviews: 2 rounds. 1st round tech screening with Enfec. 2nd round with T-Mobile.Visa: no H1b cpt or opt As a Business Analyst, you will analyze an organization and design its processes and systems, assessing the business model and its integration with technology. You will assess the current state, identify customer requirements, and define the future state and/or business solution. Roles and Responsibilities: Create, analyze, and validate detailed functional specifications. Work directly with and serve as the liaison between business units, technology teams, support teams, and external vendors. Work with functional leads to transform and develop new requirements into design and implementation documents. Design new user interface screens to support new features via sketches, mockups, wireframes, workflows, and process maps. Prioritize and communicate requirements, features, and tasks to software developers, vendors, and senior management. Work closely with developers & vendors to scope out projects, perform design discussions, estimate resources, and create a development timeline. Work with user groups to provide training, resolve questions, assess user needs, and recommend changes. Create training materials and documentation for users and train new end users on relevant applications and processes. Be an advocate for the business and their needs. Required skills: You are an experienced Business Analyst with a 7+ year track record. You have a bachelor's or master's degree in information systems, Business, or Engineering. You have experience in API space and mobile apps etc. You have the ability to produce quality requirements documents, process maps, use case diagrams, wireframes, workflows, etc. You have experience working with diverse teams and influencing strategy, tactics, and execution. You can build relationships and work collaboratively with internal and external departments and teams. You can handle multiple projects simultaneously in a dynamic, deadline-oriented environment and make key decisions in a timely manner. You have great written and oral communication skills and can interact with any audience regardless of background. You have a strong analytical mind and welcome challenges.",
        "source": "Email",
        "date_posted": "2024-10-16 08:43:41-05:00",
        "unique_id": "19295b4d34ee09f3",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]