[
    {
        "company": "IBM",
        "job_title": "Snowflake Architect",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "13-15+ years",
            "degree_required": "Technical Degree required. B.S or M.S in Computer Science, Business Analytics, Engineering",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Snowflake",
                "Data Engineering",
                "Machine Learning Engineering",
                "Artificial Intelligence",
                "ETL"
            ],
            "primary": [
                "GCP",
                "HANA",
                "Tableau",
                "Power BI",
                "Data Warehousing",
                "Teamcenter",
                "MS-SQL",
                "SAP HANA"
            ],
            "secondary": [
                "Agile",
                "CI/CD",
                "Analytical Thinking",
                "Interpersonal Skills",
                "Communication Skills",
                "Microsoft Office",
                "3NF Data Modeling",
                "Coalesce"
            ],
            "all": [
                "Snowflake",
                "Data Engineering",
                "Machine Learning Engineering",
                "Artificial Intelligence",
                "ETL",
                "GCP",
                "HANA",
                "Tableau",
                "Power BI",
                "Data Warehousing",
                "Teamcenter",
                "MS-SQL",
                "SAP HANA",
                "Agile",
                "CI/CD",
                "Analytical Thinking",
                "Interpersonal Skills",
                "Communication Skills",
                "Microsoft Office",
                "3NF Data Modeling",
                "Coalesce"
            ],
            "with_experience": [
                "Snowflake (5+ years)",
                "ETL (5+ years)",
                "Data Warehousing (8+ years)"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Parimala",
        "email": "parimala@tetrahed.com",
        "jd": "From: Parimala, Tetrahed parimala@tetrahed.com Reply to: parimala@tetrahed.com HiHope you are doing good Role: Snowflake ArchitectLocation: RemoteDuration: ContractVisa: USC, GC, H1b & H4 EADClient: IBM – End Client ConfidentialExperience: 13-15+ years Job description: What’s Encouraged Daily: Build and maintain data models and data/solution pipelines to cater to analytical applications Work in a technical team through development, deployment, and application of applied, predictive and prescriptive analytics using data engineering, machine learning engineering and artificial intelligence. Design and optimize data structures in data management systems (Snowflake, GCP, HANA) to enable reporting analytics using Tableau/Power BI as well as AI/ML solutions. Determine transformation requirements and develop processes to bring structured and unstructured data from the source to a new physical Data Model How To Qualify: Technical Degree required. B.S or M.S in Computer Science, Business Analytics, Engineering Understanding of Data Engineering/processing, Business Intelligence and Advanced analytics using Teamcenter data Thorough understanding of the back-end models for Teamcenter8+ years of strong working knowledge of databases (Snowflake, MS-SQL, GCP, SAP HANA) 5+ years building scalable ETL pipelines with data processing and/or developing applications and data sources. Experience with the back-end data structures, tables, relationships, E-R relationship of Teamcenter and translating them to data warehouse constructs. Ability to define & build hierarchical relationships of Product Lifecycle Management like BOM, etc. in data warehouse like Snowflake. Communicate effectively with stakeholders regarding all facets of data warehousing solutions pertaining to PLM Teamcenter. Ability to architect & develop solutions pertaining to attributes, relationships for master data including slowly changing dimensions. Ability to architect & develop data-warehousing solutions for extended Product Lifecycle Management encompassing production cycle definitions of products, equipment, facilities, etc. Familiarity with the integration of Teamcenter & SAP as related to data warehousing solutions. Various phases of Unit, Integration & User Acceptance testing Familiarity with software architecture (data structures, data schemas, etc.) Software development skills and knowledge in Cloud based data engineering. CI/CD pipelines including ADO repos Experience with various frameworks and processes, such as Agile (Scrum, Kanban, etc.) Outstanding analytical thinking, interpersonal, oral, and written communication skills. Proficiency in the Microsoft Office suite Ability to prioritize and meet critical project timelines in a fast-paced environment. Self-motivated and team-oriented What Sets You Apart: Strong business domain knowledge in Product Lifecycle Management. Experience with 3NF data modeling Experience with transformation & development of data models in Snowflake. Experience with Coalesce Thanks & Regards, Parimala Technical Recruiterparimala@tetrahed.com",
        "source": "Email",
        "date_posted": "2024-10-16 11:44:33-05:00",
        "unique_id": "19296580b7050509",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "GCP Data Engineer"
    }
]