[
    {
        "company": "Delta System & Software, Inc.",
        "job_title": "GCP .NET Development Lead",
        "location": "Parsippany, NJ, USA",
        "full_location": {
            "city": "Parsippany",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "12+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".NET",
                "GCP",
                "Microservice architecture",
                "Kafka",
                "REST API Development"
            ],
            "primary": [
                "SOLID principles",
                "CI/CD tooling",
                "Docker",
                "Kubernetes",
                "Unit testing",
                "Service testing"
            ],
            "secondary": [
                "ASP.NET Core WEB API",
                "SQL Server",
                "DB2",
                "Stored procedures",
                "Performance tuning",
                "Agile methodology",
                "SCRUM",
                "SOAP services",
                "Test Driven Development"
            ],
            "all": [
                ".NET",
                "GCP",
                "Microservice architecture",
                "Kafka",
                "REST API Development",
                "SOLID principles",
                "CI/CD tooling",
                "Docker",
                "Kubernetes",
                "Unit testing",
                "Service testing",
                "ASP.NET Core WEB API",
                "SQL Server",
                "DB2",
                "Stored procedures",
                "Performance tuning",
                "Agile methodology",
                "SCRUM",
                "SOAP services",
                "Test Driven Development"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Vishal Sharma",
        "email": "vishal.sharma@delta-ssi.net",
        "jd": "Urgent opening for GCP .NET Development Lead, Hybrid: Parsippany NJJob title: GCP .NET Development Lead Duration: 12+ MonthsLocation: Hybrid: Parsippany NJMUST HAVE:12+ years of exp with .Net Development of highly scalable and resilient applications incorporating.SOLID programming principles.Strong proficiency in developing applications with GCP platform (i.e. GCP pub sub etc.).Experience with other cloud platforms.Deep architectural knowledge of microservice architecture & patterns, commonly used messaging patterns.Development experience with messaging platforms eg. Kafka Job Description:A GCP Development Lead is first and foremost an experienced software development leader who specializes in .NET C# development for GCP. You’ll be part of a team focused on delivering quality software for our clients.How We Will Help You:Joining our Microsoft practice is not only a job, but a chance to grow your career. We will make sure to equip you with the skills you need to produce robust applications that you can be proud of. Whether it is providing you with training on a new programming language or helping you get certified in a new technology, we will help you grow your skills so you can continue to deliver increasingly valuable work.Once You Are Here, You Will:Design independently within a defined architectureProvide input to the architectureUnderstand different architectural views (conceptual, logical, physical, and deployment)Review code assuring Definition of Done, coding standards, and good design principles are metOperate as a \"full-stack\" developer with expertise in new and legacy architecture stylesSet an example of a professional developerCoach and teach usage of Design Patterns, SOLID principles, and Architectural PatternsEstablish development environment setup for team from scratchCreate new hosting and deployment environments from scratch, or work with engineering in their creationEstablish new Continuous Integration, integrate with SCM, and set up buildsGuides the team in developing estimatesCommunicate with the client on new features and scope changeDefine technical approach, lead team in implementing itDesign features independentlyDeliver complex componentsDefine and manage tools and processes for teamProactively raise and solve issues with clientsBasic Qualifications:Masterful expertise in .NET/.NET Core, with more than 10 years of experience leading the development of highly scalable and resilient applications incorporating SOLID programming principles.Strong proficiency in developing applications with GCP platform (i.e. GCP pub sub etc.). Experience with other cloud platforms would be beneficial.Deep architectural knowledge of microservice architecture & patterns, commonly used messaging patterns.Development experience with messaging platforms eg. KafkaStrong Experience with REST API Development and platforms i.e., ASP.net core WEB APIExperience with relational and nosql databases i.e; SQL Server, DB2 etc.Familarity with writing stored procedures.Experience with performance tuning and troubleshooting of apps deployed in production.Experience with CI/CD tooling i.e. Jenkins, Azure Devops etcExperience with containerization technologies e.g. Docker, KubernetesProficient with unit and service testing.Experience with testing frameworks xunit, Nunit etc.Familiar with TDD (Test Driven Development)Preferred:Highly proficient implementing and consuming SOAP or REST servicesAdvanced debugging and troubleshooting tools and techniquesExpert database programming skillsExpertise in Object-Oriented Design and Development (SOLID principles)In-Depth understanding of Server operating systems and Cloud hosting models, and strong ability to establish new Continuous Integration, integrate with SCM, and setup buildsStrong experience with the Agile methodology and the SCRUM processExcellent written and verbal communication skillsPrior team leadership experience strongly preferred",
        "source": "Email",
        "date_posted": "2024-10-16 11:15:29-05:00",
        "unique_id": "19296be03f8005ac",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]