[
    {
        "company": "SANROSE Information Services, Inc",
        "job_title": "Business Process Consultant",
        "location": "Tallahassee, FL, USA",
        "full_location": {
            "city": "Tallahassee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "onsite",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Bachelor’s degree or Master’s Degree in Computer Science, Information Systems, Business Administration, or other related fields. Or equivalent work experience.",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "IT business analysis",
                "business process engineering",
                "strategic planning",
                "process management",
                "business systems requirements definition"
            ],
            "primary": [
                "Microsoft Visio",
                "SharePoint",
                "Microsoft 365 Office Suite",
                "business analyst software tools",
                "analytical skills",
                "problem-solving skills"
            ],
            "secondary": [
                "communication skills",
                "mentoring",
                "data collection and analysis",
                "mapping business processes",
                "project management",
                "fact finding research",
                "continuous improvement"
            ],
            "all": [
                "IT business analysis",
                "business process engineering",
                "strategic planning",
                "process management",
                "business systems requirements definition",
                "Microsoft Visio",
                "SharePoint",
                "Microsoft 365 Office Suite",
                "business analyst software tools",
                "analytical skills",
                "problem-solving skills",
                "communication skills",
                "mentoring",
                "data collection and analysis",
                "mapping business processes",
                "project management",
                "fact finding research",
                "continuous improvement"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Diwakar",
        "email": "recruiter1@sanrose.com",
        "jd": "From: Diwakar, SANROSE Information Services, Inc recruiter1@sanrose.com Reply to: recruiter1@sanrose.com Role: Business Process ConsultantOn-site at Tallahassee FLNo OPT, CPT, H1 TransferNeed PP Number for Submission Education: Bachelor’s degree or Master’s Degree in Computer Science, Information Systems,Business Administration, or other related fields. Or equivalent work experience. (Required)Required Experience: 10+ years of IT business analysis experience and 4 years of business process engineering experience. Knowledge of leveraging both IT solutions and business process improvements. Must demonstrate expertise in strategic planning, tactical execution, process management, and business systems requirements definition. Knowledge of advanced management principles and practices, methods of data collection and analysis. Knowledge of process engineering principles and practices. Proven communication skills, both orally and in writing, with technical and non- technical staff, and all levels of management. Skilled with Microsoft Visio, SharePoint, the Microsoft 365 Office Suite, and familiar with business analyst software tools. Skilled in working on one or more projects as a project lead. Must be able to mentor and coach junior staff. Must possess strong analytical and problem-solving skills. Ability to communicate complex ideas to technical and non-technical staff, as well as all levels of management, both orally and in writing. Ability to elicit requirements using interviews, document analysis, requirements workshops, surveys, and site visits. Ability to map business processes, use cases, tasks, and workflows. Ability to establish and maintain effective working relationships with others. Ability to work independently and in a team to meet deadlines. Ability to plan, organize, and coordinate multiple projects and work assignments. Ability to organize data into logical formats for presentation in reports, documents, and other written materials. Ability to conduct fact finding research. Ability to collect, evaluate, and analyze data to develop alternative recommendations, solve problems, document workflows, and other activities relating to the continuous improvement of processes. Goal oriented, action focused, pragmatic, and self-disciplined.Preference:Preferences will be given to candidates with the following: A financial background. Experience with the Florida Accounting Information Resource (FLAIR) application. Experience with the Florida Planning, Accounting, and Ledger Management (PALM) application. Candidates are required to attend in-person project meetings. Preference will be given to candidates that are local to Tallahassee, FL",
        "source": "Email",
        "date_posted": "2024-10-16 07:26:08-05:00",
        "unique_id": "192958edcae634a0",
        "emp_type": [
            "onsite",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]