[
    {
        "company": "Pivotal Technologies",
        "job_title": "Business Analyst",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Associate’s Degree or some college",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "$55/hr"
        },
        "skills": {
            "core": [
                "Exposure to Complex IT web Applications",
                "Experience in a professional office environment",
                "Experience as a business analyst supporting a software development project",
                "Ability to lead meetings, conduct training & information sessions",
                "Proficiency with MS Office",
                "Experience working as a liaison between the development team and project manager or business client",
                "Experience with Azure DevOps"
            ],
            "primary": [
                "Knowledge and understanding of the Software Development Lifecycle",
                "Project management skills and knowledge in project management and related methodologies",
                "Experience with Microsoft SharePoint",
                "Experience with Salesforce Platform",
                "Experience with MS Dynamics"
            ],
            "secondary": [],
            "all": [
                "Exposure to Complex IT web Applications",
                "Experience in a professional office environment",
                "Experience as a business analyst supporting a software development project",
                "Ability to lead meetings, conduct training & information sessions",
                "Proficiency with MS Office",
                "Experience working as a liaison between the development team and project manager or business client",
                "Experience with Azure DevOps",
                "Knowledge and understanding of the Software Development Lifecycle",
                "Project management skills and knowledge in project management and related methodologies",
                "Experience with Microsoft SharePoint",
                "Experience with Salesforce Platform",
                "Experience with MS Dynamics"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Ankit Upadhyay",
        "email": "ankit.upadhyay@pivotal-technologies.com",
        "jd": "From: Ankit upadhyay, Pivotal Technologies ankit.upadhyay@pivotal-technologies.com Reply to: ankit.upadhyay@pivotal-technologies.com Position Business AnalystClient Name Datasphere/ (Michigan Lifelong Education)Location Lansing, MIDuration 6+ MonthsRate $55/hr C2CVisa USC NOTE: Local candidates only. NO RELOCATION ALLOWED. Hybrid Role with 2 days onsite from day 1 - Tuesday and Wednesday Local ONLY.Note- Please ask for 3 previous employment references. Description:Our client is looking for a Business Analyst to assist with the Agency Services Application Development and Support team who supports multiple applications. This role would consist of supporting maintenance activities for applications as well as multiple larger projects.They are looking for someone who understands and has experience with the software development lifecycle as they will be managing work requests to support operational support needs for web applications and gather requirements for project initiatives. This role is the liaison between the technical team and the business client. This will be about 90% of the time for this resource. This is a senior position so the selected candidate will possess leadership skills including but not limited to the ability to delegate tasks to the team, effective communication and be comfortable leading requirement meetings with business and other technical resources. TasksFacilitates meetings with the technical team and business client.Gathers requirements and project specifications by leading requirement sessions independentlyMaintain backlog of work items in Azure DevOpsManage project tasks, timelines, and communication between business product owner and development team associated with the Change Management lifecycleTrack sprints and ticket progress in Azure DevOpsEnsures the team is adhering to the department change management policiesMaintains documentation on the project SharePoint Site.Must be detail oriented and a critical thinkerProvide management with information such as project status reports and resource demand projections. Skills Required5 Years - Exposure to Complex IT web Applications, within the past 5 years5 Years - Experience in a professional office environment3 Years - Experience in a role, as a business analyst, supporting a software development project, in the past 5 years3 Years - Ability to lead meetings, conduct training & information sessions, communicate at a level appropriate to the audience, make oral and written reports and presentations3 Years - Proficiency with MS Office2 Years - Experience working as a liaison between the development team and project manager or business client in a software development project6 Months - Experience with Azure DevOpsAssociate’s Degree or some college (Please include on Resume) Skills Desired2 years - Knowledge and understanding of the Software Development Lifecycle6 Months - Project management skills and knowledge in project management and related methodologies6 Months - Experience with Microsoft SharePoint6 Months - Experience with Salesforce Platform6 Months - Experience with MS Dynamics Thanks & Regards, ANKIT UPADHYAY Technical RecruiterOffice: +1 (703) 570-8775 (Ext-217)Email- Ankit.Upadhyay@pivotal-technologies.comConnect with me:-- linkedin.com/in/ankit-upadhyay-a689a1232",
        "source": "Email",
        "date_posted": "2024-10-16 13:11:04-05:00",
        "unique_id": "19296a7429e2dec0",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]