[
    {
        "company": "Technocraft solutions",
        "job_title": "Senior .Net full stack developer (Locals Only)",
        "location": "Raleigh, NC, USA",
        "full_location": {
            "city": "Raleigh",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "#749557(NCDPI)",
            "experience_required": "5 years",
            "degree_required": "Bachelor’s degree in computer science, other related degrees, or equivalent application development experience.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "VB6",
                "VBScript",
                "C#",
                "T-SQL",
                "PL/SQL",
                "ASP.NET",
                "Entity Framework",
                "ADO.NET",
                "Visual Studio",
                "SQL Management Studio",
                "design patterns",
                "database normalization",
                "ETL processing",
                "SQL Server Integration Services",
                "GIT",
                "HTML",
                "CSS",
                "JavaScript"
            ],
            "primary": [
                "ASP.NET Core",
                "Razor Pages",
                "MVC",
                "jQuery",
                "React",
                "Oracle APEX"
            ],
            "secondary": [],
            "all": [
                "VB6",
                "VBScript",
                "C#",
                "T-SQL",
                "PL/SQL",
                "ASP.NET",
                "Entity Framework",
                "ADO.NET",
                "Visual Studio",
                "SQL Management Studio",
                "design patterns",
                "database normalization",
                "ETL processing",
                "SQL Server Integration Services",
                "GIT",
                "HTML",
                "CSS",
                "JavaScript",
                "ASP.NET Core",
                "Razor Pages",
                "MVC",
                "jQuery",
                "React",
                "Oracle APEX"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Harsh Tiwari",
        "email": "harsh.tiwari@technocraftsol.com",
        "jd": "From: Harsh Tiwari, Technocraft solutions harsh.tiwari@technocraftsol.com Reply to: harsh.tiwari@technocraftsol.com Job Title: Senior .Net full stack developer (Locals Only)Job ID: #749557(NCDPI)Location : Raleigh, NC (Onsite)Duration : 12+ Months Note******This is an on-site position.Candidate must be able to attend an in-person interview. Description:Typical Experience: 60-84 monthsFull Stack .NET Developer to help Migrate legacy Applications.You will work on a small team to migrate legacy applications developed in classic ASP (ActiveX), .NET Framework, and T-SQL to full stackASP.NET Core applications. We need a developer that can pull business logic from a code base written in VB6, classic asp, and T-SQL. Then work with businessowners to ensure the rules still apply or make any necessary changes. In any given day you might be asked to upgrade T-SQL scripts, migrate dynamic SQL built in VB6 to a stored procedure, write Web API REST services, build webpages with Razor Pages/MVC, debug an ELT job, document a process. We also have Oracle databases and APEX, which is Oracle’s rapid development framework. Integration work with Oracle/APEX is possible. A good understanding of PL/SQL and APEX is a plus.Responsibilities and Duties· Design and develop ASP.NET Core web applications using the .NET Core development stack.· Work within an older code base that has been maintained by many developers over many years.· Troubleshoot code using standard debugging tools like the Visual Studio debugger and the browser’s dev tools to resolve application errors.· Use GIT source control management in a team environment.· Optimize large and complicated SQL scripts.· Collaborate and communicate effectively with business owners and team members.· Document existing and new application features.Job Requirements· Minimum 5 years of programing experience.· Proficient in programming languages such as VB6,VBScript, C#, T-SQL, and PL/SQL· Experienced in ASP.NET development (.NET Framework and .NET Core) with Entity Framework and/or ADO.NET.· Experienced with Visual Studio and SQL Management Studio development environments.· Solid understanding of design patterns and database normalization.· Proven experience with extract, transform, and load (ETL) processing and SQL Server tools such as Integration Services, BCP.exe, and T-SQL Bulk Load.· Working knowledge of scheduled jobs including SQL Agent and Windows Scheduled Tasks. · Experienced with GIT source control management.· Strong understanding of browser side development including HTML, CSS, JavaScript· Familiar with JavaScript libraries for building g user interface such as jQuery and React· Oracle APEX and PL/SQL experience is a plus.· Bachelor’s degree in computer science, other related degrees, or equivalent application development experience. Required/Desired Skills (Candidate Must fill skills matrix) SkillRequired /DesiredAmountof ExperienceProficient in programming languages such as VB6, VBScript, C#, T-SQL, and PL/SQLRequired5YearsExperienced in ASP.NET development (.NET Framework and .NET Core) with Entity Framework and/or ADO.NET.Required5YearsExperienced with Visual Studio and SQL Management Studio development environments.Required5YearsSolid understanding of design patterns and database normalization.Required5YearsProven experience with extract, transform, and load (ETL) processing and SQL Server tools such as Integration Services, BCP.exe, and T-SQL Bulk LoadRequired5YearsWorking knowledge of scheduled jobs including SQL Agent and Windows Scheduled Tasks. Required5YearsExperienced with GIT source control management.Required5YearsStrong understanding of browser side development including HTML, CSS, JavaScriptRequired5YearsFamiliar with JavaScript libraries for building user interface such as jQuery and ReactRequired5YearsOracle APEX and PL/SQL experience is a plus.Highly desired5Years",
        "source": "Email",
        "date_posted": "2024-10-16 15:01:35-05:00",
        "unique_id": "192979da571fa482",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]