[
    {
        "company": "Vyze Inc",
        "job_title": "Project Manager",
        "location": "Tallahassee, FL, USA",
        "full_location": {
            "city": "Tallahassee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "7 years",
            "degree_required": "Bachelor's in Computer Science or Management Information Systems",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management Professional certification (PMP)",
                "Agile Methodologies",
                "Dev Ops Methodologies",
                "PMI standards",
                "Microsoft Dynamics 365",
                "Microsoft Power Platform"
            ],
            "primary": [
                "IT project management",
                "Software development programs/projects",
                "Cross-divisional project management",
                "Cloud solution development",
                "Legislative Budget Requests (LBR)",
                "Statements of Work (SOW)",
                "Operational Work Plans (OWP)",
                "Requirements gathering",
                "Joint Application Design sessions",
                "State Purchasing rules",
                "MS SharePoint",
                "MS Teams"
            ],
            "secondary": [
                "Program Management Professional (PgMp)",
                "Information Technology purchasing processes",
                "Solution Definition Framework",
                "ISDM"
            ],
            "all": [
                "Project Management Professional certification (PMP)",
                "Agile Methodologies",
                "Dev Ops Methodologies",
                "PMI standards",
                "Microsoft Dynamics 365",
                "Microsoft Power Platform",
                "IT project management",
                "Software development programs/projects",
                "Cross-divisional project management",
                "Cloud solution development",
                "Legislative Budget Requests (LBR)",
                "Statements of Work (SOW)",
                "Operational Work Plans (OWP)",
                "Requirements gathering",
                "Joint Application Design sessions",
                "State Purchasing rules",
                "MS SharePoint",
                "MS Teams",
                "Program Management Professional (PgMp)",
                "Information Technology purchasing processes",
                "Solution Definition Framework",
                "ISDM"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Ashutosh Parashar",
        "email": "ashutosh.parashar@vyzeinc.com",
        "jd": "From: ashutosh parashar, vyzeinc ashutosh.parashar@vyzeinc.com Reply to: ashutosh.parashar@vyzeinc.com Job Description -Position: Project ManagerDuration: 6 MonthsLocation: Tallahassee, FL | Local candidates are preferred, and hybrid work may be considered.Resume shall not exceed three (3) pages in length.\"Note: Please send self-certification and a completed skills matrix with resumes. The self-certification must be fully completed and signed by the candidate for us to send their resume to our client In addition, we will need three (3) Professional References for each candidate we submit. Our client would contact Reference.Minimum QualificationsAbility to communicate effectively (verbally and in writing) with Department staff. Project Management Professional certification (PMP). A minimum of seven (7) years of IT project management experience that includes software development programs/projects. Experience with Agile Methodologies. Experience with Dev Ops Methodologies. A minimum of five (5) years of experience managing projects in accordance with PMI’s standards as presented in A Guide to the Project Management Body of Knowledge (PMBOK Guide). A minimum of three (3) years of experience managing large, cross-divisional, and cross-functional software development programs/projects. Preferred ExperienceExperience leading Microsoft Dynamics 365 or MicrosoftPower Platform development programs/projects. Program Management Professional (PgMp). Experience leading cloud solution development programs/projects leveraging other low/no-code platforms. Experience communicating with IT leadership and business leadership. Experience preparing Legislative Budget Requests (LBR), Statements of Work (SOW), and Operational Work Plans (OWP). Experience facilitating requirements gathering and Joint Application Design sessions. Experience with State Purchasing rules, processes, and documentation. Experience with Information Technology purchasing processes and practices. Experience managing documentation in MS SharePoint. Experience managing utilizing MS Teams for communications and document organization. Experience managing projects for a state of FloridaInformation Technology PMO; and Experience creating a Solution Definition Framework or ISDM. Educational QualificationsA minimum of a bachelor's degree in a computer sciences field or management information systems; or five years of work experience in information technology, systems analysis, management analysis, program planning, program research, or program evaluation.",
        "source": "Email",
        "date_posted": "2024-10-16 11:51:59-05:00",
        "unique_id": "192965eda7448c30",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]