[
    {
        "company": "Department of Health Care Finance",
        "job_title": "Senior Data Steward & IT Project Lead – Data Governance and IT Operations",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "16+ years",
            "degree_required": "Bachelor’s degree in Information Technology or related field or equivalent experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Data Governance",
                "IT Project Management",
                "Data Quality Management",
                "Data Security",
                "Data Integration"
            ],
            "primary": [
                "Data Stewardship",
                "Risk Management",
                "Data Analysis",
                "Data Standards",
                "Data Architecture"
            ],
            "secondary": [
                "Microsoft Office",
                "Statistics",
                "Research Methodology",
                "Business Intelligence",
                "Data Warehousing",
                "Regulatory Compliance",
                "Communication Skills",
                "Problem-Solving Skills"
            ],
            "all": [
                "Data Governance",
                "IT Project Management",
                "Data Quality Management",
                "Data Security",
                "Data Integration",
                "Data Stewardship",
                "Risk Management",
                "Data Analysis",
                "Data Standards",
                "Data Architecture",
                "Microsoft Office",
                "Statistics",
                "Research Methodology",
                "Business Intelligence",
                "Data Warehousing",
                "Regulatory Compliance",
                "Communication Skills",
                "Problem-Solving Skills"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "sangya kumari nahak",
        "email": "sangya@adventatech.com",
        "jd": "From: sangya kumari nahak, adventa sangya@adventatech.com Reply to: sangya@adventatech.com NEED: 16+years of experience. Coordinates IT project management, engineering, maintenance, QA, and risk managementTitle: Senior Data Steward & IT Project Lead – Data Governance and IT OperationsLocation: RemoteDuration: 12 monthsVisa: Asylum,CITIZEN,E3,EB3EAD,G4,GC EAD,GREEN CARD,H4 EAD,J2 EAD,L2 EAD,OPT EAD,TN Permit,TPS EADMOI: SkypeClient : Department of Health Care Finance Short Description:16+years of experience. Coordinates IT project management, engineering, maintenance, QA, and risk managementComplete Description:The Data Steward will play a critical role to support the work of the DCAS Program Administration, Executive Steering Committee and DCAS Stakeholders. Under the aegis of the DCAS Chief Data Officer, the DCAS Data Steward is responsible for: Operational OversightOne of the key duties of the Data Stewards is overseeing the life cycle of a DCAS data. Specifically, the Data Steward is responsible for defining and implementing policies and procedures for the day-to-day operational and administrative management of systems and data —including the intake, storage, processing, and transmission of data to internal and external systems. As a part of the oversight for institutional data, the Data Steward must be accountable to define and document data and terminology ina relevant glossary. This includes ensuring that each critical data element has a clear definition and is still in use.•Responsible for developing and implementing strategies to assess and develop rules to maintain the quality, integrity and reliability of data.•Coordinate cross-agency efforts and decisions that ensure official agency records requirements, privacy, security and other related requirements are met.•Provide oversight to ensure the data issues, needs and requirements are documented. Data QualityThe Data Steward is ultimately responsible for establishing data-quality metrics and requirements, including defining the values, ranges, and parameters that are acceptable for each data element. They also work with the DCAS Data Research, Analytics, and Management team to establish procedures for detection and correction of data-quality issues and collaborate to establish policies, procedures, and internal controls affecting the quality of data. In addition, the Data Steward engages in the ongoing and detailed evaluation of data quality, the identification of anomalies and discrepancies, and the contribution of expertise to understand the root cause and implement corrective measures.•Coordinate with DCAS program teams and DCAS Stakeholder Agencies to ensure the quality and integrity of the DCAS data elements (both content and metadata) to support the implementation of DCAS.•Facilitate the creation of data standards based on business rules, data access security requirements, and retention of legacy data. Privacy, Security, and Risk ManagementOne of the most critical aspects for the Data Stewards is the protection of data. The incumbent must establish guidelines and protocols that govern the proliferation of data to ensure that privacy controls are enforced in all processes. To be effective, the Data Steward must compile retention, archival, and disposal requirements and ensure compliance with institutional policy and regulations. Accordingly, the Data Steward will establish and implement data curation practices to ensure that the life span of data is commensurate with requirements. However, the Data Steward must protect data while striking a balance between transparency and privacy.•Review agency and interagency data-related work products.•Coordinate cross-agency efforts and decisions that ensure official agency records requirements, privacy, security and other related requirements are met for data. Policies and ProceduresThe Data Steward defines policies and procedures for access to DCAS data, including the criteria for authorization based on role and/or the individual. Working closely with DCAS IT, Privacy and PMO to establish controls, the Data Steward evaluates any suspected or actual breaches or vulnerabilities in confidentiality, integrity, or availability and report them to management or information security personnel.•Monitor and analyze the application of federal, state and local data requirements, standards and rules (internal and external).•Coordinate efforts with stakeholder agencies to interpret business needs into applications and derive data requirements that represent the business entities' needs regarding accessibility, completeness, timeliness, desired attributes and relationship to other data entities when appropriate•Present findings and recommendations to DCAS leadership, Executive Steering Committee and other stakeholders regarding recommended changes to improve operating practices, accountability, or transparency.•Other duties as assigned. Other Significant FactsPreferred Skills include:•Knowledge of good data management principles, concepts and practices;•Knowledge of how to determine business data requirements, create data standards and business rules;•Knowledge of human services and health care programs;•Ability to work with multiple agency stakeholders that may have common and unique agency or program-specific data requirements;•Familiarity with public policy issues related to human services data requirements;•Ability to analyze complex, abstract issues in a logical, structured way;•Excellent written and oral communication skills•Proficient in the use of Microsoft Office(Word, Excel, Power Point and Outlook);•Knowledge of statistics and/or research methodology.•Analytical skills: outstanding analytical and problem-solving abilities.•Familiarity with business information generation and analysis methods.•Ability to effectively drive business, culture and technology change in a dynamic and complex operating environment.•Gravitas to develop a framework for information and data governance, as well as to sell and embed it in all levels of the business.•Excellent oral and written communication skills, including the ability to explain digital concepts and technologies to business leaders, as well as business concepts to technologists; the ability to sell ideas and process internally at all levels, including the board and investors.•Demonstrated knowledge of data structure desired, but not essential; information systems/tools, and related software and data management; enterprise content management, and record-keeping policies and practices in a complex organizational environment.•Broad experience desired, but not essential, in multiple domain areas, such as data warehousing, business intelligence (BI),data governance, data architecture, data integration, data classification, data strategy, data quality management, data security and privacy, MDM, data standards, regulatory compliance, and enterprise architecture frameworks.•Preference for candidates with knowledge and experience with government---------------------------------------------CONTRACT JOB DESCRIPTIONResponsibilities:1. Coordinates IT project management, engineering, maintenance, QA, and risk management.2. Plans, coordinates, and monitors project activities.3. Develops technical applications to support users.4. Develops, implements, maintains and enforces documented standards and procedures for the design, development, installation, modification, and documentation of assigned systems.5. Provides training for system products and procedures.6. Performs application upgrades.7. Performs, monitoring, maintenance, or reporting on real- time databases, real-time network and serial data communications, and real-time graphics and logic applications.8. Troubleshoots problems.9. Ensures project life-cycle is in compliance with District standards and procedures. Minimum Education/Certification Requirements:Bachelor’s degree in Information Technology or related field or equivalent experience",
        "source": "Email",
        "date_posted": "2024-10-16 11:27:03-05:00",
        "unique_id": "19296494a2d8f528",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]