[
    {
        "company": "Texas Department of Health and Human Services",
        "job_title": "Database Administrator",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "8 Required",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle Database 12c or higher",
                "Oracle RAC",
                "Golden Gate",
                "Advanced SQL",
                "Shell scripting",
                "Supporting multi-terabyte database",
                "Advanced performance tuning"
            ],
            "primary": [
                "Experience with Microsoft O365 applications (Word, Excel, PowerPoint, Visio)",
                "Experience with MS Team and Channel communication with a large team"
            ],
            "secondary": [
                "Experience working with a public sector organization (Federal, State, or Local Government)",
                "Experience with SharePoint",
                "Experience with Jira",
                "Experience working with the Scrum framework"
            ],
            "all": [
                "Oracle Database 12c or higher",
                "Oracle RAC",
                "Golden Gate",
                "Advanced SQL",
                "Shell scripting",
                "Supporting multi-terabyte database",
                "Advanced performance tuning",
                "Experience with Microsoft O365 applications (Word, Excel, PowerPoint, Visio)",
                "Experience with MS Team and Channel communication with a large team",
                "Experience working with a public sector organization (Federal, State, or Local Government)",
                "Experience with SharePoint",
                "Experience with Jira",
                "Experience working with the Scrum framework"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Roshan Singh Yadav",
        "email": "roshan.yadav@tekinspirations.com",
        "jd": "From: Roshan singh yadav, Tek Inspirations roshan.yadav@tekinspirations.com Reply to: roshan.yadav@tekinspirations.com Hi,Hope you are doing well.Have a look at role. Let me know your view. Job Description -Title - Database Administrator Duration - Multi Years ( Contract ) Location - 100% Remote for TEXAS CANDIDATES ONLY Client -- Texas Department of Health and Human Services Visa: GC, USC Interview - Video call Job Description: The critical duties will be advanced performance tuning on complex processes on multi-terabyte databases with heavy transaction volumes. Initial duties include installing Oracle Database 19c, Oracle RAC, and Golden Gate to establish a new database tier and capacity planning for the ERP upgrade project. Core duties include the standard administration and support responsibilities of backup, recovery, monitoring, troubleshooting, tuning, and assisting the upgrade project team as needs arise. This position requires work outside of standard business hours depending on the project activities and system maintenance schedule to minimize the impact on the project team's productivity. Must demonstrate and excel in communicating and working with a diverse team with collaboration tools competently in a remote work environment. Also, the candidate must be able to estimate work, set deadlines, and prioritize work to align with the project schedule. MUST HAVE 8 Required Oracle Database 12c or higher 8 Required Oracle RAC 8 Required Golden Gate 8 Required Advanced SQL 8 Required Shell scripting 8 Required Supporting multi-terabyte database 8 Required Advanced performance tuning 8 Required (at least 4) Experience with Microsoft O365 applications (Word, Excel, PowerPoint, Visio) 8 Required (at least 2) Experience with MS Team and Channel communication with a large team Required4 Preferred Experience working with a public sector organization (Federal, State, or Local Government) 2 Preferred Experience with SharePoint 1 Preferred Experience with Jira 1 Preferred Experience working with the Scrum framework Regards, Roshan Singh YadavTechnical RecruiterTEK Inspirations LLC | 13573 Tabasco Cat Trail, Frisco, TX 75035.Email: - roshan.yadav@tekinspirations.com",
        "source": "Email",
        "date_posted": "2024-10-16 14:46:10-05:00",
        "unique_id": "19296fe5188298c3",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Oracle DBA"
    }
]