[
    {
        "company": "ePeople Technologies Inc",
        "job_title": "Lead Snowflake Data Engineer",
        "location": "Parsippany, NJ, USA",
        "full_location": {
            "city": "Parsippany",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "",
            "experience_required": "10+ years of experience in data engineering or related fields, with at least 3-4 years in a leadership role.",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "Contract",
            "rate": ""
        },
        "skills": {
            "core": [
                "Snowflake",
                "data modeling",
                "SQL optimization",
                "performance tuning"
            ],
            "primary": [
                "ETL/ELT tools",
                "Apache Airflow",
                "Talend",
                "Informatica",
                "Python",
                "Java",
                "Scala"
            ],
            "secondary": [
                "data governance",
                "security",
                "compliance best practices"
            ],
            "all": [
                "Snowflake",
                "data modeling",
                "SQL optimization",
                "performance tuning",
                "ETL/ELT tools",
                "Apache Airflow",
                "Talend",
                "Informatica",
                "Python",
                "Java",
                "Scala",
                "data governance",
                "security",
                "compliance best practices"
            ],
            "with_experience": []
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Manish Sharma",
        "email": "manish@epeopletech.com",
        "jd": "From: Manish, epeopletech manish@epeopletech.com Reply to: manish@epeopletech.com Hi,We have an urgent opening with “Lead Snowflake Data Engineer ” .and I have sent you job description, please go through it and let me know your comfort with it and also send me your updated resume ASAP Position: Lead Snowflake Data Engineer Location: 255 Baldwin Road, Suite 205, Parsippany, NJ 07054Duration: Contract Core Responsibilities:Lead the design, development, and implementation of data pipelines on the Snowflake platform.Mentor and guide a team of data engineers in best practices and technical skills.Collaborate with data architects and stakeholders to define data requirements and ensure alignment with business goals.Optimize data workflows and troubleshoot performance issues.Defination,architecture,validation and implementation of data pipelines for party cloud platformData modeling oriented to specific business requirements and projectsOptimization for EDW snowflake platform such as improve performance, Reduce consumption, and explode technical capabilities, simplifying data models.Development of data pipelines of automation including query refactoring, Framework Migration, DBT Airflow Development.Data Democratization and self serviceAnalyze current Data framework for business analytics reporting, implement best practices and governance process implementationRequired Skills:Extensive experience with Snowflake, including data modeling, SQL optimization, and performance tuning.Proficiency in ETL/ELT tools (e.g., Apache Airflow, Talend, Informatica).Strong programming skills in languages such as Python, Java, or Scala.Familiarity with data governance, security, and compliance best practices.Experience:10+ years of experience in data engineering or related fields, with at least 3-4 years in a leadership role.Proven track record of managing complex data projects from inception to delivery.Certifications:Snowflake Certified Data Engineer or relevant Snowflake certifications.Additional certifications in cloud platforms (AWS, Azure, or GCP) are a plus.Soft Skills:Excellent leadership and communication skills.Strong analytical and problem-solving abilities.Ability to work collaboratively in a fast-paced environment. Thanks & Regards Manish SharmaePeople Technologies Inc255 Baldwin Road, Suite 205,Parsippany, NJ 07054Email:-Manish@epeopletech.comLinkedin: linkedin.com/in/manish-sharma-46aa1a21ahttp://www.epeopletech.comP Go Green! Please do not print this e-mail unless necessary Note: ePeople Technologies Inc is an Equal Employment Opportunity employer. All qualified applicants will receive consideration for employment without any discrimination. All applicants will be evaluated solely on the basis of their ability, competence, and performance of the essential functions of their positions. We promote and support a diverse workforce at all levels in the company. This is not an unsolicited mail and if it is not intended for you or you are not interested in receiving our e-mails please forward this email to with \"remove\" in the subject line and mention all the e-mail addresses to be removed with any e-mail addresses, which might be diverting the e-mails to you. We are extremely sorry if our email has caused any inconvenience to you.",
        "source": "Email",
        "date_posted": "2024-09-30 08:08:30-05:00",
        "unique_id": "192430b963a511b8",
        "tag": "GCP Data Engineer"
    }
]