[
    {
        "company": "GAC Solutions",
        "job_title": "MS Dynamics 365 Technical Business Analyst",
        "location": "NYC / NEW YORK / USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "hybrid"
            ],
            "job_code": "",
            "experience_required": "8–12 years",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "6-12 months",
            "rate": ""
        },
        "skills": {
            "core": [
                "MS Dynamics 365 CRM",
                "Banking and Financial Services",
                "Data migration",
                "Integration architecture"
            ],
            "primary": [
                "Mulesoft",
                "REST",
                "OData",
                "SSIS",
                "Azure Data Factory"
            ],
            "secondary": [
                "Workflows",
                "Plugins",
                "Form Customization",
                "CRM Administration"
            ],
            "all": [
                "MS Dynamics 365 CRM",
                "Banking and Financial Services",
                "Data migration",
                "Integration architecture",
                "Mulesoft",
                "REST",
                "OData",
                "SSIS",
                "Azure Data Factory",
                "Workflows",
                "Plugins",
                "Form Customization",
                "CRM Administration"
            ],
            "with_experience": [
                "Requirement gathering",
                "Analysis",
                "Workshop facilitation",
                "User stories",
                "Change request impact analysis",
                "Agile methodologies"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Justin Davis",
        "email": "justin@gacsol.com",
        "jd": "From: Justin Davis, GAC Solutions justin@gacsol.com Reply to: justin@gacsol.com Hi, I hope you're doing well! Role Name: MS Dynamics 365 Technical Business Analyst Location: NYC / NEW YORK / Hybrid 6-12 months JOB DESCRIPTION: Minimum 8–12-year experience in MS Dynamics 365 CRM Customer Engagement with knowledge in Banking and Financial Services domain Good understanding on capabilities of D365 Sales, Service, Dataverse, and Power apps Experience in requirement gathering, analysis, and in conducting workshops to drive requirements design by engaging Business Technical stakeholders Facilitating the review and approval of requirements from all stakeholders Subject matter knowledge in integration architecture and the ability to map integration pattern to functional usage. Experience in MS CRM & 3rd party Integration using Middleware Tools (Mulesoft)/ API's(REST, ODATA Web API's) /SSIS packages. Experience in data migration– data analysis, data mappings, data harmonization using OOB and third party tools, preferable experience in Azure Data Factory. Experience in data migration and translation using middleware and Dynamics 365 CRM out of the box data import process Experience in data analysis and validation with CRM dynamics configuration rules Exposure in Workflows Plugins Form Customization and CRM Administration Writing user stories conducting grooming sessions and story walkthroughs Giving demo to the Product Owner and other stakeholders for final sign off Preparation of use case diagrams, UMLs Sequence diagrams, and Visio flows Authoring User Stories, grooming Integration backlog, identify dependencies and sequence the work production. Work closely with the team to define the backlog and the sequence of implementation of the backlog Impacts analysis of change requests on the existing business flows Help the POs decide the fitment of those change requests into existing business flows without additional development effort Participate in sprint planning, review backlog refinement, and story grooming Contribute to the transfer of functional requirements to development and test teams Stay abreast on updates and new releases in CRM technologies and able to educate end-users on CRM functions Perform system integration or user acceptance testing Conduct application-level testing to certify the features Thanks, Justin Davis Sr Technical Recruiter E: justin@gacsol.com",
        "emp_type": [
            "full-time",
            "hybrid"
        ],
        "source": "Email",
        "date_posted": "2024-09-30 16:38:50-05:00",
        "unique_id": "19244f9d69fd9ec7",
        "tag": "BA/Scrum Master/PM"
    }
]