[
    {
        "company": "Quantum World Technologies Inc.",
        "job_title": "Engineer",
        "location": "Charlotte, NC, USA",
        "full_location": {
            "city": "Charlotte",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "onsite"
            ],
            "job_code": "",
            "experience_required": "6-8 years",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "",
            "rate": ""
        },
        "skills": {
            "core": [
                "Python",
                "Selenium",
                "Cyara",
                "Node.js",
                "Kore.ai",
                "AI",
                "NLP",
                "ML",
                "Chatbots"
            ],
            "primary": [
                "Python",
                "Selenium",
                "Cyara"
            ],
            "secondary": [
                "Node.js",
                "Java",
                "JavaScript",
                "AWS",
                "GCP",
                "Azure"
            ],
            "all": [
                "Python",
                "Selenium",
                "Cyara",
                "Node.js",
                "Kore.ai",
                "AI",
                "NLP",
                "ML",
                "Chatbots",
                "Unit Testing",
                "Linux",
                "Unix",
                "REST",
                "SOAP",
                "Cloud platforms",
                "Conversational AI",
                "IVR Technologies"
            ],
            "with_experience": [
                "Python",
                "Selenium",
                "Cyara"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Susheel Maurya",
        "email": "susheel@quantumworldit.com",
        "jd": "Greeting, I hope all is well with youFor the following, Quantum World IT is seeking the best consultant profile. Please respond with your most recent resume if you are considering new opportunities. Role name: Engineer Role Description: • Provides subject matter expertise in testing bots using Kore.ai across domains (voice, web agent assist). • Expertise in testing for bots across chat, voice and agent assist. • Expertise in troubleshooting Kore.ai errors. • Expertise in verifying business requirements • Ability to lead technical testing sessions with cross-functional teams (developers, UX designers, data analysts, product owners) • Willingness to provide guidance and support as testers, data scientists, ux designers are learning this new way of working. • Provides subject matter expertise for unit and integration testing for features developed on the Kore.ai platform. • Assistance in creating runbooks and documenting production support guidelines based on experience at other firms. • Serves as a Kore technical ambassador as the Vanguard team identifies Kore defects and / or Kore feature requests. • Participates in design, code, and test inspections throughout the life cycle to identify issues. • Explains technical considerations at related meetings, including those with internal departments. • Writes and elevates code using Vanguard’s SDLC tools and process. • Consults on implementation of knowledge and call summarization features, inclusive of Gen AI • Support during production incidents involving the Kore platform and features running on the platform • Provide Subject matter expertise in monitoring and telemetry tools and provide guidance in defining SLO/SLA for each bot. • Other duties as agreed to by both parties • Will work in high traffic / real-time Enterprise apps • Will be a part of Agile Methodologies, Design Patterns, and Software Revision Control Systems • Will gain experience in scaling applications and database infrastructure • Able to lead the team from technical, managerial leadership perspective • Inspire & motivate team-mates and be a cross-functional go-to-person • Implementing proofs of concept, prototypes and production-grade software Competencies: Digital : Python, Selenium Experience (Years): 6-8 Essential Skills: Must have strong expertise in either Python, Node.js● Skillset should have the following Cyara testing tool, Selenium, Unit Testing Using Python● Familiarity with the automation testing tools technologies, Performance , Load, Smoke, Integration testing Knowledge of AI, NLP, ML, Chat bots will be an added advantage.● Knowledge on Linux / Unix flavors● Experience in Web Services using REST, SOAP● Knowledge of different authentication and authorization techniques● ● Strong knowledge of code documentation and handover● Experience building scalable, high-available mission-critical platforms● Exposure to any of the cloud platforms like AWS/GCP/Azure Desirable Skills: • Min 5+ yrs hands on Automation Testing tools ike Selenium, Cyara , Python etc• Familiarity with KORE.ai, SmartAssist, IVR Technologies, Java, Java Script, Python is preferred• Good experience on Conversational AI Platform• Exposure to Gen AI and its concepts with conversational AI Products• Good experience in understanding the business requirements and creating chatbots in Kore.ai XO Platform, Search Assist• Experience on Node Js used for chatbot backend technology• Good experience in Design and Solution Architecture for creating chatbots & voicebots using Kore.ai",
        "emp_type": [],
        "source": "Email",
        "date_posted": "2024-09-30 08:43:39-05:00",
        "unique_id": "192432bc78a87400",
        "tag": "Python Dev"
    }
]