[
    {
        "company": "Anveta, Inc.",
        "job_title": "Angular Java Full-Stack Developer",
        "location": "Decatur, GA 30034, USA",
        "full_location": {
            "city": "Decatur",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "hybrid"
            ],
            "job_code": "",
            "experience_required": "8+ years",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "6+ Months",
            "rate": ""
        },
        "skills": {
            "core": [
                "Angular",
                "Java",
                "JavaScript",
                "TypeScript",
                "CSS 3",
                "SCSS",
                "HTML 5",
                "ES6+",
                "Spring Boot",
                "RESTful APIs"
            ],
            "primary": [
                "Angular",
                "Java",
                "UI/UX"
            ],
            "secondary": [
                "Bootstrap",
                "Git",
                "SQL",
                "AWS",
                "Azure Cloud"
            ],
            "all": [
                "Angular",
                "Java",
                "JavaScript",
                "TypeScript",
                "CSS 3",
                "SCSS",
                "HTML 5",
                "ES6+",
                "Spring Boot",
                "RESTful APIs",
                "Bootstrap",
                "Git",
                "SQL",
                "AWS",
                "Azure Cloud"
            ],
            "with_experience": [
                "Angular",
                "Java",
                "UI/UX"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Charan",
        "email": "charan@anveta.com",
        "jd": "Role: Angular Java Full-Stack Developer Location: 2984 Clifton Springs Rd, Decatur, GA 30034 (Hybrid)Note: Only Locals Duration: 6+ Months Job Description The selected candidate will be expected to work onsite 2 days week in Decatur, Georgia. Key Responsibilities:• Develop and maintain web applications using Angular, Bootstrap, Java, Spring Boot, and RESTful APIs.• Collaborate with cross-functional teams to design, develop, and deploy end-to-end solutions with a focus on UI/UX.• Implement responsive designs and ensure applications are mobile-friendly and optimized for performance.• Integrate third-party services and APIs into applications.• Write clean, efficient, and maintainable code following best practices and industry standards.• Collaborate with project managers, designers, and other developers to ensure seamless user experiences.• Troubleshoot, debug, and optimize existing applications to improve performance and scalability.• Participate in the entire software development lifecycle, including analysis, design, implementation, testing, and deployment.• Contribute to documentation, including technical specifications, and user guides for the applications developed. Required Qualifications:• 8+ years of professional experience as a Full-Stack Developer with a focus on Angular, UI/UX and Java 11+.• Proficient in Angular (latest versions), JavaScript, Typescript, CSS 3, SCSS, HTML 5, ES6+, Responsive web design, Java, Spring Boot, and RESTful APIs.• Strong experience in front-end development, focusing on building responsive and user-friendly web applications.• Familiarity with Git and version control systems.• Excellent communication and interpersonal skills, with the ability to work effectively in a team environment.• Ability to work independently and deliver high-quality results under tight deadlines.• Experience with relational databases (SQL).• Knowledge of cloud platforms such as AWS or Azure Cloud.• Familiarity with Agile methodologies and tools like Azure DevOps or Jira.• Collaborate with DevOps teams to streamline the CI/CD pipeline and improve deployment efficiency.",
        "source": "Email",
        "date_posted": "2024-09-30 08:36:40-05:00",
        "unique_id": "1924325633be0828",
        "tag": "Java Dev"
    }
]