[
    {
        "company": "Adventa Tech",
        "job_title": "Senior Database Engineer",
        "location": "Miami, FL, USA",
        "full_location": {
            "city": "Miami",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "hybrid"
            ],
            "job_code": "",
            "experience_required": "8 years +",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "",
            "rate": ""
        },
        "skills": {
            "core": [
                "Database Architecture",
                "SQL",
                "Data modeling",
                "Database design",
                "Performance tuning",
                "Stored procedures",
                "Data integrity",
                "ETL"
            ],
            "primary": [
                "SQL",
                "Performance tuning",
                "Database design"
            ],
            "secondary": [
                "Data modeling",
                "Auditing/compliance",
                "Continual Improvement processes"
            ],
            "all": [
                "Database Architecture",
                "SQL",
                "Data modeling",
                "Database design",
                "Performance tuning",
                "Stored procedures",
                "Data integrity",
                "ETL",
                "Complex queries",
                "Troubleshooting",
                "Agile",
                "Scrum"
            ],
            "with_experience": [
                "SQL",
                "Performance tuning"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Vikas Kumar",
        "email": "vikas@adventatech.com",
        "jd": "Role: Senior Database Engineer (SQL with complete Azure focused) Client- BayView Location: Miami, FL (HYBRID) 3 days office 2 days remote In-person Interview (Face 2 Face) Responsibilities Design, develop and optimize large, complex DB schemas, SQL scripts and objects to meet application functionality and performance requirements. Working cohesively with stakeholders including data, design, product, and executive teams and assisting them with data-related technical issues. Working closely with application developers and business teams at all levels to assist with data-related technical issues and help ensure the successful designing and delivering data driven solutions. Implement processes and procedures for the development and release of products/projects that facilitate high quality and rapid deployment Provide solutions to promote data integrity in enterprise systems. Participate in code reviews to validate effectiveness and quality of code. Liaise with Developers to improve applications and establish best practices Publish documentation and collaborative information using internal tools. Requirements Expertise in Database Architecture in an environment that handles large volume of data. Strong analytical and organizational skills. This job involves analyzing existing databases and the client's needs to develop effective data driven solutions. Demonstrate expertise in performance tuning including both query and server optimization utilizing SQL tools and/or 3rd party solutions. Strong knowledge and experience in data modeling, database design, optimization for performance, SQL, stored procedures. Expertise in understanding complex business needs, analyzing, designing, and developing solutions. Experience in troubleshooting and resolving data related issues. Excellent oral and written communication skills. Expertise in performance tuning especially tuning complex queries, procedure, and indexing strategies. Monitor and perform tuning on complex ETL jobs. Audit/compliance experience in highly regulated environment. Familiar with Continual Improvement processes. Experience: 8 years + relational database and SQL experience Creativity, curiosity, initiative, and self-management are key attributes candidate embodies. Solid experience (4 years +) in coding complex SQL queries and stored procedures. The ability to explain the details of performance tuning internals of the database. Strong understanding of database development methodologies (Source Control, Continual improvement, Release Management, Agile and Scrum).",
        "source": "Email",
        "date_posted": "2024-09-30 11:43:13-05:00",
        "unique_id": "192441f1bcd68cbf",
        "tag": "Azure Data Engineer"
    }
]