[
    {
        "company": "Flexon Technologies",
        "job_title": "Python Automation Engineer",
        "location": "Sunnyvale, CA, San Diego, CA, Boulder, CO, USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time"
            ],
            "job_code": "",
            "experience_required": "10+ Years",
            "degree_required": "",
            "visa_sponsorship": "No OPT/CPT/H4/L2/H1T's. Need PP number for H1B candidates",
            "notice_period": "",
            "duration": "",
            "rate": ""
        },
        "skills": {
            "core": [
                "Python",
                "Automation Development",
                "Unix",
                "Shell Scripting",
                "Web Technologies"
            ],
            "primary": [
                "Python",
                "Automation"
            ],
            "secondary": [
                "Ruby",
                "Swift",
                "JavaScript",
                "Tableau",
                "MySQL",
                "PHP",
                "jQuery",
                "HTML5",
                "CSS"
            ],
            "all": [
                "Python",
                "Automation Development",
                "Unix",
                "Shell Scripting",
                "Ruby",
                "Swift",
                "JavaScript",
                "Tableau",
                "MySQL",
                "PHP",
                "jQuery",
                "HTML5",
                "CSS"
            ],
            "with_experience": [
                "Automation Development",
                "Unix",
                "Shell Scripting"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Shakthi Satkuri",
        "email": "shakthi@flexontechnologies.com",
        "jd": "No OPT/CPT/H4/L2/H1T's. Need PP number for H1B candidates. 10+ Years candidates Mandatory Python Automation Engineer. Sunnyvale, CA, San Diego, CA, Boulder, CO (5 days work from office). Note: Need strong python programming experience. Objective: Create new command line, OS and web software tools for restore, kickoff, status, triage and reporting purposes. Designing and writing on-the-fly automated stress and stability hardware-centric software tests for embedded systems. Maintaining existing test and reporting software that scales to support 1000’s of devices daily with minimal lab downtime. Identify, reproduce, and isolate bugs found via debugging and performance analysis tools. Report issues in accordance with Apple bug reporting methods and testing guidelines. Skills: Must-haves for Automation Engineer: Minimum 5 years of experience in automation development in HW/SW test engineering. Experience developing software automation of low-level and user-level UI in scripting languages such as Python, Ruby, Swift or JavaScript. Experience with web and database technologies such as Tableau, MySQL, PHP, jQuery, HTML5, CSS. Strong knowledge of Unix and Unix shell scripting. Strong communication, written skills, and interpersonal skills (required to establish and maintain inter-departmental relationships). Preferred for Automation Engineer: Ability to solve hardware systems to component level and perform root-cause analysis. Experience with developing web-based automation frameworks as well as database design. Experience writing OS X or iOS applications. Experience in testing HW. Experience in building data visualization. Success Criteria/Definition of Done: All assigned software tasks are completed and validated by our internal and independent QA process. All assigned radars in the queue are performed in a timely manner. All assigned software work follows a common software development process including but not limited to pull requests, unit tests, radar updates, etc. All updates are timely, clear, concise and accurate. Communication with the team is clear, effective and timely.",
        "emp_type": [
            "full-time"
        ],
        "source": "Email",
        "date_posted": "2024-09-30 10:51:32-05:00",
        "unique_id": "19243c8dfede82f4",
        "tag": "Python Dev"
    }
]