[
    {
        "company": "Polaris Industries, Inc.",
        "job_title": "Angular Engineer",
        "location": "Remote, USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "1099",
                "W2"
            ],
            "job_code": "",
            "experience_required": "7+ years of experience in web application design and development",
            "degree_required": "",
            "visa_sponsorship": "USC and GC",
            "notice_period": "",
            "duration": "6+ months",
            "rate": ""
        },
        "skills": {
            "core": [
                "Angular",
                "C#",
                "JavaScript",
                "HTML5",
                "CSS3",
                "TypeScript",
                "SASS"
            ],
            "primary": [
                "Angular",
                "Angular Material"
            ],
            "secondary": [
                ".NET",
                "Visual Studio",
                "MVC"
            ],
            "all": [
                "Angular",
                "C#",
                "JavaScript",
                "HTML5",
                "CSS3",
                "TypeScript",
                "SASS",
                ".NET",
                "Visual Studio",
                "MVC",
                "SQL Server"
            ],
            "with_experience": [
                "Angular expertise required (v13 or above; we are using v18)",
                "Responsive UI development experience",
                "Experience architecting Angular solutions from the ground up"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Sam",
        "email": "slenka@vyzeinc.com",
        "jd": "Job Description -Please submit genuine profile no third parties candidates.Please don't submit .NET with angular or frontend with angular they are looking core angular expert with C# exp.Job Title: Angular EngineerLocation: : RemoteDuration: 6+months Visa: USC and GCMOI: Skype Please read this before finding candidates.Project info – the team is 3 months behind schedule, and they need a long term Angular resource to come in and revise the existing code. It is for an older application that changed scope. This person will need to pretty much clean up the mess and be an expert developer. Please ensure that all candidates are aware that they will be required to complete a FloCareer interview as part of the hiring process. FloCareer is a third-party technical assessment platform used to vet candidates thoroughly, ensuring their technical capabilities and confirming the authenticity of their skills. Candidates who cannot meet these standards will not be considered. Requirement. Job Summary:Polaris Industries, Inc. is seeking an experienced Angular developer to develop new applications for our Dealer area. The candidate will work in an agile environment, developing Angular applications from the ground up, with a focus on best practices. Strong communication skills and the ability to work independently are essential. Essential Duties & Responsibilities:Design, code, test, and debug applications.Work with users and staff to resolve business problems.Support, maintain, and administer deployed solutions.Participate in project and administrative meetings.Collaborate with project managers, designers, and marketing managers to refine the user experience.Develop applications using Angular, Angular Material, Typescript, JavaScript, HTML5, CSS3, and SASS.Build Angular applications based on best practices, from the ground up.Recommend system solutions by evaluating custom development vs. purchase alternatives.Design architecture and scripting for application integration.Coordinate development activities, troubleshoot problems, and support applications across multiple environments.Provide documentation and user assistance tools.Support other developers by offering advice, coaching, and educational opportunities.",
        "emp_type": [
            "1099",
            "W2"
        ],
        "source": "Email",
        "date_posted": "2024-09-30 15:00:59-05:00",
        "unique_id": "1924499026fd5bd9",
        "tag": ".NET Dev"
    }
]