[
    {
        "company": "Yochana IT Solutions INC",
        "job_title": "AWD Integration Developer",
        "location": "Remote, USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "",
            "experience_required": "15-20 years",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "Long term contract",
            "rate": ""
        },
        "skills": {
            "core": [
                "JAVA",
                ".NET",
                "AWD Integration",
                "VB6",
                "HTML",
                "SQL",
                "XML",
                "REST",
                "SOAP"
            ],
            "primary": [
                ".NET",
                "JAVA"
            ],
            "secondary": [
                "AWD Custom Code",
                "API Updates"
            ],
            "all": [
                "JAVA",
                ".NET",
                "AWD Integration",
                "VB6",
                "HTML",
                "SQL",
                "XML",
                "REST",
                "SOAP"
            ],
            "with_experience": [
                ".NET",
                "JAVA"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Jayasurya",
        "email": "jayasurya@yochana.com",
        "jd": "Hello, Hope you are doing Well! I'm currently staffing for an AWD Integration Developer at Remote. Below you will find the job description, if you are qualified and interested please send me your Updated Word Document Resume to Jayasurya@yochana.com. My apologies if this position is not an ideal fit, we'll keep you in mind for other suitable positions and referrals would be appreciated. Thank you in advance. Job Description: 15+ year of IT experience with Insurance domain knowledge. Works off of the AWD Admin requirements, to perform unit testing, supports business UAT and deploy / implements BAU projects. Configures and codes API Updates for the AWD ToolKit, AWD Custom Code, NSImport and NetServer. This could include VB6, JAVA, .NET, HTML, SQL, XML, REST and SOAP services, as well as integration with other peripheral TA applications. Provides post implementation and production support for the AWD Admin for Incident ticket resolution as needed. Monitors and supports AWD Custom Email, NSImport / NetServer, AWD custom code, and other peripheral AWD Applications on a daily basis. Provides audit support for internal TA project audits and regulatory compliance requests. Supports patching and coding changes for AWD related servers and infrastructure (Windows, Linux, JAVA, Microsoft updates, etc.)",
        "emp_type": [
            "contract"
        ],
        "source": "Email",
        "date_posted": "2024-09-30 08:58:19-05:00",
        "unique_id": "192433933ee7bab5",
        "tag": "Java Dev"
    }
]