[
    {
        "company": "Largeton INC",
        "job_title": "IT Project Manager",
        "location": "Charlotte, NC, Chicago, IL, Boston, MA, USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [],
            "job_code": "",
            "experience_required": "",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "",
            "rate": ""
        },
        "skills": {
            "core": [
                "Scrum",
                "Agile",
                "Waterfall",
                "IT Project Management",
                "Vendor Management"
            ],
            "primary": [
                "IT Project Management",
                "Scrum Management"
            ],
            "secondary": [
                "Agile Methodology",
                "Waterfall Methodology",
                "Cross-functional Team Management"
            ],
            "all": [
                "Scrum",
                "Agile",
                "Waterfall",
                "IT Project Management",
                "Vendor Management",
                "Software Development"
            ],
            "with_experience": [
                "Scrum",
                "IT Project Management",
                "Agile Methodology",
                "Waterfall Methodology"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Awkash Kumar",
        "email": "awkash@largeton.us",
        "jd": "We are seeking a seasoned IT Project Manager with a strong background in Scrum methodologies to join our team. This is a fully remote position, but candidates must be local to either Charlotte, NC, Chicago, IL, or Boston, MA due to client requirements. The ideal candidate will have extensive experience managing large-scale software development and implementation projects, leveraging both Agile and Waterfall methodologies.Key Responsibilities:Lead and oversee multiple workstreams within a large program.Manage cross-functional teams and external vendors to ensure successful project delivery.Collaborate with various stakeholders to drive project objectives and timelines.Employ Agile and Waterfall methodologies to ensure projects remain on track and within scope.Ensure alignment with client’s goals and requirements while maintaining high-quality deliverables.Qualifications:Proven experience as an IT Project Manager with strong Scrum expertise.Demonstrated success in managing software development and implementation projects.Strong familiarity with both Agile and Waterfall project management frameworks.Experience leading multiple workstreams and managing cross-functional teams in a large program setting.Excellent vendor management skills.",
        "emp_type": [],
        "source": "Email",
        "date_posted": "2024-09-30 10:30:55-05:00",
        "unique_id": "192438df96a137b4",
        "tag": "BA/Scrum Master/PM"
    }
]