[
    {
        "company": "Inteletech Global Inc",
        "job_title": "Full Stack Java Program Analyst",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "Long Term",
            "rate": ""
        },
        "skills": {
            "core": [
                "Java development",
                "DocuSign API integration",
                "AWS",
                "SOAP & REST Web Services",
                "Spring",
                "JDBC",
                "JPA/Hibernate",
                "JMS",
                "Relational/Object Oriented Modeling",
                "Technical requirements specification",
                "Team interaction",
                "Effective communication"
            ],
            "primary": [
                "Java/J2EE",
                "HTML/CSS",
                "JavaScript",
                "SQL",
                "WebHooks"
            ],
            "secondary": [
                "OKTA integration",
                "UNIXOS",
                "UNIX Shell Scripting",
                "PL/SQL",
                "UML",
                "IBM WebSphere",
                "Spring Batch",
                "Spring Boot",
                "large-scale data migration",
                "Microsoft Office Suite",
                "agile environment"
            ],
            "all": [
                "Java development",
                "DocuSign API integration",
                "AWS",
                "SOAP & REST Web Services",
                "Spring",
                "JDBC",
                "JPA/Hibernate",
                "JMS",
                "Relational/Object Oriented Modeling",
                "Technical requirements specification",
                "Team interaction",
                "Effective communication",
                "Java/J2EE",
                "HTML/CSS",
                "JavaScript",
                "SQL",
                "WebHooks",
                "OKTA integration",
                "UNIXOS",
                "UNIX Shell Scripting",
                "PL/SQL",
                "UML",
                "IBM WebSphere",
                "Spring Batch",
                "Spring Boot",
                "large-scale data migration",
                "Microsoft Office Suite",
                "agile environment"
            ],
            "with_experience": []
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "celine",
        "email": "celine@inteletechglobal.com",
        "jd": "Hi, Partners Please find one of our clients' requirements below. Please send me suitable and genuine profiles as soon as possible! Role: Full Stack Java Prog Analyst Location: Richmond, VA(ONSITE) Long Term Contract *IN PERSON Interviews ONLY (no Exceptions) *Candidate MUST be comfortable interviewing and working onsite 100% from Day 1 Job Description: Client is looking for a Sr Full Stack Java consultant to assist with the design, development and support of DocuSign workflows integrated with complex Java/JEE programs. A minimum of 3 years of experience on DocuSign API integration using WebHooks A minimum of 3 years of experience on AWS leveraging Serverless Lambda, SQS/SNS and API Gateway, AWS WAF, AWS Secrets Manager, IAM and DynamoDB A minimum of 5 years of Java development experience with complex, large-scale applications using the following technologies is required: Java/J2EE, HTML/CSS, JavaScript, SQL. A minimum of 3 years' experience with the following technologies: SOAP & REST Web Services, Spring, JDBC, JPA/Hibernate, and JMS. Experience with relational and object-oriented modeling is required. Experience with technical requirements specification and design documentation is required. Experience with problem troubleshooting and providing support for complex multitiered applications is required. The ability to successfully interact in a team environment is required. Effective oral and written communication skills are required. Experience with OKTA integration strongly preferred. Experience with UNIXOS, UNIX Shell Scripting, PL/SQL, and UML is strongly preferred. Experience with IBM WebSphere Application Server, IBM WebSphere Liberty, and Oracle RDBMS is strongly preferred. Experience with Spring Batch and Spring Boot is strongly preferred. Experience with large-scale data migration is preferred. Experience with Microsoft Office Suite of products is preferred. Experience working in an agile environment (scrum, kanban, or scrumban) is preferred.",
        "source": "Email",
        "date_posted": "2024-09-30 11:29:56-05:00",
        "unique_id": "19243c73ce9fc524",
        "tag": "Java Dev"
    }
]