[
    {
        "company": "ZealHire",
        "job_title": "IT Oracle Project Managers",
        "location": "Minneapolis, Minnesota, USA",
        "full_location": {
            "city": "Minneapolis",
            "state": "Minnesota",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "full-time"
            ],
            "job_code": "",
            "experience_required": "seasoned PM",
            "degree_required": "",
            "visa_sponsorship": "USC/GC/GC-EAD",
            "notice_period": "",
            "duration": "6-12 month contract to hire",
            "rate": ""
        },
        "skills": {
            "core": [
                "Project Management",
                "Oracle E-Business",
                "Fusion",
                "stakeholder coordination"
            ],
            "primary": [
                "Waterfall",
                "Agile"
            ],
            "secondary": [],
            "all": [
                "Project Management",
                "Oracle E-Business",
                "Fusion",
                "stakeholder coordination",
                "Waterfall",
                "Agile"
            ],
            "with_experience": [
                "Project Management",
                "Oracle E-Business",
                "Fusion"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Raman Arora",
        "email": "raman@zealhire.com",
        "jd": "Hello My name is Raman Arora and I am a Staffing Specialist at ZealHire. I am reaching out to you on an exciting job opportunity with one of our clients. Job Title - IT Oracle Project Managers Location - Minneapolis, Minnesota Job Description: USC/GC/GC-EAD need LinkedIn Local candidates only Looking for a PM that can help lead their Oracle project. They are on Oracle E-Business (EBS?) and are moving to Fusion. They need a seasoned PM that can help with: Project status updates Working with stakeholders to coordinate internally Partner with the MSP/SI partner Experience with Waterfall, agile knowledge is good Would like someone who has similar project experience moving to the cloud Up against Hatch Group and ITR Group- has a few resumes already Wants the right energy and approach, go getter They are going through some large initiatives and it’s a great time to be a part of exciting changes. Brought in all new leadership recently to help drive their digital transformation, are consolidating their 4 divisions into 2 and moving into more of a shared services model Phone screen with Suri (EPMO Manager) and then a team onsite interview Start someone in October 5 days a week onsite in NE Minneapolis 6-12 month contract to hire",
        "emp_type": [
            "contract",
            "full-time"
        ],
        "source": "Email",
        "date_posted": "2024-09-30 10:41:45-05:00",
        "unique_id": "192439811464fa16",
        "tag": "BA/Scrum Master/PM"
    }
]