[
    {
        "company": "Cohesive Technologies",
        "job_title": "Java Fullstack Developer with AWS Cloud",
        "location": "Seattle, WA, USA",
        "full_location": {
            "city": "Seattle",
            "state": "WA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [],
            "job_code": "",
            "experience_required": "13+ Years",
            "degree_required": "Bachelor's degree in Computer Science, Software Engineering, or a related field.",
            "visa_sponsorship": "NO GC Visa's or USC on C2C",
            "notice_period": "",
            "duration": "6 Months+",
            "rate": ""
        },
        "skills": {
            "core": [
                "Java",
                "J2EE",
                "Spring",
                "JavaScript"
            ],
            "primary": [
                "AWS technologies (EC2, S3, RDS, Lambda, etc.)"
            ],
            "secondary": [
                "Data structures",
                "Algorithms"
            ],
            "all": [
                "Java",
                "J2EE",
                "Spring",
                "JavaScript",
                "AWS technologies (EC2, S3, RDS, Lambda, etc.)",
                "ECS far gate",
                "S3",
                "DDB",
                "API Gateway",
                "Data & Database skills"
            ],
            "with_experience": []
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Satin Harper",
        "email": "satinh@cohetech.com",
        "jd": "Cohesive Technologies is a global IT Services & Solutions company providing IT Staffing Services and Application Development Services necessary for technology leaders to deliver business value. We help our people and clients succeed by leveraging our expertise, deep industry and market knowledge, proprietary assessment tools and techniques, and project delivery methodologies. Through relationships with thousands of specialized professionals, we bring an unparalleled ability to match talent with opportunities by assessing, recruiting, developing and engaging the best and brightest people for our clients. We combine broad geographic presence, world-class solutions and a tailored, consultative approach to help our people and clients achieve higher performance and outstanding results. Position: Java Fullstack Developer with AWS Cloud Location: Seattle, WA (all 5 days a week onsite is must) Duration: 6 Months+ Exp : 13+ Years Note : NO GC Visa's or USC on C2C Updated JD from Client: Qualifications: Bachelor's degree in Computer Science, Software Engineering, or a related field. 10+ years of experience developing web applications using AWS technologies (EC2, S3, RDS, Lambda, etc.). Strong coding skills AWS cloud – ECS far gate, S3, DDB, API Gateway Good Data & Database skills. Java, J2EE, Spring, Java script Problem solving – Data structure, Algorithms.",
        "emp_type": [],
        "source": "Email",
        "date_posted": "2024-09-30 12:14:28-05:00",
        "unique_id": "192445bb2bc05676",
        "tag": "Java Dev"
    }
]