[
    {
        "company": "NITYA Software Solutions Inc.",
        "job_title": "Program Quality Lead",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [],
            "job_code": "",
            "experience_required": "Typically requires University Degree and minimum 8 years prior relevant experience or an Advanced Degree in a related field and minimum 5 years of experience or in absence of a degree, 12 years of relevant experience",
            "degree_required": "University Degree or Advanced Degree in a related field",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "",
            "rate": ""
        },
        "skills": {
            "core": [
                "leadership",
                "team management",
                "program management",
                "Root Cause Analysis",
                "Corrective Action"
            ],
            "primary": [
                "Microsoft Office Suite (Word, Excel, PowerPoint)"
            ],
            "secondary": [
                "bidding inputs for Quality or other functional organization"
            ],
            "all": [
                "leadership",
                "team management",
                "program management",
                "Root Cause Analysis",
                "Corrective Action",
                "Microsoft Office Suite (Word, Excel, PowerPoint)"
            ],
            "with_experience": []
        },
        "job_type": [],
        "contact_person": "Raj Kumar",
        "email": "rajkumar.v@nityainc.com",
        "jd": "Hi,I hope you are doing well.I am Raj from NITYA Software Solutions Inc.I've included below the job description, please let me know if you are interested, and reply with one updated resume, which I've expected.Role: Program Quality Lead Typically requires University Degree and minimum 8 years prior relevant experience or an Advanced Degree in a related field and minimum 5 years of experience or in absence of a degree, 12 years of relevant experienceU.S. citizenship is required, as only U.S. citizens are authorized to access information under this program/contract3+ years of leadership or team management experiencePrior program experience across full program lifecycleExperience in leading proposals and bidding inputs for Quality or other functional organizationExperience with Microsoft office suite software (Word, Excel, PowerPoint)Root Cause Analysis and Corrective Action experienceThank you,RajkumarEMAIL ID:rajkumar.v@nityainc.comNITYA Software Solutions Inc.",
        "emp_type": [],
        "source": "Email",
        "date_posted": "2024-09-30 08:14:29-05:00",
        "unique_id": "192431ca349cf348",
        "tag": "BA/Scrum Master/PM"
    }
]