[
    {
        "company": "Apple",
        "job_title": "Engineering Project Manager",
        "location": "Cupertino, CA, USA",
        "full_location": {
            "city": "Cupertino",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "temporary"
            ],
            "job_code": "",
            "experience_required": "Minimum of 10 years",
            "degree_required": "Bachelor’s Degree in Engineering / Computer Science / Information Technology or equivalent work experience",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "",
            "rate": ""
        },
        "skills": {
            "core": [
                "product lifecycle management (PLM)",
                "Bills of Material (BOM)",
                "organizational skills",
                "analytical skills",
                "problem-solving skills",
                "independence",
                "self-motivation"
            ],
            "primary": [
                "end-to-end implementation",
                "project management",
                "stakeholder engagement",
                "requirements analysis",
                "design",
                "development",
                "testing",
                "maintenance"
            ],
            "secondary": [
                "experience in electronics industry",
                "agile scrum",
                "software development lifecycle (SDLC)"
            ],
            "all": [
                "product lifecycle management (PLM)",
                "Bills of Material (BOM)",
                "organizational skills",
                "analytical skills",
                "problem-solving skills",
                "independence",
                "self-motivation",
                "end-to-end implementation",
                "project management",
                "stakeholder engagement",
                "requirements analysis",
                "design",
                "development",
                "testing",
                "maintenance",
                "experience in electronics industry",
                "agile scrum",
                "software development lifecycle (SDLC)"
            ],
            "with_experience": [
                "product lifecycle management (PLM)",
                "Bills of Material (BOM)"
            ]
        },
        "job_type": [
            "onsite",
            "hybrid"
        ],
        "contact_person": "Mounika",
        "email": "mounikaj@brillius.com",
        "jd": "Role name: Engineering Project Manager - (3 days onsite/Hybrid) Cupertino, CA. Need strong end-end implementation handson experience on PLM, BOM projects, interaction with Business and IT Stakeholders. Role Description: Job summary: Apple's Environmental Technologies group is seeking temporary professional services of an Engineering Project Manager to manage minimum to large enterprise projects in support of Apple’s various Smarter Chemistry objectives and initiatives, considering current and future key global regulatory requirements. The EPM will collaborate closely with SMEs, stakeholders, cross-functional teams and vendors during the full lifecycle development process – including requirements analysis, design, development, deployment, testing and maintenance. Key Qualifications: Experience with product lifecycle management (PLM) systems and Bills of Material (BOM), ideally for complex products like electronics. Minimum of 10 years of first-hand experience in managing and implementing business processes and systems. Strong organizational abilities with attention to detail. Strong analytical and problem-solving skills. Highly accountable and dedicated to completing tasks. Demonstrated ability to excel in a fast-paced, schedule-driven environment. Capable of prioritizing work effectively. Independent, self-motivated, and committed individual. Experience in the electronics industry preferred. Job Description: This temporary professional services role is within Apple's Environmental Technologies group within Apple's Hardware Engineering division. Our mission is to deliver the world’s leading programs on the elimination of hazardous substances, improved material and energy efficiency, as well as design for environment. Apple believes that major improvements in environmental performance will be delivered through product design innovations. Roles and Responsibilities: Lead meetings with stakeholders including process owners, subject matter experts, internal and external technical experts to ensure business processes and technical solutions are consistently understood and accurately documented. Develop and execute work plans by leading scope, schedule, deliverables, and prioritization. Providing project updates on a consistent basis to stakeholders. Actively collaborate with business and technical teams on innovative solutions, requirements, scope, and project deliverables. Proactively identify and communicate project issues and risks. Prioritize issues while negotiating and setting appropriate expectations with team members, stakeholders and senior management. Prioritize team activities and drive resolution of issues across all areas of the project. Lead test strategy for user acceptance, creating and executing test scripts. Working knowledge of the software development lifecycle (SDLC), Agile scrum.",
        "emp_type": [],
        "source": "Email",
        "date_posted": "2024-09-30 12:34:36-05:00",
        "unique_id": "19244006ea85eea1",
        "tag": "BA/Scrum Master/PM"
    }
]