[
    {
        "company": "Inteletech Global Inc",
        "job_title": "IT Project Manager",
        "location": "Grand Ave Iowa, USA",
        "full_location": {
            "city": "Grand Ave",
            "state": "Iowa",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "",
            "rate": ""
        },
        "skills": {
            "core": [
                "project management",
                "stakeholder management",
                "system integration",
                "technology projects",
                "Agile project management",
                "process development",
                "gap analysis",
                "process improvement"
            ],
            "primary": [
                "project governance",
                "methodologies",
                "documentation",
                "communication"
            ],
            "secondary": [
                "team leadership",
                "time management",
                "change management"
            ],
            "all": [
                "project management",
                "stakeholder management",
                "system integration",
                "technology projects",
                "Agile project management",
                "process development",
                "gap analysis",
                "process improvement",
                "project governance",
                "methodologies",
                "documentation",
                "communication",
                "team leadership",
                "time management",
                "change management"
            ],
            "with_experience": [
                "Agile projects",
                "client expectations"
            ]
        },
        "job_type": [],
        "contact_person": "Ravi",
        "email": "ravi@inteletechglobal.com",
        "jd": "Role : IT Project Manager Location : Grand Ave Iowa (Local candidates only) Required Skills and Qualifications: 10+ years of experience managing system integration and/or technology projects. Proven experience in managing stakeholder expectations and prioritizing needs effectively. Expertise in working within a formal project governance framework, utilizing established methodologies, templates, and reporting tools. Extensive experience planning, managing, and tracking multiple large-scale, high-impact projects. Strong process development and documentation skills, with the ability to interpret, document, and formalize procedures. Strong gap analysis and process improvement abilities. Exceptional project management skills, including multitasking and managing changing priorities in a cross-functional environment. Demonstrated experience gathering and documenting business requirements through collaboration with business users. Ability to prioritize and manage multiple projects and project activities simultaneously while adhering to deadlines. Working experience managing Agile projects, with a focus on iterative development and continuous improvement. Proven experience managing client expectations and driving change management initiatives. Position Responsibilities and Essential Functions: Ability to work within established project governance structures, utilizing defined methodologies, templates, and reporting standards. Facilitate collaboration and communication with business and IT teams, fostering a culture of mutual learning and continuous improvement. Operate effectively with broad oversight, while maintaining the ability to self-direct and work independently as needed. Motivate and lead teams to meet deadlines in a fast-paced, dynamic environment, driving project success. Gather, organize, and manage multiple complex business processes simultaneously. Break down complex tasks into manageable, actionable items, ensuring appropriate sequencing and execution. Control scope creep and maintain a focus on delivering a minimum viable product (MVP) to meet key business objectives. Demonstrate excellent organizational, presentation, interpersonal, and team-building skills. Manage time effectively, with strong skills in project planning, strategizing, and execution. Communicate clearly and effectively, both verbally and in writing, to stakeholders and team members at all levels. Experience managing client expectations, implementing service improvement initiatives, and ensuring stakeholder satisfaction. Lead and coordinate multiple parallel workstreams, ensuring consistent progress toward project goals. Track project progress, monitor schedules, and provide regular status updates to teams and leadership, escalating issues as necessary. Provide insights and recommend improvements to processes related to portfolio, project, and program management. Perform additional duties or tasks as assigned by management.",
        "source": "Email",
        "date_posted": "2024-09-30 10:42:58-05:00",
        "unique_id": "19243d05037ba0fb",
        "tag": "BA/Scrum Master/PM"
    }
]