[
    {
        "company": "Integrated Technology Strategies, Inc.",
        "job_title": "BA - Criminal Justice Analyst",
        "location": "Chesterfield VA, USA",
        "full_location": {
            "city": "Chesterfield",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "14 Months",
            "rate": ""
        },
        "skills": {
            "core": [
                "criminal justice analysis",
                "law enforcement analysis",
                "business analysis",
                "communication skills",
                "Organizational Change Management",
                "cloud-hosted SaaS"
            ],
            "primary": [
                "system testing",
                "requirements gathering",
                "quality assurance"
            ],
            "secondary": [
                "document communications",
                "develop management reports"
            ],
            "all": [
                "criminal justice analysis",
                "law enforcement analysis",
                "business analysis",
                "communication skills",
                "knowledge of Virginia criminal justice system",
                "computer systems",
                "system test plans",
                "organizational skills",
                "analytical skills",
                "problem solving skills",
                "interpersonal skills",
                "self-motivation",
                "rapport building",
                "Microsoft Products (Word, Excel, Visio, PowerPoint)"
            ],
            "with_experience": [
                "creating business and system requirements",
                "managing security access",
                "producing requirements related artifacts"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Lucky",
        "email": "lucky@itstrategiesinc.com",
        "jd": "BA - Criminal Justice Analyst - IN PERSON IVs ONLY\nLocation: Chesterfield VA (near Richmond) Onsite (Local Only)\nDuration: 14 Months\nInterview is In-Person\nClient is State of VA \nRole is: BA must have 5+ years of experience as a criminal justice and/or law enforcement analyst. Short Description\nINTERVIEWS - IN-PERSON ONLY\nSelected candidates must work full-time onsite at VSP headquarters, North Chesterfield. Please do not submit if the candidate is not available to work on-site from day one.\n\nComplete Description\nABOUT THE ROLE\nVirginia State Police (VSP) is looking for an analyst to perform complex criminal justice and/or law enforcement computer systems analysis. During system testing and post-implementation refinement, the incumbent will coordinate and document communications between VSP project Team Leaders, System Interface Partners and Suppliers in accordance with the goals for each release and the project schedule. Perform analysis to help VSP determine if Suppliers are delivering systems in accordance with documented requirements. Perform analysis to help VSP determine if testing is occurring consistent with the project schedule. Perform Quality Assurance to ensure communications are consistent with established guidelines and project requirements. Develop and distribute management reports that describe the progress, problems and risks associated with system testing. Candidates must have 5+ years of experience as a criminal justice and/or law enforcement analyst. Extensive knowledge of the Virginia criminal justice system and/or law enforcement is required. Extensive knowledge in computer systems is required, preferably computer systems used by criminal justice and/or law enforcement agencies. Experience as a business analyst is required. Excellent communications skills in English is required. Knowledge of criminal history record processing is preferred. Experience writing and reading system test plans is preferred. Also, candidates for this position should be proficient in creating business and system requirements; possess strong organization, administrative, analytical, problem solving and interpersonal skills; be self-motivated; able to develop rapport and positive working relationships with coworkers; be proficient in Organizational Change Management; have experience implementing cloud-hosted Software As A Service (SaaS) solutions; be able to produce requirements related artifacts such as test cases, requirements traceability matrix, business rules, interface requirements, use cases, activity diagrams, error validations and role based system profiles; be able to manage security access and user profile management; be able to identify how new applications and business processes will integrate with or replace existing business processes; have the ability to communicate with internal customers in nontechnical terms; be proficient with Microsoft Products (Word, Excel, Visio, PowerPoint); and be proficient in creating business and system requirements. The incumbent must work full-time onsite at VSP headquarters, North Chesterfield.",
        "source": "Email",
        "date_posted": "2024-09-30 09:57:04-05:00",
        "unique_id": "19243858d8cd37e6",
        "tag": "BA/Scrum Master/PM"
    }
]