[
    {
        "company": "Vy Systems",
        "job_title": "Oracle ERP Developer",
        "location": "Riverwoods, IL, USA",
        "full_location": {
            "city": "Riverwoods",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "C2C"
            ],
            "job_code": "",
            "experience_required": "10 years",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "",
            "rate": ""
        },
        "skills": {
            "core": [
                "Oracle ERP",
                "PL/SQL",
                "Scheduling and Scripting"
            ],
            "primary": [
                "Oracle Fusion Cloud",
                "OTBI",
                "BIP Reports"
            ],
            "secondary": [
                "Payments",
                "Cards & Payments"
            ],
            "all": [
                "Oracle ERP",
                "PL/SQL",
                "Scheduling and Scripting",
                "Oracle Fusion Cloud",
                "OTBI",
                "BIP Reports",
                "Accounting Hub",
                "General Ledger",
                "Accounts Payable",
                "Autosys"
            ],
            "with_experience": [
                "Oracle Fusion Cloud",
                "PL/SQL"
            ]
        },
        "job_type": [
            "onsite",
            "hybrid"
        ],
        "contact_person": "Kishore V",
        "email": "kishore.v@vysystems.com",
        "jd": "Oracle ERP Developer location:- Riverwoods, IL (onsite/hybrid)Primary Skills1.Oracle ERP2. PL/SQL3. Scheduling and ScriptingJob Description/ Responsibilities :Development and support of Oracle ERP• Experience with Oracle Fusion Cloud especially OTBI / BIP Reports. Hands on experience in OIC integration work• Experience with the following modules – Accounting Hub, General Ledger, Accounts Payable• Writes PL/SQL queries in support of report development• Develops windows batch scripting• Creates and manages Autosys schedulesYears of Experience 10 yearsJob summary : - Experience with Oracle Fusion Cloud especially OTBI / BIP Reports. Hands on experience in OIC integration work - Experience with the following modules - Accounting Hub, General Ledger, Accounts Payable - Writes PL/SQL queries in support of report development - Develops windows batch scripting - Creates and manages Autosys schedules: ,..Responsibilities : -Lead the design and implementation of Oracle Cloud ERP solutions to meet business requirements. - Oversee the development and maintenance of PL/SQL scripts to ensure optimal performance. - Provide technical expertise and guidance to the development team throughout the project lifecycle. - Collaborate with cross-functional teams to gather and analyze business requirements. - Ensure the integration of ERP solutions with other enterprise systems. - Conduct code reviews and ensure adherence to coding standards and best practices. - Troubleshoot and resolve technical issues related to Oracle Cloud ERP and PL/SQL. - Develop and maintain technical documentation for ERP solutions. - Monitor system performance and implement improvements as needed. - Stay updated with the latest trends and advancements in Oracle Cloud ERP and PL/SQL. - Participate in project planning and provide accurate time estimates for development tasks. - Ensure the successful delivery of projects within the specified timeline and budget. - Contribute to the continuous improvement of development processes and methodologies. Qualifications - -Possess a strong background in Oracle Cloud ERP with hands-on experience in implementation and support. - Demonstrate proficiency in PL/SQL with the ability to write and optimize complex queries. - Have experience in the Payments or Cards & Payments domain, which is considered a plus. - Exhibit excellent problem-solving skills and the ability to troubleshoot technical issues effectively. - Show strong communication skills to collaborate with cross-functional teams and stakeholders. - Display a proactive approach to learning and staying updated with the latest industry trends.",
        "emp_type": [
            "C2C"
        ],
        "source": "Email",
        "date_posted": "2024-09-30 14:08:12-05:00",
        "unique_id": "1924454e0f9df596",
        "tag": "Oracle DBA"
    }
]