[
    {
        "company": "RCI",
        "job_title": "Healthcare Business Analyst",
        "location": "Quincy, MA, USA",
        "full_location": {
            "city": "Quincy",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "C2C"
            ],
            "job_code": "",
            "experience_required": "Minimum of (3) three years of extensive experience with project management as a Senior Business Analyst",
            "degree_required": "Bachelor’s degree in computer science, Information Systems, Business Administration, or a related field",
            "visa_sponsorship": "No H1B",
            "notice_period": "",
            "duration": "6 months with a possible extension",
            "rate": "$50/hr"
        },
        "skills": {
            "core": [
                "Knowledge of the principles of software development using the approved SDLC",
                "Proficient knowledge of Jira",
                "Long Term Care Population",
                "Complex eligibility systems",
                "Unified processes",
                "Proficiency in Microsoft 365",
                "Excel",
                "Word",
                "PowerPoint",
                "Access",
                "Visio",
                "Knowledge of methods and techniques of computer systems analysis",
                "Technical terminology",
                "Codes and standard abbreviations",
                "Ability to prepare flow charts",
                "Diagrams",
                "Use Cases",
                "Strong organizational skills",
                "Problem-solving aptitude",
                "Attention to detail",
                "Ability to work collaboratively"
            ],
            "primary": [
                "Data structures",
                "Application programming",
                "Database development",
                "Relational database theory and technology"
            ],
            "secondary": [
                "MA HIX",
                "Other State Health Exchange"
            ],
            "all": [
                "Knowledge of the principles of software development using the approved SDLC",
                "Proficient knowledge of Jira",
                "Long Term Care Population",
                "Complex eligibility systems",
                "Unified processes",
                "Proficiency in Microsoft 365",
                "Excel",
                "Word",
                "PowerPoint",
                "Access",
                "Visio",
                "Knowledge of methods and techniques of computer systems analysis",
                "Technical terminology",
                "Codes and standard abbreviations",
                "Ability to prepare flow charts",
                "Diagrams",
                "Use Cases",
                "Strong organizational skills",
                "Problem-solving aptitude",
                "Attention to detail",
                "Ability to work collaboratively",
                "Data structures",
                "Application programming",
                "Database development",
                "Relational database theory and technology",
                "Knowledge of MA HIX",
                "Other State Health Exchange"
            ],
            "with_experience": []
        },
        "job_type": [
            "Hybrid"
        ],
        "contact_person": "Anamika",
        "email": "aanamika@rconsultinginc.com",
        "jd": "Must have the local DL of Massachusetts or Rhode Island or New Hampshire only. Role: Business Analyst (Healthcare). Location: Quincy, MA [Hybrid] [Local Only from MA, NH or RI and must have recent client experience from these locations only]. Duration: 6 months with a possible extension. Visa - No H1B. Rate: $50/hr C2C. Interview Mode: In-person 2-3 days onsite every week. 37.5 Hours work week paid. Minimum Requirements: Knowledge of the principles of software development using the approved SDLC. Proficient knowledge of Jira, Long Term Care Population, Complex eligibility systems, and Unified processes. Proficiency in Microsoft 365, Excel, Word, PowerPoint, Access, and Visio. Knowledge of methods and techniques of computer systems analysis, design, technical terminology, codes, and standard abbreviations. Experience with one or more of the following: data structures, application programming, database development, or relational database theory and technology. Ability to prepare flow charts, diagrams, and Use Cases. Deliver oral and written instructions in a precise, understandable manner. Prepare required deliverables in accordance with established procedures. Strong organizational skills with the ability to maintain accurate records and status reporting. Ability to understand and apply the policies, procedures, specifications, standards, and guidelines governing assigned unit activities. Knowledge of MA HIX or other State Health Exchange. Ability to work with multiple vendors. Strong organizational skills, problem-solving aptitude, and attention to detail. Ability to work well with others in a fast paced, dynamic environment. Strong initiative and ability to manage multiple projects, as well as strong follow-through skills. Must be able to work collaboratively, collegially, and cooperatively with others in an environment where deliverables are potentially dependent on the output of others.",
        "emp_type": [
            "C2C"
        ],
        "source": "Email",
        "date_posted": "2024-09-30 14:54:51-05:00",
        "unique_id": "192447f97a6e23af",
        "tag": "BA/Scrum Master/PM"
    }
]