[
    {
        "company": "State of IA- IA-DOM-HHS",
        "job_title": ".NET Full Stack Tech Lead",
        "location": "Des Moines, IA, USA",
        "full_location": {
            "city": "Des Moines",
            "state": "IA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time"
            ],
            "job_code": "748006",
            "experience_required": "10+ years",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "8+ Months",
            "rate": ""
        },
        "skills": {
            "core": [
                "C#",
                "ASP.NET Webforms",
                "Angular",
                "Bootstrap",
                "CSS3",
                "HTML5",
                "TypeScript",
                "JavaScript",
                "MVC",
                "Knockout",
                "ASP.NET Core",
                "Azure cloud services",
                "Amazon Web Services (AWS)",
                "Entity Framework",
                "SQL Server 2016+",
                "SSIS",
                "SSRS"
            ],
            "primary": [
                "C#",
                "ASP.NET Webforms",
                "RESTFUL development",
                "Visual Studio",
                "HTML5",
                "CSS3",
                "JavaScript",
                "TypeScript",
                "Knockout",
                "Angular",
                "LINQ",
                "Entity Framework",
                "SQL Server",
                "CI/CD pipelines"
            ],
            "secondary": [
                "OpenText Content Server",
                "Adobe Experience Manager"
            ],
            "all": [
                "C#",
                "ASP.NET Webforms",
                "RESTFUL development",
                "VB.NET",
                "ASP.NET Core",
                "Visual Studio",
                "HTML5",
                "CSS3",
                "JavaScript",
                "TypeScript",
                "Knockout",
                "Angular",
                "LINQ",
                "Entity Framework",
                "Team Foundation Server",
                "Azure Dev Ops",
                "GitHub",
                "SQL Server 2016+",
                "SSIS",
                "SSRS",
                "Azure cloud services",
                "AWS (Amazon Web Services)",
                "CI/CD pipelines",
                "Database modeling & Design",
                "Power BI"
            ],
            "with_experience": [
                "ASP.NET",
                "ASP.NET Webforms",
                "RESTFUL development",
                "C#",
                "Visual Studio",
                "HTML5",
                "CSS3",
                "JavaScript",
                "TypeScript",
                "Knockout",
                "Angular",
                "LINQ",
                "Entity Framework",
                "SQL Server",
                "SSIS",
                "SSRS",
                "Azure cloud services",
                "AWS",
                "CI/CD pipelines",
                "Database modeling & Design"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Vineela",
        "email": "vineela@diasoftwaresolutions.com",
        "jd": "State of IA - IA-DOM-HHS-AA2.NET Full Stack Tech Lead Job Id: 748006 Hi, Job ID# 748006 Agency”: State of IA- IA-DOM-HHS-AA2.NET Full Stack Tech Lead Work Arrangement: Onsite Work Location: 200 E Grand Avenue | Des Moines, IA 50309 Max Submittals by Vendor:1 Agency Interview Type: In Person Only Duration of the Project:8+ Months Notes: Please look for candidates who have more than 10+ years of experience and with prior State govt exp is huge plus! Ideally Iowa candidate is highly preferred This is a Senior .NET Developer will be part of a development team and will assist in end-to-end system enhancement, system support and new development using C#, Bootstrap, CSS3, HTML5, TypeScript, JavaScript, Knockout, ASP.NET Webforms, .NET Core, MVC, Entity Framework, Angular, Azure cloud services, Amazon Web Services (AWS), SQL Server including creating stored procedures, functions, tables and creating and maintaining SSIS packages and SSRS reports. This position will be responsible for helping create and maintain code pipelines, perform code reviews and provide guidance and assistance to less experienced developers. This position will assist in developing new enhancements for existing systems and new enterprise solution system development utilizing .NET technologies. The position will be involved in architecting, solutioning, and developing new enterprise solutions as well as assisting other teams in support of applications. As a full stack developer, skills are needed in both front-end and back-end development. C#, Angular, Bootstrap, CSS3, HTML5, TypeScript, JavaScript, MVC, Knockout, ASP.NET Webforms, .NET Core, Azure web services, Amazon Web Services (AWS), Entity Framework and SQL 2016+ Gather business requirements, analyse, and create functional and technical specifications Analyse and design SQL databases and database objects Perform end-to-end development and testing and support business users with user testing for enhancements to the system. Resolve system issues and problem reports reported by end users though the Help Desk. Perform code reviews Setup and maintain CI/CD pipelines Provide technical assistance and guidance to less experienced developers Help establish and enforce coding standards Successful candidates will possess: The ability to analyse new development, or current applications and assist with coding tasks; able to react quickly to changing requirements in an agile environment Self-starter work ethic, adept at providing exceptional results with limited supervision Excellent troubleshooting skills to identify and fix issues reported in existing systems Preference will be given to candidates who can demonstrate knowledgeable experience in any or all the following products: OpenText Content Server Adobe Experience Manager – specifically using Designer, Workbench, and Workflow Fill the above skills in the below box and have consultant to complete SKILLS MATRIX Skill Required Amount of Experience Experience Experience in developing ASP.NET Required 3 Years 10 Years Experience with ASP.NET Webforms Required 10 Years Experience with RESTFUL development for web services and APIs Required 10 Years Experience using C#, VB.NET, and ASP.NET Core Required 10 Years Proficiency with using Visual Studio 2022 and previous versions Required 10 Years Experience in working with HTML5, CSS3, JavaScript, TypeScript, Knockout, and Angular Required 10 Years Experience using LINQ and Entity Framework Required 10 Years Team Foundation Server/Azure Dev Ops or GitHub (or other version control tools) Required 10 Years SQL Server 2016+ Required 8 Years Experience in creating batch packages using SSIS Required 10 Years Experience in creating reports using SSRS Required 5 Years Experience with Microsoft Azure Cloud services Required 6 Years Experience with AWS (Amazon Web Services) Required 6 Years Experience creating and maintaining CI/CD pipelines Required 6 Years Database modeling & Design Required 6 Years Experience in using Power BI Desired OpenText Content Server Desired Adobe Experience Manager – specifically using Designer, Workbench, and Workflow Desired.",
        "source": "Email",
        "date_posted": "2024-09-30 10:28:03-05:00",
        "unique_id": "192438b57072dab9",
        "tag": ".NET Dev"
    }
]