[
    {
        "company": "Themesoft Inc",
        "job_title": "Technical Manager – Cloud Operations and Support",
        "location": "McKinney, TX, USA",
        "full_location": {
            "city": "McKinney",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time"
            ],
            "job_code": "",
            "experience_required": "Hands-on experience in Cloud Operations and Azure IaC projects",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "",
            "rate": ""
        },
        "skills": {
            "core": [
                "Cloud Operations",
                "AZURE",
                "Terraform",
                "Ansible",
                "SQL",
                "Tomcat",
                "WebLogic"
            ],
            "primary": [
                "Stakeholder Management",
                "Project Management",
                "Agile methodology"
            ],
            "secondary": [
                "RCA's",
                "Bug fixes",
                "Reports",
                "Infrastructure automation"
            ],
            "all": [
                "Cloud Operations",
                "AZURE",
                "Terraform",
                "Ansible",
                "SQL",
                "Tomcat",
                "WebLogic",
                "Stakeholder Management",
                "Project Management",
                "Agile methodology",
                "RCA's",
                "Bug fixes",
                "Reports",
                "Infrastructure automation"
            ],
            "with_experience": [
                "Cloud Operations",
                "AZURE",
                "Terraform"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "John Richardson",
        "email": "john@themesoft.com",
        "jd": "Technical Manager – Cloud Operations and Support\nWork Location: McKinney, TX (Onsite)\nNeed to be technically skilled to answer customer queries regarding Cloud technologies. Guide team members to troubleshoot & resolve technical issues. Hands-on experience in Cloud Operations and AZURE IaC projects. Hands-on experience in Terraform. Experience in developing infrastructure and application deployment automation. Experienced in various AZURE services, including RDS. Manage resources to deliver projects on time with quality as the primary goal. Good exposure in Ansible, SQL, Tomcat/WebLogic. Own team deliverables including but not limited to RCA’s, Bug fixes, Reports, and minor enhancements. Need to have complete accountability and ownership. Should be driving the inflight issues and driving solutions. Should have hands-on experience in Stakeholder and Project Management. Act as the SPOC for customer and internal stakeholders from the technical standpoint. Should practice the Agile way of working and collaborate with geographically distributed teams in multiple time zones. Assist with internal and external communication, improving transparency, and radiating information.\nWhat you will do: Leading Cloud Operations and Support teams. Own team deliverables including but not limited to RCA’s, Bug fixes, Reports, and minor enhancements. Stakeholder management Understanding requirements and converting them to user stories Estimation of efforts Resource Planning Responsible for delivery and governance. Represent the team in daily calls and weekly and monthly governance calls with the customer. On-board and plan new resources for the project. Reporting project status to internal and external stakeholders Engage in delivery sync-up. Drive daily scrum calls with the Cloud Operations and Customer Support team and tracks the project progress. Manage invoices. Track burn rate and course correction of the project execution path.",
        "emp_type": [
            "full-time"
        ],
        "source": "Email",
        "date_posted": "2024-09-30 09:42:18-05:00",
        "unique_id": "1924361ab2ff02b5",
        "tag": "BA/Scrum Master/PM"
    }
]