[
    {
        "company": "Source InfoTech Inc.",
        "job_title": "Salesforce BSA",
        "location": "100% Remote, USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "",
            "experience_required": "Proven experience with Salesforce, particularly in business analysis and integrations.",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "3-6 Months",
            "rate": ""
        },
        "skills": {
            "core": [
                "Salesforce",
                "MuleSoft",
                "Business Analysis"
            ],
            "primary": [
                "Salesforce Administrator certification",
                "Salesforce Experience Cloud",
                "Salesforce Service Cloud"
            ],
            "secondary": [
                "API management",
                "Integration best practices"
            ],
            "all": [
                "Salesforce",
                "MuleSoft",
                "Business Analysis",
                "Salesforce Administrator certification",
                "Salesforce Experience Cloud",
                "Salesforce Service Cloud",
                "API management",
                "Integration best practices"
            ],
            "with_experience": [
                "Salesforce",
                "MuleSoft"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Sunny",
        "email": "sunny@sourceinfotech.com",
        "jd": "Client is seeking a skilled Salesforce BSA for a 3-6 month remote contract opportunity. The selected person will be responsible for gathering and documenting requirements and building test cases for integrations that are being pushed into the Salesforce/UCI Ascend ecosystem from MuleSoft. This role will focus on gathering requirements, documenting the integrations into Salesforce, and building robust test cases and acceptance criteria for each integration. The ideal candidate should have a solid understanding of Salesforce Experience Cloud and Service Cloud and be certified as a Salesforce Admin. Key Responsibilities: Collaborate with Subject Matter Experts SME’s, Business Partners, and developers to gather, document, and write business requirements via interviews or recorded sessions for MuleSoft integrations with UCI Ascend (which is their Alumni portal, which is built on Salesforce Experience Cloud – UCI Ascend has integration pathways called Interims built on Salesforce Service Cloud). Analyze, define, and create detailed test cases and acceptance criteria for integration projects. (some integrations are already built, some are not, some have no requirements even yet) Work closely with development teams, MuleSoft developers, and Salesforce admins to ensure seamless integration. Perform gap analysis between current Salesforce functionality and desired business needs. Support user testing, troubleshooting, and issue resolution related to integrations. Required Qualifications: Proven experience with Salesforce, particularly in business analysis and integrations. Salesforce Administrator certification (Salesforce Admin Certified). Hands-on experience working with MuleSoft or other integration platforms. Strong understanding of Salesforce integration methodologies and data mapping. Excellent communication skills for stakeholder management and team collaboration. Detail-oriented with the ability to build clear and thorough acceptance criteria. Preferred Skills: Experience with UCI Ascend / Interims or similar applications. Knowledge of API management and integration best practices.",
        "source": "Email",
        "date_posted": "2024-09-30 12:42:48-05:00",
        "unique_id": "19244074d7281a9e",
        "tag": "BA/Scrum Master/PM"
    }
]