[
    {
        "company": "Tek Inspirations",
        "job_title": "OCM Specialist",
        "location": "Austin, TX, USA",
        "full_location": {
            "city": "Austin",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "hybrid"
            ],
            "job_code": "",
            "experience_required": "3+ years",
            "degree_required": "Bachelor’s degree in Information Technology, Business Administration, Communications, Organizational Change Management or related field",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "6+ Months",
            "rate": ""
        },
        "skills": {
            "core": [
                "OCM methodologies",
                "Stakeholder Analysis",
                "Change Impact Analysis",
                "Communications Assessments",
                "Change management plans",
                "Coaching and guidance",
                "Cross-functional coordination",
                "Communication",
                "Documentation",
                "Relationship building"
            ],
            "primary": [
                "Exceptional verbal and written communication skills",
                "Development of communications plans",
                "Inclusive environment contribution"
            ],
            "secondary": [
                "PROSCI Certification",
                "Marketing experience",
                "Graphic design"
            ],
            "all": [
                "OCM methodologies",
                "Stakeholder Analysis",
                "Change Impact Analysis",
                "Communications Assessments",
                "Change management plans",
                "Coaching and guidance",
                "Cross-functional coordination",
                "Communication",
                "Documentation",
                "Relationship building",
                "Exceptional verbal and written communication skills",
                "Development of communications plans",
                "Inclusive environment contribution",
                "PROSCI Certification",
                "Marketing experience",
                "Graphic design"
            ],
            "with_experience": [
                "OCM methodologies",
                "Change management plans",
                "Coaching and guidance",
                "Documentation"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Mohit Kumar",
        "email": "kumar.mohit@tekinspirations.com",
        "jd": "Title- OCM Specialist Duration- 6+ Months Location- Austin, TX- Hybrid MOI - Skype Qualifications Minimum (Required): 3+ years experience, skills, and working knowledge of OCM methodologies such as PROSCI which includes development of such deliverables as Stakeholder Analysis, Change Impact Analysis and Communications Assessments. 3+ years in addition to analysis, assessments and change strategies and plans, the resource will have experience developing work products that support the change management plans. Execution of plans and work products is expected with stakeholder engagement and end-user adoption critical to success and measured through metrics and reporting (created by the OCM Analyst). 3+ years of providing project teams with coaching and guidance based on industry best practices to improve cross-functional coordination and communication during project execution. 3+ years experience working with and reach all levels of employees. 3+ years experience on large efforts with Agency-wide impact. 3+ years of developing content for dissemination to non-technical users. Ability to write and communicate technical changes to users in non-technical terms. Exceptional verbal and written communication skills. 3+ years of supporting the development and maintenance of relationships within ITD and across the agency. Develops and executes communications plans to communicate project work, priorities, and impacts across the agency in an effort to provide transparency into ITD projects. 3+ years of providing project teams and users with documentation based on industry best practices to improve understanding of technical changes. 3+ years of contributing to an inclusive environment that values differences by building and maintaining collaborative relationships with team members, peers, and ITD leaders. Actively embodies ITD values and behaviors including accountability, ethics, and best-in-class customer service. Contributes to a culture of trust and transparency by sharing information broadly, openly, and deliberately. 3+ years of supporting the vision for Engagement, Culture, and Communications. Works closely with team members and management to implement and support effective solutions for change management. Maintains currency with technology, standards, and best practices. Supports process improvement efforts within the team and across ITD. Preferred (Optional): 4 years of bachelor’s degree in Information Technology, Business Administration, Communications, Organizational Change Management or related field. PROSCI Certification 3 years of marketing and/or corporate communications experience. 3 years of graphic design or visual representation of content to convey messaging.",
        "source": "Email",
        "date_posted": "2024-09-30 11:13:55-05:00",
        "unique_id": "19243b98ce099061",
        "tag": "BA/Scrum Master/PM"
    }
]