[
    {
        "company": "VYZE Inc",
        "job_title": "Organizational Change Management (OCM) Lead",
        "location": "Remote, USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "",
            "experience_required": "7+ years of experience in organizational change management, with at least 3 years in a leadership role.",
            "degree_required": "Bachelor’s degree in Business Administration, Human Resources, Organizational Development, or a related field.",
            "visa_sponsorship": "USC and GCMOI",
            "notice_period": "",
            "duration": "10 Month Contract with extensions",
            "rate": ""
        },
        "skills": {
            "core": [
                "organizational change management",
                "change management strategy",
                "stakeholder analysis",
                "communication planning",
                "training",
                "risk management"
            ],
            "primary": [
                "leadership",
                "communication",
                "presentation",
                "interpersonal skills",
                "analytical skills",
                "problem-solving skills"
            ],
            "secondary": [
                "ADKAR",
                "Kotter’s 8-Step Process"
            ],
            "all": [
                "organizational change management",
                "change management strategy",
                "stakeholder analysis",
                "communication planning",
                "training",
                "risk management",
                "leadership",
                "communication",
                "presentation",
                "interpersonal skills",
                "analytical skills",
                "problem-solving skills",
                "ADKAR",
                "Kotter’s 8-Step Process"
            ],
            "with_experience": [
                "organizational change management",
                "change management methodologies"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Fahad Zafar",
        "email": "fahad@vyzeinc.com",
        "jd": "We are seeking an experienced Offshore Organizational Change Management (OCM) Lead to spearhead all change management activities for our projects. The ideal candidate will be responsible for ensuring successful adoption and implementation of organizational changes while minimizing resistance and maximizing engagement. You will lead a team of change management professionals, collaborating with stakeholders across various functions to drive the change initiatives. Key Responsibilities: Develop and execute a comprehensive change management strategy that aligns with project goals and objectives. Lead all OCM activities throughout the project lifecycle, including stakeholder analysis, communication planning, training, and support. Collaborate with project managers, business leaders, and cross-functional teams to assess the impact of changes on the organization. Conduct change readiness assessments and create plans to address identified gaps and resistance. Design and implement communication strategies to keep stakeholders informed and engaged throughout the change process. Facilitate training sessions and workshops to equip employees with the necessary skills and knowledge for successful adoption. Monitor and measure the effectiveness of change initiatives, providing regular updates to stakeholders and leadership. Foster a culture of change resilience by promoting a positive attitude toward change across the organization. Identify and manage risks associated with change initiatives, ensuring timely mitigation strategies are in place. Stay current with industry trends and best practices in organizational change management. Qualifications: Bachelor’s degree in Business Administration, Human Resources, Organizational Development, or a related field. 7+ years of experience in organizational change management, with at least 3 years in a leadership role. Proven track record of leading change initiatives in a complex, global environment. Strong knowledge of change management methodologies and frameworks (e.g., ADKAR, Kotter’s 8-Step Process). Excellent communication, presentation, and interpersonal skills, with the ability to engage and influence stakeholders at all levels. Strong analytical and problem-solving skills, with a focus on results and outcomes. Ability to work effectively in a remote setting and manage a diverse team across various time zones. Relevant certifications in change management (e.g., Prosci, CCMP) are a plus.",
        "source": "Email",
        "date_posted": "2024-09-30 19:03:50-05:00",
        "unique_id": "192456384b2dde90",
        "tag": "BA/Scrum Master/PM"
    }
]