[
    {
        "company": "Upward Talent Inc.",
        "job_title": "Pega Architect with RPA",
        "location": "Remote, USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [],
            "job_code": "",
            "experience_required": "Min 5 years experience as Systems Architect",
            "degree_required": "Bachelor's degree",
            "visa_sponsorship": "USC Only",
            "notice_period": "",
            "duration": "6+ Months",
            "rate": ""
        },
        "skills": {
            "core": [
                "Pega Systems Architect certification",
                "Azure DevOps",
                "Pega Robotic Process Automation (RPA)",
                "Agile/Scrum development methodology"
            ],
            "primary": [
                "Communication Skills",
                "Troubleshooting",
                "Documentation & User Guides",
                "Critical Thinking & Analysis"
            ],
            "secondary": [
                "digital white-boarding tools",
                "Visio",
                "Adobe XD",
                "PowerPoint",
                "Figma"
            ],
            "all": [
                "Pega Systems Architect certification",
                "Azure DevOps",
                "Pega Robotic Process Automation (RPA)",
                "Agile/Scrum development methodology",
                "Communication Skills",
                "Troubleshooting",
                "Documentation & User Guides",
                "Critical Thinking & Analysis",
                "digital white-boarding tools",
                "Visio",
                "Adobe XD",
                "PowerPoint",
                "Figma"
            ],
            "with_experience": [
                "Pega Systems Architect certification",
                "Azure DevOps",
                "Pega Robotic Process Automation (RPA)"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Diksha Tiwari",
        "email": "dtiwari@upwardtalent.com",
        "jd": "Hope you are doing good. I am hiring a Consultant for one of my client's requirements. Job Description for the same is written below. Job Title: Pega Architect with RPA Location: (Remote) Duration: 6+Months Visa—USC Only Full job description--Working In A Remote Environment: Work in a remote environment and manage a geographically-distributed team. Communication Skills / Collaboration: Communicate clearly and collaborate with teams to iterate on software development concepts and other ideas beneficial to the institute. Discuss and provide analysis of feasibility. Troubleshooting / Analysis: Troubleshoot complex technical issues using tools to help debug and analyze data. Azure DevOps: Manage work in Microsoft Azure DevOps, utilize boards, queries and the creation and updates of pertinent work items. Documentation & User Guides: Develop pertinent documentation and user guides for NIA applications to be used and referred to by fellow developers or NIA Staff. Critical Thinking & Analysis: Solve problems, think critically, and analyze user feedback or requirements. Analyze problems and logically break down into sizable portions which can be presented to development teams or clients for consideration. Required Knowledge and Skills: Bachelor's degree: engineering and technical backgrounds are a plus Min 5 years experience as Systems Architect Pega Systems Architect certification required 3+ years hands on Experience with Pega Robotic Process Automation (RPA) Experience with DevOps tools such as Azure DevOps Experience with digital white-boarding tools (Visio / Adobe XD / PowerPoint / Figma, etc.) Agile/Scrum development methodology knowledge/experience Abilities: Critical thinker with strong problem-solving ability Team player with excellent communication skills Self-motivated with a strong work ethic",
        "source": "Email",
        "date_posted": "2024-09-30 13:55:55-05:00",
        "unique_id": "1924449a3a1e4647",
        "tag": "Pega Dev"
    }
]