[
    {
        "company": "Themesoft Inc",
        "job_title": "Senior Enterprise Architect",
        "location": "Pleasanton, CA, USA",
        "full_location": {
            "city": "Pleasanton",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [],
            "job_code": "",
            "experience_required": "12+ years",
            "degree_required": "Bachelor’s or Master’s degree in Computer Science, Information Technology, or related field",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "",
            "rate": ""
        },
        "skills": {
            "core": [
                "Kubernetes",
                "Azure cloud expertise",
                "GCP"
            ],
            "primary": [
                "cloud computing",
                "enterprise architecture",
                "microservices architecture",
                "data management",
                "application integration"
            ],
            "secondary": [
                "problem-solving",
                "analytical skills",
                "communication skills",
                "leadership",
                "project management abilities"
            ],
            "all": [
                "Kubernetes",
                "Azure cloud expertise",
                "GCP",
                "cloud computing",
                "enterprise architecture",
                "microservices architecture",
                "data management",
                "application integration",
                "problem-solving",
                "analytical skills",
                "communication skills",
                "leadership",
                "project management abilities"
            ],
            "with_experience": []
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "John Richardson",
        "email": "john@themesoft.com",
        "jd": "Role: Senior Enterprise Architect with Kubernetes and Azure cloud expertise. Years of Experience: 12+ years. Location- Pleasanton, CA (3 days- Onsite Mandatory). Updates on this requirement-Very strong in Kubernetes. Hands-on, readiness to code as the client gets into these working sessions with the architect. GCP, some understanding and work on Google Cloud. Key Responsibilities: Architectural Strategy and Planning: Develop and maintain the enterprise architecture framework that aligns with the organization’s business strategy. Work with the IT architecture review board and ensure architectural governance across the organization. Translate business requirements into functional IT architecture and roadmaps. Technology Management: Assess current technologies and systems to ensure they meet the evolving needs of the business. Recommend the adoption of new technologies or architectural changes to drive efficiency, security, and scalability. Define standards and best practices for the selection, integration, and implementation of IT systems. Solution Design and Implementation: Collaborate with diverse teams and other stakeholders to define solution architectures for complex projects. Lead the design and implementation of IT initiatives, ensuring technical solutions meet both current and future requirements. Stakeholder Communication: Act as a liaison between Engineering teams and business leaders to ensure IT projects meet business objectives. Communicate architectural decisions and strategies to key stakeholders. Work with business units to understand their strategic initiatives and translate these into technical requirements. Risk Management and Compliance: Identify potential security, performance, or compliance issues in current and proposed architectures. Ensure the company’s IT architecture adheres to regulatory requirements, industry standards, and best practices. Develop strategies for mitigating potential risks, including disaster recovery and business continuity planning. Team Leadership: Mentor and guide solution architects and technical leads. Foster collaboration across various teams within the organization. Provide thought leadership on IT architecture. Qualifications: Education: Bachelor’s or Master’s degree in Computer Science, Information Technology, or related field. Experience: Minimum of 12+ years of experience in IT with at least 5 years in architecture roles. Demonstrated experience in enterprise-level architecture and integration across diverse technology platforms. Certifications: TOGAF or other relevant architectural certifications preferred. Strong knowledge of enterprise architecture frameworks and methodologies. Expertise in cloud computing, microservices architecture, data management, and application integration. Excellent problem-solving and analytical skills. Strong communication skills, with the ability to articulate complex technical concepts to non-technical stakeholders. Experience with cloud platforms (Azure, GCP), and security best practices. Strong leadership and project management abilities.",
        "source": "Email",
        "date_posted": "2024-09-30 09:07:43-05:00",
        "unique_id": "19243421663270c4",
        "tag": "Azure Data Engineer"
    }
]