[
    {
        "company": "DMS Visions Inc",
        "job_title": "Project Manager",
        "location": "Livonia, MI, USA",
        "full_location": {
            "city": "Livonia",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [],
            "job_code": "",
            "experience_required": "Moderately complex application development and IT infrastructure projects typically 6 – 12 months in length.",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "6+ months",
            "rate": ""
        },
        "skills": {
            "core": [
                "Project Management",
                "Telephone Systems",
                "Communication Implementation"
            ],
            "primary": [
                "Genesys Call Center",
                "Salesforce Integration"
            ],
            "secondary": [],
            "all": [
                "Project Management",
                "Telephone Systems",
                "Communication Implementation",
                "Genesys Call Center",
                "Salesforce Integration"
            ],
            "with_experience": [
                "Telephone Systems"
            ]
        },
        "job_type": [
            "Hybrid"
        ],
        "contact_person": "Yashwant Singh",
        "email": "yashwant@dmsvisions.com",
        "jd": "Position: Project manager (Hybrid) Location: (Livonia, MI) Local only Duration: 6+ months Job Description:This project is to implement Genesys Call Center with integration into Salesforce. Genesys is not required but experience with telephone systems and implementing communications is required. The client is looking for someone that can clearly define ‘how would you start this project’ -they want someone that would lay out what they would need and how they would go about and find the info and use all the tools in the toolbelt. General Purpose Operating within the core values and operating principles of the organization, manages moderately complex application development and IT infrastructure projects typically 6 – 12 months in length. Project Managers are responsible for facilitating project lifecycle activities such as initiation, kickoff and ceremonies such as Standup, Backlog Grooming, Retrospectives and Story Mapping. Project tasks include estimating, planning, resourcing, budgeting, development, quality assurance, deployment and post-production support. Position Responsibilities 1. Manage diverse project teams which may include a variety of cross-functional resources such as developers, quality analysts, business analysts and project sponsors 2. Define the project schedule 3. Manage project budget, scope and risk 4.",
        "emp_type": [],
        "source": "Email",
        "date_posted": "2024-09-30 19:06:47-05:00",
        "unique_id": "192456637552cbfa",
        "tag": "BA/Scrum Master/PM"
    }
]