[
    {
        "company": "Kovan Technology Solutions",
        "job_title": "Java IVR Developer",
        "location": "Remote, USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "",
            "experience_required": "Minimum of 4 years of experience in IVR development",
            "degree_required": "Bachelor’s degree in Computer Science, Information Technology, or a related field",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "Contract",
            "rate": ""
        },
        "skills": {
            "core": [
                "IVR",
                "VXML",
                "GDF",
                "Java",
                "SQL"
            ],
            "primary": [
                "IVR application development",
                "speech recognition",
                "text-to-speech"
            ],
            "secondary": [
                "integration with backend systems",
                "call flow design"
            ],
            "all": [
                "IVR",
                "VXML",
                "GDF",
                "Java",
                "SQL",
                "Cyara",
                "Avaya",
                "Genesys",
                "Amazon connect",
                "Watson",
                "Nuance"
            ],
            "with_experience": [
                "IVR development",
                "IVR testing",
                "IVR system maintenance"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Naveen R",
        "email": "naveen@kovantech.com",
        "jd": "We are seeking a skilled IVR Developer with expertise in few or more of IVR development technologies VXML, GDF, IVR, Cyara, Avaya, Genesys, Amazon connect, Watson and Nuance. The successful candidate will be responsible for designing, developing, and maintaining interactive voice response (IVR) systems to enhance customer experience and streamline operations. Key Responsibilities: Design and Development: Design and develop IVR applications using VXML and GDF. Integrate IVR solutions with backend systems and databases using Java and SQL. Develop call flows for inbound and outbound IVR systems. Testing and Deployment: Perform unit, functional and integration testing of IVR applications. Use Cyara for automated testing and monitoring of IVR systems. Deploy IVR applications on Avaya and Genesys platforms. Integration and Maintenance: Integrate speech recognition and text-to-speech technologies using GDF. Monitor and maintain IVR systems to ensure high availability and performance. Troubleshoot and resolve issues related to IVR applications and infrastructure. Collaboration: Work closely with cross-functional teams, including business analysts, QA engineers, and project managers. Provide technical support and training to other team members and stakeholders.Qualifications: Technical Skills: Proficient in VXML, GDF, and IVR application development. Expertise in few or more of IVR technologies/products like GDF, Avaya, Genesys, Amazon connect, Watson and Nuance, Avaya and Genesys platforms. Familiarity with Cyara for IVR testing and monitoring. Strong understanding of inbound and outbound call flow design. Experience: Minimum of 4 years of experience in IVR development. Experience in deploying and maintaining IVR systems in a production environment. Knowledge of telephony protocols and standards. Education: Bachelor’s degree in Computer Science, Information Technology, or a related field. Soft Skills: Excellent problem-solving and analytical skills. Strong communication and interpersonal skills. Ability to work independently and as part of a team.",
        "source": "Email",
        "date_posted": "2024-09-30 14:53:54-05:00",
        "unique_id": "19244823088420c3",
        "tag": "Java Dev"
    }
]