[
    {
        "company": "Sligo Software Solutions, Inc.",
        "job_title": "Kronos Senior Business Analyst Lead",
        "location": "New York, New York, USA",
        "full_location": {
            "city": "New York",
            "state": "New York",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "remote",
                "onsite"
            ],
            "job_code": "",
            "experience_required": "Proven experience as a Business Analyst Lead with a focus on Kronos or UKG Pro WFM implementations.",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "1 year 1 day(s)",
            "rate": ""
        },
        "skills": {
            "core": [
                "Kronos",
                "UKG Pro WFM",
                "stakeholder management",
                "business requirements",
                "Peoplesoft development",
                "test script design",
                "integration tools",
                "Kronos Boomi",
                "leadership"
            ],
            "primary": [
                "Kronos Workforce Central",
                "Kronos ProWFM",
                "testing",
                "data extraction",
                "system configuration",
                "project coordination"
            ],
            "secondary": [
                "Mobile",
                "Analytics",
                "Workforce Central modules",
                "communication",
                "analytical skills",
                "problem-solving"
            ],
            "all": [
                "Kronos",
                "UKG Pro WFM",
                "stakeholder management",
                "business requirements",
                "Peoplesoft development",
                "test script design",
                "Kronos Boomi",
                "leadership",
                "Kronos Workforce Central",
                "Kronos ProWFM",
                "testing",
                "data extraction",
                "system configuration",
                "project coordination",
                "Mobile",
                "Analytics",
                "Workforce Central modules",
                "communication",
                "analytical skills",
                "problem-solving"
            ],
            "with_experience": [
                "Kronos",
                "UKG Pro WFM",
                "Peoplesoft HRMS",
                "integration with WFM systems"
            ]
        },
        "job_type": [
            "remote",
            "onsite"
        ],
        "contact_person": "Praveen Pasumarthi",
        "email": "praveen.pasumarthi@sligosoft.com",
        "jd": "Greetings from Sligo Software Solutions, Inc. !!SLIGO is a Software Development & IT Consulting company. We have around 100+ IT associates working with our esteemed clients across several domains such as IT, Banking, Healthcare, and Government. We have an urgent requirement for Kronos Senior Business Analyst Lead - REMOTE position with our client. Role: Kronos Senior Business Analyst Lead - REMOTE Location: New York, New York Duration: 1 year 1 day(s) Respond by Date: 09/30/24 3:00 PM Kronos Senior Business Lead position :Find below details. Let me know if you can help. ***This is a New, Remote role. There will be some onsite work required as is necessary. *** MTA is seeking a Kronos Senior Business Analyst Lead to support the upgrade from Kronos Workforce Central to UKG Pro Workforce Management (WFM). This role involves consolidating five WFC instances into a single KronosWFM instance, managing complex integrations, and ensuring seamless data transfer with PeopleSoft HRMS and other legacy systems. The role requires a strong understanding of stakeholder management, business requirements, Peoplesoft development and testing processes. Key Responsibilities: Stakeholder Management: Collaborate effectively with business and IT stakeholders to gather and understand requirements for the UKG Pro WFM upgrade. Requirement Analysis: Analyze business requirements and ensure they are accurately translated into functional specifications. Test Script design and Development: Develop and manage test scripts using the designated testing tool to ensure comprehensive coverage of business scenarios. Experience in implementing and configuring Kronos Workforce Central Suite and Kronos ProWFM. Experience in configuring Kronos Workforce Timekeeper. Knowledge of Activities, Mobile, Analytics and other Workforce Central modules is a plus. Knowledge of full life-cycle of a project including gathering detailed requirements, being able to develop a design and then building of the design to deliver the solution to the client. Excellent client interaction and communication skills are needed. Data extraction from WFC, cleansing, reformatting as per latest configuration and upload into proWFM. Adoptability to learn SI tools and accelerators to leverage Willing to travel to customer’s location as needed. Team Leadership: Lead a team of Kronos analysts in testing and validating system configurations and integrations. Integration Oversight: Work with the system integrator and PMO to ensure successful integration with PeopleSoft and other legacy systems using Kronos Boomi middleware. Configuration Validation: Ensure accurate configuration and validation of pay rules. CBA's and payroll processing, maintaining pay rates in PeopleSoft. Project Coordination: Coordinate with the MTA Program Manager to align project objectives and timelines, ensuring successful project delivery. Qualifications: Proven experience as a Business Analyst Lead with a focus on Kronos or UKG Pro WFM implementations. Strong stakeholder management skills and the ability to work collaboratively with cross-functional teams. Experience in developing test scripts and leading testing efforts for complex systems. Familiarity with integration tools and middleware, particularly Kronos Boomi. Experience and expertise Knowledge of PeopleSoft HRMS and its integration with WFM systems. Excellent communication and leadership skills. Strong analytical and problem-solving abilities. Reporting:This role reports directly to the MTA Kronos Program Manager. Additional Skills and Information: Peoplesoft HRMS, Boomi middleware, Test Assure testing tool.",
        "source": "Email",
        "date_posted": "2024-09-30 12:12:11-05:00",
        "unique_id": "19243ec80c0a7891",
        "tag": "BA/Scrum Master/PM"
    }
]