[
    {
        "company": "HAN IT Staffing",
        "job_title": "Business Analyst (Payments Domain)",
        "location": "New York City, Jersey City NJ, Pittsburgh PA, USA",
        "full_location": {
            "city": "New York City",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "job_code": "",
            "experience_required": "7+ Years of Business Analysis experience in Payments/Cash Management domain",
            "degree_required": "",
            "visa_sponsorship": "",
            "notice_period": "",
            "duration": "Long-Term Contract",
            "rate": ""
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Payments",
                "Cash Management",
                "Data Analytics"
            ],
            "primary": [
                "Business Requirements",
                "Functional Specifications",
                "User Documentation",
                "Testing"
            ],
            "secondary": [
                "Project Scope",
                "Design Support",
                "Process Improvement"
            ],
            "all": [
                "Business Analysis",
                "Payments",
                "Cash Management",
                "Data Analytics",
                "Business Requirements",
                "Functional Specifications",
                "User Documentation",
                "Testing",
                "Project Scope",
                "Design Support",
                "Process Improvement"
            ],
            "with_experience": [
                "Payments",
                "Cash Management"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Rohith Reddy",
        "email": "rohithr@hanstaffing.com",
        "jd": "Role: Business Analyst (Payments Domain)Location: New York City /Jersey City NJ /Pittsburgh PADuration: Long-Term Contract Job Description7+ Years of Business Analysis experience in Payments/Cash Management domain experience is highly preferred.Analyses and defines business requirements and functional or operational specifications for small to moderate sized projects of limited complexity. Formulates and defines system scope and objectives. Interfaces with all areas of IT on behalf of the business to resolve IT matters and improve business processes.Collects and defines business or functional requirements and translates them into functional design, test planning, and user documentation processes. Formulates project scope, objectives, constraints and assumptions based upon user needs as well as knowledge of the application.Participates in development of the functional design and user documentation by analyzing business process flows or client requests and identifying changes. Uses knowledge of business needs to provide design support to software and application development teams.Gathers information and provides analysis of business issues or client feedback for a specific function or application.Trains users on new or enhanced applications and/or systems that are more straightforward in nature.Supports testing of new or enhanced applications and/or systems. Tasks include case development, requirement traceability analysis, test preparation, script writing, and functional test execution. Identifies areas for improvement and works with technology teams to improve applications for business use.Uses general knowledge of regulatory and legal requirements and client corporate policies involving risk and control to support the development of improved business processes through technology.Good understanding of Data AnalyticsResponsibilitiesAnalyses and defines business requirements and functional or operational specifications for small to moderate sized projects of limited complexity. Formulates and defines system scope and objectives. Interfaces with all areas of IT on behalf of the business to resolve IT matters and improve business processes.Collects and defines business or functional requirements and translates them into functional design, test planning, and user documentation processes. Formulates project scope, objectives, constraints and assumptions based upon user needs as well as knowledge of the application.Participates in development of the functional design and user documentation by analyzing business process flows or client requests and identifying changes. Uses knowledge of business needs to provide design support to software and application development teams.",
        "emp_type": [
            "contract"
        ],
        "source": "Email",
        "date_posted": "2024-09-30 12:41:12-05:00",
        "unique_id": "1924405c745e5441",
        "tag": "BA/Scrum Master/PM"
    }
]