[
    {
        "company": "XFORIA",
        "job_title": "JAVA AWS Developer",
        "location": "NYC, NY, USA",
        "full_location": {
            "city": "NYC",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "",
            "visa_sponsorship": "H1B only",
            "notice_period": "",
            "duration": "",
            "rate": ""
        },
        "skills": {
            "core": [
                "Java",
                "Spring boot",
                "Microservices",
                "AWS"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Java",
                "Spring boot",
                "Microservices",
                "AWS",
                "J2EE",
                "Webservices",
                "PL/SQL",
                "Object Oriented Analysis",
                "Object Oriented Design",
                "SCM tools",
                "GIT",
                "Jenkins",
                "MVC",
                "Java Design Patterns",
                "JUnit",
                "Relational Databases",
                "Oracle",
                "SQL Server",
                "SQL",
                "SOAP",
                "REST",
                "IntelliJ",
                "Maven",
                "Tomcat"
            ],
            "with_experience": []
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "PAVITHRA",
        "email": "pavithra.s@xforia.com",
        "jd": "Mandate skills: Java, Spring boot, Microservices, AWS Job Description: Experience in Agile software development methodology and practices with full development lifecycle from inception through implementation. Required: Java, J2EE, Spring, Microservice, Webservices, PL/SQL Working knowledge of Object Oriented Analysis/Object Oriented Design methodologies and life cycles. Demonstrated experience with SCM tools such as GIT, Jenkins Experience with application development on Java, J2EE, Spring, and MVC, Java Design Patterns and JUnit. Knowledge of Relational Databases like Oracle/SQL Server, SQL Knowledge of Web service technologies including SOAP/REST. Strong working knowledge of IntelliJ, Maven and Tomcat. Ability to work collaboratively in teams and develop meaningful relationships to achieve common goals Knowledge of architecture, design and business processes Proficiency in modern programming languages Experience in design and build of complex application systems using the new banking architecture including Java/J2EE/Spring technologies. Proficiency in one or more general purpose programming languages including Java/J2EE/JSP based Web applications/Middleware and Batch systems. Experience in design, analysis, development, coding, unit testing, debug and documentation for Java/J2EE systems including Web applications, business services, batch applications, large/complex projects and utilizing Web Services and Java RMI technologies to improve interface/API and significantly enhance integration capability between front-end and back-end systems.",
        "emp_type": [],
        "source": "Email",
        "date_posted": "2024-09-30 12:49:56-05:00",
        "unique_id": "192440d392c04eeb",
        "tag": "Java Dev"
    }
]