[
    {
        "company": "STELLENT IT",
        "job_title": ".NET Application Architect",
        "location": "Remote (from within the State of Wisconsin), USA",
        "full_location": {
            "city": "",
            "state": "Wisconsin",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [],
            "job_code": "",
            "experience_required": "6 years",
            "degree_required": "",
            "visa_sponsorship": "NO H1B",
            "notice_period": "",
            "duration": "12 months",
            "rate": ""
        },
        "skills": {
            "core": [
                ".NET",
                "VB Net",
                "ASP Net",
                "C#",
                "MVC",
                "Oracle",
                "SQL",
                "XML",
                "Agile"
            ],
            "primary": [
                ".Net (MS)",
                "Team Foundation Server",
                "Stored procedures",
                "Triggers",
                "Oracle SQL Tuning",
                "Change management",
                "MVVM"
            ],
            "secondary": [
                "MS Word",
                "Excel",
                "Outlook"
            ],
            "all": [
                ".NET",
                "VB Net",
                "ASP Net",
                "C#",
                "MVC",
                "Oracle",
                "SQL",
                "XML",
                "Agile",
                "Team Foundation Server",
                "Stored procedures",
                "Triggers",
                "Oracle SQL Tuning",
                "Change management",
                "MVVM",
                "Requirements gathering",
                "Design",
                "Coding",
                "Testing",
                "Implementation",
                "Support"
            ],
            "with_experience": [
                ".NET",
                "VB Net",
                "ASP Net",
                "C#",
                "MVC",
                "Oracle",
                "SQL",
                "XML",
                "Agile"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Avinash Kumar",
        "email": "avinashk@stellentit.com",
        "jd": "Position : .NET Application Architect\nLocation : Remote (from within the State of Wisconsin)\nDuration 12 months\nInterview Method : In-Person ONLY LOCAL And NO H1B\nDescription: Our client is seeking a .NET Application Architect. This position will be responsible for the development and support of critical priority applications. Will play an integral role on self-directed work teams in support of high priority development projects. Application architecture design and development. Integration with 3rd party software. Data conversion. New development and modifications to existing code. Designing, creating, and maintaining web services, system integration, web development, and Agile Scrum development methodology. Knowledge, Skills and Abilities Required: Highly technically competent. Consistently high producer. Excellent oral and written communication skills. Solutions-oriented. Enthusiastic to mentor junior developers. Technical thought leader. Overall team player. Excellent analytical skills. Skills Required: 6 years - Previous work experience in government, insurance, accounting, or case management. 6 years - Previous work experience in online transaction processing (OLTP) web application development and batch processing. 6 years - Experience leading teams, planning and estimating projects, guiding underlying application architecture, establishing governance of process and best practices. 6 years - Experience with implementation and ongoing support of multi-platform applications. Specifically Microsoft Webforms and MVC Web browser user interfaces, as well as services. 6 years - Keeping a strong pulse on technological trends, making recommendations on emerging technologies, and identifying problems that can be solved with emerging tools. 6 years - Web and client server application development experience, including requirements gathering, design, coding, testing, implementation and support. 6 years - Evaluate and recommend programming languages, design tools and applications. MS Word, Excel, Outlook experience. 6 years - Change management experience. 6 years - Understanding of project management methodologies and experience with Agile. 4 years - MVVM (Model View View Model) experience. 6 years - Structured Analysis and Design of Web and Client-Server applications for both transactional and batch applications. 3 years - Stored procedures and triggers experience. 3 years - Oracle experience. 3 years - Oracle SQL Tuning experience. 5 years - .Net (MS) experience. 3 years - VB Net / ASP Net experience. 5 years - C#.net experience. 3 years - MVC (Model View Controller) experience. 3 years - Team Foundation Server experience. 3 years - Experience with Oracle PL/SQL. 6 years - Documenting Requirements experience. 6 years - Experience as a developer in a large, very complex organization. 6 years - In-Depth knowledge of System Development Lifecycle Deliverables (SDLC) for each phase of development. 6 years - Experience in Requirements Gathering / Analysis. 3 years - User test, System Test, and User Acceptance Test Plans.",
        "emp_type": [],
        "source": "Email",
        "date_posted": "2024-09-30 13:14:48-05:00",
        "unique_id": "1924424016a19af0",
        "tag": ".NET Dev"
    }
]