[
    {
        "company": "Vyze",
        "job_title": "Technical Business Analyst",
        "location": "Chicago, IL, USA",
        "full_location": {
            "city": "Chicago",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Technical Degree or related work experience",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Technical Degree or related work experience",
                "Proven experience in an analytics and systems development capacity",
                "Proficiency with digital analytics e.g. google analytics, google ad manager",
                "Proven analytical abilities",
                "Excellent communicator with the ability to translate data into actionable insights",
                "Knowledge of SAFe and Scrum",
                "Experience in JIRA tool"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Technical Degree or related work experience",
                "Proven experience in an analytics and systems development capacity",
                "Proficiency with digital analytics e.g. google analytics, google ad manager",
                "Proven analytical abilities",
                "Excellent communicator with the ability to translate data into actionable insights",
                "Knowledge of SAFe and Scrum",
                "Experience in JIRA tool"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Aryan Sinha",
        "email": "aryan@vyzeinc.com",
        "jd": "Job Description -Technical BAHybrid(Chicago, IL)Visa: NO h1B/CPT/OPTDuration: 6 monthsProject descriptionFor one of the ongoing initiative of DOT COM area, is looking for a well experienced Tech BA who worked in a large scale integration program. This is a Chicago based onsite position with long term opportunity.ResponsibilitiesThis role involves serving as a liaison between business challenges and technology solutions.The key responsibilities include analyzing business processes, identifying business needs, and proposing solutions that may involve software system development, process improvements, or organizational changes. Technical Business Analyst is responsible for gathering and documenting requirements, conducting business and systems analysis, creating specifications for systems to meet business requirements, and overseeing the implementation of these systems.This role requires a combination of IT and business skills, as well as the ability to communicate effectively with both technical and non-technical stakeholders. Looking for an experienced BA who can write the user stories for dev and EQA team with enough details without much supervision Prefer local to Chicago since they have work with product owners and participate in PI planning sessions etc. Experience with media player, entertainment domainSkillsMust haveTechnical Degree or related work experienceProven experience in an analytics and systems development capacityProficiency with digital analytics e.g. google analytics, google ad managerProven analytical abilitiesExcellent communicator with the ability to translate data into actionable insightsKnowledge of SAFe and ScrumExperience in JIRA toolNice to havePrefer local to Chicago since they have work with product owners and participate in PI planning sessions etc.",
        "source": "Email",
        "date_posted": "2024-10-23 21:30:11-05:00",
        "unique_id": "192bc7c70a1112b7",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]