[
    {
        "company": "GA DHS",
        "job_title": "Senior Software Developer",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "749887",
            "experience_required": "11+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months",
            "rate": "$53.75/hour"
        },
        "skills": {
            "core": [
                "Java",
                "Node.js",
                "ServiceNow",
                "Splunk",
                "Dynatrace",
                "Spring Framework",
                "Microservices Architecture",
                "Java Server Pages",
                "Database Management",
                "RESTful Web Services",
                "CI/CD",
                "KeyCloak Integration",
                "Scripting Languages",
                "SQL"
            ],
            "primary": [
                "Java (Java 17+)",
                "PostgreSQL",
                "Oracle",
                "GitHub Actions",
                "JUnit",
                "TestNG",
                "Mockito",
                "AWS"
            ],
            "secondary": [
                "HTML",
                "CSS",
                "JavaScript",
                "Angular 17+",
                "Maven",
                "NPM",
                "OAuth2.0",
                "JWT tokens",
                "SAML/SSO integration",
                "Bash",
                "PowerShell",
                "Python",
                "Teradata Retail Data Model (RDM)"
            ],
            "all": [
                "Java",
                "Node.js",
                "ServiceNow",
                "Splunk",
                "Dynatrace",
                "Spring Framework",
                "Microservices Architecture",
                "Java Server Pages",
                "Database Management",
                "RESTful Web Services",
                "CI/CD",
                "KeyCloak Integration",
                "Scripting Languages",
                "SQL",
                "Java (Java 17+)",
                "PostgreSQL",
                "Oracle",
                "GitHub Actions",
                "JUnit",
                "TestNG",
                "Mockito",
                "AWS",
                "HTML",
                "CSS",
                "JavaScript",
                "Angular 17+",
                "Maven",
                "NPM",
                "OAuth2.0",
                "JWT tokens",
                "SAML/SSO integration",
                "Bash",
                "PowerShell",
                "Python",
                "Teradata Retail Data Model (RDM)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Zara Khan",
        "email": "info@techbrandstaffing.com",
        "jd": "Greetings, Must have 11+ Years of experience, Must have experience with Java, Node.js, ServiceNow, Splunk, Dynatrace Hope you're doing great, This is Zara Khan from Tech Brand Staffing LLC. I've been retained by a top employer to help them recruit for a new GA DHS - Senior Software Developer (749887) position. Please review the below job description and reply back with your updated resume and desired rate. Title: GA DHS - Senior Software Developer (749887) Duration: 12 Months Location: Atlanta, GA Rate : 53.75/hr Please fill this box: Skill Required years req Years Used Last Used Experience in Java and modern technologies. Required 7 Java (Java 17+) features such as records, sealed classes, switch expressions, pattern matching, and enhanced performance improvements. Required 3 Node 16+ Required 3 ServiceNow, Splunk, Dynatrace Required 3 Spring Framework (Spring Boot, Spring MVC, Spring Data, Spring Security, Spring Batch) Required 3 Microservices Architecture (Designing, developing, and deploying microservices) Required 3 Java Server Pages (creating dynamic web pages and integrating with back-end logic) Required 3 Database Management (PostgreSQL, Oracle and experience with ORM tools like Hibernate) Required 3 RESTful Web Services (API development, consumption, and integration) Required 3 CI/CD: GitHub Actions Required 3 KeyCloak Integration: Integrate KeyCloak with Java-based applications and services for API authentication Required 3 Scripting Languages: Proficiency in one or more scripting languages, such as Bash, or PowerShell, Python Required 3 Proficiency in SQL and experience with relational databases (e.g., MySQL, PostgreSQL, Oracle). Required 3 Job description · Develop and maintain Java-based applications using core Java and advanced Java (Java 17). · Design and implement microservices using Spring Boot and other relevant frameworks. · Build and consume RESTful APIs and web services. · Integrate with databases, ensuring performance optimization (e.g., SQL databases like PostgreSQL, Oracle). · Write unit and integration tests using JUnit, TestNG, Mockito, or other testing frameworks. · Develop SQL queries and analyze data to support application development and production issues. · Implement object-oriented design principles and patterns for scalable and maintainable codebases. · Ensure adherence to clean code principles and write reusable, modular code. · Troubleshoot and debug Java applications, ensuring optimal performance and security. · Participate in code reviews and provide constructive feedback to peers. · Follow Agile methodologies (Scrum) and participate in sprints, daily stand-ups. · Use version control systems like GitHub for source code management. · Implement and manage CI/CD pipelines using GitHub Actions. · Collaborate with DevOps teams for cloud deployment and infrastructure management (AWS). · Design, configure, and implement Spring Batch jobs for processing large datasets and scheduling tasks. · Implement dynamic web pages and views using JSP (Java Server Pages). · Design and implement authentication and authorization mechanisms using Key Cloak for identity and access management, ensuring secure communication through OAuth2.0 and JWT tokens. · Leverage SAML/SSO integration for single sign-on and authentication. Experience and Technical Skills Required · Seven (7) years of experience in Java and modern technologies. · Previous experience using - Java (Java 17+) features such as records, sealed classes, switch expressions, pattern matching, and enhanced performance improvements - Node 16+ - ServiceNow, Splunk, Dynatrace - Spring Framework (Spring Boot, Spring MVC, Spring Data, Spring Security, Spring Batch) - Microservices Architecture (Designing, developing, and deploying microservices) - Java Server Pages (creating dynamic web pages and integrating with back-end logic) - Database Management (PostgreSQL, Oracle and experience with ORM tools like Hibernate) - RESTful Web Services (API development, consumption, and integration) - Thorough understanding of REST, SOAP, Web services and API Communication protocols S/FTP/S, HTTP/S, File I/O etc. - Testing: JUnit, TestNG, Mockito - Version Control: GitHub - Build Tools: Maven, NPM - CI/CD: GitHub Actions - Cloud Platforms: Amazon Web Services - Frontend Integration: Understanding of HTML, CSS, JavaScript, and Angular 17+ - IDE: IntelliJ, Eclipse etc. - Security & Identity Management: Experience with OAuth2.0, JWT tokens, and SAML/SSO integration for authentication and authorization - Key Cloak Integration: Integrate Key Cloak with Java-based applications and services for API authentication - Scripting Languages: Proficiency in one or more scripting languages, such as Bash, or PowerShell, Python - Teradata Retail Data Model (RDM): RDM systems experience is a plus Thanks & Regards, Zara Khan",
        "source": "Email",
        "date_posted": "2024-10-24 14:19:46-05:00",
        "unique_id": "192c01a0f1576797",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]