[
    {
        "company": "Tek Inspirations LLC",
        "job_title": "Java Backend",
        "location": "New York, NY, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "15 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Spring Boot",
                "Kotlin",
                "Object-Oriented Design",
                "Microservices"
            ],
            "primary": [
                "SQL",
                "RDBMS",
                "NoSQL",
                "API Development",
                "Cloud Development",
                "CICD",
                "Agile"
            ],
            "secondary": [
                "DevOps",
                "Automation",
                "Event Driven Architecture",
                "Technical Mentoring",
                "Communication"
            ],
            "all": [
                "Java",
                "Spring Boot",
                "Kotlin",
                "Object-Oriented Design",
                "Microservices",
                "SQL",
                "RDBMS",
                "NoSQL",
                "API Development",
                "Cloud Development",
                "CICD",
                "Agile",
                "DevOps",
                "Automation",
                "Event Driven Architecture",
                "Technical Mentoring",
                "Communication"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Sanjeev Kumar Singh",
        "email": "sanjeev.singh@tekinspirations.com",
        "jd": "From: Sanjeev Kumar Singh, Tek Inspirations LLC sanjeev.singh@tekinspirations.com Reply to: sanjeev.singh@tekinspirations.com Job Description -Java Backend (Onsite) NY 15 Years Candidate Need to relocate if PA And NJInterview Will be anytime this week.JOB DESCRIPTIONThe client is looking for a Senior Developer to drive our customer experience strategy forward by consistently innovating and problem-solving. Our solutions are built on the Digital Network Architecture, around Cloud Native principles and in a Scaled Agile Framework. The ideal candidate is passionate about the customer experience journey, highly motivated, intellectually curious, analytical, and possesses an entrepreneurial mindset.The Role• Senior Developer with adequate skills and experience delivering design/code of high quality• Drive design and development in Java 8 and above using Object Oriented SOLID principles and patterns towards creating reusable and scalable microservices leveraging technologies such as Spring Boot Framework, and Event Driven Architecture.• Develop in a CICD environment leveraging any one of the Cloud frameworks.• Leverage the appropriate persistence mechanisms such as RDBMS, No SQL etc based on needs• Implement Coding Best Practices. Implement Code Quality gates as per the program norms.• Perform various Proofs-of-concept depending on the business needs• Coordinate with various groups to ensure success of the projects• Exhibit teamwork aligned completely with the Agile environment• Provide technical mentoring/training for junior developers based on the needsAll About You• Strong Java, Kotlin and object-oriented design and development skills.• Strong fundamentals of Spring Boot, microservices and SQL based database (Oracle and PostgreSQL).• Proven track record in API based products• You care about the technical architecture and design - ensuring that the solution is flexibly designed and performs efficiently.• Experienced working in an Agile environment with a global team that makes frequent production releases.• Background in Dev/Ops a distinct advantage.• Background in automation a distinct advantage.• Experience in designing and delivering APIs and security models an advantage• You strive to create highly intuitive and responsive products.• Passionate about technology, with strong Object-Oriented Design & Programming skills• In depth knowledge on product development• Strong expertise in Java and Spring Boot. Experience working on Event Driven Architecture would be an advantage.• Experience in Online / Real Time Systems development• Experience in CI and CD• Experience in Cloud based development is desirable• Strong Communicator• Quick grasping and learning abilities• Technical Mentoring Skills",
        "source": "Email",
        "date_posted": "2024-10-23 11:07:43-05:00",
        "unique_id": "192ba5f5513580d0",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]