[
    {
        "company": "Neo Tech Solutions, Inc.",
        "job_title": "Senior Agile Program Manager",
        "location": "Trenton, NJ, USA",
        "full_location": {
            "city": "Trenton",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Agile Program Management",
                "Salesforce",
                "Snowflake",
                "AWS"
            ],
            "primary": [
                "Leadership",
                "Problem-solving",
                "Organizational skills",
                "Communication",
                "Stakeholder management"
            ],
            "secondary": [
                "Agile methodologies",
                "Continuous improvement",
                "Agile ceremonies"
            ],
            "all": [
                "Agile Program Management",
                "Salesforce",
                "Snowflake",
                "AWS",
                "Leadership",
                "Problem-solving",
                "Organizational skills",
                "Communication",
                "Stakeholder management",
                "Agile methodologies",
                "Continuous improvement",
                "Agile ceremonies"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Venkat Ram",
        "email": "venkat@neotechusa.com",
        "jd": "Hi ,Hope you are doing wellPlease find the below Job Description and let me know if you are interested in applying for this position. Position: Senior Agile Program ManagerDuration: ContractLocation: Trenton, NJ Job Description:We are seeking a Senior Agile Program Manager to drive the successful delivery of complex projects using Agile methodologies. This role involves collaborating with cross-functional teams and working with Salesforce, Snowflake, and AWS technologies.Under the direction of a supervisor in the Office of Information Technology at the New Jersey Department of Education, this position will be responsible for overseeing the planning, execution, and delivery of multiple Agile projects, ensuring alignment with business objectives. This role involves collaborating with cross-functional teams, managing program timelines, and driving continuous improvement across projects. The successful candidate will interact with key technologies such as Salesforce, Snowflake, and AWS to ensure seamless program delivery and efficient operations. The candidate will follow Agile best practices, remove roadblocks, and work closely with stakeholders to ensure goals are met on time and within scope.Key Responsibilities:Lead and manage the delivery of complex, high-impact programs using Agile methodologies.Partner with product owners, stakeholders, and cross-functional teams to align priorities and ensure strategic objectives are met.Facilitate Agile ceremonies (standups, retrospectives, planning) and drive continuous improvement across teams.Identify and address any impediments that may affect program timelines or deliverables.Implement scalable Agile practices and Agile principles.Communicate program status, risks, and opportunities to stakeholders and executives.Ensure programs are delivered on time, within budget, and meet quality standards.Qualifications:Extensive experience in Agile Program Management, with a proven track record of leading successful Agile transformations.Experience working with Salesforce, Snowflake, and AWS technologies. (Desired)Strong leadership, problem-solving, and organizational skills.Excellent communication and stakeholder management abilities.Experience in scaling Agile practices across teams and departments.",
        "source": "Email",
        "date_posted": "2024-10-23 12:23:21-05:00",
        "unique_id": "192ba87cfa2ee88b",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]