[
    {
        "company": "Vyze Inc",
        "job_title": "Project Manager",
        "location": "Denver, CO, USA",
        "full_location": {
            "city": "Denver",
            "state": "CO",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "7-10+ years",
            "degree_required": "Bachelor's degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "CyberArk Sentury Certificate",
                "Administrative background in IAM"
            ],
            "primary": [
                "CyberArk",
                "Sailpoint",
                "RSA",
                "MS Authenticator",
                "Azure"
            ],
            "secondary": [
                "PKI"
            ],
            "all": [
                "CyberArk Sentury Certificate",
                "Administrative background in IAM",
                "CyberArk",
                "Sailpoint",
                "RSA",
                "MS Authenticator",
                "Azure",
                "PKI"
            ],
            "with_experience": [
                "CyberArk (7-10+ years)",
                "IAM (7-10+ years)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Rohit Dubey",
        "email": "rdubey@vyzeinc.com",
        "jd": "From: Rohit Dubey, Vyze Inc rdubey@vyzeinc.com Reply to: rdubey@vyzeinc.com Hi,This is Rohit from Vyze Inc. working as a recruiter. I’m having a very urgent role.Please go through the Job Description and provide me below required information alongwith your updated Resume ASAP.Full Name:Visa:Email:Phone:Location:Relocation:Skype Id:Start: Job Description -Position: Project Manager Location: Denver ,CO (Onsite)Duration: 12+ MonthsMOI: SkypePreference Local (Representation Allowed)Years of experience: 7-10+ years Education: bachelor's degreeJob Description:Responsible for the strategic management of the largest and/or most complex key cyber security initiatives by identifying security risk management and compliance solutions driven by business needs for significant business critical applications, infrastructure and services. Protect the company against risks of data loss and vulnerability management as well as drive initiatives to ensure compliance with requirements from agencies such as FERC, NERC, and Department of Homeland Security (such as CIP, HIPAA, SOX, PCI). Manage security risks and threats by collaborating with other business units, utilities, governmental agencies and security related communities to share information. Apply expert level business and technical acumen while defining security and compliance solutions that deliver best practices for building and monitoring controls for information protection and threat management.This is support based around CyberArk But wants a candidate with a broad IAM background (sailpoint, RSA, MS Authenticator, Azure, etc.)Looking for certified sentury level CyberArk engineer. If they have the delivery engineer certification that is highly sought after as they can own upgrades and do internal patching. Facilitating the day to day operations with CyberArk, being point of contact for any tickets opens up on CyberArk, make sure we aren't violating any compliance issues. Would like to do knowledge transfer to other Xcel employees, add documentation, add dashboards, work with compliance team.Must Have:CyberArk Sentury Certificate (Certified Delivery Engineer is preferred)Administrative background in IAMIt is a collaborative group. Looking for someone who is proactive, when you see something, say something. Be prepared to own the management and administration of CyberArk. Nice to have:Sailpoint admin skillsRSAMS AuthentictorPKI Thank You!Rohit DubeyTalent Acquisition Specialist, Vyze, Inc.rdubey@vyzeinc.com",
        "source": "Email",
        "date_posted": "2024-10-24 16:30:44-05:00",
        "unique_id": "192c0909d1421c12",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]