[
    {
        "company": "Nous",
        "job_title": ".Net Technical Lead",
        "location": "New York, NY, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "Permanent",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "C# .NET",
                "ASP.NET",
                "MVC framework",
                "REST APIs",
                "VSTO Word Add-In development",
                "SharePoint Online",
                "AWS"
            ],
            "primary": [
                "DynamoDB",
                "S3",
                "Lambda",
                "HTML",
                "CSS",
                "JavaScript frameworks",
                "Agile methodologies",
                "DevOps"
            ],
            "secondary": [
                "microservices architecture",
                "CI/CD pipelines",
                "Azure",
                "Google Cloud",
                "document management systems",
                "collaboration platforms",
                "AWS certifications",
                "Microsoft technologies certifications"
            ],
            "all": [
                "C# .NET",
                "ASP.NET",
                "MVC framework",
                "REST APIs",
                "VSTO Word Add-In development",
                "SharePoint Online",
                "AWS",
                "DynamoDB",
                "S3",
                "Lambda",
                "HTML",
                "CSS",
                "JavaScript frameworks",
                "Agile methodologies",
                "DevOps",
                "microservices architecture",
                "CI/CD pipelines",
                "Azure",
                "Google Cloud",
                "document management systems",
                "collaboration platforms",
                "AWS certifications",
                "Microsoft technologies certifications"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Devan Mark",
        "email": "devan@maintec.com",
        "jd": "From: Devan, Maintec Technologies devan@maintec.com Reply to: devan@maintec.com Client: NousLocation: NYC NY Key Responsibilities:Architecture & Design:Architect and design scalable, high-performance software solutions using C# .NET, ASP.NET, and related technologies. Lead efforts to design REST APIs and implement a microservices-based architecture where applicable.Development Leadership:Lead and mentor the development team in best practices for coding, design patterns, and cloud architecture. Drive the development of new features and enhancements for web applications using MVC and modern front-end frameworks.VSTO Word Add-In Development:Design and develop custom Word Add-Ins using VSTO for various business workflows, ensuring seamless integration with other systems like SharePoint Online.SharePoint Online Solutions:Lead the design and development of SharePoint Online solutions, leveraging its capabilities for document management, collaboration, and integration with other business systems.AWS Cloud Solutions:Architect and implement cloud-based solutions utilizing AWS services, including DynamoDB, S3, and Lambda, ensuring cost-effective and scalable solutions that align with industry best practices.Integration & API Management:Design and implement robust RESTful APIs to integrate third-party services and internal applications, ensuring security, scalability, and ease of use. Oversee API documentation and versioning processes.Problem Solving & Troubleshooting:Quickly identify and resolve technical challenges and bottlenecks across the development and operational pipeline. Provide guidance and direction in solving complex technical issues.Collaboration & Communication:Act as a liaison between technical teams, business stakeholders, and management. Effectively communicate architectural designs, project status, and timelines. Ensure all technical decisions align with business goals.Code Review & Quality Assurance:Review code, architecture designs, and technical implementations to ensure quality, performance, and adherence to standards. Ensure all development practices comply with security guidelines and regulatory requirements.Project Management:Collaborate with project managers to ensure timely delivery of projects, providing technical insights for resource planning, risk management, and task prioritization. Required Skills & Experience:• 10+ years of professional experience in software development, with at least 5 years in a technical leadership or architect role.• Proficiency in C# .NET, ASP.NET, and MVC framework.• Experience developing and integrating REST APIs for large-scale applications.• Strong experience with VSTO Word Add-In development.• Hands-on experience with SharePoint Online solutions.• AWS expertise: DynamoDB, S3, Lambda, and other cloud-native services.• Knowledge of front-end technologies such as HTML, CSS, and JavaScript frameworks is a plus.• Excellent problem-solving skills and a demonstrated ability to independently solve technical challenges.• Strong understanding of scalable architecture and design patterns.• Experience with Agile methodologies and working in a DevOps environment is preferred.• Ability to articulate complex technical concepts clearly and effectively to both technical and non-technical stakeholders.• Strong communication skills: Verbal, written, and interpersonal.Desired Skills:• Experience with microservices architecture.• Knowledge of CI/CD pipelines and automated deployment processes.• Familiarity with other cloud providers like Azure or Google Cloud.• Experience with document management systems and collaboration platforms.• Certifications in AWS or Microsoft technologies are a plus.",
        "source": "Email",
        "date_posted": "2024-10-23 08:24:24-05:00",
        "unique_id": "192b9cb377e2f545",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]