[
    {
        "company": "Smart IT Frame",
        "job_title": "Lead Java Developer",
        "location": "Brentwood, TN, USA",
        "full_location": {
            "city": "Brentwood",
            "state": "TN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "J2EE",
                "REST",
                "SOAP",
                "AWS",
                "Spring Framework",
                "Hibernate",
                "SQL"
            ],
            "primary": [
                "Spring Boot",
                "Spring Batch",
                "XML",
                "XSD",
                "XSLT",
                "WSDL",
                "JAXB",
                "Tomcat",
                "JBoss",
                "WebLogic",
                "Oracle",
                "DB2",
                "PostgreSQL",
                "SQL Server",
                "Ant",
                "Maven",
                "Jenkins",
                "Subversion",
                "GIT",
                "SVN",
                "Angular 4",
                "Bootstrap",
                "Jira",
                "Confluence"
            ],
            "secondary": [
                "Production issue handling",
                "Team collaboration",
                "Communication skills",
                "Analysis",
                "Problem solving",
                "Flexibility",
                "Multi-vendor environment"
            ],
            "all": [
                "Java",
                "J2EE",
                "REST",
                "SOAP",
                "AWS",
                "Spring Framework",
                "Hibernate",
                "SQL",
                "Spring Boot",
                "Spring Batch",
                "XML",
                "XSD",
                "XSLT",
                "WSDL",
                "JAXB",
                "Tomcat",
                "JBoss",
                "WebLogic",
                "Oracle",
                "DB2",
                "PostgreSQL",
                "SQL Server",
                "Ant",
                "Maven",
                "Jenkins",
                "Subversion",
                "GIT",
                "SVN",
                "Angular 4",
                "Bootstrap",
                "Jira",
                "Confluence",
                "Production issue handling",
                "Team collaboration",
                "Communication skills",
                "Analysis",
                "Problem solving",
                "Flexibility",
                "Multi-vendor environment"
            ]
        },
        "job_type": [
            "onsite",
            "hybrid"
        ],
        "contact_person": "iyyappan",
        "email": "iyyappan@smartitframe.com",
        "jd": "Greetings from Smart IT Frame, Hope you are doing well!!! Smart IT Frame specializes in enabling you with your most critical line of resources. Whether it’s for permanent staffing, contract staffing, contract-to-hire or executive search, we understand the importance of delivering the most suitable talent; on time and within budget. With our Core focus in emerging technologies, we have provided global technology workforce solutions in North America, Canada &amp; India. We take pride in delivering specialized talent, superior performance, and seamless execution to meet the challenging business needs of customers worldwide. Role: Lead Java Developer Location: Brentwood, TN (Hybrid) Duration: Contract Job Description: Hands on experience with REST and SOAP web services development using core Java J2EE Hands on experience with Amazon Web Services AWS Knowledge of Spring Framework and Hibernate Experience with web application standards and technologies like Spring Batch Spring Boot XML XSD XSLT WSDL and JAXB Exposure to one or more of the following application servers Tomcat JBoss and WebLogic Experience with SQL and relational databases Experience working on DB like Oracle DB2 PostgreSQL and SQL Server Exposure with the following build and deployment tools Ant Maven Jenkins Exposure with source control tools e g Subversion GIT SVN In addition to the Java back end experience a comfort with Angular 4 or above and Bootstrap is a plus Exposure with Atlassian tools Jira Confluence Need experience in production issue handling Excellent team collaboration and communication skills as well as analysis and problem solving skill A great attitude personal desire drive to produce amazing work Flexible in timing Can work under multi-vendor environment.",
        "source": "Email",
        "date_posted": "2024-10-23 16:11:33-05:00",
        "unique_id": "192bb58b963d6a27",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]