[
    {
        "company": "Nukasani Group",
        "job_title": ".NET Full Stack Developer",
        "location": "Jackson, MS, USA",
        "full_location": {
            "city": "Jackson",
            "state": "MS",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "6+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Best competitive rate",
            "job_code": ""
        },
        "skills": {
            "core": [
                "C#",
                ".NET Framework",
                "ASP.NET Web API",
                "SQL",
                "HTML5",
                "CSS3"
            ],
            "primary": [
                "Azure",
                "ADO.Net",
                "JQuery",
                "Bootstrap",
                "Entity Framework",
                "SCRUM/Sprint methodologies",
                "Visual Studio",
                "IIS",
                "Windows Client",
                "Windows Server",
                "TFS/SVN"
            ],
            "secondary": [
                "Jira Software",
                "Ability to work on many projects at one time",
                "Experience converting older technologies to new cutting edge technologies"
            ],
            "all": [
                "C#",
                ".NET Framework",
                "ASP.NET Web API",
                "SQL",
                "HTML5",
                "CSS3",
                "Azure",
                "ADO.Net",
                "JQuery",
                "Bootstrap",
                "Entity Framework",
                "SCRUM/Sprint methodologies",
                "Visual Studio",
                "IIS",
                "Windows Client",
                "Windows Server",
                "TFS/SVN",
                "Jira Software",
                "Ability to work on many projects at one time",
                "Experience converting older technologies to new cutting edge technologies"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Bhavani",
        "email": "recruitment@nukasanigroup.com",
        "jd": "Dear Partner, Good Morning, Greetings from Nukasani Group Inc! We have below urgent long term contract project immediately available for .NET Full Stack Developer, Jackson, MS, Onsite. Need submissions you please review the below role, if you are available, could you please send me updated word resume, and below candidate submission format details, immediately. If you are not available, any referrals would be greatly appreciated. Interviews are in progress, urgent response is appreciated. Looking forward for your immediate response and working with you. Candidate Submission Format - needed from you: Full Legal Name, Personal Cell No (Not google phone number), Email Id, Skype Id, Interview Availability, Availability to start, if selected, Current Location, Open to Relocate, Work Authorization, Total Relevant Experience, Education./ Year of graduation, University Name, Location, Last 4 digits of SSN, Country of Birth, Contractor Type, DOB: mm/dd, Home Zip Code. Assigned Job Details: Job Title: .NET Full Stack Developer, Location: Jackson, MS, Onsite, Rate: Best competitive rate. Position Description and Job Skill Set: We are looking for a talented and highly effective Senior Full Stack .NET Developer to join our development team. We are currently building the next generation eligibility applications using the latest technologies and are looking for a developer with a true passion for modern web development technologies and frameworks, and experience on the server crafting robust Web APIs based on a highly efficient and extensible application tier. You will be working with server technologies such as ASP.NET Web API 2 and .NET 4.5 to produce JSON RESTful APIs, and browser technologies such as HTML5, and Angular to produce applications. Required Skills/Experience: Provide the minimum required skills and/or experience the contractor must possess to qualify for this position. These requirements will be transferred to the Score Sheet and candidates without these requirements reflected on their resume will NOT be presented to the manager for consideration. * Advanced technical expertise in 6+ years of C#, 10+ years of database design and implementation, .NET Framework (4.0 or later), .NET Web API (2 or later), SQL 2008 (or later), Azure, ADO.Net, JQuery, Bootstrap, Entity Framework, 8 or more years’ practical experience in HTML5 and CSS3, Advanced knowledge of SCRUM/Sprint methodologies, Visual Studio (2012 or later), IIS (7 or later), Windows Client (7 or later), Windows Server (2008 R2 or later), TFS/SVN Version control. Preferred/Not Required: Provide any skills/experience that would be helpful for the candidate to possess but not required. Examples: Previous supervisory experience, WebLogic experience helpful, etc. Jira Software, Ability to work on many projects at one time, Experience converting older technologies to new cutting edge technologies.",
        "source": "Email",
        "date_posted": "2024-10-24 08:26:07-05:00",
        "unique_id": "192bef8e8d665228",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]