[
    {
        "company": "Tek Inspirations LLC",
        "job_title": "Full-stack Lead",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Bachelor’s degree in computer science, computer engineering or a combination of education and equivalent experience.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 month contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Springboot",
                "Angular",
                "React JS",
                "GCP",
                "MSSQL",
                "Postgres",
                "NoSQL",
                "MongoDB"
            ],
            "primary": [
                "Microservices",
                "Cloud platforms",
                "DevOps",
                "Software Programming",
                "Agile delivery"
            ],
            "secondary": [
                "HackerRank",
                "Test Driven Development (TDD)",
                "CI/CD",
                "GitHub",
                "Leadership",
                "Effective communication"
            ],
            "all": [
                "Java",
                "Springboot",
                "Angular",
                "React JS",
                "GCP",
                "MSSQL",
                "Postgres",
                "NoSQL",
                "MongoDB",
                "Microservices",
                "Cloud platforms",
                "DevOps",
                "Software Programming",
                "Agile delivery",
                "HackerRank",
                "Test Driven Development (TDD)",
                "CI/CD",
                "GitHub",
                "Leadership",
                "Effective communication"
            ],
            "with_experience": [
                "Java (5+ years)",
                "Spring",
                "Angular",
                "React",
                "GCP",
                "Cloud platforms"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Sanjeev Kumar Singh",
        "email": "sanjeev.singh@tekinspirations.com",
        "jd": "From: Sanjeev Kumar Singh, Tek Inspirations LLC sanjeev.singh@tekinspirations.com Reply to: sanjeev.singh@tekinspirations.com Job Description -Job ::Full-stack LeadDuration::12 month contract.Additional Information:ready to work in hybrid model. ** Please Complete HackerRank Software Engineer Skills Assessment Test. Candidate(s) WITHOUT HackerRank Results will be Declined. ** Full stack Back End Java RequiredHACKERANK CODING IS REQUIRED. You will be providing me the email address to send the link of Hackerank. The sooner they take Hackerank and I get results the sooner I talk to them and submit.Skills Required:· Self-motivated and ability to build great software in a fast paced, and dynamic environment · Demonstrated ability to automate unit/integration/UI testing scenarios. Experience in building high performance distributed systems solving large scale engineering challenges · Meaningful experience in building microservices in Java and Angular/React/Java Script · Understanding of databases like MSSQL, Biq query, Postgres, NoSQL, MongoDB etc.· Experience deploying applications to cloud platforms (ie: GCP, AWS, Azure) · Hands-on experience on Java, Springboot, Angular, React JS, GCP SQL./ Kafka / Pubsub · Strong in Software Programming/Engineering with a good understanding of DevOps(Jenkin, Tekton, SonarQube, FOSSA, Cloud Monitoring, Dynatrace) tool and GitHub etc. · Working knowledge and experience in transportation and automotive. · Respect and empathy for team members, business partner and product customer · Effective communication skills· Practitioner in 2 coding languages or advanced practitioner in 1 coding Language Comfort level developing in all tiers of application software: front-end, mobile, back-end and database. Advanced knowledge of software design patterns · Knowledge and practical experience of agile delivery · Leadership experience · Demonstrated ability to delivery product roadmap milestoneSkills Preferred:· Experience building full stack applications, Deep understanding or computational fundamentals( e.g. algorithms, operating systems), REST/RESTful API experience, TEST DRIVEN DEVELOPMENT (TDD). · Exposure to cloud and GCP tool/technologies will be an added advantageExperience Required:· 5+ years experience in Software Engineering. · Bachelor’s degree in computer science, computer engineering or a combination of education and equivalent experience. · 1+ year experience with developing for and deploying to cloud platforms (e.g. GCP, PCF, Azure) · Implement and optimize cloud services and tools (e.g. Terraform, BigQuery, GCP)· Experience in development using combination of the following technologies: o Languages: Java / JS / TS / Python o Frontend frameworks: Angular / React /Kafka / Pubsub /Postgres o Backend frameworks: Spring / Node · Proven experience understanding, practicing, and advocating for software engineering disciplines from Clean Code, Software Artisanship, and Lean including: o Paired / Mobbing programming o Test-first/Test Driven Development (TDD) o Evolutionary design o Minimum Viable Product · Willingness to collaborate daily with team members. · A strong curiosity around how to best use technology to amaze and delight our customers · Using CI/CD tools and pipelines e.g. Tekton, Cloud Build, etc.Experience Preferred:· Knowledge of GCP cloud tools and LLM's · API and Microservice development with end to end Devops knowledge;Education Required:· Bachelor's degree in IT, Computer Science, Engineering or equivalent experience in a relevant field",
        "source": "Email",
        "date_posted": "2024-10-24 13:14:31-05:00",
        "unique_id": "192bff95033ea6a1",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]