[
    {
        "company": "Pivotal",
        "job_title": "Sr. SQL DBA",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "7 years",
            "degree_required": "Bachelor's Degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SQL Server",
                "Database Administration",
                "High Availability",
                "Disaster Recovery",
                "Transparent Data Encryption"
            ],
            "primary": [
                "Systems Documentation",
                "Database Integrity Checks",
                "Database Replication",
                "Backup Environments"
            ],
            "secondary": [
                "Patch Management",
                "Capacity Planning",
                "Monitoring Tools",
                "Troubleshooting",
                "Database Standards"
            ],
            "all": [
                "SQL Server",
                "Database Administration",
                "High Availability",
                "Disaster Recovery",
                "Transparent Data Encryption",
                "Systems Documentation",
                "Database Integrity Checks",
                "Database Replication",
                "Backup Environments",
                "Patch Management",
                "Capacity Planning",
                "Monitoring Tools",
                "Troubleshooting",
                "Database Standards"
            ],
            "with_experience": [
                "SQL Server (7 years)",
                "Database Administration (7 years)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Mayank Mer",
        "email": "mayank.mer@pivotal-technologies.com",
        "jd": "From: Mayank Mer, Pivotal mayank.mer@pivotal-technologies.com Reply to: mayank.mer@pivotal-technologies.com \"Need local to MI only|| F2F Interview\" Position Sr. SQL DBALocation Lansing, MI (ID Required)Duration 6+ MonthsVisa USC/GC Interview Mode 1st Round MS Teams & 2nd Round will be In-Person NOTE: Candidates MUST be local to greater Lansing area (commutable distance). Note- Please ask for 3 previous employment references. Description: Our client is looking for a SQL DBA to provide Infrastructure DBA support for all SQL Server applications and it is replacement for a Senior Level DBA leaving the team. The intention is to fill this position in the gap between the incumbent DBA leaves and the position is backfilled which will take several months. We cannot afford not having a resource for large and complex application that we support and in that there are several Tier 1 level applications that are important. TasksParticipate in 24x7 software and hardware support for complex applications in several versions of SQL Server, with high availability and Disaster Recovery support, following industry development standards.Helps develop and/or submit for approval, plans for installation, patch management maintenance, upgrades and support for the Database systems. Evaluate impacts of change and new technology, recommend solutions to persistent problems, and serves as liaison to external consultants.Follow and enforce database standards, policies & procedures.Research and draft guidelines within the boundaries of current policies and standards.Monitor space allocation across databases. Perform adjustments in test and development environments as necessary and as prescribed by predefined standards/guidelines.Calculate disk space requirements for existing and/or new installations of existing business needsModify parameters based on capacity changes.Configure and execute database integrity checks.Monitor for database integrity checks.Install database base management software for development and test environments.Install database patches and service packs for development and test environments.Monitor and support clustered database environments.Monitor and support database replication and backup environments.Implement the strategy to release unused space or repair fragmentation in test and development environments.Execute (run) scripts provided by Systems Analysts or Database Architect/Designer for creating and modifying database objects (tables, views, constraints, indexes, etc.)Monitor database back-ups to ensure recoverability. Troubleshoot backup errors.Monitor database jobs and scheduled processes in development, test and production environments.Participate in troubleshooting.Monitor database environments (using alert logs, trace files, alert mechanisms, and other tools) for issues and problems with database functionality, connectivity, or downtime.Follow standards and guidelines for database space allocation based on best practices and implementation considerations based on business requirements. Skills Required7 years - Database administration specifically on SQL Server 16 and upwards.3 years - Experience creating, updating and maintaining systems documentation.Expertise in HA and DR solutionsExperience with transparent Data Encryption within SQL ServerBachelor's Degree Thanks & Regards,Mayank MerTechnical Recruiter",
        "source": "Email",
        "date_posted": "2024-10-23 15:02:02-05:00",
        "unique_id": "192bb1929381ed03",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "DB Admin"
    }
]