[
    {
        "company": "Techgene",
        "job_title": "Program Manager or Shopping Experiencer eCommerce",
        "location": "New York, NY, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Senior-level, 5+ years",
            "degree_required": "Bachelor’s degree in a technical field or equivalent professional experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "1 Year+",
            "rate": "Flexible"
        },
        "skills": {
            "core": [
                "Program Management",
                "Agile Methodologies",
                "SCRUM",
                "Project Management",
                "Retail/eCommerce Experience"
            ],
            "primary": [
                "Online Shopping Cart Experience",
                "Communication Skills",
                "Risk Management",
                "Stakeholder Management",
                "Team Development"
            ],
            "secondary": [
                "Problem-solving",
                "Analytical Skills",
                "Technical Background",
                "Mentoring",
                "Coaching"
            ],
            "all": [
                "Program Management",
                "Agile Methodologies",
                "SCRUM",
                "Project Management",
                "Retail/eCommerce Experience",
                "Online Shopping Cart Experience",
                "Communication Skills",
                "Risk Management",
                "Stakeholder Management",
                "Team Development",
                "Problem-solving",
                "Analytical Skills",
                "Technical Background",
                "Mentoring",
                "Coaching"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Manvith",
        "email": "manvith.c@techgene.com",
        "jd": "From: Manvith, techgene manvith.c@techgene.com Reply to: manvith.c@techgene.com Program Manager OR Shopping Experience eCommerce - Hybrid NYC Tri-State - 1 Year+ *** We need: A senior Program Manager with experience leading Enterprise Retail/eCommerce – Online shopping experience projects. Candidates need to be coming out of Large Retail Enterprises and have experience with Online Shopping Cart experience (Think Amazon) and improving the customers experience including Loyalty rewards and Fast Check Out. **Candidates must have Long Projects/Good Tenure, Excellent communication skills and a State issued ID (Not Bills) showing they are Local. **** CANDIDATES MUST HAVE RETAIL/ECOMMERCE EXPERIENCE WITH SHOPPING CARTS. RATE IS FLEXIBLE. Required Location: Hybrid/Midtown New York City Once a Quarter. Candidates can be withing a 2 hour commute.Contract status: C-C preferredInterview Required: Video Candidates must be LOCAL to the NEW YORK or NEW JERSEY area and COMMUTE into the office Once a Quarter. NO RELOCATION CONSIDERED. *** *** Please provide all the below Submittal Format details. It is required for the client Management system.· Full Name:· Rate: · Location: · Availability to Interview: One Day’s notice· Availability to Start: · Email Address: · Phone Number: · Visa Status:· Education - College/Year of graduation:· Link to LinkedIn? · Certifications (Please list)? Job Description: Key Responsibilities:Promote empowerment of the team, ensure that each team member is fully engaged and making a meaningful contribution, and encourage a sustainable pace with high-levels of quality for the teamManage risks and issues; correct deviations from plans; and perform delivery planning for assigned initiativesSupport the Product Owner in managing customer expectations for project deliverables, managing stakeholder communications, and helping to implement an effective system of governanceEstablish cadence and facilitate team ceremoniesAssist in team development while holding teams accountable for their commitments and removing roadblocks to their workLeveraging organizational resources to improve capacity for initiativesMentoring and developing team membersBe a voice of reason and authority, while enabling the team to self-organize and innovateActively participates in product planning sessions, risk management processes and change management/communicationTrack and report on team and project KPIs - Velocity, Burndown, Cycle time, Lead time, capacity, SPI, EV, rate of change requests, errors etc.Partners with shared service teams such as EDS, EIDEnsure that all representatives have an environment conducive to openly and honestly sharing information for Team successCommunicate clearly, professionally, and regularly with clients, partners and vendorsNeeded Skills:Problem-solving approach with the ability to focus on details while maintaining the “big picture” viewSolid understanding of software development life cycle models as well as expert knowledge of both Agile and traditional project management principlesPrior experience with SCRUM/Agile methodologies with enterprise-level application development initiativesExperience managing and delivering large, complex initiatives in a high-tech development environment with multi-function teamsExperience overseeing multi-function project teams with at least 10-15 team membersAbility to lead software development initiatives and ensure objectives, goals, and commitments are metStrong analytical, planning, and organizational skills with an ability to manage competing demandsEffective communication skillsSufficient level of technical background to provide highly-credible leadership to development teamsEnergetic, enthusiastic and a proven ability to work and lead in a team based environmentBe able to accurately and objectively evaluate complex project risks and issuesEffective interpersonal skills including mentoring, coaching, collaborating, and team buildingQualifications:Experience with Agile MethodologiesCSM, SSM or PSM certification requiredSASM, CSP, SPS or other advanced certification preferredBachelor’s degree in a technical field or equivalent professional experiencePrior experience in software development as an analyst, tester, developer, or project manager",
        "source": "Email",
        "date_posted": "2024-10-23 11:17:20-05:00",
        "unique_id": "192ba4d6c7027672",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Scrum Master"
    }
]