[
    {
        "company": "RuriSoft LLC",
        "job_title": "Sr GEOSPATIAL Developer",
        "location": "Pittsburgh, PA, USA",
        "full_location": {
            "city": "Pittsburgh",
            "state": "PA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "8-12 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Spring Boot",
                "Java Platform APIs"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Java",
                "Spring Boot",
                "Java Platform APIs"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Chaitanya",
        "email": "chaitanya@rurisoft.com",
        "jd": "From: Chaitanya, RuriSoft LLC chaitanya@rurisoft.com Reply to: chaitanya@rurisoft.com GEOSPATIAL SR. DEVELOPER JAVAClient Address: 2 PNC Building 620 Liberty Avenue, Pittsburgh, PA - 15222ONSITE ROLEJob Description:We are seeking a highly skilled Sr. Developer with expertise in Java API and Spring Boot to join our dynamic team. The ideal candidate will have 8 to 12 years of experience in developing and implementing geospatial solutions. This role involves working on cutting-edge projects that leverage geospatial data to drive business insights and improve decision-making processes.Develop and implement geospatial solutions using Java and Spring Boot to meet project requirements. - Collaborate with cross-functional teams to design and develop scalable geospatial applications. - Provide technical expertise in Java Platform APIs to enhance the functionality of geospatial systems. - Oversee the integration of geospatial data with existing systems and databases. - Ensure the performance, quality, and responsiveness of geospatial applications. - Conduct code reviews and provide constructive feedback to team members. - Troubleshoot and resolve complex technical issues related to geospatial applications. - Stay updated with the latest trends and technologies in geospatial development. - Contribute to the continuous improvement of development processes and methodologies. - Mentor junior developers and provide guidance on best practices in geospatial development. - Collaborate with stakeholders to gather and analyze requirements for geospatial projects. - Develop and maintain documentation for geospatial applications and processes. - Participate in project planning and provide estimates for development tasks.Top 3 Skills Required:JavaSpring BootJava Platform APIsYears of experience: 8-12 years",
        "source": "Email",
        "date_posted": "2024-10-23 09:12:28-05:00",
        "unique_id": "192ba0beaeeb200a",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]