[
    {
        "company": "State of NC",
        "job_title": "Azure Databricks Engineer",
        "location": "Raleigh, NC, USA",
        "full_location": {
            "city": "Raleigh",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "NCDOT - Technical Specialist- Junior (749799)",
            "experience_required": "2 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months+",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Azure Databricks",
                "Databricks notebooks",
                "Delta Live Tables",
                "data engineering best practices",
                "Spark"
            ],
            "primary": [
                "data warehouses",
                "data lakes",
                "Delta Lake architecture",
                "Databricks SQL",
                "PySpark",
                "OLTP systems",
                "OLAP systems",
                "streaming products"
            ],
            "secondary": [
                "C#",
                "Java",
                "Python",
                "excellent interpersonal skills",
                "written communication skills"
            ],
            "all": [
                "Azure Databricks",
                "Databricks notebooks",
                "Delta Live Tables",
                "data engineering best practices",
                "Spark",
                "data warehouses",
                "data lakes",
                "Delta Lake architecture",
                "Databricks SQL",
                "PySpark",
                "OLTP systems",
                "OLAP systems",
                "streaming products",
                "C#",
                "Java",
                "Python",
                "excellent interpersonal skills",
                "written communication skills"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Dheeraj",
        "email": "recruiter11@webgeosolutions.com",
        "jd": "Greetings from Web Geo Solutions, LLC. We have an exciting new job opportunity with our direct client, matching your skills. Please review the job description and respond with all the requested details if you are interested. Job Details JOB ID: NCDOT - Technical Specialist- Junior (749799) Client: State of NC Last day to apply: 10/28 Initial Term: 12 Months+ Tentative start date: ASAP Interview mode: Webcam/In-Person Work location: Raleigh, NC (Need Locals) Job Description: **The candidate will need to come onsite on the first day to collect equipment.** **All candidates must be local to the Triangle region of North Carolina, and posting may require up to 1-2 days per month in a Triangle area office for meetings.** NCDIT-Transportation Web Systems Team seeks an Azure Databricks Engineer who will work with existing staff to plan and design ETL pipelines and product solutions using Azure Databricks. The person filling this role will create resilient processes to ingest data from a variety of on-prem and cloud transactional databases and APIs. Responsibilities will also include developing business requirements, facilitating change management documentation, and actively collaborating with stakeholders. This individual will work closely with a development technical lead and discuss all aspects of the design and planning with the development team. Roles and Responsibilities *Research and engineer repeatable and resilient ETL workflows using Databricks notebooks and Delta Live Tables for both batch and stream processing *Collaborate with business users to develop data products that align with business domain expectations *Work with DBAs to ingest data from cloud and on-prem transactional databases *Contribute to the development of the Data Architecture for NC DIT - Transportation: **By following practices for keeping sensitive data secure **By streamlining the development of data products for use by data analysts and data scientists **By developing and maintaining documentation for data engineering processes **By ensuring data quality through testing and validation **By sharing insights and experiences with stakeholders and engineers throughout DIT - Transportation If you are interested, please reply with below details for further evaluation Please send all the requested below information for consideration Contact details (and employer details if C2C) Your full legal name (Must match with state issued ID or passport) Phone number Personal email id (this same id should be used to send E-RTR after submission) Desired hourly rate (above max advertised rate is not considered): W2: $ C2C: $ Work Status (H1B, EAD, GC, US Citizen), please attach a copy of work authorization: If H1B, who holds the visa (contact details, please include name, phone number and email)? If selected, how soon would you be available to start? Have you ever worked for this client? If so, please provide team name, project name, reason for leaving and when the engagement ended. Upon selected, employment is subjected to 7-year national criminal background check. Will you be able to attend In-Person interview (Yes or No)? Your current address? Are you available to be on-site at client’s location for the duration of the project? Note: Payment for all approved hours will be paid at the straight hourly rate regardless of the total hours worked (regular and overtime hours) by the engaged resource. Do you accept this requirement? Upon selection, candidate must be able to provide three (3) references from prior engagements before a final decision is made. Do you accept this requirement? LinkedIn profile URL Skill Matrix NCDOT - Technical Specialist- Junior (749799) Skills Required / Desired Amount in years Your actual Experience in years (Please fill all of them) Excellent interpersonal skills as well as written and communication skills. Required 5 Able to write clean, easy-to-follow Databricks notebook code Required 2 Deep knowledge of data engineering best practices, data warehouses, data lakes, and the Delta Lake architecture Required 2 Good knowledge of Spark and Databricks SQL/PySpark Required 2 Technical experience with Azure Databricks and cloud providers like AWS, Google Cloud, or Azure Required 2 In-depth knowledge of OLTP and OLAP systems, Apache Spark, and streaming products like Azure Service Bus Required 2 Good practical experience with Databricks Delta Live Tables Required 2 Knowledge of object-oriented languages like C#, Java, or Python Desired 7 Your resume in MS Word format, copy of any relevant certifications & copy of work authorization (H1B/GC/EAD). Please check the other positions that are currently open with several NC State agencies http://www.indeed.com/cmp/Web-Geo-Solutions,-LLC/jobs",
        "source": "Email",
        "date_posted": "2024-10-23 18:03:44-05:00",
        "unique_id": "192bc64c3967d6c9",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Azure Data Engineer"
    }
]