[
    {
        "company": "SoniTalent Corporation",
        "job_title": "Workday Business Analyst",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "1+ years",
            "degree_required": "Bachelor's degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Workday HCM",
                "Workday Payroll",
                "Data Quality",
                "Data Validation",
                "Excel"
            ],
            "primary": [
                "JIRA",
                "Exceptional written and verbal communication skills",
                "Analytical skills",
                "Active listening skills",
                "Problem solving"
            ],
            "secondary": [
                "Flexibility",
                "Adaptability",
                "Ability to influence others",
                "Ability to synthesize data"
            ],
            "all": [
                "Workday HCM",
                "Workday Payroll",
                "Data Quality",
                "Data Validation",
                "Excel",
                "JIRA",
                "Exceptional written and verbal communication skills",
                "Analytical skills",
                "Active listening skills",
                "Problem solving",
                "Flexibility",
                "Adaptability",
                "Ability to influence others",
                "Ability to synthesize data"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Bhuwan Tiwari",
        "email": "bhuwan.tiwari@sonitalentcorp.com",
        "jd": "From: bhuwan tiwari, Sonitalentcorp bhuwan.tiwari@sonitalentcorp.com Reply to: bhuwan.tiwari@sonitalentcorp.com Workday BA with Workday HCM and Payroll required. Data Quality/Data Validation exp. Jira, Need strong Excel as well. This is 100% remote If you can find someone with State/Govt exp. that would be preferred. Work Location: RemoteTop 3 Skills:1. 1+ years of experience with Workday HCM and/or Payroll.2. Exceptional written and verbal communication skills.3. Ability to synthesize multiple sources of data/information and compile into a cohesive presentation. Job Description:We are hiring a Business Analyst to join our project team. The Project Management Office is looking for individuals to join the PMO as a resource to be assigned as needed. Assignment can be with any department within the state of Maine, dependent on need. You will report directly to the project management office. Your main tasks will include performing detailed requirements analysis, documenting processes, and performing some user acceptance testing. As a key contributor to the State of Maine Workday implementation it is imperative that you establish high quality standards and lead by example.Key Responsibilities:Monitoring/Supporting/Researching Data Quality/Data Cleanup with StakeholdersData ValidationTicket Management (JIRA)Eliciting, analyzing, documenting, validating, and communicating business requirementsGeneral project documentation (i.e. meeting notes, drafting proposals)General support through testing phases: researching issues, providing guidance on defect resolutionOther Project Support tasks as identified Required Skills:Exceptional written and verbal communication skillsStrong analytical skillsProficient with Excel (VLOOKUP's, pivot tables, concatenations, etc.)Excellent active listening skillsAbility to clearly articulate messages to various audiencesActive listening skillsAbility to influence othersFlexibility and adaptability; ability to work in ambiguous situations at all levels of the organizationProblem solving and root cause analysis skillAbility to synthesize multiple sources of data/information and compile into a cohesive presentationRequired EducationBachelor's degree Thanks, Bhuwan TiwariSr.Technical Recruiter SoniTalent Corporation I5404 Merribrook Lan--e, Prospect, KY, USA Cell -859-946-4062 | bhuwan.tiwari@sonitalentcorp.com",
        "source": "Email",
        "date_posted": "2024-10-24 11:05:40-05:00",
        "unique_id": "192bf693b09bbf3c",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]