[
    {
        "company": "Siri Info Solutions",
        "job_title": "CIAM Business Architect",
        "location": "Rolling Meadows, IL, USA",
        "full_location": {
            "city": "Rolling Meadows",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "CIAM strategies",
                "CIAM architectures",
                "risk assessments",
                "CIAM technologies",
                "security principles"
            ],
            "primary": [
                "OAuth",
                "OpenID Connect",
                "SAML",
                "Okta",
                "Ping Identity"
            ],
            "secondary": [
                "GDPR",
                "CCPA",
                "analytical skills",
                "problem-solving skills",
                "communication skills"
            ],
            "all": [
                "CIAM strategies",
                "CIAM architectures",
                "risk assessments",
                "CIAM technologies",
                "security principles",
                "OAuth",
                "OpenID Connect",
                "SAML",
                "Okta",
                "Ping Identity",
                "GDPR",
                "CCPA",
                "analytical skills",
                "problem-solving skills",
                "communication skills"
            ],
            "with_experience": [
                "CIAM strategies",
                "CIAM architectures",
                "risk assessments",
                "CIAM technologies",
                "security principles"
            ]
        },
        "job_type": [],
        "contact_person": "Prateek Kapoor",
        "email": "prateek.kapoor@siriinfo.com",
        "jd": "Greetings Hope you are doing well. Please find the JD & let me know your thoughts. CIAM Business ArchitectRolling Meadows, IL ? Develop and implement CIAM strategies and solutions that align with business objectives and security requirements. o Design and document CIAM architectures, including user authentication, authorization, and identity lifecycle management. o Conduct risk assessments and develop mitigation strategies to ensure the security and privacy of customer data. o Collaborate with cross-functional teams, stakeholders, and subject matter experts to understand their CIAM needs and translate them into technical requirements.? Evaluate and select CIAM technologies and vendors based on business requirements and industry best practices.? Define and enforce CIAM policies, procedures, and standards to ensure compliance with regulatory requirements.? Develop analysis & process documents, requirements and roadmaps for various projects and programs across GB?s business units, applications, and products. ? Advocate and drive adoption of Business Architecture best practices to ensure standardization ? Stay up to date with industry trends & advancements in CIAM and security technologies. 10+ years of related experience as a Business Architect or similar role, with a focus on CIAM framework (such as OAuth, OpenID Connect & SAML)? Strong knowledge of security principles, including authentication, authentication and encryption.? Experience with CIAM technologies, such as Okta or Ping Identity.? Familiarity with regulatory requirements, such as GDPR and CCPA, and their impact on CIAM? Proficiency in translating business requirements into technical solutions and collaborating with IT teams for implementation.? Excellent analytical, problem-solving, and communication skills.",
        "source": "Email",
        "date_posted": "2024-10-24 13:15:49-05:00",
        "unique_id": "192c004b5872239e",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]