[
    {
        "company": "Sligo Software Solutions, Inc.",
        "job_title": "Sr. Business Analyst with CBAP",
        "location": "Albany, NY, USA",
        "full_location": {
            "city": "Albany",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "SLG - 19 - 9946",
            "experience_required": "12+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "24 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "requirements elicitation",
                "business process analysis",
                "software development lifecycle",
                "business requirements documentation",
                "stakeholder management"
            ],
            "primary": [
                "CBAP certification",
                "facilitating requirement workshops",
                "creating test plans",
                "managing requirements lifecycle",
                "creating software development artifacts"
            ],
            "secondary": [
                "problem solving",
                "interpersonal skills",
                "flexibility",
                "adaptability",
                "communication skills"
            ],
            "all": [
                "requirements elicitation",
                "business process analysis",
                "software development lifecycle",
                "business requirements documentation",
                "stakeholder management",
                "CBAP certification",
                "facilitating requirement workshops",
                "creating test plans",
                "managing requirements lifecycle",
                "creating software development artifacts",
                "problem solving",
                "interpersonal skills",
                "flexibility",
                "adaptability",
                "communication skills"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Abhijith",
        "email": "amallavajhula@sligosoft.com",
        "jd": "Greetings from Sligo Software Solutions, Inc. !!SLIGO is a Software Development & IT Consulting company. We have around 100+ IT associates working with our esteemed clients across several domains such as IT, Banking, Healthcare, and Government. We have an urgent requirement for Sr. Business Analyst with CBAP position with our client. Role: Sr. Business Analyst with CBAPLocation: Albany, New YorkDuration: 24 MonthsJob ID: SLG - 19 - 9946Client: NY State Description Child Care Assistance Electronic Application Systems Intake, Child Care Assistance Case Management System, Replace Child Care and Attendance System into new CMS system, and Child Care Vendor management.Duties Work closely with the Portfolio BA Team, project manager, ITS BAS manager, technical team members and other project stakeholders to provide guidance throughout the System Development Life Cycle (SDLC).Work as liaison to stakeholders and Subject Matter Experts to elicit, analyze, communicate, validate and verify the requirements for changes to current business processes, policies and information systems and for the development of new business processes, policies and information systems.Create as-is and to-be business process flows to ensure that the implemented business process and supporting software meets agency needs, as well as provide an effective and efficient means of referral and trackingConduct requirements workshops and JAD sessions with agency subject matter experts as one of the many techniques to be used to elicit requirements.Create business requirements documents, context diagrams, business requirements document (BRD), system “as-is” and “to be” states, system specifications, use cases and workflow diagrams, report and screen mockups, swim lane diagrams, and prototypes.Provide the development team with clearly articulated artifacts and ensure development team understanding.Ensure that artifacts required by ITS governance process and Secure Systems Development Lifecycle (SSDLC) are created and support the project scope.Manage requirements through the life of the contract using a requirements management plan and traceability to ensure coverage between the source of requirements and their test case(s) it will be tested by. Mandatory Requirements Experience (12+ Years)Studies the software application domain, prepares software requirements, and specification documents. Liaises between the software users and the software developers. Conveys the demands of software users to the developers. Skills include working knowledge of software technology; computer programming experience/expertise; general business knowledge; problem solving/reduction skills; interpersonal relation skills; flexibility and adaptability.Requirements This is an 100% Onsite84 Months experience performing requirements elicitation. Researching and understanding the stakeholder’s business needs using a variety of analysis techniques and converting those into verified and validated functional and non-functional requirements for development.84 Months experience creating and maintaining software development artifacts for communication of requirements, including context diagrams, textual use cases, swim lane diagrams, report specifications, wireframes, user interface specifications, and non-functional requirements specifications.84 Months experience facilitating requirement workshops, JAD sessions and structured walkthroughs, practicing effective communication to ensure requirements are understood, conveyed, and met.72 Months experience creating test plans/cases, managing defects with development teams, and working with users on User Acceptance Testing.72 Months experience managing requirements throughout the Requirements Management Lifecycle, including creation and execution of a Requirements Management Plan, Requirements Traceability, establishing requirements baselines and managing requirements change controlCBAP (Certified Business Analysis Professional) certification by the International Institute of Business Analysis (IIBA)RésuméCopy of Candidate Identification (i.e., Driver’s License/Green Card/Visa and Passport if applicable)Any documents referenced in the above Requested Qualifications(i.e., professional certifications, degrees, etc.)",
        "source": "Email",
        "date_posted": "2024-10-24 09:09:44-05:00",
        "unique_id": "192beff2783b7cdb",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]