[
    {
        "company": "Sibitalent",
        "job_title": "Sr .Net Lead Developer with Angular Exp.",
        "location": "New York, NY, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "14+ years",
            "degree_required": "Bachelor’s degree in Computer Science or related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Month Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".Net",
                "Angular",
                "Technical Leadership",
                "Project Management",
                "Software Development"
            ],
            "primary": [
                "Regulatory Reporting Applications",
                "Web Application Development",
                "Agile Methodologies",
                "Team Management",
                "Analytical Skills"
            ],
            "secondary": [
                "Troubleshooting",
                "Problem-Solving",
                "Communication Skills",
                "Organizational Skills",
                "Multi-tasking"
            ],
            "all": [
                ".Net",
                "Angular",
                "Technical Leadership",
                "Project Management",
                "Software Development",
                "Regulatory Reporting Applications",
                "Web Application Development",
                "Agile Methodologies",
                "Team Management",
                "Analytical Skills",
                "Troubleshooting",
                "Problem-Solving",
                "Communication Skills",
                "Organizational Skills",
                "Multi-tasking"
            ],
            "with_experience": [
                ".Net (5+ years)",
                "Angular (5+ years)",
                "Technical Leadership (5+ years)"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Krishna Chaudhary",
        "email": "krishna@sibitalent.com",
        "jd": "Hello, I hope you are doing fine. Please find the below Jd and share your candidate profile. Role: Sr .Net Lead Developer with Angular Exp.(In Person Interview) Location: New York or New Jersey (Hybrid) Duration :: 12+ Month Contract Need Local Candidate of New York or New Jersey as their would be a In person Interview Job Description Should have at least 14+ Years of Exp. Lead and manage a team of overseas software engineers, providing technical direction and guidance for development projects Oversee technical project plans and timelines, ensuring projects are completed on time Work closely with onsite client stakeholders from cross functional departments Provide technical expertise and guidance to ensure quality standards are met Research, evaluate, and recommend new technologies, processes and tools to enhance development capabilities. Develop proof of concept and own development deliverables Analyze customer requirements and develop technical solutions to meet customer needs Develop and document technical processes and procedures Prepare and publish progress reports Skills: Understanding of Regulatory reporting applications related to Client onboarding, legal entity onboarding or Capital Market applications related to equity, underrating business etc. or Internal finance applications Ability to develop web applications in .Net , Angular in agile mode Ability to manage 10-15 team members from different timezone Bachelor’s degree in Computer Science or related field 5+ years of experience in software development and technical leadership Demonstrated knowledge of software development methodologies and techniques Strong analytical, troubleshooting and problem-solving skills. Ability to analyze business requirements and understand objectives Excellent verbal and written communication skills Able to work independently and as part of a team Able to multi-task and prioritize tasks effectively Strong organizational and project management skills.",
        "source": "Email",
        "date_posted": "2024-10-23 08:45:27-05:00",
        "unique_id": "192b9c400bfa7915",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]