[
    {
        "company": "Tek Inspirations",
        "job_title": ".NET Developer",
        "location": "Baton Rouge, LA, USA",
        "full_location": {
            "city": "Baton Rouge",
            "state": "LA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Bachelor’s degree in Computer Science, Information Technology, Finance, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "ASAP through at least the end of the year; likely longer",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".NET",
                "VB",
                "C#"
            ],
            "primary": [
                "Flexi Accounting Software",
                "Excel functions",
                "data manipulation techniques"
            ],
            "secondary": [
                "problem-solving skills",
                "communication skills",
                "collaborative skills"
            ],
            "all": [
                ".NET",
                "VB",
                "C#",
                "Flexi Accounting Software",
                "Excel functions",
                "data manipulation techniques",
                "problem-solving skills",
                "communication skills",
                "collaborative skills"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Aditi Sikarwar",
        "email": "aditi.sikarwar@tekinspirations.com",
        "jd": "From: Aditi Sikarwar, Tek Inspirations aditi.sikarwar@tekinspirations.com Reply to: aditi.sikarwar@tekinspirations.com Candidate must currently live in Baton Rouge, Louisiana and have experience with Flexi. Mode of interview: Onsite - Baton Rouge, LAJob Title: .NET DeveloperDuration: ASAP through at least the end of the year; likely longerLocation: Baton Rouge, LA (In office 2 days and remote 3 days)Interview Process: Likely 1 with CIO and a Sr Team MemberKey Skills: .NET/VB/C# development skillsAccounting software experience with a STRONG preference for experience with FlexiKey Responsibilities:Develop and maintain .NET/VB/C# scripts and macros to automate and enhance Excel reporting and data analysis processes.Integrate Flexi Accounting Software with Excel for streamlined data extraction and reporting.Collaborate with finance and accounting teams to identify requirements and create custom solutions.Troubleshoot and resolve issues related to VBA applications and Flexi Accounting integration.Document processes, workflows, and technical specifications for future reference.Qualifications:Bachelor’s degree in Computer Science, Information Technology, Finance, or a related field.Proven experience in developing and deploying .NET (VB and/or C#)Strong understanding of Flexi Accounting Software and its functionalities.Proficient in Excel functions, formulas, and advanced data manipulation techniques.Excellent problem-solving skills and attention to detail.Strong communication skills and ability to work collaboratively with cross-functional teams.Please send me each of your candidates' information in a separate email and have them complete the Spark Hire THEN I will call them. I will not call any candidates until I have confirmation that the Spark Hire is completedIt will ask the candidates a few questions about their experience and the questions are below. Camera and microphone are on - a suit and tie are not necessary at all, but a collared shirt and clean background go a long way. This should be a natural response - so please do not read off of a resume. As soon as this is completed I will give the candidates a call, talk to them a little about the job requirements, and submit them.Questions for SH Tell me about your last projectDo you have experience with Flexi or any other accounting softwareWhat is one strength you bring to a team or one accomplishment you’re proud of in your careerThanks & RegAditi SikarwarTechnical RecruiterTEK Inspirations LLC | 13573 Tabasco Cat Trail, Frisco, TX 75035E: aditi.sikarwar@tekinspirations.com",
        "source": "Email",
        "date_posted": "2024-10-23 11:35:18-05:00",
        "unique_id": "192ba5d316b3a682",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]