[
    {
        "company": "iTech US, Inc.",
        "job_title": "Program Manager with Banking domain exp",
        "location": "Buffalo, NY, USA",
        "full_location": {
            "city": "Buffalo",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Contract Role",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Transformation Delivery",
                "Program/Project Management",
                "Organizational Change Management",
                "Performance Measurement",
                "Customer Experience"
            ],
            "primary": [
                "Strategic Enterprise Initiatives",
                "Governance Framework",
                "Communication Skills",
                "Stakeholder Engagement",
                "Risk Management"
            ],
            "secondary": [
                "Innovation",
                "Process Re-engineering",
                "Change Management",
                "Mentoring",
                "Diversity Promotion"
            ],
            "all": [
                "Transformation Delivery",
                "Program/Project Management",
                "Organizational Change Management",
                "Performance Measurement",
                "Customer Experience",
                "Strategic Enterprise Initiatives",
                "Governance Framework",
                "Communication Skills",
                "Stakeholder Engagement",
                "Risk Management",
                "Innovation",
                "Process Re-engineering",
                "Change Management",
                "Mentoring",
                "Diversity Promotion"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Sowmyasri Sistla",
        "email": "sowmya.s@itechus.net",
        "jd": "From: Sowmyasri, ITECH sowmya.s@itechus.net Reply to: sowmya.s@itechus.net Hi,Greetings from iTech US, Please go through the below requirement and let me know your interest. Position:: Program Manager with Banking domain expLocation:: Buffalo , NY:: Hybrid ::Duration:: Contract Role (Roles and Responsibilities) Driving the Technology Transformation by co-leading the delivery of one or more Strategic ObjectivesPlays a coordinating role in developing, formulating and communicating corporate technology strategies and objectives, creating and implementing the strategy, roadmap, resourcing and business cases to drive and deliver one or more Strategic ObjectivesPartners with business leaders to design, evaluate and advance their technology strategies, ensuring alignment with corporate strategySupporting and driving the use of leading practices to execute complex initiatives spanning different large teams/ stakeholders and geographiesObserving market trends and evolutions, monitors the organization's needs and performances against targets and evaluates potential issues in order to implement action plansSupporting up a best-in-class transformation operating model and organization and serve as liaison across stakeholdersEngaging with team members by creating a motivating work environment that recognizes, holds team members accountable, and rewards strong performance.Supporting the assignment of clear tasks and objectives and establishing performance indicators for monitoring results versus objectivesPromoting development and sharing of best practices and knowledge that build on core capabilities to proactively address risks and prioritiesMandatory skills Independently guide multi-disciplinary teams through large-scale complex transformational changes focused on Strategic Enterprise Initiatives, or strategically important short-term engagements that deliver business outcomes.Responsible for overseeing and driving teams in the implementation of an evolving strategic enterprise initiative governance framework aimed at achieving alignment across the bank and its strategy.Provide transparency to senior leadership of progress of initiatives.Develop and tailor communications content and artifacts used across various levels in the organization on our Strategic Enterprise Initiative Portfolio of highly complex business initiatives with high attention to detail and quality.Ensures follow up on all critical items and drives accountability through documentation and governance framework and/or assessments.Learn and support understanding of the organization by building credibility with teams, leveraging business acumen and curiosity.Proactively leverages and encourages others on use of multiple Transformation Delivery Tools to ensure all action items, risks, decisions, and issues are identified, captured, escalated and reported consistently and appropriate for Executive levels and decision making, where necessary. Build relationships and participate in engagement management with senior stakeholders and encourage collaboration to support an environment of information sharing to effectively deliver outcomes; learn and support understanding of the organization by building credibility with teams, leveraging business acumen and curiosity.Develop and rely upon relationships across the organization to break down silos and stay connected to changes going on in the bank.Responsible for educating team members by leveraging deep institutional and industry knowledge, business processes/workflows, products, and technologies and leverages them to shape strategy and deliver desired outcomes Lead work groups and individuals with diverse views to develop and provide strategic recommendations and encourage innovation.Provide execution certainty by setting pace and driving accountability working along side senior leaders to drive decisions.Encourage the team to champion new transformation delivery tools and techniques and use them to support innovation, development and facilitate discussion.Support Governance practices and our business partners by influencing the level of defined outcomes and key measures of success for Strategic transformation initiatives.Encourage a culture of how to challenge status quo by consistently pushing for innovation and improvement and recommend solutions for adoption across the organization. Mentor and coach Enterprise Transformation Portfolio and/or Delivery team members to take ownership of their development.Understand and adhere to the Company’s risk and regulatory standards, policies and controls in accordance with the Company’s Risk Appetite. Design, implement, maintain and enhance internal controls to mitigate risk on an ongoing basis. Identify risk-related issues needing escalation to management.Promote an environment that supports diversity and reflects the Bank brand.Maintain M&T internal control standards, including timely implementation of internal and external audit points together with any issues raised by external regulators as applicable.Complete other related duties as assigned. Desired/ Secondary skills Independently guide Transformation Delivery or multi-disciplinary teams through large-scale complex transformational change initiatives, or strategically important short-term engagements for senior management that deliver business outcomes. This function serves as independent 3rd party advising and supporting internal stakeholders on Strategic Enterprise Initiative Governance, Industry best practices for Change Management, transformation delivery and execution. In-depth expertise in strategy and innovation methodologies for enterprise Governance and Transformation Delivery including industry best practices, Program/Project Management, problem statement and Scope Definition, Process Re-engineering, Organizational Change Management, Performance Measurement, and Customer Experience.This function serves as independent 3rd party advising and supporting internal stakeholders on Strategic Enterprise Initiative Governance, transformation delivery methodologies, and execution. Please share your updated resume along with current location details: Thanks,Sowmyasri SistlaEmail : sowmya.s@itechus.netiTech US, Inc. https://www.linkedin.com/in/sri-s-8795a9168/",
        "source": "Email",
        "date_posted": "2024-10-24 10:05:55-05:00",
        "unique_id": "192bf3476b3be570",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]