[
    {
        "company": "Siriinfo",
        "job_title": "Google Cloud Engineer",
        "location": "Boston, MA, USA",
        "full_location": {
            "city": "Boston",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "experience_required": "8-10 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Cloud computing",
                "Microservices architectures",
                "SQL",
                "NoSQL"
            ],
            "primary": [
                "Agile methodologies",
                "Backlog management",
                "User story development",
                "Stakeholder management",
                "Product launches"
            ],
            "secondary": [
                "Retail domain knowledge",
                "Pharmacy domain knowledge",
                "Distributed systems",
                "Usability studies",
                "Process improvements"
            ],
            "all": [
                "Cloud computing",
                "Microservices architectures",
                "SQL",
                "NoSQL",
                "Agile methodologies",
                "Backlog management",
                "User story development",
                "Stakeholder management",
                "Product launches",
                "Retail domain knowledge",
                "Pharmacy domain knowledge",
                "Distributed systems",
                "Usability studies",
                "Process improvements"
            ],
            "with_experience": [
                "Cloud computing",
                "Microservices architectures"
            ]
        },
        "job_type": [],
        "contact_person": "Dushyanth",
        "email": "dushyanth@siriinfo.com",
        "jd": "From: Dushyanth, Siriinfo dushyanth@siriinfo.com Reply to: dushyanth@siriinfo.com Hi Hiring for Google Cloud Engineer at Boston, MAExperience (Years): 8-10Essential Skills: Lead the development and implementation of creative, high-quality requirement roadmaps based on Modernization strategy and vision. Assume end-to-end responsibility for the strategic value, usability, and performance of our solutions.Influence key stakeholders in design and planning decisionManage prioritization and trade-offs among experience, scope, and time to market.Work closely with frontend/backend engineering teams, design, and stakeholders in an agile environment to deliver solutions to market. Proactively identify and resolve strategic issues to help the team meet business, financial, and technical goals Manage backlog planning and development through day-to-day collaboration and decision making with a cross-functional team including engineers, designers and business or subject matter representatives. Develop detailed, crisp user stories with acceptance criteria based on customer needs/experience and business requirements that can be used to create product specifications and architecture. Work with UX Research to design usability and research studies to inform product requirements and influence product design and experience.Own and manage the backlog; continuously orders and prioritizes to ensure that 1-2 sprints/iterations of backlog are always ready. Define and analyzes metrics that measure and benchmark solution success. Drive product launches including working with business stakeholders, engineers, and other cross functional teams across the enterprise.Play active role in optimization and process improvements, for teams to easily understand, build, and maintain best in class software systems.Provide leadership, technology guidance and mentors others throughout their domain.Demonstrate superior product and industry knowledge.Keywords: Domain Knowledge- Retail/Pharmacy,Techincal Knowledge- Understanding of distributed systems, cloud computing, and microservices architecturesDatabase knowledge – SQL, NoSQL, table structure, data relationshipsThanks & regardsDushyanth | Sr. IT Recruiter| Email: dushyanth@siriinfo.com",
        "source": "Email",
        "date_posted": "2024-10-24 09:57:26-05:00",
        "unique_id": "192bf2c6e6af6036",
        "emp_type": [
            "third party"
        ],
        "tag": "GCP Data Engineer"
    }
]