[
    {
        "company": "Stellar IT Solutions",
        "job_title": "Salesforce Business Analyst",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "4 - 5 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Salesforce",
                "Scrum Master",
                "Documentation",
                "Requirements Gathering",
                "Communication"
            ],
            "primary": [
                "Agile",
                "Presentation Skills",
                "Salesforce Certification"
            ],
            "secondary": [
                "User Stories",
                "Administration",
                "FSL",
                "Field Service",
                "Backlog Grooming"
            ],
            "all": [
                "Salesforce",
                "Scrum Master",
                "Documentation",
                "Requirements Gathering",
                "Communication",
                "Agile",
                "Presentation Skills",
                "Salesforce Certification",
                "User Stories",
                "Administration",
                "FSL",
                "Field Service",
                "Backlog Grooming"
            ],
            "with_experience": [
                "Salesforce (5+ years)",
                "Scrum Master"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Aravind",
        "email": "aravindr@stellarit.com",
        "jd": "Hi, This is Aravind form Stellar IT Solutions! You intrigued us in your profile; hence I have a Great Opportunity for you with our direct client so kindly view the below job description and let me know your interest to proceed further.Role: Salesforce Business AnalystLocation: RemoteJob description:We are hiring a Salesforce Business Analyst who also has experience as a Scrum Master. Approximately 2/3 of the consultant's time will involve Business Analyst duties, and 1/3 Scrum Master duties. There work consists of both project-based, enhancement, and bug fixes.The environment is customized and fairly complex and this BA will need excellent documentation, requirements gathering, presentation, and communication skills. Salesforce technologies used include: Sales, Service, Marketing, Field Service, and Experience. Customer works in an Agile, iterative development environment with 2-week sprints.Required Skills, Experience and Duties include:- ability to run scrum calls and perform the backlog grooming- work with multiple business users- document requirements- proactively ask questions to clarify details- have excellent presentation skills- be able to create journeys- work with diverse team of various stakeholders- handle a mix of enhancement and project work- must possess at least one Salesforce certification, as a Business Analyst or Administrator- must have 4 - 5 years of experience as a BAFormal Listed Requirements:• Detailed understanding of the SFDC core application architecture, as well as integrated applications such as SAP and data warehouses.• Serves as a system design liaison for functional enhancements.• Facilitate interviews to gather formal business requirements, document current process, and design future state.• Translate and document user requirement(s) into Functional Specifications or ‘How It can be done’ in tools being used.• Design, propose and document Enterprise Change Requests (ECR’s) for updated and new data integrations.• Defines, documents and coordinates integration testing requirements.• Advises business team members on business process options.• Analyzes complex issues and presents in easy to read process/data flows.• Create/manage project management plans, run weekly project team meetings and drive tasks toward completion.• Deliver efficient and meaningful stakeholder communications to drive awareness and progress toward common goals. Job Title: Salesforce Business Analyst / Scrum Master Top Skills Details1) 5+ years of Salesforce BA experience2) Prior experience as a Scrum Master3) Outstanding documentation, requirements gathering, communication, and presentation skills.4) At least one Salesforce certification (preferably Business Analyst or Administrator) Workplace Type: 100% RemoteExperience Level: Expert LevelWork Environment: 100% remote. Generally, 7:30 - 4:30 MT hours with some flexibility.Additional Skills Tags: User Stories, Administration, FSL, Field Service, backlog, GroomingAdditional Skills & Qualifications: Outstanding verbal, written, presentation, and communication skills are required, as are excellent documentation skills.",
        "source": "Email",
        "date_posted": "2024-10-23 12:05:31-05:00",
        "unique_id": "192bab283e19dae0",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]