[
    {
        "company": "",
        "job_title": "Business Analyst with Data",
        "location": "Chicago, IL, USA",
        "full_location": {
            "city": "Chicago",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "8+ years",
            "degree_required": "Bachelor's degree or equivalent work experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "business and technical requirements analysis",
                "documenting business use cases",
                "drafting data & BI requirements",
                "SQL"
            ],
            "primary": [
                "MS Word",
                "Excel",
                "Powerpoint",
                "quantitative skills",
                "analytical skills",
                "critical-thinking skills",
                "problem-solving skills",
                "communication skills",
                "interpersonal skills",
                "influencing skills"
            ],
            "secondary": [
                "hospitality industry experience",
                "IDeaS Revenue Management system experience",
                "cloud data warehouse / BI project environment experience",
                "data visualization",
                "design"
            ],
            "all": [
                "business and technical requirements analysis",
                "documenting business use cases",
                "drafting data & BI requirements",
                "SQL",
                "MS Word",
                "Excel",
                "Powerpoint",
                "quantitative skills",
                "analytical skills",
                "critical-thinking skills",
                "problem-solving skills",
                "communication skills",
                "interpersonal skills",
                "influencing skills",
                "hospitality industry experience",
                "IDeaS Revenue Management system experience",
                "cloud data warehouse / BI project environment experience",
                "data visualization",
                "design"
            ]
        },
        "job_type": [],
        "contact_person": "sai",
        "email": "sai@o2finc.com",
        "jd": "From: sai, o2f sai@o2finc.com Reply to: sai@o2finc.com Job DescriptionPURPOSE:In this role youll help gather and organize information related to data products which will be used to build business-critical, scalable data processing solutions, and intuitive and trustworthy data products that power data discovery, self-service analytics and drive product innovation. You will be part of a global data community and you will work in cross-functional and agile project teams alongside Data Product Managers, Data Stewards, Data Scientists, Machine Learning Engineers, Data Engineers, and executives to improve the experience of guests and colleagues worldwide.RESPONSIBILITIES:• Support the Data product team in gathering, analyzing and organizing the data product requirements, including but not limited to the functions - Guest, Marketing, Revenue Management, Sales, Loyalty, Finance and Operations• Develop technical deliverables, review technical documents and provide input to data product plans and milestones.• Analyze and verify requirements for completeness, consistency, comprehensibility, feasibility, and conformity to standards.• Collaborate with Product Managers, Business Stakeholders, Data Engineering/Platform and Data Science teams to execute the Data product roadmaps.• Promote and facilitate the development of self-service capabilities for the business in the access and reporting of business information.• Provide inputs to define, implement, and consistently exercise information management best practices across the organization. Identify and implement industry best practices. Ensure data integrity of all systems.EXPERIENCE & SKILLS:• Strong team player with 8+ years of proven experience in business and technical requirements analysis, documenting business use cases, verification and drafting data & BI requirements• Ability to effectively prioritize and execute tasks with strong customer service orientation• Strong experience with MS Word, Excel and Powerpoint• SQL experience strongly preferred• Strong quantitative, analytical, critical-thinking and problem-solving skills.• Strong work ethic and personal integrity; self-directed and self-motivated with a highly developed curiosity and willingness to learn and to teach.• Excellent verbal and written communication skills as well as interpersonal and influencing skills.• Proven ability to influence and work with cross-functional teams. Significant skill required to work effectively across internal functional areas in situations where clear parameters may not exist.• Experience with hospitality industry a plus.• Experience with IDeaS Revenue Management system is a plus.• Experience working in a cloud data warehouse / BI project environment a plus.• Familiarity with data visualization and designEDUCATION:Bachelors degree or equivalent work experience.",
        "source": "Email",
        "date_posted": "2024-10-23 12:41:26-05:00",
        "unique_id": "192ba985d6984143",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]