[
    {
        "company": "Stellar Consulting Solutions",
        "job_title": "Technical .NET Lead",
        "location": "Seattle, WA, USA",
        "full_location": {
            "city": "Seattle",
            "state": "WA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "14-18 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$80 on C2C",
            "job_code": "",
            "contact_person": "Abhishek Pathak",
            "email": "abhishek.pathak@stellarconsulting.com"
        },
        "skills": {
            "core": [
                "Google Cloud Spanner",
                ".NET",
                "GCP"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Google Cloud Spanner",
                ".NET",
                "GCP"
            ]
        },
        "job_type": [
            "remote",
            "hybrid"
        ],
        "contact_person": "Abhishek Pathak",
        "email": "abhishek.pathak@stellarconsulting.com",
        "jd": "From: Abhishek Pathak, Stellar Consulting Solutions abhishek.pathak@stellarconsulting.com Reply to: abhishek.pathak@stellarconsulting.com Note: Exp. Mandatory in GCP and Retail Order Mgmt.Job Description:Title: Technical .NET LeadLocation: Seattle, WA (hybrid)/Remote (PST)Exp.: 14+ yearsRate: $80 on C2CWe are seeking a highly experienced Technical Lead with 14 to 18 years of experience to join our team.The ideal candidate will have a strong background in Google Cloud Spanner, GCP, and .NET.This hybrid role requires excellent organizational and communication skills to manage multiple projects effectively.The Program Manager will play a crucial role in driving project success and ensuring alignment with company goals.Experience : 14 to 18YrsRequired Skills : Google Cloud Spanner, .NET, GCPResponsibilities :- Lead the planning and execution of multiple projects simultaneously, ensuring they align with company objectives. - Oversee project timelines, budgets, and resources to ensure successful delivery.- Provide clear and consistent communication to stakeholders, keeping them informed of project status and any potential risks.- Collaborate with cross-functional teams to ensure project requirements are clearly defined and met.- Utilize Google Cloud Spanner, GCP, and .NET to develop and implement technical solutions that meet project goals.- Monitor project progress and make adjustments as necessary to ensure successful completion.- Ensure all projects adhere to company policies and standards.- Conduct regular project reviews and post-project evaluations to identify areas for improvement.- Develop and maintain comprehensive project documentation. - Facilitate effective team collaboration and communication to drive project success.- Identify and mitigate potential project risks to minimize impact on project outcomes.- Provide mentorship and guidance to junior team members to foster their professional growth.- Ensure projects are delivered on time, within scope, and within budget.Qualifications- Possess a minimum of 14 years of experience in program management.- Demonstrate expertise in Google Cloud Spanner, GCP, and .NET.- Exhibit strong organizational and communication skills.- Show ability to manage multiple projects simultaneously.- Have experience in a hybrid work model.- Display proficiency in project management tools and methodologies.",
        "source": "Email",
        "date_posted": "2024-10-24 16:18:11-05:00",
        "unique_id": "192c0fe20ac42bbe",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]