[
    {
        "company": "Dept of Education",
        "job_title": "Senior Business/Data/Reporting Analyst (Tableau/Excel/SSMS - Data Reporting/Visualizations)",
        "location": "Tallahassee, FL, USA",
        "full_location": {
            "city": "Tallahassee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "11-12 years",
            "degree_required": "Bachelor’s or Master’s Degree in Computer Science, Information Systems, or other related field. Or equivalent work experience.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "$XX/hr (All Inclusive)"
        },
        "skills": {
            "core": [
                "Business Analyst",
                "Tableau",
                "SQL Server Management Studio",
                "SQL (TSQL)",
                "Data reporting"
            ],
            "primary": [
                "Req Gathering",
                "information technology design techniques",
                "evaluate & define large & complex business processes",
                "design and development of visualizations",
                "state and federal performance reports",
                "Report enhancements/designs/Modifications",
                "Dictionaries/Definitions/information accuracy/standards/ policies and procedures/validation methodologies and strategies",
                "Flow charts",
                "Develop framework for data administration documentation",
                "metadata warehouse",
                "User stories",
                "ERDs/user guides",
                "USE CASES",
                "Test Plan/Cases",
                "JAD sessions",
                "MS Office/Visio/PDF",
                "Scrum/Agile",
                "Waterfall",
                "Develop technical manuals and training materials"
            ],
            "secondary": [
                "GOVT",
                "Analytical & product management skills",
                "Verbal & written communication skills",
                "Ability to analyze, evaluate & define large & complex business processes",
                "Ability to develop technical manuals and training materials for IT systems and applications",
                "Knowledge of Word and PDF document development",
                "Ability to successfully engage in multiple initiatives simultaneously"
            ],
            "all": [
                "Business Analyst",
                "Tableau",
                "SQL Server Management Studio",
                "SQL (TSQL)",
                "Data reporting",
                "Req Gathering",
                "information technology design techniques",
                "evaluate & define large & complex business processes",
                "design and development of visualizations",
                "state and federal performance reports",
                "Report enhancements/designs/Modifications",
                "Dictionaries/Definitions/information accuracy/standards/ policies and procedures/validation methodologies and strategies",
                "Flow charts",
                "Develop framework for data administration documentation",
                "metadata warehouse",
                "User stories",
                "ERDs/user guides",
                "USE CASES",
                "Test Plan/Cases",
                "JAD sessions",
                "MS Office/Visio/PDF",
                "Scrum/Agile",
                "Waterfall",
                "Develop technical manuals and training materials",
                "GOVT",
                "Analytical & product management skills",
                "Verbal & written communication skills",
                "Ability to analyze, evaluate & define large & complex business processes",
                "Ability to develop technical manuals and training materials for IT systems and applications",
                "Knowledge of Word and PDF document development",
                "Ability to successfully engage in multiple initiatives simultaneously"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "sam",
        "email": "sam@vitaforms.com",
        "jd": "From: sam, vitaforms sam@vitaforms.com Reply to: sam@vitaforms.com Position is with Dept of Education in Tallahassee, FL. so it will be plus to have Public Sector experience. Make sure that we have about 3 + Top candidates for the positions who can provide 3 ref.. Start will be Dec 2024 due to extensive background check so ideally we need candidates who already have a project NOT someone on bench. We would need 1) Resume2) Resume AND ON-SITE certification form – Signed 3) References4) Skill matrix for each candidate submitted. Mandatory Experience11-12 years of IT work experience in Business Analysis. This person can be remote after the first 1-2 weeks at the client site but the candidate has to be living in Florida ideally in Tallahassee, FL. They will NOT be authorized to take state Equipment to any other states. Title: 80 (24/25) Business Analyst, Advanced; Request #: PR622963-R119271 – Use this for R-TR Deadline to Submit Monday (11/04/2 in order to submit we need A) Skill matrixB) An up to date resume and Cover letter (why you should be the selected candidate) in word format only. C) Complete ref sheet. Ref from 3 different projects are needed with All the fields filled out. D) Manual signed Resume certification form with Blue/Black ink. DL copy or passport copy is needed as form of identification to witness the persons signature. Please leave the date blank so we DO NOT have you bother you with this STEP for any future positions.E) Manual signed “on-site Acknowledgement” form with Blue/Black ink. Only place the date and signature the above info box will be filled by GIS, IncF) Rate as agreed - $XX/hr (All Inclusive) C-2-C with once a month billing terms NET 30. Please confirmG) No Double submission to the state of Florida. Please confirm This is in ref to the position listed below Position ID: 422201-SBDRA Title: Senior Business/Data/Reporting Analyst (Tableau/Excel/SSMS - Data Reporting/Visualizations)Location: Tallahassee, FL Pay Rate: DOELength: Long Term Travel Required: noneTelecommute: no Skills: \"Business Analyst\"; Req Gathering; information technology design techniques; \"evaluate & define large & complex business processes\"; design and development of visualizations; Tableau; state and federal performance reports; SQL Server Management Studio; SQL (TSQL) procedures and data queries; Report enhancements/designs/Modifications; Data reporting/Dictionaries/Definitions/information accuracy/standards/ policies and procedures/validation methodologies and strategies; Flow charts, Develop framework for data administration documentation; metadata warehouse; Rule 60GG-1, User stories, ERDs/user guides; USE CASES; Test Plan/Cases, JAD sessions; Plan/schedule/facilitate/document meetings/UAT; MS Office/Visio/PDF, Scrum/Agile, Waterfall; Develop technical manuals and training materials, GOVT Note : Please reply ONLY if you 1) Can live in state of Florida from day one and have all the Required skill set and have experience as a \"Senior Business/Data/Reporting Analyst (Tableau/Excel/SSMS - Data Reporting/Visualizations))\". Preference to have PUBLIC SECTOR Experience.2) can meet the min required experience as defined under the MANDATORY Skill. 3) can provide at least 3 verifiable experience from completed and/or substantially completed jobs that closely match this request (Filling the client provided form) + Sign a Resume certification form4) Can go through a background check including fingerprinting + Agree to a Web Cam interview5) will be available in December 2024 timeframe as it takes a minimum of 2-3 weeks for a start after a successful interview. Each staff member assigned to this project must have a background screening that is equivalent to a Level Two (2) screening standard. This is a fixed fee/hourly based project which is inclusive of travel, lodging, per diem expenses and all other costs associated with the completion of the associated tasks. Face to Face Interviews: At the hiring manager’s discretion, interviews may be conducted via Microsoft Teams or in person. Telecommuting: Allowed BackgroundThis is a new request for a contracted resource within the Division of Vocation Rehabilitation, Bureau of Compliance and Quality Assurance. Minimum Qualifications of CandidateThe Department is seeking a Business Analyst professional with the following minimum qualifications (these qualifications must be clearly stated on the resume and verifiable via reference checks):Education: Bachelor’s or Master’s Degree in Computer Science, Information Systems, or other related field. Or equivalent work experience. (Required)11-12 years of IT work experience in Business Analysis. 1. Must have knowledge of Agency specific policies and procedures and databases.2. Knowledge of requirement gathering techniques.3. Knowledge of information technology design techniques.4. Ability to determine work priorities & ensure proper completion of work assignments.5. Ability to establish & maintain effective working relationships with others.6. Analytical & product management skills required, including a thorough understanding of how to interpret customer business needs & translate them into application & operational requirements.7. Verbal & written communication skills & the ability to interact professionally with a diverse group, executives, managers, & subject matter experts.8. Ability to analyze, evaluate & define large & complex business processes.9. Ability to develop technical manuals and training materials for IT systems and applications.10. Knowledge of Word and PDF document development.11. Ability to successfully engage in multiple initiative simultaneously.12. Skill in design and development of visualizations, preferably with Tableau and Excel. Deliverables/TasksThe Business Analyst key deliverables include, but are not limited to, the following. Minimum Level of performance will be verified by supervisor. • Evaluate information gathered from multiple sources, reconcile conflicts, decompose high-level information into details, abstract up from low-level information to a general understanding, and distinguish user requests from the underlying true needs.• Assist with the design and development of visualizations (especially Tableau and Excel} for stakeholders and customers (e.g., HQ, FRC, field offices, public records requests, and legislative committees, etc.}.• Resolve and troubleshoot complex issues related to data reporting information.• Create process control plans and other process related documentation.• Assist with the preparation and delivery of required state and federal performance reports.• Collaborate with subject matter experts and key stakeholders to establish the metrics that will be used to develop data extracts and/or reports.• Assist key stakeholders (i.e., data management team and IT) to translate-business requirements into technical specifications to support data, reporting, and IT systems.• Use a SQL Server Management Studio (SSMS) in the design, development, and maintenance of SQL (TSQL) procedures and data queries to provide information requested by stakeholders and customers (e.g., HQ, FRC, field offices, public records requests, legislative committees, etc.).• Consult with Federal and State personnel; recommend appropriate action for program changes to ensure the availability of required data and reports.• Consult with Division Administrators and staff to develop solutions for programmatic/systemic data reporting problems.• Collect, investigate and analyze requests for report enhancements, recommend solutions, report designs, data reporting changes, monitor and test modified reports to ensure that end-user requirements are met.• Document technical processes using entity relationship diagrams, flow charts, data reporting dictionaries and data definitions, etc.• Assist or lead in the establishment of methods and procedures for maintaining data reporting information accuracy, data validation methodologies and strategies.• Assist and/or provide a process which manages the enforcement of established data, standards, policies and procedures.• Provide training and technical assistance in data management, information analysis, and information interpretation skills.• Conduct, coordinate, and/or assist in the requirements gathering and documentation of specifications relating to reports and reporting systems.• Identify opportunities for sharing commonly used data within the Division and with external partners.• Coordinate maintenance of statewide data reports with staff to reflect policy changes and ensure appropriate distribution.• Develop framework for data administration documentation.• Develop, manage, and maintain a data reporting dictionary and metadata warehouse. Note: The staff augmentation consultants are required to be off the week of Christmas and New Year unless services are required with prior approval from division leadership. Please ensure that your candidates are aware of this prior to submitting them for this proposal. General Knowledge, Skills and Abilities (KSAs)The submitted candidate(s) must be able to apply common knowledge, skills, and abilities in the following areas:1. Communication: Able to clearly convey information, in both written and verbal formats, to individuals or groups in a wide variety of settings (i.e.; project team meetings, management presentations, etc.). Must have the ability to effectively listen and process information provided by others.2. Customer Service: Works well with clients and customers (i.e.; business office, public, or other agencies). Able to assess the needs of the customer, provide information or assistance to satisfy expectations or resolve a problem.3. Decision Making: Makes sound, well-informed, and objective decisions.4. Flexibility: Is open to change, new processes (or process improvement), and new information. Has the ability to adapt in response to new information, changing conditions, or unexpected obstacles. Ability to receive and give constructive criticism and maintain effective work relationships with others.5. Interpersonal: Shows friendliness, courtesy, understanding, and politeness to others.6. Leadership: Motivates, encourages, and challenges others. Is able to adapt leadership styles in a variety of situations and is self-motivated.7. Problem Solving: Able to identify, evaluate, and use sound judgement to generate and evaluate alternative actions, and make recommendations as accordingly.8. Team Building: Encourages, inspires, and guides others toward accomplishing the common goal. NOTE: In addition to the above list, all selected Candidates must successfully complete a Level II Background Check. The Contractor must complete the Department s Security Awareness Training within 30 calendar days of starting, and must pass a Level II Background screen prior to accessing the CLIENT system. \"When replying please make sure to list your (All Inclusive) Compensation requirements !!!\" Note : This is a Full time ON SITE Contract Position with no REMOTE options allowed !! Start date : December 2024 # OF POSITIONS : 1",
        "source": "Email",
        "date_posted": "2024-10-23 10:53:58-05:00",
        "unique_id": "192ba38f7acde580",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]