[
    {
        "company": "HCL",
        "job_title": "Senior Project Manager",
        "location": "Chicago, IL, USA",
        "full_location": {
            "city": "Chicago",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Portfolio Management",
                "Business Process",
                "CMS"
            ],
            "primary": [
                "Stakeholder Collaboration",
                "Risk Management",
                "Project Documentation"
            ],
            "secondary": [
                "Quality Assurance",
                "Process Improvement",
                "Technical Design"
            ],
            "all": [
                "Portfolio Management",
                "Business Process",
                "CMS",
                "Stakeholder Collaboration",
                "Risk Management",
                "Project Documentation",
                "Quality Assurance",
                "Process Improvement",
                "Technical Design"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Rajesh",
        "email": "rajesh@info-ways.com",
        "jd": "Hi, Hope you are doing great. We have an urgent requirement for the below position with our IT Client HCL. Kindly reply back to this email or call me to discuss further. POSITION : Senior Project Manager LOCATION : Its a complete onsite location is Chicago IL and there is no remote option DURATION : 12 MONTHS Portfolio Management EXP MAIN Skill (Primary): Domain Competencies (APPS)-Bus. Process- CMS-Portfolio Management JD Specific Skillset Required Collaborate with stakeholders to define scope, priorities, timelines and deliverables for the initiative Tracks progress on overall program Help in developing communication plan Drive alignment and signoffs with relevant stakeholders for each feature Manage risks, dependencies across the project Maintain project documentation, plans, reports throughout the lifecycle (1.) To oversee quality assurance processes, ensuring adherence to coding standards , implementation of best practices and perform Value creation and KM activities. (2.) To ensure process improvement and compliance, and participate in technical design discussion and to review technical documents. (3.) Responsible for shaping the overall project strategy working closely with stakeholders to define project scope, objectives, deliverables and keeping track of schedule to ensure on time delivery as per the defined quality standards. (4.) To work closely with the development team, On-site Engineers to understand technical requirements and work with them to address and resolve technical issues. (5.) Identify and flag potential risks and issues that may impact project timelines or quality, develop mitigation strategies or contingency plans to address risks and provide regular project updates to key stakeholders.",
        "source": "Email",
        "date_posted": "2024-10-23 12:20:16-05:00",
        "unique_id": "192ba84fb2a2e84a",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]