[
    {
        "company": "Paramount Software Solutions",
        "job_title": "Project Coordinator",
        "location": "Lawrenceville, GA, USA",
        "full_location": {
            "city": "Lawrenceville",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "2+ years",
            "degree_required": "Bachelor’s degree in business or related field of study",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ months contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Microsoft Word",
                "Microsoft Excel",
                "MS Project",
                "SharePoint",
                "Outlook"
            ],
            "primary": [
                "SDLC",
                "Document Management",
                "Interpersonal Skills",
                "Communication Skills",
                "Action Plan Execution"
            ],
            "secondary": [
                "Agile",
                "Waterfall",
                "Presentation Skills",
                "Team Collaboration",
                "Risk Assessment"
            ],
            "all": [
                "Project Management",
                "Microsoft Word",
                "Microsoft Excel",
                "MS Project",
                "SharePoint",
                "Outlook",
                "SDLC",
                "Document Management",
                "Interpersonal Skills",
                "Communication Skills",
                "Action Plan Execution",
                "Agile",
                "Waterfall",
                "Presentation Skills",
                "Team Collaboration",
                "Risk Assessment"
            ],
            "with_experience": [
                "Project Management",
                "Microsoft Word",
                "Microsoft Excel",
                "MS Project",
                "SharePoint",
                "Outlook"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Padmapriya",
        "email": "padma@paramountsoft.net",
        "jd": "From: Padmapriya, Paramount software solutions padma@paramountsoft.net Reply to: padma@paramountsoft.net Position: Project CoordinatorLocation: Lawrenceville, GA (This position is 100% onsite from day 1. Candidate needs to work from client location in Lawrenceville, GA. No Remote options)Duration: 12+ months contractInterview Mode: Typically, the manager starts with either a brief phone interview or a virtual interview. Some may also follow up with a face-to-face interview in Lawrenceville, GA. Security Message:This job requires a public safety background check to include criminal histories and fingerprinting. Please note Police will contact the candidate directly during the process which can take up to 2 weeks to complete. Position Description:This position is for an experienced Project Coordinator who will support the PMO processes with a complete understanding of current procedures, identify improvements, document those processes, and connect project managers, managers, and senior leadership. The project coordinator will use Microsofttools to assist in organizing the work and documentation that supports the PMO organization. The project coordinator will be responsible for the knowledge transfer of PMO processes to new and existing project managers, managers, supervisors, etc. An effective Project Coordinator must be able to fulfillvarious duties and responsibilities. Minimum Qualifications:• Clear understanding of the key concepts related to Project Management and the implementation of the System Development Lifecycle (SDLC).• Proficient with technology and basic software programs.• Familiarity with document management concepts and practice.• Ability to execute an action plan.• Ability to perform work accurately and completely, and in a timely manner.• Ability to communicate both written and oral with strong interpersonal skills and a professional demeanor.• Competency in Microsoft applications including Word, Excel, MS Project, SharePoint, and Outlook Preferred Experience:• Bachelor’s degree in business or related field of study• 2+ years of experience as a Project Coordinator.• Exceptional verbal, written, and presentation skills• Ability to work effectively both independently and as part of a team• Ability to work on tight deadlines• Experience supporting highly technical teams. Responsibilities:• Work closely with PMs, managers, supervisors on forms to be submitted into the PMO process for intake, change requests, waivers, charters, project closure, etc.• Ensure that the team is on track with timelines, deadlines• Participate in project improvements meetings (if necessary)• Fundamental knowledge of PMO processes i.e., Waterfall, Agile, etc.• Supervise current projects and coordinate all closure activities that require leadership approval• Organize, attend, and participate in stakeholder meetings• Document and follow up on important actions and decision from meetings• Prepare necessary presentation materials for meetings• Provide administrative support as needed• Undertake project tasks as required• Ensure projects adhere to frameworks and all documentation is maintained appropriately for each project• Assist with on-boarding of new Project Managers.• Assess project risks and issues and provide solutions where applicable• Facilitate meetings where appropriate and distribute minutes to all project team members• Create a project management calendar for fulfilling PMO goals and objectives• Work closely with PMO leadership on portfolio updates and portfolio presentations• Manage small projects• Ability to manage project closure tasks• Ability to create and manage a project schedule• Proficient in MS Project, SharePoint, TEAMS and PowerPoint Availability Requirements:Monday – Friday (8AM-5PM); No overtime.After Hours; Weekends and Holidays – Emergency OnlyTerm: OngoingLocation: Lawrenceville, GAOn-Site: This position will be required to report on-site.",
        "source": "Email",
        "date_posted": "2024-10-23 15:54:48-05:00",
        "unique_id": "192bb947e55c4ec9",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]