[
    {
        "company": "GSK Solutions Inc",
        "job_title": "Senior Java Technical Writer",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months",
            "rate": "$75/hr on C2C / 1099 All Inclusive"
        },
        "skills": {
            "core": [
                "Java",
                "Technical Writing",
                "System Analysis",
                "Swagger"
            ],
            "primary": [
                "J2EE",
                "WebSphere",
                "ASP.Net",
                ".Net 6.0",
                "Angular",
                "React",
                "Java MVC frameworks",
                "Hibernate",
                "SQL Server",
                "SQL",
                "Object Oriented Analysis",
                "Microservices",
                "Cloud-based deployment",
                "Git",
                "Junit",
                "Selenium",
                "Cucumber",
                "Maven",
                "Spring Boot",
                "Azure DevOps",
                "Jenkins"
            ],
            "secondary": [
                "Corticon Rules Engine",
                "WebSphere Liberty",
                "Content Management",
                "OpenShift",
                "Docker",
                "Kubernetes",
                "Visio",
                "Rational Rose",
                "UML Diagrams"
            ],
            "all": [
                "Java",
                "Technical Writing",
                "System Analysis",
                "Swagger",
                "J2EE",
                "WebSphere",
                "ASP.Net",
                ".Net 6.0",
                "Angular",
                "React",
                "Java MVC frameworks",
                "Hibernate",
                "SQL Server",
                "SQL",
                "Object Oriented Analysis",
                "Microservices",
                "Cloud-based deployment",
                "Git",
                "Junit",
                "Selenium",
                "Cucumber",
                "Maven",
                "Spring Boot",
                "Azure DevOps",
                "Jenkins",
                "Corticon Rules Engine",
                "WebSphere Liberty",
                "Content Management",
                "OpenShift",
                "Docker",
                "Kubernetes",
                "Visio",
                "Rational Rose",
                "UML Diagrams"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Kris",
        "email": "kris@gsksolutions.com",
        "jd": "From: Kris, GSK Solutions Inc kris@gsksolutions.com Reply to: kris@gsksolutions.com Job Title: Senior Java Technical Writer (Hybrid)Location: Lansing, MIDuration: 12 MonthsPay Rate: $75/hr on C2C / 1099 All Inclusive Close to Submissions on 10/30 at 10AM EST.Interviews: In-person interview REQUIRED. Indicate Y/N on coversheetPosition location: Lansing, MI. Hybrid Role with 2 days onsite from day 1 - Tuesday & WednesdayLocal candidates ONLY - Must live within a 60-mile radius. Clear and concise communication skills required. Top Skills & Years of Experience Required:Have a minimum of ten years of post-undergraduate degree experience as a Java code developer (applicant development skill will be assessed in the interview).Have a minimum of six years of System Analyst/Technical Writing experience on a large-scale system (retirement system preferred)Senior Java developer skill set required (will be required to read/write code as part of the System Analyst roleAbility to write quality technical specifications (Familiarity with Swagger) Please See Full Job Description for Additional REQUIRED/Nice to Have skills Job Description: The Systems (Technical) Analyst will work with the ORS Development and Operations Teams to analyze the current system architecture and research emerging technologies, system changes, prepare for specifications, configuration of software, program code evaluation and testing. Lead and manage the design, implementation and delivery of system and software architecture designs, strategies and quality assurance plans. Design, prototype, develop and implement to achieve business results for the client. Experienced expert able to lead and deliver the technical documentation of solutions using object-oriented, serviceoriented architecture, and n-tier architectures. Documents both the State and industry best practices for software engineering. Leads in the development and documentation of long-term technology strategy and planning for the entire organization leveraging existing and acquiring new resources. Leads and actively participates on project teams business by documenting technical requirements in alignment with business needs and requirements, performing analysis, design, development, integration, and maintenance of the ORS technical ecosystem. This position supports the ORS Clarety application, the Employer Self Service (ESS) application, the miAccount application and the Microsoft Dynamics 365 Customer Relationship Management system. Skill DescriptionSenior Java developer skill set required (will be required to read/write code as part of the System Analyst role)Senior Java developer skill set required (will be required to read/write code as part of the System Analyst role)Ability to write quality technical specifications (Familiarity with Swagger)Considerable knowledge of Java, J2EE, WebSphere development technologies. ASP.Net, .Net 6.0 or latest version.Flexibility to work with other technologies (i.e., Angular, React, etc.)Experience with design patterns and organizing algorithms Experienced in designing and implementing Java MVC frameworks (Struts MVC) and ORM tool (Hibernate) and Java Script, Web Services and EJB.Experience in developing systems with Microsoft SQL Server (SQL 2016 or higher)Experience writing Structured Query Language (SQL) and stored procedures.Experience performing analysis and requirements gathering with customers.Experience with both web-based and client server based systems architecture.Experience with Object Oriented Analysis, design and programming experience.Experience with application and database development and access methods.Experience with systems development methodology utilized in the development of new systems and enhancements. Experience with Corticon Rules Engine technologyExperience with WebSphere Liberty Experience with Git Experience with ContentManagement Knowledge (e.g. Filenet) Experience with Micro service and Cloud-based deployment Experience with Junit, Selenium, Cucumber Experience withMaven Experience with Security Framework, JWT, Oauth, Spring Boot, BatchFramework Experience with OpenShift, Docker and Kubernetes Experience withAzure DevOps, Jenkins Experience creating business process models within the process modeling methodology frameworkExperience using Visio and process modeling software such as Rational Rose, UML Diagrams, or other tools. Knowledge of Web Services, process automation, batch operations, API, Cloud / Gov CloudAbility to work and communicate well with all levels of IT project stakeholders Ability to prepare detailed written instructions and technical documentation using industry best practices Ability to work under pressure and tight timelines and diagnose and resolve complex problems quickly.Other technologies as identified through discovery",
        "source": "Email",
        "date_posted": "2024-10-24 11:55:17-05:00",
        "unique_id": "192bf94814645259",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]