[
    {
        "company": "Compusoft Integrated Solutions Inc.",
        "job_title": "Senior Cloud Platform Engineer/Developer",
        "location": "Charlotte, NC, USA",
        "full_location": {
            "city": "Charlotte",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "12+ years",
            "degree_required": "Bachelor’s degree in computer science or related relevant experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Till yearend with potential extensions",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "AWS",
                "Terraform",
                "Python",
                "CI/CD"
            ],
            "primary": [
                "Software Development Lifecycle",
                "Gitlab",
                "Cloud architecture",
                "Infrastructure as code",
                "Serverless applications"
            ],
            "secondary": [
                "Excellent communication skills",
                "Mentoring",
                "Agile delivery process",
                "Technical documentation",
                "Automation & Scripting",
                "Linux administration"
            ],
            "all": [
                "AWS",
                "Terraform",
                "Python",
                "CI/CD",
                "Software Development Lifecycle",
                "Gitlab",
                "Cloud architecture",
                "Infrastructure as code",
                "Serverless applications",
                "Excellent communication skills",
                "Mentoring",
                "Agile delivery process",
                "Technical documentation",
                "Automation & Scripting",
                "Linux administration"
            ],
            "with_experience": [
                "AWS (Expert knowledge)",
                "Terraform (Strong proficiency)",
                "Python (Scripting)",
                "CI/CD (Strong process experience)"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "",
        "email": "dev@compusoft-is.com",
        "jd": "From: Dev, Compusoft Integrated Solutions Inc. dev@compusoft-is.com Reply to: dev@compusoft-is.com Senior Cloud Platform Engineer/Developer (Terraform/AWS/Python)Title: DevOps Engineer V (Senior Cloud Platform Engineer)Work Location: Charlotte, NC (Hybrid- 3 days onsite - only local candidates at this time)Duration: Till yearend with potential extensions2 interviews - 2nd interview onsite at Charlotte office Need 12+ Years Top Skills:Must have strong developer/coding skills – understand and support full Software Development Lifecyle;** AWS - Expert knowledge of application and AWS (cloud) architecture and related technologies – AWS certification preferred but not required;** Terraform,**Python,** CI/CD - Strong CI/CD process experience with tools such as Gitlab. ** Must have excellent communication skills – both verbal and written, collaborative team player, self-starter who will take initiative, able to manage bodies of work not just tasks oriented. Able to mentor and coach junior team members, able to review others’ code and provide feedback. The OpportunitySeeking an innovative and passionate individual who can provide significant contributions in the design, coding, testing, support and debugging of software & enhancements to existing software specifically focused on Public Cloud solutions. The candidate will be responsible for designing, implementing, and maintaining infrastructure as code solutions and tools for our cloud-based systems and applications. The candidate will work closely with cross-functional teams to ensure that our cloud infrastructure adheres to industry best practices and regulatory compliance standards. The Work ItselfDevelop and maintain reusable, inner-sourced Terraform modules for enterprise consumption, collaborating closely with cloud security partners and internal customers.Design, develop, and prototype cloud deployed services, APIs, and serverless applications using infrastructure as code (Terraform) to enable business capabilities in alignment with architecture direction and standards.Lead the development and deployment of new features and tooling to solve complex problems at scale.Participate in an agile delivery process, and as part of that help size stories and own, research, and recommend new solutions.Aid in implementation of monitoring using various tools, collection of metrics to enhance visibility, & implement alerting to enhance service reliability.Develop and maintain policies, procedures, and documentation related to infrastructure deployment patterns and best practices.Be passionate about your work, your teammates’ success, and our customers’ needs.Other duties as assigned. The Skills You BringPreferable Certifications: AWS Certified Solutions Architect Professional, AWS Certified DevOps Engineer, or relevant certificationsBachelor’s degree in computer science or related relevant experienceExpert knowledge of application and AWS (cloud) architecture and related technologiesProficiency designing and building custom, reusable Terraform modulesStrong CI/CD process experience with tools such as GitlabExperience implementing serverless and event-driven solutionsComfortable building solutions as an individual and as a leader of others concurrentlyExcellent technical documentation capabilities (e.g., data models, process diagrams, high-level designs)Strategic thinking abilities and an enterprise-wide perspectiveStrong grasp of software development lifecycle (SDLC) conceptsAutomation & Scripting (Python, Bash, etc)Familiarity with administration of Linux operating systems is a plus",
        "source": "Email",
        "date_posted": "2024-10-24 12:53:42-05:00",
        "unique_id": "192bfc9e85e44f15",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]