[
    {
        "company": "iTech US, Inc.",
        "job_title": "Project Manager",
        "location": "Stamford, NY, USA",
        "full_location": {
            "city": "Stamford",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "10 years",
            "degree_required": "Management qualification",
            "visa_sponsorship": "Only H1B with PPnum Mandatory",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Regulatory Projects",
                "Change Management"
            ],
            "primary": [
                "Risk Management",
                "Stakeholder Engagement",
                "Project Delivery"
            ],
            "secondary": [
                "Team Leadership",
                "Reporting",
                "Governance Framework"
            ],
            "all": [
                "Project Management",
                "Regulatory Projects",
                "Change Management",
                "Risk Management",
                "Stakeholder Engagement",
                "Project Delivery",
                "Team Leadership",
                "Reporting",
                "Governance Framework"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Srikanth V",
        "email": "srikanth.v@itechus.net",
        "jd": "Hi , This is Srikanth from iTech US. I have below requirement with one of the premier Client. Please go through it and let me if you are interested to apply for same. Role:Project Manager Location: Stamford, NY(Onsite) - Nearby State CandidatesVisa: Only H1B with PPnum MandatoryJob Description:Total IT Experience required 10 YearsExperience of delivering complex regulatory projectsOwn and drive the project delivery to meet its outcomes and milestone on time and on targetIdentify, track, manage and mitigate any project risks, assumptions, issues and dependenciesLead and monitor the production of a project milestones and make sure that the solutions clearly support the required outcomes and is aligned to our strategic goalsMake sure that all project deliverables satisfy the requirements and that they adhere to the agreed governance frameworkWe’ll expect you to hold a management qualification, as well as some experience in change management. You should also have experience of delivering regulatory projects that support a business strategy and its growth agenda.A collaborative approach and the ability to build productive relationships with stakeholders, colleagues and senior managersIn your new role, you’ll prepare, analyze and provide reporting on all analysis on regulations and rule mapping to policies, manage project plans, controls and make sure that the plans are in line with any wider program plans and controls. You’ll drive activities to adequately prepare the business and engage all the appropriate stakeholders effectively to enable change to be implemented and handed over.You’ll lead a team through the project lifecycle, setting team objectives and carrying out individual assessments, while building and maintaining a positive working relationship with stakeholders across multiple franchises and functions.",
        "source": "Email",
        "date_posted": "2024-10-23 09:03:15-05:00",
        "unique_id": "192b9d326f906a2c",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]