[
    {
        "company": "NITYA Software Solutions Inc.",
        "job_title": "Java Backend Subject Matter Expert",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Microservices",
                "SQL",
                "NoSQL",
                "APIs",
                "GCP"
            ],
            "primary": [
                "Middleware",
                "Event-driven systems",
                "Cloud architecture",
                "Code reviews",
                "Best practices"
            ],
            "secondary": [
                "Mentoring",
                "Documentation",
                "Modular development",
                "Security",
                "Observability"
            ],
            "all": [
                "Java",
                "Microservices",
                "SQL",
                "NoSQL",
                "APIs",
                "GCP",
                "Middleware",
                "Event-driven systems",
                "Cloud architecture",
                "Code reviews",
                "Best practices",
                "Mentoring",
                "Documentation",
                "Modular development",
                "Security",
                "Observability"
            ],
            "with_experience": [
                "Java",
                "Microservices",
                "GCP"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Rajkumar",
        "email": "rajkumar.v@nityainc.com",
        "jd": "From: rajkumar, NITYA Software Solutions Inc. rajkumar.v@nityainc.com Reply to: rajkumar.v@nityainc.com Hi,I hope you are doing well.I am Raj from NITYA Software Solutions Inc.I've included below the job description, please let me know if you are interested, and reply with one updated resume, which I've expected.Role: Java Backend Subject Matter Expert Contribute individually to project success in terms of Backend, middleware and system integration related development involving microservices, event driven system integrations and Structured Query Language (SQL)/NoSQL databases, and design application programming interfaces (APIs) for an API-first platform, ensuring seamless support for primary UI implementation(s)Hybrid Cloud Adaptation: You will work with a hybrid cloud architecture, necessitating flexibility in learning new technologiesHybrid Google Cloud Platform (GCP) solutions will replace or coexist with some technologies currently available exclusively on-premise, in addition to GCP Solutions: Provide solutions that leverage GCP, as it is crucial to fully exploit the benefits of our proposed cloud strategyCode Reviews and Best Practices: Participate in code reviews and contribute to evolving best practices for better maintainability, security, observability, reuse, and modular developmentAssist in tool and platform documentation from both technology and operations perspectives, as well as lead the exploration and implementation of innovative backend solutions using GCP services to optimize our technology stackMentor and Individual Contribution: Mentor teams in technology, design, and architecture, while continuously evaluating and recommending improvements to our backend development processes and infrastructure, considering the optimal use of GCPThank you,RajkumarEMAIL ID:rajkumar.v@nityainc.comNITYA Software Solutions Inc.",
        "source": "Email",
        "date_posted": "2024-10-24 05:33:34-05:00",
        "unique_id": "192be36f92cc3f13",
        "emp_type": [
            "third party"
        ],
        "tag": "Java developer"
    }
]