[
    {
        "company": "Technocraft Solutions LLC",
        "job_title": "Senior .NET Developer",
        "location": "Chicago, IL, USA",
        "full_location": {
            "city": "Chicago",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "4+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".NET",
                "C#",
                "ASP.NET MVC Framework",
                "API programming",
                "Service-Oriented Architecture"
            ],
            "primary": [
                "Cloud services",
                "SOAP",
                "REST services",
                "Web API",
                "Kibana",
                "Elastic search",
                "Log stash",
                "Docker",
                "Kubernetes"
            ],
            "secondary": [
                "Microsoft Enterprise Library",
                "Test Driven Development",
                "automated unit testing",
                "Event Base Architecture"
            ],
            "all": [
                ".NET",
                "C#",
                "ASP.NET MVC Framework",
                "API programming",
                "Service-Oriented Architecture",
                "Cloud services",
                "SOAP",
                "REST services",
                "Web API",
                "Kibana",
                "Elastic search",
                "Log stash",
                "Docker",
                "Kubernetes",
                "Microsoft Enterprise Library",
                "Test Driven Development",
                "automated unit testing",
                "Event Base Architecture"
            ],
            "with_experience": [
                ".NET",
                "C#",
                "ASP.NET MVC Framework",
                "API programming",
                "Service-Oriented Architecture"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Kajal Katara",
        "email": "kajal.katara@technocraftsol.com",
        "jd": "Need Local candidate to IL with DLHello,Hope you are doing wellMy name is Kajal Katara and I'm a Technical Recruiter at Technocraft solutions. We provide IT Consulting Services to our customers immediate and long-term resource needs. I am contacting you either because your resume has been posted to one of the internet job sites to which we subscribe or you had previously submitted your resume to Technocraft solutions. Senior .NET Developer (Hybrid)Chicago IL (3/2 Hybrid) ResponsibilitiesProvide software development services to external customers and internal project teams. Responsible for development and/or leadership in the creation of custom software solutions using Deliver Microsoft .Net technology solutions designed to meet customers' business needs.Design and architect solutions and have the ability to understand the customers' businesses is imperative.Acts as trusted advisor by creating and maintaining effective customer relationships to ensure customer satisfaction.Maintain knowledge of leading-edge technologies and industry/market domain knowledge.Work with technical leads/architects and functional resources to shape technical direction and technical strategies within the organization and for external customers. Skills Must haveSignificant experience in web service development and Service-Oriented Architecture4+ years of software development experience of API programming4+ years of .C# and ASP.NET MVC Framework, .NET core, MiddlwareSolid understand of security issues related to multi-tier enterprise applicationsSolid understanding of Cloud services and IntegrationSolid understanding of SOAP, REST services, and Web API based web service protocolsLogging : Kibana, Elastic search, Log stashDev Tool : Fiddler, Postmam and CharlesDevOps: Docker and Kubernetes (understanding)Testing tool : XUnit Nice to haveExperience with Microsoft Enterprise LibraryExperience with Test Driven Development and automated unit testingExperience with Event Base Architecture",
        "source": "Email",
        "date_posted": "2024-10-23 14:39:21-05:00",
        "unique_id": "192bb375da071334",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]