[
    {
        "company": "Dept of Environmental Protection",
        "job_title": "Java/JEE Developer (Oracle database/PL-SQL)",
        "location": "Tallahassee, FL, USA",
        "full_location": {
            "city": "Tallahassee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "DEP 3703 OTIS-37ITC010-37ITC092-FY24/25",
            "experience_required": "11+ years",
            "degree_required": "Bachelor’s Degree in Computer Science, Information Systems or other Information Technology major, or equivalent work experience.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Multi Years",
            "rate": "$XX/hr (All Inclusive)"
        },
        "skills": {
            "core": [
                "JAVA/J2EE",
                "Oracle",
                "PL/SQL",
                "Spring",
                "Spring Boot"
            ],
            "primary": [
                "ETL",
                "full-stack developer",
                "Struts 2/Tiles",
                "Servlets/JSP",
                "JPA 2/Hibernate",
                "DML/DDL",
                "UML",
                "XML",
                "HTML",
                "CSS",
                "Bootstrap",
                "RESTful web services",
                "JQuery",
                "AngularJS",
                "NodeJS",
                "React",
                "ISDM",
                "OOA&D",
                "Jenkins",
                "Gitlab",
                "TOAD",
                "SQL Developer",
                "SQL Navigator",
                "Kubernetes",
                "Docker",
                "CI/CD pipelines",
                "Linux/UNIX shell environments",
                "Geographic Information System",
                "Agile development/Scrum",
                "Extreme Programming (XP)",
                "Kanban",
                "Documentation",
                "Govt"
            ],
            "secondary": [
                "Oracle certification(s)",
                "Familiarity with Agile development",
                "Experience with Virtualization",
                "Experience implementing GIS applications",
                "Experience developing web services"
            ],
            "all": [
                "JAVA/J2EE",
                "Oracle",
                "PL/SQL",
                "Spring",
                "Spring Boot",
                "ETL",
                "full-stack developer",
                "Struts 2/Tiles",
                "Servlets/JSP",
                "JPA 2/Hibernate",
                "DML/DDL",
                "UML",
                "XML",
                "HTML",
                "CSS",
                "Bootstrap",
                "RESTful web services",
                "JQuery",
                "AngularJS",
                "NodeJS",
                "React",
                "ISDM",
                "OOA&D",
                "Jenkins",
                "Gitlab",
                "TOAD",
                "SQL Developer",
                "SQL Navigator",
                "Kubernetes",
                "Docker",
                "CI/CD pipelines",
                "Linux/UNIX shell environments",
                "Geographic Information System",
                "Agile development/Scrum",
                "Extreme Programming (XP)",
                "Kanban",
                "Documentation",
                "Govt",
                "Oracle certification(s)",
                "Familiarity with Agile development",
                "Experience with Virtualization",
                "Experience implementing GIS applications",
                "Experience developing web services"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "sam",
        "email": "sam@vitaforms.com",
        "jd": "From: sam, vitaforms sam@vitaforms.com Reply to: sam@vitaforms.com This is with Dept of Environmental Protection so it will be plus to have Public Sector + Environmental experience. Make sure that we have about 3+ Top candidates who can provide 3 ref. Start will be Dec 2024 so ideally we need candidates who already have a project NOT someone on bench. We would need the Resume, Ref sheet and Signed Resume and on-site certification; for each candidate submitted. This closes by Monday (11/04/24) .!!!!! Official ID : – DEP 3703 OTIS-37ITC010-37ITC092-FY24/25 Request #: PR622764-R119376 - Use this for R-T-R TelecommutingTelecommuting is not an option for this position. This is NOT a remote position. This position will be located at Tallahassee, FL. Please review the position and let us know of your interest. In order to submit we need A) Complete ref sheet (Page 1) . Ref from 3 different projects are needed with All the fields filled out. The attached sheet needs to be filled out. “Job period of Service and Description” refers to your experience NOT the references.B) Skill Matrix – Fill Pages 2-3 + 4 (partially) in the Ref sheet….page 4 (partially) and Last page is for GIS to fill.C) An up to date resume D) Manual signed Resume certification form (provided as PDF and Word option) with Blue/Black ink. GIS, Inc will provide the witness signatures. Please leave the date blank so we DO NOT have you bother you with this STEP for any future positions.E) Manual signed “on-site Acknowledgement” form (provided as PDF and Word option) with Blue/Black ink by the consultant providing the services. Only place the date and signature at the bottom; the above info box will be filled by GIS, IncF) Rate as agreed - $XX/hr (All Inclusive) C-2-C with once a month billing terms NET 30. Please confirmG) No Double submission to the state of Florida. Please confirm This is in ref to the position listed below Position ID: 422201-JEEM Title: Java/JEE Developer (Oracle database/PL-SQL)Location: Tallahassee, FLPay Rate: DOELength: Multi YearsTravel Required: noneTelecommute: no Skills: JAVA/J2EE; ETL; “full-stack developer”; Spring, Spring Boot, Struts 2/Tiles, Servlets/JSP, JPA 2/Hibernate, DML/DDL; Oracle, PL/SQL, UML, XML, HTML, CSS, Bootstrap; RESTful web services; JQuery; AngularJS, NodeJS, React; ISDM, OOA&D, Jenkins, Gitlab, TOAD, SQL Developer, SQL Navigator, Kubernetes, Docker, CI/CD pipelines, RESTful web services, Linux/UNIX shell environments, Geographic Information System, Agile development/Scrum, Extreme Programming (XP); Kanban, Documentation, Govt Description:Note : Please reply ONLY if you 1) Can work on-site from day one. NO REMOTE option allowed2) have all the Required skill set and have worked as an \"Java/JEE Developer\" for Maintenance Projects in a large & Complex enterprise level IT Environment. 3) have Minimum of 11+ years of successful experience in Java Development;4) can provide at least 3 verifiable experience from completed and/or substantially completed jobs that closely match this request (Filling the client provided form) + fill out a skill Matrix + Sign Resume certification form5) Can go through a background check including fingerprinting + Agree to a Face to face interview OR a WEB CAM Interview 6) A Competitive Rate7) will be available Dec 2024 to start at the project. Each staff member assigned to this project must have a background screening that is equivalent to a Level Two (2) screening standard. This is a fixed fee/hourly based project which is inclusive of travel, lodging, per diem expenses and all other costs associated with the completion of the associated tasks. Interviews: In the event an interview is requested; all interviews will be conducted via web Cam. Telecommuting: Not allowed for this position. PurposeServe as an Application Developer focusing on the following technologies: Java/JEE and Oracle DBMS. This role supports ongoing maintenance needed to ensure the stability of applications residing in the CLIENT portfolio. The focus of this support work will focus on a specific Division’s application portfolio, however the team member may also be assigned to work on other projects and/or applications in the CLIENT application portfolio, as specified by management. Education: Bachelor’s Degree in Computer Science, Information Systems or other Information Technology major, or equivalent work experience. Required Tasks to be performed:• Provide maintenance, enhancement and support for a variety of the agency’s business applications.• Assisting in the preparation and documentation of program requirements and specifications.• Research and document requirements of program users.• Writing, translating and coding software programs and applications per specifications.• Assisting in the development and maintenance of user manuals and guidelines.• Working with network administrators, systems analysts and software engineers to assist in resolving problems with software products or company software systems.• Providing mentoring and guidance to junior programmers. Required Knowledge, Skills & Abilities (KSAs):• 7+ years’ experience with Java application development, leveraging frameworks such as Struts/Tiles, Struts 2, Servlets/JSP, and JPA/Hibernate• 5+ years’ experience with Oracle databases, possessing the capability to develop DML and DDL statements to produce very complex queries and PL/SQL database objects, including both DML and DDL• 3+ years’ experience with Javascript frameworks, such as AngularJS, NodeJS, React or JQuery• 3+ years’ experience as a full-stack developer• Experience with responsive design frameworks, preferably Bootstrap• Experience using code repositories, preferably Git• Experience using continuous integration tools, preferably Jenkins• Knowledge of relational database designs• Knowledge of object-oriented design methodologies• Knowledge of Information Systems Development Methodology (ISDM)• Experience with database query tools (i.e., TOAD, SQL Developer, SQL Navigator)• Knowledge of database security, including role-based security• Knowledge and experience with Unified Modeling Language (UML)• Ability to be creative, to use sound judgment, and to display foresight to identify potential problems and design/specifications and assigned application software systems• Ability to establish and maintain effective working relationships with others• Ability to work independently• Ability to determine work priorities and ensure proper completion of work assignments• Ability to work well under pressure and meet deadlines without sacrificing quality• Excellent interpersonal, collaborative, oral and written communication skills Preferred Knowledge, Skills & Abilities (KSAs):• Oracle certification(s)• Familiarity with Agile development, specifically Scrum, Extreme Programming (XP) and Kanban.• Experience with Virtualization, preferably Docker• Experience implementing GIS (Geographic Information System) applications• Experience developing web services, preferably RESTful web services• Experience with environmental regulatory business processes and practices• Knowledge and understanding of Client’s technical environment Resume for One Proposed Consultant - Resume Should have the following information : - Name- All work experience related to the CLIENT’s request for service- Sufficient detail for CLIENT to determine dates of the related work experience, how extensive the related work experience is, and the depth of knowledge and skills of the proposed candidate related to the needs of CLIENT- Candidate Education- Professional Summary- Technical Skills- Work Experience Candidate References: Three (3) references must be provided and include the following:- Name of Company: - Contact Person & Title: - Contact Telephone Number: - Contact Email Address: - Job Period of Service: (MM/YYYY-MM/YYYY)- Description (Scope of Work): - Reference should be a company contact not a peer on the project.- Verify candidate references, if incomplete and CLIENT is unable to email and call their reference, the proposal will be unaccepted. \"When replying please make sure to list your (All Inclusive) Compensation requirements !!!\" Note : This is a Full time ON SITE Contract Position with no REMOTE options allowed !! Start date : Dec 2024 # OF POSITIONS : 1",
        "source": "Email",
        "date_posted": "2024-10-23 09:54:54-05:00",
        "unique_id": "192ba58b79bc018d",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]