[
    {
        "company": "Pull Skill Technologies Inc.",
        "job_title": ".NET Architect",
        "location": "San Ramon, CA, USA",
        "full_location": {
            "city": "San Ramon",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "3 months with possibility of extension",
            "rate": "$85-90/hr on C2C"
        },
        "skills": {
            "core": [
                ".NET",
                "Asset Management",
                "Tech Leadership",
                "UI-based applications",
                "Azure Cloud"
            ],
            "primary": [
                "React",
                "Angular",
                "Winforms",
                "WCF"
            ],
            "secondary": [],
            "all": [
                ".NET",
                "Asset Management",
                "Tech Leadership",
                "UI-based applications",
                "Azure Cloud",
                "React",
                "Angular",
                "Winforms",
                "WCF"
            ],
            "with_experience": [
                ".NET",
                "Asset Management",
                "Tech Leadership"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Aazam",
        "email": "aazam@pullskill.com",
        "jd": "Asset OR Wealth Management Experience is Must Role: .NET Architect with Asset or Wealth Management experienceLocation: San Ramon, CA - 3 days onsite per weekEnd Date: start as a 3 month contract, possibility of extension and also looking for those interested in conversionInterview process: 2 internal, possible client Rate: $85-90/hr on C2C Notes: Need Asset Management experience - Some recent rejections were due to not having Asset Management experience. They should also have experience architecting any system or having helped architect it, as well as done delivery mgmt or provided Tech leadership. Updated Requirements: Recent .NET Architect experience and .NET expertise Experience building UI-based applications (React/Angular), Winforms/WCF on Azure Cloud. Asset/Wealth Management experience is a mustFinancial Services backgroundResponsibilities: Target Architecture of the applicationTech Leadership across Client TeamsBuild a tech roadmap for the productProvide Tech Leadership to the implementation team for migration of D&C’s on-prem EWS application to cloud We need a solid .NET Architect with experience in building UI-based applications (React/Angular), Winforms/WCF on Azure Cloud.Must have played a role of Sr. ArchitectMust have a solid communication to collaboratively drive buildingTarget Architecture of the applicationTech Leadership across Client TeamsBuild a tech roadmap for the productProvide Tech Leadership to the implementation team for migration of D&C’s on-prem EWS application to cloudAWM experience required (asset and wealth management)",
        "source": "Email",
        "date_posted": "2024-10-23 13:23:13-05:00",
        "unique_id": "192babe9e9c02a6a",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]