[
    {
        "company": "Altitude Technology Solutions",
        "job_title": "Java Spring Lead Developer",
        "location": "San Antonio, TX, USA",
        "full_location": {
            "city": "San Antonio",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Bachelor’s or Master’s degree in Computer Science, Engineering, or a related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Spring",
                "Spring Boot",
                "Microservices architecture",
                "RESTful API design"
            ],
            "primary": [
                "AWS",
                "Azure",
                "Google Cloud",
                "SQL",
                "NoSQL",
                "MySQL",
                "PostgreSQL",
                "MongoDB",
                "Docker",
                "Kubernetes",
                "CI/CD",
                "Jenkins",
                "GitLab CI"
            ],
            "secondary": [
                "React",
                "Angular",
                "Vue.js",
                "Software architecture",
                "Design patterns",
                "Problem-solving",
                "Debugging",
                "Analytical skills",
                "Leadership",
                "Communication",
                "Collaboration"
            ],
            "all": [
                "Java",
                "Spring",
                "Spring Boot",
                "Microservices architecture",
                "RESTful API design",
                "AWS",
                "Azure",
                "Google Cloud",
                "SQL",
                "NoSQL",
                "MySQL",
                "PostgreSQL",
                "MongoDB",
                "Docker",
                "Kubernetes",
                "CI/CD",
                "Jenkins",
                "GitLab CI",
                "React",
                "Angular",
                "Vue.js",
                "Software architecture",
                "Design patterns",
                "Problem-solving",
                "Debugging",
                "Analytical skills",
                "Leadership",
                "Communication",
                "Collaboration"
            ]
        },
        "job_type": [],
        "contact_person": "Ravinder Sharma",
        "email": "r.sharma@atsitinc.com",
        "jd": "Urgent Hiring for Java Spring boot Lead Java Spring Lead Developer San Antonio, TX Job Summary: We are looking for a highly skilled and experienced Java Spring Boot Lead to join our team. In this role, you will lead a group of developers to design, develop, and deliver enterprise-grade software solutions using Java and Spring Boot. As a lead, you will be responsible for setting technical standards, driving best practices, and ensuring the quality and performance of applications. Key Responsibilities: Develop and Maintain Applications in SpringBoot and Open liberty Lead a team of developers in the design and development of robust, scalable, and high-performance applications using Java and Spring Boot. Collaborate with cross-functional teams including Product Managers, Architects, and QA to ensure seamless delivery of projects. Architect and design new features, components, and modules with a focus on performance, scalability, and maintainability. Write high-quality code that is easy to maintain and test, adhering to coding standards and best practices. Conduct code reviews, mentoring, and provide technical guidance to the team. Manage project timelines, scope, and ensure the delivery of high-quality software within deadlines. Troubleshoot and resolve issues related to software performance, application bugs, and production environments. Ensure proper integration of backend services with frontend applications. Stay updated with emerging technologies and incorporate best practices into the development process. Manage CI/CD pipelines and ensure smooth deployment processes. Required Skills and Experience: 10+ years of experience in software development with a strong focus on Java, Spring, and Spring Boot. Proficient in microservices architecture, RESTful API design, and implementation. Solid experience with cloud platforms such as AWS, Azure, or Google Cloud. Strong understanding of database technologies including SQL and NoSQL databases like MySQL, PostgreSQL, MongoDB. Experience with containerization and orchestration technologies (Docker, Kubernetes). Familiarity with CI/CD tools like Jenkins, GitLab CI, or similar. Strong experience in software architecture, design patterns, and best practices. Knowledge of front-end technologies (React, Angular, or Vue.js) is a plus. Excellent problem-solving, debugging, and analytical skills. Strong leadership, communication, and collaboration skills.",
        "source": "Email",
        "date_posted": "2024-10-24 15:06:30-05:00",
        "unique_id": "192c0676e5faf5e9",
        "emp_type": [
            "third party"
        ],
        "tag": "Java developer"
    }
]