[
    {
        "company": "InfoTech Spectrum Inc",
        "job_title": "Business Analyst",
        "location": "Chicago, IL, USA",
        "full_location": {
            "city": "Chicago",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "6-10 years",
            "degree_required": "Technical Degree or related work experience",
            "visa_sponsorship": "Must have existing work authorization",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "media industry experience",
                "business analysis",
                "requirements gathering",
                "digital analytics",
                "communication"
            ],
            "primary": [
                "software system development",
                "process improvements",
                "organizational changes",
                "user stories",
                "JIRA"
            ],
            "secondary": [
                "familiarity with media player",
                "entertainment domain",
                "analytical abilities",
                "SAFe",
                "Scrum"
            ],
            "all": [
                "media industry experience",
                "business analysis",
                "requirements gathering",
                "digital analytics",
                "communication",
                "software system development",
                "process improvements",
                "organizational changes",
                "user stories",
                "JIRA",
                "familiarity with media player",
                "entertainment domain",
                "analytical abilities",
                "SAFe",
                "Scrum"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Muskan Sharma",
        "email": "muskan.sharma@infotechspectrum.com",
        "jd": "Hi ,Business Analyst Must have media industry experience (entertainment media content, gaming)Location-Chicago, ILLINOI (must be able to go into the downtown Chicago office 1 or 2 times per week.)- localUSC/GC/GCEAD/H4EAD/OPT (Fake visa copy will not work)Duration-6+Months6 to 10 years exp Start date: November 04, 2024. Must have media industry experience (entertainment media content, gaming) Technical BALocated in Chicago IL Must have media industry experience (entertainment media content, gaming)Responsibilities:This role involves serving as a liaison between business challenges and technology solutions. The key responsibilities include analyzing business processes, identifying business needs, and proposing solutions that may involve software system development, process improvements, or organizational changes. A Technical Business Analyst is responsible for gathering and documenting requirements, conducting business and systems analysis, creating specifications for systems to meet business requirements, and overseeing the implementation of these systems. This role requires a combination of IT and business skills, as well as the ability to communicate effectively with both technical and non-technical stakeholders.Looking for an experienced BA who can write the user stories for dev and EQA team with enough details without much supervisionPrefer local to Chicago since they have work with product owners and participate in PI planning sessions etc.Qualifications :Technical Degree or related work experienceProven experience in an analytics and systems development capacityProficiency with digital analytics e.g. google analytics, google ad managerNice to have: Familiarity with media player, entertainment domainProven analytical abilitiesExcellent communicator with the ability to translate data into actionable insightsKnowledge of SAFe and ScrumExperience in JIRA tool Thank YouBest RegardsMuskan SharmaInfoTech Spectrum Inc2060, Walsh Ave, #120, Santa Clara, CA 95050Email : muskan.sharma@infotechspectrum.com Web: www.infotechspectrum.com",
        "source": "Email",
        "date_posted": "2024-10-23 11:15:40-05:00",
        "unique_id": "192ba4b3ebde127a",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]