[
    {
        "company": "Navy Federal Credit Union",
        "job_title": "Scrum Master/PM with IAM Project Experience",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Scrum Master",
                "IAM",
                "CyberArk",
                "Agile",
                "Project Management"
            ],
            "primary": [
                "CSM",
                "SSM",
                "PMP"
            ],
            "secondary": [],
            "all": [
                "Scrum Master",
                "IAM",
                "CyberArk",
                "Agile",
                "Project Management",
                "CSM",
                "SSM",
                "PMP"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "ashish",
        "email": "ashish@tekinspirations.com",
        "jd": "From: ashish, Tekinspirations ashish@tekinspirations.com Reply to: ashish@tekinspirations.com Hi,Job Description -Need DL Copy at time of Submission and Please provide candidate’s Active LinkedIn Profile with profile picture as it is Required. Also I have a Skills Matrix which is to fill by candidate at time of Submission. Resume no longer than 5 pages. Client: Navy Federal Credit UnionJob Title: Scrum Master/PM with IAM Project ExperienceLocation: RemoteDuration: 6+ monthsMOI: Skype.Visa: USC Only No Fake Candidates; No Fake Visa; No Fake Documents Need Candidates with at least 10+ years of experience in Scrum Master and and having recent experience with CyberArk and IAM projects and is must be clearly shown in Resume.CSM or SSM certification is required.PMP is a really nice to have but not required. Candidates will be switching between an Agile Scrum Master and a traditional PM. Client Need Scrum Master with significant project management experience not a PM with some scrum master experienceCandidates must have some experience with IAM projects, specifically CyberArk. Will take any IAM security tool project experience, but having experience with CyberArk projects will be a home run!!Requirements (Skills which are mentioned below, will be mentioned in the Skill Matrix, so all the points are very important): Within IAM Security Projects, specifically related to CyberArk, work closely with the Product Owner to prioritize and lead delivery of new and existing solutions that align with business initiatives and corporate strategiesParticipate as Scrum Master for an assigned Product Team. Will be assigned Products by the Technical Owner and oversee projects ranging from low to high complexity.Managing a continuous workflow of team deliverables. Advocate, adopt and coach Product Team on Lean, Agile and Scrum practices.",
        "source": "Email",
        "date_posted": "2024-10-23 12:43:40-05:00",
        "unique_id": "192ba9a6598db97f",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Scrum Master"
    }
]