[
    {
        "company": "GVR Infotek",
        "job_title": "Sr. SQL Developer",
        "location": "New York, NY, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SQL development",
                "data modeling",
                "database design",
                "database performance tuning",
                "investment banking financial reporting"
            ],
            "primary": [
                "database management systems (DBMS)",
                "Reporting tool quick sight",
                "Kafka",
                "analytical skills",
                "problem-solving skills",
                "communication skills",
                "interpersonal skills"
            ],
            "secondary": [],
            "all": [
                "SQL development",
                "data modeling",
                "database design",
                "database performance tuning",
                "investment banking financial reporting",
                "Reporting tool quick sight",
                "Kafka",
                "analytical skills",
                "problem-solving skills",
                "communication skills",
                "interpersonal skills"
            ],
            "with_experience": [
                "SQL development",
                "data modeling",
                "database design",
                "investment banking financial reporting"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Kartik Mahajan",
        "email": "kartik.mahajan@gvrinfotek.com",
        "jd": "From: Kartik Mahajan, GVR Infotek kartik.mahajan@gvrinfotek.com Reply to: kartik.mahajan@gvrinfotek.com Role: Sr. SQL DeveloperLocation: New York, NY Need Local Candidates only Day 1 Onsite LinkedIn id is must (Should not been created recently, at least 6 Years old in case of senior candidates) Job Summary: As a SQL Developer, you will play a critical role in designing, developing, and optimizing database solutions that support our investment banking operations. You will work closely with cross-functional teams to ensure that our data architecture meets business needs and regulatory requirements, particularly in the realm of financial reporting. Required Skills and Qualifications:• 10+ years of experience in database development.• Extensive experience with SQL development.• Proven experience in data modeling and database design.• Experience in investment banking financial reporting is required.• Experienced in Reporting tool quick sight.• Experienced in messaging (near real time) data proceeding tools like Kafka, other tools are fine.• Strong analytical and problem-solving skills.• Excellent understanding of database management systems (DBMS).• Proficient in database performance tuning and optimization.• Ability to work in a fast-paced, dynamic environment.• Strong communication and interpersonal skills. Key Responsibilities:• Design, develop, and optimize complex SQL scripts, stored procedures, packages, and functions.• Develop and maintain conceptual, logical, and physical data models that support business requirements and regulatory standards.• Implement and manage data integration processes using cloud-based tools and services.• Utilize your expertise in investment banking to ensure that financial reporting requirements are met efficiently and accurately.• Collaborate with stakeholders to understand reporting needs and translate them into technical specifications.• Optimize database performance and troubleshoot issues to ensure high availability and reliability.• Stay updated with emerging technologies and best practices to improve data management processes.• Document data models, integration processes, and reporting methodologies for future reference.",
        "source": "Email",
        "date_posted": "2024-10-23 14:09:09-05:00",
        "unique_id": "192bae9a078dd9ef",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "DB Admin"
    }
]