[
    {
        "company": "Vyze Inc",
        "job_title": "Pega Developer",
        "location": "Austin, TX, USA",
        "full_location": {
            "city": "Austin",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10 or more years",
            "degree_required": "BS in Computer Science or equivalent",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Pega PRPC 8.x or above",
                "Eclipse",
                "Intellij",
                "GIT",
                "Maven",
                "CI/CD - Jenkins",
                "Newrelic",
                "Splunk",
                "Postman",
                "SQL"
            ],
            "primary": [
                "Excellent triaging skills",
                "Ability to work in large, collaborative teams",
                "Strong analytical skills",
                "Problem solver",
                "Self-starter"
            ],
            "secondary": [
                "Prior experience in large scale healthcare initiatives"
            ],
            "all": [
                "Pega PRPC 8.x or above",
                "Eclipse",
                "Intellij",
                "GIT",
                "Maven",
                "CI/CD - Jenkins",
                "Newrelic",
                "Splunk",
                "Postman",
                "SQL",
                "Excellent triaging skills",
                "Ability to work in large, collaborative teams",
                "Strong analytical skills",
                "Problem solver",
                "Self-starter",
                "Prior experience in large scale healthcare initiatives"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Rohit Dubey",
        "email": "rdubey@vyzeinc.com",
        "jd": "From: Rohit Dubey, Vyze Inc rdubey@vyzeinc.com Reply to: rdubey@vyzeinc.com Hi,This is Rohit from Vyze Inc. working as a recruiter. I’m having a very urgent role.Please go through the Job Description and provide me below required information alongwith your updated Resume ASAP.Full Name:Visa:Email:Phone:Location:Relocation:Skype Id:Start: Job Description -Title: Pega DeveloperLocation: Austin, TX, Memphis TN, Morris Plains, NJ and St. Louis, MO (Hybrid) (Need Local)Duration: 6+ MonthsVisa: CITIZEN,GREEN CARDNeed Profile with 200+ LinkedIn connectionsDescription :Location: must be able to go into office weekly 1-2 days: Austin, TX, Memphis TN, Morris Plains, NJ and St. Louis, MO MUST HAVES:10 or more years of hands-on experience with Pega PRPC 8.x or aboveExperience in using Eclipse, Intellij and GIT for Integrated Development Environments (IDE) primarily for Java development, supporting various languages through plugins.Experience or familiarity in using Maven, CI/CD - Jenkins, Newrelic, Splunk, Postman to automate your build, test, and deployment processesDescription:Recognized internally as “the go-to person” for the complex Pega Development assignments.Provides counsel and advice to top management on significant Pega Development matters, often requiring coordination between organizations.Works closely with client and IT management and staff to identify Pega development solutions, new or modified programs, reuse of existing code through the use of program development software alternatives, or integration of purchased solutions or a combination of the available alternatives.Acts as the designer for complex major systems and their subsystems utilizing a thorough understanding of available technology, tools and existing designs.Provides comprehensive consultation to business unit and IT management and staff at the highest technical level on all phases of application programming and processes for diverse development platforms, computing environments (e.g., host based, distributed systems, client server, software, hardware, technologies and tools, etc.).Researches and evaluates alternative solutions and recommends the most efficient and cost effective application programming solution.May code new or modified programs, reuse existing code through the use of program development software alternatives and/or integrates purchased solutions.Documents, tests, implements and provides on-going support for the Pega applications. Focuses on providing thought leadership and technical expertise across multiple disciplines.Skills:10 or more years of hands on experience with Pega PRPC 8.x or aboveExperience in using Eclipse, Oracle, Intellij and GITExperience or familiarity in using Maven, CI/CD - Jenkins, Newrelic, Splunk, PostmanExcellent triaging skills, SQL querying expertise to identify issuesAbility to work in large, collaborative teams to achieve team & organizational goals.Should have can-do attitude, strong analytical skills, be a problem solver and a self-starterPrior experience in large scale healthcare initiatives preferred but not mandatory. Education:BS in Computer Science or equivalent.Thank You!Rohit DubeyTalent Acquisition Specialist, Vyze, Inc.rdubey@vyzeinc.com",
        "source": "Email",
        "date_posted": "2024-10-23 18:56:06-05:00",
        "unique_id": "192bbef5b8a51835",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "PEGA Developer"
    }
]