[
    {
        "company": "Shrive Technologies LLC",
        "job_title": "Pega Architect with Telecom Domain",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "10-12 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Pega Platform",
                "AIML modeling",
                "Agile development methodologies",
                "Service Management solutions",
                "Front-end web application full-stack systems"
            ],
            "primary": [
                "ReactJS",
                "JSON",
                "RESTful APIs",
                "Google GCP",
                "Google CCAI",
                "LLM Models",
                "Adobe"
            ],
            "secondary": [
                "Voice of Customer",
                "Service Oriented Architecture",
                "Mobile",
                "Web",
                "Voice Chat Technologies",
                "Building reusable components",
                "Modern Auth mechanisms (such as JWT)"
            ],
            "all": [
                "Pega Platform",
                "AIML modeling",
                "Agile development methodologies",
                "Service Management solutions",
                "Front-end web application full-stack systems",
                "ReactJS",
                "JSON",
                "RESTful APIs",
                "Google GCP",
                "Google CCAI",
                "LLM Models",
                "Adobe",
                "Voice of Customer",
                "Service Oriented Architecture",
                "Mobile",
                "Web",
                "Voice Chat Technologies",
                "Building reusable components",
                "Modern Auth mechanisms (such as JWT)"
            ],
            "with_experience": [
                "Pega Platform",
                "AIML modeling",
                "Agile development methodologies"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Krishna",
        "email": "saikrishna@shrivetechnologies.com",
        "jd": "From: Krishna, Shrive Technologies LLC saikrishna@shrivetechnologies.com Reply to: saikrishna@shrivetechnologies.com Role: Pega Architect with Telecom DomainLocation: RemoteDuration: Long term Role Responsibility: The Senior Solutions Architect will lead High Level Design, Reference Architecture and Implementation for variety of programs within the Customer Experience, Service Management, AIML across Omni Channel Systems for the Verizon Consumer Group (VCG). The solutions architect will be responsible for driving solutions and design patterns that promote flexible customer experience and workflow orchestration, reusable components, consistent common domain logic. The Solutions architect will also be responsible for designing solutions across all sales and service transactions that Verizon offers to our customers. These involve complex business processes including managing multiple products, offer and device eligibility rules, business process flows across ordering, billing, provisioning and technical support. The architect will be expected to bring strong expertise on Agile along with Industry Standard Workflow Orchestration Frameworks, Voice of Customer, Service Oriented Architecture, Mobile, Web, Voice Chat Technologies. The architect will help drive experiences that are personalized by leveraging insights from systems of intelligence and AIML modeling. The role will demand knowledge in AIML and Generative AI to enhance customer experience framework with Large Language Model solutioning. The role will demand high standards and technical acumen along with strong attention to scalability and performance to build solutions that can sustain ultra-high volume of traffic. The role will involve heavy collaboration with large functional teams across business, IT, and Data ScientistData Engineering to design solutions for business transformation use cases across the entire customer lifecycle. The resource will be expected to work independently and bring in technical expertise and thought leadership to drive best in class architecture and also alignment adoption of solutions across the GTS group. The role will involve in the Discovery and prototype of new technology for AI solutions . Experiences in PEGA Workflow Case Management, Pega recommendation, Google GCP, Google CCAI, LLM Models, Adobe are a plus. Define methodologies, best practices, perform research, evaluate open source and vendor products in the most critical space of non-functional requirements (NFRs) such as performance, and scalability in the DevOps pipeline. The resource will independently drive prioritization and phasing of features and user stories to enable solution delivery, working with dev and business teams and achieving alignment. The resource will balance business priorities, complexity of work involved and GTS dev team readiness to ensure HLDs and solution designs can drive business outcomes. Resource will be expected to make all related decisions autonomously. Business Alignment Partnership: Build long lasting relationships with business teams to deeply understand their roadmaps, strategic goals. Ensure use case and overall architecture alignment with roadmaps. Conduct reviews, demos and presentations for C-suite and various business executives Knowledge Skills: 10-12 years work experience in large enterprise systems for Fortune 500 Companies (Preferably Telco or Service Provider) focused on front-end web application full-stack systems 2-3 years experience with Service Management solutions. 2-3 years experience with Pega Platform and designing integration with Pega Solution. 2-3 years in AIML modeling, GenAI technologies. Experience with agile development methodologies ReactJS, JSON, RESTfulAPIs etc. Experience with building reusable components and front-end libraries for future use is desirable Knowledge of modern Auth mechanisms (such as JWT) Advanced knowledge of system relationships",
        "source": "Email",
        "date_posted": "2024-10-24 11:49:09-05:00",
        "unique_id": "192bf9dec9b90b4d",
        "emp_type": [
            "third party"
        ],
        "tag": "PEGA Developer"
    }
]