[
    {
        "company": "California State Controller's Office",
        "job_title": "Business Solutions Analyst",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "3 years",
            "degree_required": "Bachelor's degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Process Analysis",
                "Business Process Re-engineering",
                "Certified Business Analyst"
            ],
            "primary": [
                "Documentation",
                "Process Improvement",
                "Project Management"
            ],
            "secondary": [
                "Visio",
                "Excel",
                "Word",
                "PowerPoint",
                "Human Resources",
                "Financial Analysis"
            ],
            "all": [
                "Business Process Analysis",
                "Business Process Re-engineering",
                "Certified Business Analyst",
                "Documentation",
                "Process Improvement",
                "Project Management",
                "Visio",
                "Excel",
                "Word",
                "PowerPoint",
                "Human Resources",
                "Financial Analysis"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Vyzeinc Santosh",
        "email": "sharma@vyzeinc.com",
        "jd": "From: Santosh, Vyzeinc ssharma@vyzeinc.com Reply to: ssharma@vyzeinc.com Job Description -Title: Business Solutions AnalystLocation: Remote (CA)Duration: 12 MonthsMoi: videoThey must have that certification and preferably master’s as well. must linkdin The California State Controller's Office (SCO) is seeking a Consulting Process Reengineer Contractor to provide three non-technical skilled business solutions analysts to identify and document business processes for the SCO.The services shall include:1. Develop branded templates and create a document repository.2. Create and maintain a business process and procedure inventory and associated work plan.3. Conduct analysis, document processes and procedures, and recommend business process improvements.4. Create new materials as needed in various formats (e.g., Visio, Excel, Word and PowerPoint).• Maintain the state's official accounting book of records.• Inform the public of the state's financial condition.• Account for and control disbursement of all state funds, issuing warrants in payment of the state's bills including lottery prizes and unclaimed property.• Determine legality and accuracy of financial claims against the state.• Audit state and local government programs.• Safeguard many types of assets until claimed by the rightful owners, in accordance with the Unclaimed Property Law.• Inform the public of financial transactions of city, county, and other local governments.• Administer the Uniform State Payroll System.• Audit and process all personnel and payroll transactions for state civil service, state exempt employees, state university employees, and college system employees.The SCO is seeking to improve its’ documentation of its business processes and procedures, which will initially focus on its Human Resources, Executive Office, and Unclaimed Property Division.Mandatory Qualifications: a. At least three years’ experience, within the past five years, performing business process analysis, and/or business process re-engineering.b. A Certified Business Analyst certificate that is certified through an accredited entity such as the International Institute of Business Analysis (IIBA) or the Project Management Institute (PMI). This certification must be current and valid at the time of review of proposals. A copy of the certification must be provided for each key staff.c. A bachelor’s degree. A copy of the degree certificate must be provided for each key staff. Additional qualifying experience may be substituted for the required education on a year-for-year basis. Four years’ experience can be substituted for a bachelor’s degree. The substituted experience must in addition to the required three years of experience.Example: If the experience requirement is three years, and the individual is substituting four years’ experience in lieu of a bachelor’s degree, a total of seven years of experience must be submitted to claim this qualification1) Key Staff have more than five years’ experience conducting business process analysis or business process re-engineering. One point will be awarded for each year of experience beyond 5 years, up to 15 years of experience.2) Key Staff have a Master of Business Administration (MBA) degree. A copy of the degree certificate must be provided for each key staff.",
        "source": "Email",
        "date_posted": "2024-10-23 14:26:04-05:00",
        "unique_id": "192baf88e3187c97",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]