[
    {
        "company": "Cognizant",
        "job_title": "Sr GCP Architect",
        "location": "Issaquah, WA, USA",
        "full_location": {
            "city": "Issaquah",
            "state": "WA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "GCP Infra Hands on Architecting",
                "GCP Devops Hands on Architecting",
                "GCP API Management"
            ],
            "primary": [
                "Cloud Infrastructure",
                "Technical Guidance",
                "Stakeholder Collaboration",
                "Cloud Billing Management",
                "IAM/Cloud Identity Management",
                "GCP Operations Suite",
                "Load Balancers",
                "Compute Engine Management",
                "Serverless Applications",
                "Cloud Storage"
            ],
            "secondary": [
                "Training and Mentorship",
                "Compliance with Security Standards",
                "Staying Updated with GCP Technologies"
            ],
            "all": [
                "GCP Infra Hands on Architecting",
                "GCP Devops Hands on Architecting",
                "GCP API Management",
                "Cloud Infrastructure",
                "Technical Guidance",
                "Stakeholder Collaboration",
                "Cloud Billing Management",
                "IAM/Cloud Identity Management",
                "GCP Operations Suite",
                "Load Balancers",
                "Compute Engine Management",
                "Serverless Applications",
                "Cloud Storage",
                "Training and Mentorship",
                "Compliance with Security Standards",
                "Staying Updated with GCP Technologies"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Isaac",
        "email": "isaac@centraprise.com",
        "jd": "From: Isaac, Centraprise isaac@centraprise.com Reply to: isaac@centraprise.com Hi Professional, I am writing to let you know regarding a job opportunity as “Sr GCP Architect” with “Cognizant”. Mentioned is the job description for your review. Job Title: Sr GCP ArchitectLocation: Issaquah WA (Day One Onsite)Job Type: Contract Job Description: 1. GCP Infra Hands on Architecting 2. GCP Devops Hands on Architecting3. GCPs API Lead the design and architecture of scalable and secure GCP cloud solutions.Oversee the implementation of cloud infrastructure, ensuring optimal performance and reliability.Provide technical guidance and support to development teams on GCP best practices.Collaborate with stakeholders to understand business requirements and translate them into technical solutions. Manage cloud billing and optimize costs through effective resource management. Implement and manage IAM/Cloud Identity to ensure secure access and compliance. Utilize GCPs Operations Suite to monitor and maintain the health of cloud environments. Design and deploy load balancers to ensure high availability and fault tolerance. Configure and manage Compute Engine instances for various workloads. Develop and maintain APIs using GCPs API Management/Market Place. Implement VPCs to ensure secure and efficient network communication. Utilize Cloud Storage for scalable and durable data storage solutions. Develop serverless applications using Cloud Functions. Ensure compliance with security standards and best practices. Provide training and mentorship to junior team members. Stay updated with the latest GCP technologies and trends to continuously improve solutions. Contribute to the companys strategic goals by delivering innovative cloud solutions. If interested, please fill the below details and revert with your updated resume. Candidate Full Name Current Location Phone Email ID Skype ID Linked in ID Passport number Total Years of Experience Education Visa Status Willing to relocate Rate Last 4 Digits of SSN#: Availability to start on the project Previously worked with Cognizant (Y/N) If Yes – Provide the CTS Emp ID Interview Availability with the time Zone Thanks & RegardsIsaacIsaac@centraprise.comDirect: 469-923-8111Centraprise",
        "source": "Email",
        "date_posted": "2024-10-24 14:52:25-05:00",
        "unique_id": "192c03d1441b9874",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "GCP Data Engineer"
    }
]