[
    {
        "company": "Nukasanigroup Inc.",
        "job_title": ".NET Full Stack Developer",
        "location": "Jackson, MS, USA",
        "full_location": {
            "city": "Jackson",
            "state": "MS",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "6+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long-term",
            "rate": "Best competitive rate"
        },
        "skills": {
            "core": [
                "C#",
                ".NET Framework",
                "ASP.NET Web API",
                "SQL Server",
                "HTML5",
                "CSS3"
            ],
            "primary": [
                "Azure",
                "ADO.Net",
                "JQuery",
                "Bootstrap",
                "Entity Framework",
                "SCRUM/Sprint methodologies",
                "Visual Studio",
                "IIS",
                "Windows Client",
                "Windows Server",
                "TFS/SVN Version control"
            ],
            "secondary": [
                "Jira Software",
                "Ability to work on many projects at one time",
                "Experience converting older technologies to new cutting edge technologies"
            ],
            "all": [
                "C#",
                ".NET Framework",
                "ASP.NET Web API",
                "SQL Server",
                "HTML5",
                "CSS3",
                "Azure",
                "ADO.Net",
                "JQuery",
                "Bootstrap",
                "Entity Framework",
                "SCRUM/Sprint methodologies",
                "Visual Studio",
                "IIS",
                "Windows Client",
                "Windows Server",
                "TFS/SVN Version control",
                "Jira Software",
                "Ability to work on many projects at one time",
                "Experience converting older technologies to new cutting edge technologies"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Bhavani",
        "email": "recruitment@nukasanigroup.com",
        "jd": "From: Bhavani, nukasanigroup recruitment@nukasanigroup.com Reply to: recruitment@nukasanigroup.com Dear Partner,Good Morning ,GreetingsfromNukasanigroupInc!,Wehavebelowurgentlongtermcontractprojectimmediatelyavailable for**.NET Full Stack Developer, Jackson, MS, Onsite** need submissions you please review the below role, if you are available, could you please send me updated word resume, and below candidate submission format details, immediately. If you are not available, any referrals would be greatly appreciated.Interviews are in progress, urgent response is appreciated. Looking forward for your immediate response and working with you. **Candidate Submission Format - needed from you**Full Legal NamePersonal Cell No ( Not google phone number)Email IdSkype IdInterview AvailabilityAvailability to start, if selectedCurrent LocationOpen to RelocateWork AuthorizationTotal Relevant ExperienceEducation./ Year of graduationUniversity Name, LocationLast 4 digits of SSNCountry of BirthContractor Type DOB: mm/dd Home Zip CodeAssigned Job DetailsJob Title :.NET Full Stack DeveloperLocation: Jackson, MS, OnsiteRate : Best competitive rate3. Position Description and Job Skill SetDescription of the job functions the contractor will be expected to perform.We are looking for a talented and highly effective Senior Full Stack .NET Developer to join our development team. We are currently building the next generation eligibility applications using the latest technologies and are looking for a developer with a true passion for modern web development technologies and frameworks, and experience on the server crafting robust Web APIs based on a highly efficient and extensible application tier. You will be working with server technologies such as ASP.NET Web API 2 and .NET 4.5 to produce JSON RESTful APIs, and browser technologies such as HTML5, and Angular to produce applications.Required Skills/ExperienceProvide the minimum required skills and/or experience the contractor must possess to qualify for this position. These requirements will be transferred to the Score Sheet and candidates without these requirements reflected on their resume willNOT be presented to the manager for consideration.* Advanced technical expertise in 6+ years of C#10+ years of database design and implementation.NET Framework (4.0 or later) NET Web API (2 or later) SQL 2008 (or later)Azure ADO.NetJQuery BootstrapEntity Framework8 or more years’ practical experience in HTML5 and CSS3Advanced knowledge ofSCRUM/Sprint methodologies Visual Studio (2012 or later) IIS (7 or later)Windows Client (7 or later) Windows Server (2008 R2 or later) TFS/SVN Version controlPreferred/Not RequiredProvide any skills/experience that would be helpful for the candidate to possess but not required. Examples: Previous supervisory experience, WebLogic experience helpful, etc.Jira SoftwareAbility to work on many projects at one timeExperience converting older technologies to new cutting edge technologies Beginner: 1-2 years Intermediate: 3-5 years Advanced: 5-7 years SME: 7+ yearsSkill SetSkill Level(See key code above)Required/PreferredNotesOperating SystemsWindows 10AdvancedSelectEnter text hereWindows Server 2012AdvancedSelectEnter text hereEnter text hereSelectSelectEnter text hereProgramming Language/Development ToolsASP.netAdvancedRequiredEnter text hereC#AdvancedRequiredEnter text hereWeb APIAdvancedRequiredEnter text hereDatabase Systems/Database ToolsSQL Server 2008 or laterAdvancedPreferredEnter text hereFramework/SLD/Methodology.NET FrameworkAdvancedSelectEnter text hereQA/Testing – Approaches, ApplicationUnit TestingAdvancedSelectEnter text here",
        "source": "Email",
        "date_posted": "2024-10-23 23:06:09-05:00",
        "unique_id": "192bcd44ab0a9c89",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]