[
    {
        "company": "San Francisco Public Utilities Commission (SFPUC)",
        "job_title": "Accela PM/ Business Analyst",
        "location": "San Francisco, CA, USA",
        "full_location": {
            "city": "San Francisco",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "1 Year",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Accela Civic Platform",
                "software solutions implementation",
                "project management"
            ],
            "primary": [
                "system configuration",
                "user training materials development",
                "technical support"
            ],
            "secondary": [
                "workflow configuration",
                "data structure documentation",
                "user acceptance testing"
            ],
            "all": [
                "Accela Civic Platform",
                "software solutions implementation",
                "project management",
                "system configuration",
                "user training materials development",
                "technical support",
                "workflow configuration",
                "data structure documentation",
                "user acceptance testing"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Rishabh",
        "email": "rishabc@gensigma.com",
        "jd": "From: Rishabh, Gensigma rishabc@gensigma.com Reply to: rishabc@gensigma.com More C2C reqs- connect me on Linkedin--- https://www.linkedin.com/in/rishabhchaturvedi9/ Job Title: Accela PM/ Business AnalystLocation: San Francisco, CAClient Name: San Francisco Public Utilities Commission (SFPUC)Contract Duration: 1 YearPay Rate: Minimum Requirements:MQ1 - 10+ years of experience implementing software solutions for public agencies. The project team must provide documentation supporting this minimum qualification in the form of staff resume(s) and/or company profile, including: If including specific projects or contracts: (a) project scope summary, (b) project cost, (c) approximate project start and end dates, and (d) client name and contact information. If including employment history: (a) start and end year of employment, (b) organization name, and (c) relevant employment duties/tasks. MQ2 - 10+ years of experience with Accela Civic Platform, including implementation, maintenance, and support for public agencies of a similar size (150,000+ customers) and configuration of the rules engine for complex fee structures and workflow. The project team must provide documentation supporting this minimum qualification in the form of staff resume(s) and/or company profile, including specific projects that detail: project scope summary, (b) project cost, (c) approximate project start and end dates, (d) and client name and contact information. Roles and Responsibilities: (Drafted this from the solicitation)Lead project initiation, kick-off meetings, and track key milestones using the project schedule.Facilitate workshops to confirm system configuration needs based on business requirements.Develop user training materials and system documentation for Accela Civic Platform.Configure the platform and document technical configuration, including data structure and entity relationships.Conduct testing, track and report system bugs, and incorporate fixes during user acceptance testing.Provide post-go-live technical support, troubleshooting, and maintain a service resolution log for four weeks.",
        "source": "Email",
        "date_posted": "2024-10-24 10:17:04-05:00",
        "unique_id": "192bf7d47b270ff2",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]