[
    {
        "company": "Nukasani Group",
        "job_title": "Release Train Engineer PM 4",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Best competitive rate"
        },
        "skills": {
            "core": [
                "SAFe Agile Release Train Engineer",
                "PMP Certification",
                "Scrum Master Certification",
                "SAFe SPC or RTE Certification"
            ],
            "primary": [
                "5 years of RTE experience",
                "3 years of RTE experience managing Power Platform teams",
                "Strong verbal/written communication skills",
                "Experience with agile software development for complex Information Technology systems"
            ],
            "secondary": [
                "Microsoft Project",
                "Visio",
                "MS Office",
                "Team Foundation Server",
                "JIRA",
                "Version One"
            ],
            "all": [
                "SAFe Agile Release Train Engineer",
                "PMP Certification",
                "Scrum Master Certification",
                "SAFe SPC or RTE Certification",
                "5 years of RTE experience",
                "3 years of RTE experience managing Power Platform teams",
                "Strong verbal/written communication skills",
                "Experience with agile software development for complex Information Technology systems",
                "Microsoft Project",
                "Visio",
                "MS Office",
                "Team Foundation Server",
                "JIRA",
                "Version One"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Nancy",
        "email": "recruiter5@nukasanigroup.com",
        "jd": "Dear Partner, Good Morning, Greetings from Nukasani Group Inc! We have below urgent long-term contract project immediately available for Release Train Engineer PM 4, Richmond, VA, Hybrid. Need submissions you please review the below role, if you are available, could you please send me updated word resume, and below candidate submission format details, immediately. If you are not available, any referrals would be greatly appreciated. Interviews are in progress, urgent response is appreciated. Looking forward for your immediate response and working with you. Candidate Submission Format - needed from you: Full Legal Name, Personal Cell No (Not google phone number), Email Id, Skype Id, Interview Availability, Availability to start, if selected, Current Location, Open to Relocate, Work Authorization, Total Relevant Experience, Education./ Year of graduation, University Name, Location, Last 4 digits of SSN, Country of Birth, Contractor Type, DOB: mm/dd, Home Zip Code. Assigned Job Details: Job Title: Release Train Engineer PM, Location: Richmond, VA, Hybrid, Rate: Best competitive rate. LOCAL candidates required. Candidate should be able to work onsite up to 3 days/week. PLEASE DO NOT submit candidates who were submitted to previous VDOT Release Train Engineer reqs. VDOT ITD is looking for a passionate and result-oriented individual who will take over a technical Scaled Agile train as Release Train Engineer (RTE) that supports Power Platform development. This RTE should have some understanding of Power Platform technology, be able to empower teams, facilitate the ART events, effectively communicate with stakeholders, coach teams to ensure Agile processes are being followed, support teams with self-organization, escalate and help resolve impediments, and continuously improve teams/train to maximize value delivery. Candidate should also be able to perform Scrum Master/Project Manager duties as needed. Ideal candidate should be well versed, have led technical projects using Agile methodologies, and be comfortable with autonomously leading in a matrixed environment. Responsibilities: • Plan, lead, organize, and motivate agile and traditional project teams to achieve a high level of performance and quality in delivering projects that provide exceptional business value to the internal and external stakeholders. • Drive consistent project delivery through the entire project lifecycle, including Project plans, Release plans, Resource allocation, and management of project risks, schedule, budget, and delivery of value. • Provide leadership in the establishment and development of project baseline budgets, resource allocation, and schedules. • Track and communicate project's progress from a schedule, cost, and risk perspective to the project team, stakeholders, and management. • Manage and optimize the flow of value through the ART using various tools, such as the Program Kanban and other information radiators. • Establish and communicate the annual calendars for Iterations and Program Increments (PIs). • Facilitate PI Planning readiness, PI Planning event, and PI execution e.g. Roadmap, Backlogs, Risks, Dependencies, and PI Objectives, etc. • Assist feature prioritization, tracking the execution of features e.g. Train level metrics. • Facilitate synchronization meetings e.g. Scrum of Scrums and Program Committee Meetings. • Coach Managers, Teams, and Scrum Masters in Lean-Agile practices and mindsets. • Escalate and track impediments, help identify and address critical bottlenecks. • Encourage collaboration between teams, Engineering, and Enterprise Architects. • Help ensure strategy and execution alignment (Product Management and Stakeholders). • Assess practices with DevOps, etc. and help improve Continuous Delivery Pipeline. • Conduct Inspect and Adapt workshops, facilitate System Demos, assess the agility level of the ART and help them improve. • Ability to take on additional responsibilities such as Scrum Master, Community of Practice, etc. Knowledge, Skills, and Abilities: • PMP and Scrum Master Certification is required. • SAFe SPC or RTE Certification is required. • 5 years of RTE experience is required. • 3 years of RTE experience managing Power Platform teams is required. • An understanding of creating and maintaining Program Increment Backlogs. • Ability to lead and direct the software development teams through program increment and program iteration planning. • Experience with agile software development for complex Information Technology systems. • Strong interpersonal skills including mentoring, coaching, collaborating, and team building. • Strong analytical, organizational and decision-making skills. • Strong verbal/written communication skills with the ability to simplify and communicate complex issues to multiple audiences. • Ability to work with customers, understand their business practices and manage their expectations. • Expertise with Project Management tools such as Microsoft Project, Visio, and MS Office. • Experience with Agile collaboration tools such as Team Foundation Server, JIRA, Version One, etc.",
        "source": "Email",
        "date_posted": "2024-10-24 10:29:00-05:00",
        "unique_id": "192bf672fbc86b38",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Scrum Master"
    }
]