[
    {
        "company": "Mars information",
        "job_title": "Oracle Project Manager",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "experience_required": "5+ years",
            "degree_required": "Bachelor's degree in Computer Science, Information Technology, Business Administration, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle ERP modules",
                "cutover processes",
                "project management"
            ],
            "primary": [
                "data migration tools",
                "PMP",
                "Agile",
                "Prince2"
            ],
            "secondary": [
                "organizational skills",
                "time-management skills",
                "communication skills",
                "interpersonal skills",
                "problem-solving skills"
            ],
            "all": [
                "Oracle ERP modules",
                "cutover processes",
                "project management",
                "data migration tools",
                "PMP",
                "Agile",
                "Prince2",
                "organizational skills",
                "time-management skills",
                "communication skills",
                "interpersonal skills",
                "problem-solving skills"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Priti Dubey",
        "email": "priti.dubey@tekinspirations.com",
        "jd": "From: Priti, Tek Inspirations LLC priti.dubey@tekinspirations.com Reply to: priti.dubey@tekinspirations.com Location- RemoteRole- Oracle Project Manager - Cutover Activitiesvisa: USC, (GC, H4EAD, GC-EAD, H1B THIS WE NEED PP NUMBER AT TIME OF SUBMISSION )Mandate- In-depth knowledge of Oracle ERP modules (Finance, Supply Chain, HR, etc.) and cutover processesClient: Mars informationKey Responsibilities: Cutover planning: Develop and manage the detailed cutover plan, outlining activities, resources, and timelines required for the transition from legacy systems to Oracle ERP. Stakeholder coordination: Collaborate with cross-functional teams, including IT, business units, and external vendors, to ensure alignment on cutover activities and readiness. Oversee post-cutover stabilization activities, ensuring any issues are addressed quickly and that end-users have the support they need. Documentation: Create and maintain comprehensive documentation for all cutover activities, including step-by-step procedures, roles and responsibilities, and lessons learned. Continuous improvement: After cutover, conduct a post-mortem review and implement best practices for future deployments or upgrades. Required Qualifications: Education: Bachelor s degree in Computer Science, Information Technology, Business Administration, or a related field. Experience: o 5+ years of project management experience, including at least 3 years with Oracle ERP implementations. o Proven experience managing cutover activities for large-scale Oracle ERP projects. Technical Skills: o In-depth knowledge of Oracle ERP modules (Finance, Supply Chain, HR, etc.) and cutover processes. o Familiarity with data migration tools, techniques, and best practices. o Strong understanding of project management methodologies, such as PMP, Agile, or Prince2. Soft Skills: o Excellent organizational and time-management skills, with a keen attention to detail. o Strong communication and interpersonal skills, with the ability to manage multiple stakeholders effectively. o Problem-solving skills, with the ability to make quick decisions under pressure. (1.) To leverage design expertise to ensure that software and products exhibit user-friendliness, intuitiveness, and alignment with user expectations, contributing to the creation of seamless user experiences. (2.) To lead a team of designers, provide guidance, and ensuring the delivery of high-quality design solutions in alignment with the overall business goals. (3.) To present design concepts and play a crucial role in shaping the overall design vision and strategy. (4.) To stay abreast of industry trends, emerging technologies to drive innovation and excellence in design Regards,Priti DubeySenior Technical Recruiter Desk: 469-639-0969| Email: priti.dubey@tekinspirations.com TEK Inspirations LLC | 13573 Tabasco Cat Trail, Frisco, TX 75035Disclaimer: This communication, along with any documents, files or attachments, is intended only for the use of the addressee and may contain confidential information. If you are not the intended recipient, you are hereby notified that any dissemination, distribution or copying of any information contained in or attached to this communication is strictly prohibited, To remove your email address permanently from future mailings, please send REMOVE to remove@tekinspirations.com",
        "source": "Email",
        "date_posted": "2024-10-24 09:41:26-05:00",
        "unique_id": "192bf1e947b685ab",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]