[
    {
        "company": "Incom Technologies Inc",
        "job_title": "Process Engineer",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "BS degree in CS, Computer Engineering, Mathematics, Statistics, or a related technical engineering field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$70/hr on c2c"
        },
        "skills": {
            "core": [
                "process documentation",
                "business analytics",
                "agile software development"
            ],
            "primary": [
                "process design",
                "process improvements",
                "client facing work",
                "technical project management"
            ],
            "secondary": [
                "consulting",
                "engineering"
            ],
            "all": [
                "process documentation",
                "business analytics",
                "agile software development",
                "process design",
                "process improvements",
                "client facing work",
                "technical project management",
                "consulting",
                "engineering"
            ],
            "with_experience": [
                "process documentation",
                "business analytics"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "komal",
        "email": "komal@incom-tech.net",
        "jd": "From: komal, Incom Technologies Inc komal@incom-tech.net Reply to: komal@incom-tech.net Hi Role: Process EngineerClient :CMSLocation : RemoteRate :$70/hr on c2c NOTE : CANDIDATES SHOULD BE LOCAL TO District of columbia , Maryland and virginia RECENT MARKETPLACE EXPERIENCE IS MANDATORYDuties/Responsibilities:Define and decompose work flows using a defined operating model to assess and prioritize project work activities. Support MSI teams to consult, recommend and advise on process, methodologies, and technology. Support architectural teams’ solutions, engaging and contributing to solutions and architecture development, POCs (Point of Contact) to ensure use cases, contingencies and risks are considered, discussed and either resolved or accepted. Education:BS degree in CS, Computer Engineering, Mathematics, Statistics, or a related technical engineering fieldGeneral Experience:Able to work with the existing team to understand landscape of MSIAble to create basic flow of work from conversations/interviews/shadowing othersAble to go from flow to diagramAble to add to diagram steps which add up to a processAble to document the process using a standard technique, SIPOCAble to manage their own work load Able to exercise good judgement in creating draft documents with little helpAble to plan for, conduct and incorporate feedback on docs being created...Required Experience: 5+ years of experience with process documentation, design and improvements 5+ years of experience in business analytics Knowledge of agile software development techniques Client facing work in consulting, engineering, or technical project management.",
        "source": "Email",
        "date_posted": "2024-10-24 09:55:31-05:00",
        "unique_id": "192bf2b1d0020898",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]