[
    {
        "company": "IDC Technologies",
        "job_title": "Data Warehouse Architect",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "15+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "data warehousing",
                "data architecture",
                "data mining",
                "data modeling",
                "data profiling",
                "data mapping",
                "Azure Cloud",
                "Azure Data Factory",
                "Data Bricks",
                "Oracle",
                "DataStage",
                "IBM Integration Bus (IIB)",
                "data management",
                "data governance",
                "IBM Information Governance Catalog (IGC)",
                "Information Knowledge Catalog (IKC)",
                "Collibra",
                "Azure Synapse",
                "Snowflake",
                "ETL processes",
                "data integration strategies",
                "data migration"
            ],
            "primary": [
                "big data technologies",
                "Hadoop",
                "Spark",
                "Kafka",
                "data privacy regulations",
                "GDPR",
                "CCPA",
                "data security",
                "Automation",
                "AI in Data Warehousing"
            ],
            "secondary": [
                "analytical skills",
                "problem-solving skills",
                "communication skills",
                "stakeholder management",
                "cross-functional collaboration"
            ],
            "all": [
                "data warehousing",
                "data architecture",
                "data mining",
                "data modeling",
                "data profiling",
                "data mapping",
                "Azure Cloud",
                "Azure Data Factory",
                "Data Bricks",
                "Oracle",
                "DataStage",
                "IBM Integration Bus (IIB)",
                "data management",
                "data governance",
                "IBM Information Governance Catalog (IGC)",
                "Information Knowledge Catalog (IKC)",
                "Collibra",
                "Azure Synapse",
                "Snowflake",
                "ETL processes",
                "data integration strategies",
                "data migration",
                "big data technologies",
                "Hadoop",
                "Spark",
                "Kafka",
                "data privacy regulations",
                "GDPR",
                "CCPA",
                "data security",
                "Automation",
                "AI in Data Warehousing",
                "analytical skills",
                "problem-solving skills",
                "communication skills",
                "stakeholder management",
                "cross-functional collaboration"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "John Joseph",
        "email": "john.joseph@idctechnologies.com",
        "jd": "From: John Joseph, IDC Technologies.com john.joseph@idctechnologies.com Reply to: john.joseph@idctechnologies.com EXTERNAL EMAIL : This email originated from an external sender. If you do not trust the sender please refrain from clicking URLs EXTERNAL EMAIL : This email originated from an external sender. If you do not trust the sender please refrain from clicking URLs HI, Hope you are doing well. We have an urgent opening for the below role with Contract position for our clients, kindly Check the below job description and let me know your interest. Position – Data Warehouse ArchitectLocation – Richmond VA 23219 - HybridRequired Skills and Qualifications: 15+ years of experience in data warehousing and data architecture.Extensive experience in data mining, large scale data modeling, data profiling, and data mapping.Experience with Azure Cloud, Azure Data Factory, and Data Bricks.Experience with different database platforms and services like SOAP, REST, etc.Strong experience with Oracle, DataStage, and IBM Integration Bus (IIB) for data integration and ETL.Solid experience with data management and governance tools like IBM Information Governance Catalog (IGC), Information Knowledge Catalog (IKC), or Collibra.Expertise with modern cloud data warehouse platforms such as Azure Synapse or Snowflake.Experience in defining and implementing data governance frameworks and ensuring data quality management.Proven experience in designing and implementing scalable data warehouse solutions and strategies.Understanding of ETL processes, data integration strategies, and data migration in both on-premise and cloud environments.Familiarity with data modeling, data lakes, and big data technologies.Strong analytical and problem-solving skills with the ability to balance competing priorities.Experience working in collaboration with Enterprise Architecture teams to create strategic roadmaps for data platforms.Excellent communication and stakeholder management skills, with the ability to work cross-functionally across teams.Preferred Qualifications: Knowledge of big data tools like Hadoop, Spark, and Kafka.Certifications in Oracle, Azure, or Snowflake technologies.Experience with data privacy regulations like GDPR, CCPA, and best practices in data securityExperience with Automation and AI in Data WarehousingPersonal Attributes: Strong written and oral communication skills. Strong presentation and interpersonal skills and Ability to present ideas in user-friendly language. We prefer candidates local to Richmond Area or Ready to move to Richmond. This position is Hybrid In person 2-3 days a week for first 3 months and once a month after that. Skills Matrix - Advanced skills in Data Warehousing, Data Analytics and Data Architecture Required 15 YearsStrong Background in data governance, data quality, data lineage and enterprise master data management Required 15 YearsExperience working with Oracle PL/SQL and SQL Server Database Development. Required 15 YearsWritten and oral communications Required 15 YearsFamiliarity with data modeling, data lakes, and big data technologies. Required 15 YearsExpertise with modern cloud data warehouse platforms such as Azure Synapse or Snowflake. Required 12 YearsStrong Experience with other data integration tools and techniques including IBM DataStage, IBM IKC or Collibra Required 12 YearsExperience to use Snowflake Highly desired 10 YearsExperience with Automation and AI in Data Warehousing Highly desired 10 YearsKnowledge of big data tools like Hadoop, Spark, and Kafka. Highly desired 10 Years",
        "source": "Email",
        "date_posted": "2024-10-23 14:18:41-05:00",
        "unique_id": "192baf1ab7c551e8",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Azure Data Engineer"
    }
]