[
    {
        "company": "TEK Inspirations LLC",
        "job_title": "Oracle PL/SQL DBA Developer",
        "location": "Albany, NY, USA",
        "full_location": {
            "city": "Albany",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "7 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "2-3 years",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle PL/SQL",
                "SQL Plus",
                "SQL Developer",
                "SQL Loader",
                "ETL"
            ],
            "primary": [
                "Database Design",
                "Performance Tuning",
                "Debugging",
                "Data Modelling"
            ],
            "secondary": [
                "Database Support",
                "Coding Utilities",
                "User Documentation"
            ],
            "all": [
                "Oracle PL/SQL",
                "SQL Plus",
                "SQL Developer",
                "SQL Loader",
                "ETL",
                "Database Design",
                "Performance Tuning",
                "Debugging",
                "Data Modelling",
                "Database Support",
                "Coding Utilities",
                "User Documentation"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Vinita Singh",
        "email": "vinita.singh@tekinspirations.com",
        "jd": "Job Description -Job Title: Oracle PL/SQL DBA Developer Duration: 2- 3 years Contract Position Location: Albany, NY (local or within a 30-mile radius/mandatory) Total Experience Required: 7 years Client: NYS Documentation: qualified candidates will need to provide copy of their Visa (H1B allowed) or Green Card and a copy of their non-US passport. Citizens will need to provide a copy of their driver’s license. Requirements: • 84 Months Experience determining database structural requirements by analyzing client operations, applications, and programming; reviews objectives with clients; evaluates current systems; provides database support by coding utilities, responding to user questions, and resolving problems. • 84 Months Experience developing Oracle PL/SQL using advanced PL/SQL programming techniques. • 84 Months Experience using Oracle development tools such as SQL Plus, SQL Developer, and SQL Loader for programming and maintaining applications. • 84 Months Experience designing and implementing logical and physical database models, including indexes, primary keys, foreign keys, and constraints. • 48 months Experience performing Extract, Transform, and Load (ETL) techniques. • 24 months Experience optimizing, performance tuning, and debugging PL/SQL Responsibilities: The Database Architect will be responsible for, but not limited to, the analysis and design of database objects and data collection systems, including the transformation of legislative requirements into system functionality; data modelling; responsible for software development tasks including coding, testing, and implementation; prepares technical and user documentation.",
        "source": "Email",
        "date_posted": "2024-10-24 17:33:37-05:00",
        "unique_id": "192c0ca2b8dc7bc0",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Oracle DBA"
    }
]