[
    {
        "company": "Large Lending Company",
        "job_title": "Senior Java Integration Architect",
        "location": "Lewisville, TX, USA",
        "full_location": {
            "city": "Lewisville",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "Multi-Year",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "RESTful APIs",
                "Kafka",
                "event-driven architecture"
            ],
            "primary": [
                "GCP",
                "technical documentation",
                "mentoring",
                "optimization",
                "automation"
            ],
            "secondary": [
                "Confluent Kafka",
                "Agile",
                "collaboration",
                "knowledge sharing"
            ],
            "all": [
                "Java",
                "RESTful APIs",
                "Kafka",
                "event-driven architecture",
                "GCP",
                "technical documentation",
                "mentoring",
                "optimization",
                "automation",
                "Confluent Kafka",
                "Agile",
                "collaboration",
                "knowledge sharing"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Vikram Singh",
        "email": "vikram.singh@techstargroup.com",
        "jd": "From: Vikram Singh, Tech Star Group vikram.singh@techstargroup.com Reply to: vikram.singh@techstargroup.com Good Morning, Partners.Please find below 10 urgent requirements that need to be covered ASAP. LinkedIn is a must with every submission. Thank You. Very Important Note: Please reply to vikram.singh@techstargroup.com only. Some resumes were rejected as they were submitted without LinkedIn and Visa status. Job 1.Role: Senior Java Integration Architect Client: Large Lending Company Visa: GC, USC, TN, L2, E3, GC EAD and H4 EAD ONLY.Location: Hybrid – Lewisville, TXYou’ll be hands-on as we design and implement RESTful APIs and Kafka consumers and producers using Java and following best practices.Deeply understand event-driven architecture (EDA) principles and best practices, leveraging Confluent Kafka as a core technology.Collaborate with engineering teams to apply new patterns and approaches as we build out our platform.Lead the development of Centers of Excellence (COEs) focused on RESTful APIs and event-driven architecture.Mentor and guide junior developers, fostering a culture of knowledge sharing and continuous learning.Stay current with the latest advancements in Java, RESTful APIs, Confluent Kafka, and related technologies, including GCP-specific integration services.Analyze existing systems and identify opportunities for improvement through optimization and automation.Develop and maintain technical documentation for patterns and solutions.Collaborate with stakeholders across the organization to understand business needs and translate them into technical requirements.",
        "source": "Email",
        "date_posted": "2024-10-23 09:52:05-05:00",
        "unique_id": "192ba5bd00ec7252",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]