[
    {
        "company": "synergent Tech Solutions",
        "job_title": "Technical Business Analyst (Consultant)",
        "location": "NY, NJ, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "12+ Years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Technical Specifications",
                "Risk Rating",
                "Data Integration",
                "UAT Execution"
            ],
            "primary": [
                "Commercial Banking",
                "CRE Risk Domain",
                "C&I Risk Domain",
                "Probability of Default (PD)",
                "Loss Given Default (LGD)",
                "Risk Adjusted Return on Capital (RAROC)",
                "Current Expected Credit Loss (CECL)",
                "Moody’s Credit Lens",
                "Dual Risk Rating Framework"
            ],
            "secondary": [
                "Client Interaction",
                "Stakeholder Engagement",
                "Data Lineage",
                "ETL Specs",
                "System Flow Documentation",
                "Fast-paced Environment"
            ],
            "all": [
                "Business Analysis",
                "Technical Specifications",
                "Risk Rating",
                "Data Integration",
                "UAT Execution",
                "Commercial Banking",
                "CRE Risk Domain",
                "C&I Risk Domain",
                "Probability of Default (PD)",
                "Loss Given Default (LGD)",
                "Risk Adjusted Return on Capital (RAROC)",
                "Current Expected Credit Loss (CECL)",
                "Moody’s Credit Lens",
                "Dual Risk Rating Framework",
                "Client Interaction",
                "Stakeholder Engagement",
                "Data Lineage",
                "ETL Specs",
                "System Flow Documentation",
                "Fast-paced Environment"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Arthi",
        "email": "aarthi@synergent.net",
        "jd": "From: Arthi, synergent Tech Solutions aarthi@synergent.net Reply to: aarthi@synergent.net Technical Business Analyst (Consultant) - RiskExperience: 12+ YearsNY, NJ – Remote - Candidate from EST time zone The Bank is seeking an experienced Business Analyst/Project Manager to join its Technology department. This individual will work as a Technical Business Analyst responsible for UAT execution & Coordination with users and vendor of Risk Rating system. In addition, this position is also responsible for Data/Business Analysis as part of Enhanced Dual Risk Rating Project. He/she will also be expected to conduct support end to end Project SDLC lifecycle. He/She will be working very closely with external implementation partner and internal IT, Risk, Lending, Underwriting Departments. The successful candidate will have a solid business and technical analysis skill gained within financial services in the banking industry. Primary Responsibilities:Working with key Business Stakeholders & internal departments like Risk, Middle Office, Lending, Treasury & IT to conduct requirement analysisDefining & Documenting Current & Target state system flow, interface field mapping, data lineage and ETL specs as per Bank’s SDLC standardsWork with external Vendor & Internal IT team on Design, Build & TestingWork with UAT Coordinator on UAT Test cases & UAT executionWorking internal SMEs in analyzing the data integration between multiple source systems and work with IDB IT team in developing the end solution Candidate Qualifications:Experience in working as Senior Business Analysts in Commercial Banking with special focus on CRE, C&I risk domainWriting technical specifications to build new file based and real-time interfaces to and from Risk systemsWriting specifications to build reportsDeep understanding of customer, loan, facility data lineage and hierarchiesDeep proficiency with key Banking RISK Concepts like Probability of Default (PD), Loss Given Default (LGD) Risk Adjust Return on Capital (RAROC), Current Expected Credit Loss (CECL)Preferred Experience working with Moody’s Credit Lens platform or similar PlatformKnowledge/Exposure to Dual Risk Rating Framework is a plusSolid Knowledge of Commercial Banking Risk area related to Customer Ratings & Loan Ratings Solid knowledge of key System & business processes in Deposit, Loans areaAble to work in a fast-paced environment with a diverse group of people, engaging stakeholders to capture and prioritize business needExcellent client interaction skillsEffectively promote best practices process",
        "source": "Email",
        "date_posted": "2024-10-23 12:46:37-05:00",
        "unique_id": "192ba9d19638ee9c",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]