[
    {
        "company": "Paramount Software Solutions Inc",
        "job_title": "Data Architect",
        "location": "Tallahassee, FL, USA",
        "full_location": {
            "city": "Tallahassee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "4+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Synapse Analytics",
                "Dedicated SQL Pools",
                "Azure SQL Database",
                "Azure Managed Instance",
                "DDL",
                "DML",
                "T-SQL",
                "data architecture design principles",
                "data governance principles",
                "cloud computing concepts"
            ],
            "primary": [
                "ETL processes",
                "data integration",
                "data security",
                "data privacy",
                "Python",
                "Scala",
                "Salesforce",
                "Message MQ",
                "MuleSoft"
            ],
            "secondary": [
                "analytical skills",
                "problem-solving skills",
                "customer support",
                "quality of work"
            ],
            "all": [
                "Synapse Analytics",
                "Dedicated SQL Pools",
                "Azure SQL Database",
                "Azure Managed Instance",
                "DDL",
                "DML",
                "T-SQL",
                "data architecture design principles",
                "data governance principles",
                "cloud computing concepts",
                "ETL processes",
                "data integration",
                "data security",
                "data privacy",
                "Python",
                "Scala",
                "Salesforce",
                "Message MQ",
                "MuleSoft",
                "analytical skills",
                "problem-solving skills",
                "customer support",
                "quality of work"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Malkuri Ramarao",
        "email": "ramarao@paramountsoft.net",
        "jd": "From: Malkuri Ramarao, Paramount software solutions inc ramarao@paramountsoft.net Reply to: ramarao@paramountsoft.net Hi, This is Ramarao Malkuri and I am working with Paramount Solutions, I would like to check your current availability in the job market. We are hiring for Data Architect, if you’re keeping your options open, please give me a call or respond to my email with your update resume ramarao@paramountsoft.net Job Title: Data Architect Location: Tallahassee, FL/Onsite Duration: Long Term Contract Job description Data Architect (C. Advanced)) positions. The activities these candidates will be tasked with include, but are not limited to the following: Work with stakeholders and development team to determine project scope and vision, gather and prioritize collected requirements. Designing and Implementing Data Architectures: Develop comprehensive data architectures that support the organization’s business goals, using Azure Synapse Analytics, Azure SQL, and other Azure data services. Managing Dedicated SQL Pools: Efficiently manage and optimize Dedicated SQL Pools in Synapse to handle large-scale data warehousing and analytics workloads. Database Design and Management: Design, implement, and manage databases using AzureSQL and Azure Managed Instance, ensuring high performance, availability, and security. Data Integration and ETL Processes: Develop and manage ETL (Extract, Transform, Load) processes using Synapse Pipelines, ensuring efficient data flow from various sources to the data warehouse. Data Governance and Cataloguing: Implement data governance practices and manage the data catalog to ensure data quality, consistency, and accessibility. Building and Maintaining Data Models: Create and maintain data models that accurately represent the data landscape, ensuring they are scalable and optimized for performance. Ensuring Data Security and Compliance: Implement and oversee data security measures, ensuring compliance with legal and regulatory standards. Maintain procedures manuals and system documentation. Research software solutions to support recommendations, analyzing current and future technology trends. These positions are to provide technical guidance and expertise in supporting the department in developing, architecting, and maintaining data, data mappings, and monitoring high-volume complex data transfer processes. 2.2 Specific Knowledge, Skills, and Abilities (KSAs) The submitted candidate must be able to apply common knowledge, skills, and abilities in the following areas: Minimum Required KSAs: 4+ years of experience in Synapse Analytics, Dedicated SQL Pools, Azure SQL Database, and Azure Managed Instance. 5+ years of experience in DDL, DML T-SQL skills, advanced stored procedure writing skills, tables, primary keys, foreign keys, constraints, indexes, transactions, process logging, and error handling. 4+ years of experience in data architecture design principles, methodologies, and best practices. 3+ years of experience in data governance principles and compliance requirements related to data security and privacy. 3+ years of experience in integrating data from various sources and managing large data pipelines. 2+ years of experience in cloud computing concepts, particularly in Microsoft Azure, including storage solutions and compute capabilities. 1+ years of Experience with programming languages such as Python or Scala. 1+ years of experience in Salesforce, Message MQ, and MuleSoft Strong analytical and problem-solving skills to address complex data challenges. Ability to design and implement robust, scalable, and efficient data architectures. Ability to provide excellent customer support; meticulous quality of work and work product.",
        "source": "Email",
        "date_posted": "2024-10-23 17:14:23-05:00",
        "unique_id": "192bb923e112ae1d",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Azure Data Engineer"
    }
]