[
    {
        "company": "GSK SOLUTIONS INC",
        "job_title": "Data Warehouse Architect",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "8 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "IBM DataStage",
                "Collibra",
                "AI",
                "Hadoop",
                "Spark",
                "Kafka",
                "data governance",
                "MDM",
                "Oracle PL/SQL",
                "modeling",
                "data lakes",
                "big data"
            ],
            "primary": [
                "business analysis",
                "Agile Business Analyst",
                "Scrum",
                "Product and Sprint backlogs",
                "user stories",
                "acceptance criteria",
                "communication skills"
            ],
            "secondary": [
                "enterprise data management",
                "process flows",
                "context diagrams",
                "data flow diagrams",
                "test plans",
                "User Acceptance Testing (UAT)",
                "Microsoft Office",
                "Application Lifecycle Management (ALM)",
                "Certified Business Analysis Professional (CBAP)",
                "PMI – Professional in Business Analysis (PMI-PBA)",
                "PMI – Agile Certified Practitioner (PMI-ACP)",
                "Azure DevOps",
                "Jira",
                "automated testing tools"
            ],
            "all": [
                "IBM DataStage",
                "Collibra",
                "AI",
                "Hadoop",
                "Spark",
                "Kafka",
                "data governance",
                "MDM",
                "Oracle PL/SQL",
                "modeling",
                "data lakes",
                "big data",
                "business analysis",
                "Agile Business Analyst",
                "Scrum",
                "Product and Sprint backlogs",
                "user stories",
                "acceptance criteria",
                "communication skills",
                "enterprise data management",
                "process flows",
                "context diagrams",
                "data flow diagrams",
                "test plans",
                "User Acceptance Testing (UAT)",
                "Microsoft Office",
                "Application Lifecycle Management (ALM)",
                "Certified Business Analysis Professional (CBAP)",
                "PMI – Professional in Business Analysis (PMI-PBA)",
                "PMI – Agile Certified Practitioner (PMI-ACP)",
                "Azure DevOps",
                "Jira",
                "automated testing tools"
            ],
            "with_experience": [
                "IBM DataStage (8+ years)",
                "Collibra (8+ years)",
                "Agile Business Analyst (5+ years)",
                "Scrum (5+ years)",
                "business analysis (8+ years)"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Lokesh",
        "email": "lokesh@gsksolutions.com",
        "jd": "The Virginia Department of Transportation (VDOT) is seeking a highly experienced Business (Data) Analyst to join our dynamic Business Analytics and Testing Support team. In this role, you will be crucial in supporting the implementation of Enterprise Data Management tools. Your responsibilities will include documenting use cases, validating success criteria through testing, and supporting end users with tools such as Collibra, Informatica, IBM Knowledge Catalog, Snowflake, SafeFME, and ArcGIS Enterprise.\n\nVDOT is a fast-paced organization that upholds the highest standards for work quality and efficiency. We are committed to continuous improvement, and every team member is expected to contribute proactively to our success. If you are a problem-solver with a passion for data governance and a drive to make a significant impact, we would love to have you on our team.\n\nKey Responsibilities:\nPartner with project team members and business stakeholders to deeply understand business processes, identify pain points, and develop expertise in the customers’ business applications.\nConduct thorough root cause analysis to uncover system gaps and deficiencies, proposing effective business, technical, or blended solutions.\nDevelop process flows, context diagrams, and data flow diagrams to document current processes and propose modifications.\nDiscover and meticulously document requirements and user stories with a focus on improving both business and technical processes.\nDecompose requirements into Epics and Features, creating clear and actionable user stories that can be easily understood and implemented by technical teams. Use progressive elaboration to map stories to technical design specifications.\nSupport the Product Owner in maintaining the product backlog, grouping related user stories into Themes, and documenting dependencies.\nCreate conceptual prototypes and mock-ups to visualize proposed solutions and enhance stakeholder understanding.\nPropose cost-effective solutions, rigorously testing their feasibility for both business and technical compatibility.\nDefine test objectives, create test plans and cases, execute tests (including regression testing), and facilitate User Acceptance Testing (UAT) with the business. Keep Project Managers and Scrum Masters informed of the progress of testing activities.\n\nQualifications:\nRequired:\nAdvanced understanding of enterprise data management concepts and tools.\nMinimum of 10 years of experience delivering business and systems analysis artifacts.\n5+ years of experience as an Agile Business Analyst with a strong understanding of Scrum concepts and methodology.\nProven experience in organizing and maintaining Product and Sprint backlogs.\nProficiency in translating client and product strategy requirements into application requirements and user stories.\nExpertise in defining acceptance criteria and managing the acceptance process with development teams.\nExperience with large, multi-module enterprise systems.\nProficiency with Microsoft Office products (Word, Excel, Access, Outlook, Visio, PowerPoint, Project Server).\nExperience with Application Lifecycle Management (ALM).\nExceptional written and oral communication skills, with a proven ability to work well with a diverse set of peers and customers.\n\nPreferred:\nCertified Business Analysis Professional (CBAP)\nPMI – Professional in Business Analysis (PMI-PBA)\nPMI – Agile Certified Practitioner (PMI-ACP)\nExperience using Azure DevOps or Jira for agile software development and work item tracking.\nExperience with automated testing tools such as TestComplete, Cucumber, or Selenium.",
        "source": "Email",
        "date_posted": "2024-10-24 11:22:32-05:00",
        "unique_id": "192bf799170b6d1d",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]