[
    {
        "company": "Vyze Inc",
        "job_title": "Senior Full-Stack Software Developer",
        "location": "Warren, MI, USA",
        "full_location": {
            "city": "Warren",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Minimum 7 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Spring Boot",
                "Angular",
                "SQL"
            ],
            "primary": [
                "Postgres",
                "Microservices",
                "RESTful APIs",
                "Cloud platforms",
                "Kubernetes",
                "Docker",
                "HPC platforms",
                "Agile"
            ],
            "secondary": [
                "UI Design",
                "Multi-threaded development",
                "Software development best practices",
                "Electrical wiring harness",
                "Vehicle diagnostics",
                "Build/release automation",
                "Unit testing",
                "Code quality scanning",
                "Security scanning",
                "Dependency management"
            ],
            "all": [
                "Java",
                "Spring Boot",
                "Angular",
                "SQL",
                "Postgres",
                "Microservices",
                "RESTful APIs",
                "Cloud platforms",
                "Kubernetes",
                "Docker",
                "HPC platforms",
                "Agile",
                "UI Design",
                "Multi-threaded development",
                "Software development best practices",
                "Electrical wiring harness",
                "Vehicle diagnostics",
                "Build/release automation",
                "Unit testing",
                "Code quality scanning",
                "Security scanning",
                "Dependency management"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Anupam Singh",
        "email": "anupam.singh@vyzeinc.com",
        "jd": "From: anupam singh, vyzeinc anupam.singh@vyzeinc.com Reply to: anupam.singh@vyzeinc.com Job Description -Senior Full-Stack Software Developer Hybrid — MUST CURRENTLY LIVE in WARREN, MI The Senior Full-Stack Software Developer (Java/Spring Boot) will design, develop, and maintain high-performance, scalable applications. This role involves working across the entire tech stack, focusing on back-end services using Java, Spring Boot and Postgres, while also contributing to front-end development using Angular framework. Responsibilities include collaborating with cross-functional teams to deliver robust solutions, driving the architecture and design of new features, optimizing performance, and ensuring code quality through best practices like testing and code reviews. The ideal candidate has extensive experience with full-stack development, microservices, RESTful APIs, and database technologies.This role entails the following and will work with GM’s Customer Care and Aftersales (CCA) and Manufacturing IT teams to help accelerate the development of one of home-grown product to expand for dealerships. Minimum Experience Minimum 7 years of professional software development experience Excellent technical (hands-on) knowledge of Java, Angular, SQLProficient in multi-threaded development Experience with Spring BootExperience with cloud platforms, Kubernetes, Docker and HPC platformsGood understanding of software development best practices Experience working in an agile environment Extensive UI Design experience Comfortable dealing with ambiguity We are looking for a Senior Full-Stack Software Developer who: Has a steadfast drive for excellence Challenges themselves with innovative spirit Enjoys working collaboratively in a cross-functional teams Demonstrates a strong work ethic Excels in software engineeringUnderstanding of electrical wiring harness, general electrical concepts and vehicle diagnostics is a plusHas a strong attention to detailDeveloping scalable software solutions based on detailed business requirements and supported technology architecture.Actively engage in development activities associated with developing new solutions and refining current solutions.Demonstrate success in software project delivery, experience driving technical efforts, and experience with a variety of development tools and technologies.Possess technical depth and applied experience in multi-layer solution development, performance tuning, solution debug, incident triage/remediation, and usability improvement.Ability to demonstrate adaptive experience gaining technical situational depth quickly, quantifying impact assessment, triage & root causing activities, defining remediation options, and expressing declarative technical recommendations.Engage to identify and remediate software opportunities related to code quality, security, framework development, and software usability refinement.Proficiency in build/release automation solutions.Demonstrated experience augmenting build/release automation solutions to include unit testing, code quality scanning, security scanning, and dependency management.Demonstrate strong written and verbal communication skills.Demonstrate experience and proficiency in the following technology platforms/patterns:Java, Azure TFS Build/Release Automation, UI Framework Development, API Framework Development, Data Layer Development, Unit Testing, UI Experience with Angular. Solutions Architecture (design, proposal, develop, deliver, sustain), Secured Development Patterns, and Practices Kubernetes/Dock Mobile Development Network (Firewall, Proxy, Gateway). Regards, Anupam singh IT Recruiter Email: Anupam.singhvyzeinc.com",
        "source": "Email",
        "date_posted": "2024-10-24 18:26:54-05:00",
        "unique_id": "192c0faf30d2d4bb",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]