[
    {
        "company": "Los Angeles Unified School District (LAUSD)",
        "job_title": "Business Analyst for Information Systems",
        "location": "Los Angeles, CA, USA",
        "full_location": {
            "city": "Los Angeles",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "4 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Through June 30, 2025 (Initial Period)",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "critical thinking",
                "analytical reasoning",
                "problem-solving",
                "ETL process",
                "SQL",
                "data validation",
                "network understanding",
                "database knowledge",
                "Snowflake",
                "Power BI"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "critical thinking",
                "analytical reasoning",
                "problem-solving",
                "ETL process",
                "SQL",
                "data validation",
                "network understanding",
                "database knowledge",
                "Snowflake",
                "Power BI"
            ],
            "with_experience": [
                "critical thinking",
                "analytical reasoning",
                "problem-solving",
                "ETL process",
                "SQL",
                "data validation",
                "network understanding",
                "database knowledge",
                "Snowflake",
                "Power BI"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Kiran Bhatt",
        "email": "kiran.bhatt@largeton.us",
        "jd": "From: Kiran Bhatt, Largeton INC. kiran.bhatt@largeton.us Reply to: kiran.bhatt@largeton.us Job Title: Business Analyst for Information SystemsClient: Los Angeles Unified School District (LAUSD) Department: Information Technology Services.Location: LAUSD -. Beaudry Avenue, Los Angeles, CA 90017-OnsiteDuration: Through June 30, 2025 (Initial Period)Linkedin - YesNo H1B,CPT,OPTRFP ID: 202524 Additional Information: Experience and Qualifications: Provide a minimum of three (3) candidate references closely related to services as listed in the statement of work.Need prior Govt education domain(Mandate) Project Scope: The Los Angeles Unified School District (LAUSD) seeks qualified proposers to provide Business Analyst on behalf of the Information Technology Services. LAUSD intends to use the results of this solicitation process to award a contract to the responsive/responsible proposer. Roles/Responsibilities: Ensure effective communication through verbal and written means with all stakeholders, including business customers, vendors, and internal resources. This is essential for facilitating team communication and achieving our mission. Utilize strong critical thinking, analytical reasoning, and problem-solving skills to gather, analyze, define, and document requirements. Communicate these requirements to both technical and non-technical audiences. Translate information from elicitation sessions into business and functional requirements, use cases, user stories, and software requirements specifications documents. Use standard templates and simple, unambiguous, and concise natural language. Demonstrate a solid understanding of the ETL process (Extract, Transform, and Load) and proficiency in writing SQL to analyze and decompose problem statements into clearly defined requirements. Thoroughly validate data and test applications for business requirements, functionality, and usability with strong attention to detail. Possess a strong understanding of networks, databases, and other technologies such as Snowflake and Power BI dashboards. Responsible for carrying out complex analysis of datasets and conducting appropriate data validation across multiple data sources. Present analytic results to business and functional leaders using visualizations to effectively communicate data and metrics. Assist with user acceptance testing and demonstrate active listening skills. Ability to work on multiple projects in parallel and collaborate constructively as part of a team or teams to analyze system characteristics. Contribute to project coordination by assisting in project planning, scheduling, and monitoring activities. Track project milestones, deliverables, and dependencies to ensure timely completion and adherence to project scope. Mandatory Skills: Proposer’s Resource must have at least four (4) years of experience in providing services as listed in the Statement of Work (SOW).4 years of experience utilizing strong critical thinking, analytical reasoning, and problem-solving skills to gather, analyze, define, and document requirements. Communicate these requirements to both technical and non-technical audiences. 4 years of experience translating information from elicitation sessions into business and functional requirements, use cases, user stories, and software requirements specifications documents. Use standard templates and simple, unambiguous, and concise natural language. 4 years of experience demonstrating a solid understanding of the ETL process (Extract, Transform, and Load) and proficiency in writing SQL to analyze and decompose problem statements into clearly defined requirements. 4 years of experience validating data and test applications for business requirements, functionality, and usability with strong attention to detail. 4 years of experience understanding of networks, databases, and other technologies such as Snowflake and Power BI dashboards. Responsible for carrying out complex analysis of datasets and conducting appropriate data validation across multiple data sources. 4 years of experience presenting analytic results to business and functional leaders using visualizations to effectively communicate data and metrics. 4 years of experience assisting with user acceptance testing and demonstrate active listening skills. 4 years of experience working on multiple projects in parallel and collaborate constructively as part of a team or teams to analyze system characteristics. 4 years of experience contributing to project coordination by assisting in project planning, scheduling, and monitoring activities. 4 years of experience tracking project milestones, deliverables, and dependencies to ensure timely completion and adherence to project scope.Ensure effective communication through verbal and written means with all stakeholders, including business customers, vendors, and internal resources. This is essential for facilitating team communication and achieving our mission. Desirable Skills: N/A Other Requirements: At least Three (3) client references from the past ten (10) years with the following details. The references must be from three (3) different clients. Name of Company/Agency Contact Name Contact Title Contact Phone # Contact Email Thanks & RegardsKiran Bhatt|Technical RecruiterEmail:kiran.bhatt@largeton.us | LARGETON INC | 13800 Coppermine Rd, Herndon, VA 20171",
        "source": "Email",
        "date_posted": "2024-10-23 16:55:02-05:00",
        "unique_id": "192bbd1f7d79ddbe",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]