[
    {
        "company": "iTech US, Inc",
        "job_title": "Google Cloud Platform(GCP) with .Net Technical Lead",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "14 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "GCP",
                "Google Cloud Platform",
                ".Net",
                "Google Cloud Spanner"
            ],
            "primary": [
                "Retail Order Management"
            ],
            "secondary": [],
            "all": [
                "GCP",
                "Google Cloud Platform",
                ".Net",
                "Google Cloud Spanner",
                "Retail Order Management"
            ],
            "with_experience": [
                "GCP",
                "Google Cloud Platform",
                ".Net",
                "Google Cloud Spanner"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Hari V",
        "email": "hari.v@itechus.net",
        "jd": "From: Hari V, iTech US hari.v@itechus.net Reply to: hari.v@itechus.net Title: Google Cloud Platform(GCP) with .Net Technical LeadLocation: Remote (PST)Must Have's:• 14 yrs experience of these core skills: GCP • Google Cloud Platform and .Net• Retail Order Mgmt 2 -3 yrs experience• Google Cloud Spanner (database)Responsibilities : • Lead the planning and execution of multiple projects, ensuring alignment with company goals and objectives. • Oversee the development and implementation of solutions using Google Cloud Spanner, GCP, and .Net Core technologies. • Provide technical guidance and support to the project team to ensure high quality deliverables. • Coordinate with cross functional teams to ensure seamless integration and delivery of project components. • Monitor project progress, identify risks, and implement mitigation strategies to ensure timely completion. • Develop and maintain project documentation, including project plans, status reports, and risk management plans. • Facilitate communication between stakeholders to ensure clear understanding of project requirements and expectations. • Conduct regular project reviews and provide updates to senior management on project status and performance. • Ensure compliance with company policies, procedures, and standards throughout the project lifecycle. • Foster a collaborative and inclusive team environment to drive innovation and continuous improvement. • Utilize data driven insights to make informed decisions and optimize project outcomes. • Manage project budgets, ensuring efficient allocation of resources and adherence to financial constraints. • Drive the adoption of best practices and emerging technologies to enhance project delivery and performance. Qualifications: • Possess a deep understanding of Google Cloud Spanner, GCP, and .Net Core technologies. • Demonstrate strong project management skills with a proven track record of successful project delivery. • Exhibit excellent communication and interpersonal skills to effectively collaborate with diverse teams. • Show proficiency in risk management and problem-solving techniques. • Have experience in developing and maintaining comprehensive project documentation.",
        "source": "Email",
        "date_posted": "2024-10-24 12:58:00-05:00",
        "unique_id": "192bfcdd862f36cc",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]