[
    {
        "company": "SANROSE Information Services, Inc",
        "job_title": "Data Architect",
        "location": "Tallahassee, FL, USA",
        "full_location": {
            "city": "Tallahassee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "onsite",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Synapse Analytics",
                "Dedicated SQL Pools",
                "Azure SQL Database",
                "Azure Managed Instance",
                "DDL",
                "DML T-SQL",
                "data architecture design principles",
                "data governance principles",
                "cloud computing concepts",
                "Microsoft Azure",
                "Python",
                "Scala"
            ],
            "primary": [
                "advanced stored procedure writing",
                "data integration",
                "large data pipelines",
                "Salesforce",
                "Message MQ",
                "MuleSoft"
            ],
            "secondary": [
                "analytical skills",
                "problem-solving skills",
                "customer support",
                "communication",
                "decision making",
                "flexibility",
                "interpersonal skills",
                "leadership",
                "constructive criticism"
            ],
            "all": [
                "Synapse Analytics",
                "Dedicated SQL Pools",
                "Azure SQL Database",
                "Azure Managed Instance",
                "DDL",
                "DML T-SQL",
                "data architecture design principles",
                "data governance principles",
                "cloud computing concepts",
                "Microsoft Azure",
                "Python",
                "Scala",
                "advanced stored procedure writing",
                "data integration",
                "large data pipelines",
                "Salesforce",
                "Message MQ",
                "MuleSoft",
                "analytical skills",
                "problem-solving skills",
                "customer support",
                "communication",
                "decision making",
                "flexibility",
                "interpersonal skills",
                "leadership",
                "constructive criticism"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Diwakar",
        "email": "recruiter1@sanrose.com",
        "jd": "From: Diwakar, SANROSE Information Services, Inc recruiter1@sanrose.com Reply to: recruiter1@sanrose.com Role: Data ArchitectOn-site at Tallahassee FLNo OPT, CPT, H1 TransferNeed PP Number for Submission Experience in Synapse Analytics, Dedicated SQL Pools, Azure SQL Database, and Azure Managed Instance.Experience in DDL, DML T-SQL skills, advanced stored procedure writing skills, tables, primary keys, foreign keys, constraints, indexes, transactions, process logging, and error handling.Experience in data architecture design principles, methodologies, and best practices.Experience in data governance principles and compliance requirements related to data security and privacy.Experience in integrating data from various sources and managing large data pipelines.Experience in cloud computing concepts, particularly in Microsoft Azure, including storage solutions and compute capabilities.Experience with programming languages such as Python or Scala.Experience in Salesforce, Message MQ, and MuleSoftStrong analytical and problem-solving skills to address complex data challenges.Ability to design and implement robust, scalable, and efficient data architectures.Ability to provide excellent customer support; meticulous quality of work and work product.Communication: Able to clearly convey information, in both written and verbal formats, to individuals or groups in a wide variety of settings (i.e.; project team meetings, management presentations, etc.). Must have the ability to effectively listen and process information provided by others.Customer Service: Works well with clients and customers (i.e.; business office, public, or other agencies). Able to assess the needs of the customer, provide information or assistance to satisfy expectations or resolve a problem.Decision Making: Makes sound, well-informed, and objective decisions.Flexibility: Is open to change, new processes (or process improvement), and new information. Has the ability to adapt in response to new information, changing conditions, or unexpected obstacles. Ability to receive and give constructive criticism and maintain effective work relationships with others.Interpersonal: Shows friendliness, courtesy, understanding, and politeness to others.Leadership: Motivates, encourages, and challenges others. Can adapt leadership styles in a variety of situations.Problem-Solving: Able to identify, evaluate, and use sound judgment to generate and evaluate alternative actions, and make recommendations as accordingly.Encourages, inspires, and guides others toward accomplishing the common goal.",
        "source": "Email",
        "date_posted": "2024-10-23 14:00:36-05:00",
        "unique_id": "192bbcd9b0a57132",
        "emp_type": [
            "onsite",
            "third party"
        ],
        "tag": "Azure Data Engineer"
    }
]