[
    {
        "company": "Kroger",
        "job_title": "Program Manager Level 3",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Data Mapping",
                "Finance and Accounting",
                "Organizational Change Management",
                "Supply Chain Management",
                "Cross-Functional Communication"
            ],
            "primary": [
                "Legal and Political Program Delivery",
                "Merger Experience",
                "PowerBI Reporting",
                "Data Integration",
                "Algorithm Development"
            ],
            "secondary": [
                "Leadership Capabilities",
                "Problem Solving",
                "Stakeholder Engagement",
                "Technology Delivery",
                "Operational Change Management"
            ],
            "all": [
                "Data Mapping",
                "Finance and Accounting",
                "Organizational Change Management",
                "Supply Chain Management",
                "Cross-Functional Communication",
                "Legal and Political Program Delivery",
                "Merger Experience",
                "PowerBI Reporting",
                "Data Integration",
                "Algorithm Development",
                "Leadership Capabilities",
                "Problem Solving",
                "Stakeholder Engagement",
                "Technology Delivery",
                "Operational Change Management"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Riya Kori",
        "email": "rkori@greattechglobal.com",
        "jd": "Hi,Currently, I am recruiting candidates for one of my requirement as mentioned below. If you have a matching profile,please send me the updated resume along with contact details at the earliest. Job Program Manager Level 3Project Location RemoteDuration 6+ Months Summary : What You’ll Do Kroger is seeking a highly skilled level 3 Program Manager with expertise in data mapping, organizational change management, and navigating complex political and legal landscapes to support the integration of technology and operational infrastructure following the merger of Kroger and Albertsons. This role will be critical in delivering new data mapping technology, systems, and reporting solutions to support the rebannering of newly acquired stores and ensuring that both operational and technological changes align across multiple functions. The ideal candidate will possess strong leadership capabilities, technical acumen, and a proven track record in managing cross-functional teams to drive large-scale transformations in complex environments. This individual will support Product Managers, Designers, Engineers, and other stakeholders across multiple Merchandising Domains to successfully implement and integrate these solutions, ensuring smooth transitions and successful outcomes. Program Management & Delivery:Collaborate with Product Managers, Designers, Engineers, and other cross-functional teams to deliver new data mapping technology and support the rebannering of stores following the merger.Oversee the delivery of infrastructure, data mapping/algorithm code, and new system consumer-facing outputs for the newly merged company.Coordinate with other Merchandising Pillar Program Managers (PgMs) and IMO Leaders to ensure weekly and executive status reports are accurate, timely, and audience appropriate.Manage complex program dependencies across multiple Kroger and Albertsons Tech Pillars, ensuring all deliverables are met on time and within scope. Stakeholder & Cross-Functional Collaboration:Work closely with stakeholders across Supply Chain, Finance, Manufacturing, and other key business functions at both Kroger and Albertsons to ensure successful program execution.Facilitate cross-functional communication to align teams on program goals, timelines, and milestones.Maintain an open dialogue with senior leadership to navigate legal, political, and regulatory ramifications throughout the delivery of the program. Organizational Change Management:Drive organizational change management initiatives, ensuring smooth transitions for impacted teams and individuals across the business.Provide leadership and support to teams adjusting to new systems, processes, and operational changes resulting from the merger.Ensure that any change impacts are carefully planned and communicated, helping to mitigate resistance and foster adoption. Data Integration & Reporting:Lead the data mapping/integration efforts, ensuring data is accurately organized and integrated across platforms and systems.Oversee the development of new reporting solutions in PowerBI, ensuring data insights are easily accessible and actionable for stakeholders. Risk Management & Problem Solving:Identify and mitigate risks associated with legal, political, and operational factors.Ensure compliance with relevant regulations and standards, particularly in areas like finance and supply chain management.Proactively address any program delivery challenges and work with teams to find innovative solutions. What You’ll Need Top skills: Data Mapping, heavy finance and accounting, navigating legal/political program delivery, SMO driven, supply chain management, organizational change management, cross functional communication and merger experience Soft Skills Needed: someone who is not scared to ask questions, leadership capabilitiesProven experience managing large-scale, complex programs in highly political and legally sensitive environments.Extensive experience with data mapping, heavy finance and accounting, supply chain management, and merger integrations.Demonstrated success in delivering technology-driven transformations in the retail or merchandising sectors.Familiarity with system integrations, PowerBI reporting, and operational change management within large organizations.Strong knowledge of data integration, algorithm development, and data mapping techniques.Experience in technology delivery, including consumer-facing systems, infrastructure changes, and reporting solutions.Familiarity with supply chain, manufacturing, and finance systems integration, especially in a retail environment.Excellent cross-functional communication skills, with the ability to engage and influence stakeholders at all levels.Leadership capabilities: Ability to lead teams through complex changes, inspire collaboration, and drive results.Strong problem-solving skills, with a proactive approach to addressing challenges and managing risks.Ability to ask insightful questions and challenge assumptions to ensure the program is delivered successfully.Highly organized and results-oriented, with a demonstrated ability to handle multiple priorities in a fast-paced environment",
        "source": "Email",
        "date_posted": "2024-10-23 09:42:42-05:00",
        "unique_id": "192b9f8c9bcb2d3c",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]