[
    {
        "company": "Vyze",
        "job_title": "Java Developer",
        "location": "Tallahassee, FL, USA",
        "full_location": {
            "city": "Tallahassee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "7+ years",
            "degree_required": "Bachelor’s Degree in Computer Science, Information Systems or other Information Technology major, or equivalent work experience.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Oracle DBMS",
                "Java application development",
                "Javascript frameworks",
                "Full-stack development"
            ],
            "primary": [
                "Struts/Tiles",
                "Struts 2",
                "Servlets/JSP",
                "JPA/Hibernate",
                "DML and DDL statements",
                "PL/SQL",
                "AngularJS",
                "NodeJS",
                "React",
                "JQuery",
                "Responsive design frameworks",
                "Bootstrap",
                "Git",
                "Jenkins",
                "Relational database designs",
                "Object-oriented design methodologies",
                "Information Systems Development Methodology (ISDM)",
                "TOAD",
                "SQL Developer",
                "SQL Navigator",
                "Database security",
                "Unified Modeling Language (UML)"
            ],
            "secondary": [
                "Oracle certification(s)",
                "Agile development",
                "Scrum",
                "Extreme Programming (XP)",
                "Kanban",
                "Docker",
                "GIS applications",
                "RESTful web services",
                "Environmental regulatory business processes"
            ],
            "all": [
                "Java",
                "Oracle DBMS",
                "Java application development",
                "Javascript frameworks",
                "Full-stack development",
                "Struts/Tiles",
                "Struts 2",
                "Servlets/JSP",
                "JPA/Hibernate",
                "DML and DDL statements",
                "PL/SQL",
                "AngularJS",
                "NodeJS",
                "React",
                "JQuery",
                "Responsive design frameworks",
                "Bootstrap",
                "Git",
                "Jenkins",
                "Relational database designs",
                "Object-oriented design methodologies",
                "Information Systems Development Methodology (ISDM)",
                "TOAD",
                "SQL Developer",
                "SQL Navigator",
                "Database security",
                "Unified Modeling Language (UML)",
                "Oracle certification(s)",
                "Agile development",
                "Scrum",
                "Extreme Programming (XP)",
                "Kanban",
                "Docker",
                "GIS applications",
                "RESTful web services",
                "Environmental regulatory business processes"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "priya",
        "email": "ppundhir@vyzeinc.com",
        "jd": "Job Description -Job Title: Java DeveloperLocation : Tallahassee, FL OnsiteDuration: 6+ monthMOI: Skype Note: Need 3 references in order to submitPrimary Work: Serve as an Application Developer focusing on the following technologies: Java/JEE and Oracle DBMS. This role supports ongoing maintenance needed to ensure the stability of applications residing in the DEP portfolio. The focus of this support work will focus on a specific Division’s application portfolio, however the team member may also be assigned to work on other projects and/or applications in the DEP application portfolio, as specified by FDEP management.Education: Bachelor’s Degree in Computer Science, Information Systems or other Information Technology major, or equivalent work experience. Required Tasks to be performed: • Provide maintenance, enhancement and support for a variety of the agency’s business applications. • Assisting in the preparation and documentation of program requirements and specifications. • Research and document requirements of program users. • Writing, translating and coding software programs and applications per specifications. • Assisting in the development and maintenance of user manuals and guidelines. • Working with network administrators, systems analysts and software engineers to assist in resolving problems with software products or company software systems. • Providing mentoring and guidance to junior programmers. Required Knowledge, Skills & Abilities (KSAs): • 7+ years’ experience with Java application development, leveraging frameworks such as Struts/Tiles, Struts 2, Servlets/JSP, and JPA/Hibernate • 5+ years’ experience with Oracle databases, possessing the capability to develop DML and DDL statements to produce very complex queries and PL/SQL database objects, including both DML and DDL • 3+ years’ experience with Javascript frameworks, such as AngularJS, NodeJS, React or JQuery • 3+ years’ experience as a full-stack developer • Experience with responsive design frameworks, preferably Bootstrap • Experience using code repositories, preferably Git • Experience using continuous integration tools, preferably Jenkins • Knowledge of relational database designs • Knowledge of object-oriented design methodologies • Knowledge of Information Systems Development Methodology (ISDM) • Experience with database query tools (i.e., TOAD, SQL Developer, SQL Navigator)• Knowledge of database security, including role-based security • Knowledge and experience with Unified Modeling Language (UML) • Ability to be creative, to use sound judgment, and to display foresight to identify potential problems and design/specifications and assigned application software systems • Ability to establish and maintain effective working relationships with others • Ability to work independently • Ability to determine work priorities and ensure proper completion of work assignments • Ability to work well under pressure and meet deadlines without sacrificing quality • Excellent interpersonal, collaborative, oral and written communication skills Preferred Knowledge, Skills & Abilities (KSAs): • Oracle certification(s) • Familiarity with Agile development, specifically Scrum, Extreme Programming (XP) and Kanban. • Experience with Virtualization, preferably Docker • Experience implementing GIS (Geographic Information System) applications • Experience developing web services, preferably RESTful web services • Experience with environmental regulatory business processes and practices • Knowledge and understanding of DEP’s technical environment",
        "source": "Email",
        "date_posted": "2024-10-23 14:05:20-05:00",
        "unique_id": "192bae54fd557f89",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]