[
    {
        "company": "Veridian Tech Solutions, Inc",
        "job_title": "Python Developer",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long-term Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Python"
            ],
            "primary": [
                "Communication Skills",
                "Application Development",
                "Problem Solving"
            ],
            "secondary": [
                "Event-driven",
                "Messaging",
                "Stream Processing",
                "AWS",
                "GCP",
                "Azure",
                "DevOps",
                "Docker",
                "Kubernetes",
                "Openshift",
                "Machine Learning"
            ],
            "all": [
                "Python",
                "Communication Skills",
                "Application Development",
                "Problem Solving",
                "Event-driven",
                "Messaging",
                "Stream Processing",
                "AWS",
                "GCP",
                "Azure",
                "DevOps",
                "Docker",
                "Kubernetes",
                "Openshift",
                "Machine Learning"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Nitin Raj",
        "email": "nitin@veridiants.com",
        "jd": "From: Nitin Raj, Veridian Tech Solutions nitin@veridiants.com Reply to: nitin@veridiants.com Hi,Greetings from Veridian Tech Solutions, Inc!!! This is Nitin from Veridian Tech Solutions, Inc. Veridian Tech Solutions, Inc is providing enhanced IT consulting to top Notch IT Clients. I would appreciate it if you could render the requirement details below and if interested, kindly share a copy of your resume, else please take a moment to forward these Job details to someone you think might be interested and good fit for the job. Find the JD for your reference.Only Local to GATitle: Python Developer x DPLocation: Atlanta, GA (Onsite)Duration: Long-term Contract Starting date: 18.11.2024 Required 10+ years of experience. Job Description: Need an experienced professional software developer who worked on an application development team. We are not looking for someone that are really analytics or data science people who are interested in machine learning and have used python as a prototyping or simulation tool, but aren’t really building production ready, supportable, maintainable applications.They need to know Python. This does not mean that they have used that language exclusively or that their resume is written to sell them as a “Python” developer. It does mean that they know the syntax and deployment patterns and can start working in that language on day one.We need good communication skills. The candidate will be part of a cross geographical team and must be a clear communicator both in person and over the phone.You will be successful in the interview process if youAre smart and can demonstrate itHave experience as a senior software developer for high-tech products or services.Have 5+ years of Python programming experience in a production environmentHave a proven history of solving complex problems both in code and in person.Nice-to-haves:Event-driven, messaging, or stream processing experienceAWS, GCP, or Azure experience – AWS preferredDevOps, Docker, Kubernetes, or Openshift experienceMachine learning experience Linkedin - https://www.linkedin.com/in/nitin-raj-83169b15a/Nitin RajTechnical Recruiter Veridian Tech Solutions, IncCertified by WOSB, WBENC, HUB nitin@veridiants.comwww.veridiants.com11931 Wick Chester Lane Suite 150 Houston, TX, 77043“Verdian is an Equal Opportunity Employer and prohibits discrimination and harassment of any kind.",
        "source": "Email",
        "date_posted": "2024-10-23 09:43:04-05:00",
        "unique_id": "192ba1d7c6667d9c",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Python developer"
    }
]