[
    {
        "company": "VDart Inc",
        "job_title": "CIAM/Security Business Architect",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Bachelor's or Master's degree in Computer Science, Information Systems, or a related field.",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "0-6 months + extension",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "CIAM framework (such as OAuth, OpenID Connect & SAML)",
                "Okta",
                "Ping Identity",
                "GDPR",
                "CCPA"
            ],
            "primary": [
                "security architecture",
                "business analysis",
                "risk assessments",
                "user authentication",
                "authorization",
                "identity lifecycle management"
            ],
            "secondary": [
                "analytical skills",
                "problem-solving skills",
                "communication skills",
                "Agile/Scrum",
                "Waterfall development processes"
            ],
            "all": [
                "CIAM framework (such as OAuth, OpenID Connect & SAML)",
                "Okta",
                "Ping Identity",
                "GDPR",
                "CCPA",
                "security architecture",
                "business analysis",
                "risk assessments",
                "user authentication",
                "authorization",
                "identity lifecycle management",
                "analytical skills",
                "problem-solving skills",
                "communication skills",
                "Agile/Scrum",
                "Waterfall development processes"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Mohamed Yasin Sirajudeen",
        "email": "yasin.s@vdartinc.com",
        "jd": "From: Mohamed Yasin S, VDart INC yasin.s@vdartinc.com Reply to: yasin.s@vdartinc.com Hi,Please Find the requirements below Job Title: CIAM/Security Business ArchitectLocation: RemoteJob Mode: RemoteVisa Restriction: Any Visa will Works Except OPT, CPT ,F1, & STEMType/Duration: Contract, 0- 6 month(s) + extensionNo of years Need: 10+ years of experience NeededLocal/ No Local : RemoteMandatory Skills: CIAM framework (such as OAuth, OpenID Connect & SAML) || Okta or Ping Identity || GDPR and CCPA, and their impact on CIAM CIAM/Security Business Architect Position Summary:As a Business Architect, you will be responsible for designing and implementing secure and scalable CIAM solutions for our client. You will work closely with global cross-functional teams, including stakeholders, security architects, business analysts, developers & project managers, to ensure the successful delivery of CIAM projects across Gallagher Bassett. You must have a strong background in in security architecture, CIAM frameworks, and business analysis. Strong analytical, problem-solving, and communication skills are essential for success in this role.This role offers rich opportunities to develop as a leader, problem solver, and strategic planner. There will be frequent opportunities to interact with and influence senior decision makers. You will also help scale the Business Architecture group by improving our methodologies and mentoring others on the team. Essential Duties and Responsibilities: • Develop and implement CIAM strategies and solutions that align with business objectives and security requirements.o Design and document CIAM architectures, including user authentication, authorization, and identity lifecycle management.o Conduct risk assessments and develop mitigation strategies to ensure the security and privacy of customer data.o Collaborate with cross-functional teams, stakeholders, and subject matter experts to understand their CIAM needs and translate them into technical requirements.• Evaluate and select CIAM technologies and vendors based on business requirements and industry best practices.• Define and enforce CIAM policies, procedures, and standards to ensure compliance with regulatory requirements.• Develop analysis & process documents, requirements and roadmaps for various projects and programs across GB’s business units, applications, and products. • Advocate and drive adoption of Business Architecture best practices to ensure standardization • Stay up to date with industry trends & advancements in CIAM and security technologies. Required:• Bachelor's or Master's degree in Computer Science, Information Systems, or a related field.• 10+ years of related experience as a Business Architect or similar role, with a focus on CIAM framework (such as OAuth, OpenID Connect & SAML)• Strong knowledge of security principles, including authentication, authentication and encryption.• Experience with CIAM technologies, such as Okta or Ping Identity.• Familiarity with regulatory requirements, such as GDPR and CCPA, and their impact on CIAM• Proficiency in translating business requirements into technical solutions and collaborating with IT teams for implementation.• Excellent analytical, problem-solving, and communication skills.• Ability to collaborate effectively with cross-functional teams, stakeholders, and subject matter experts.• Strong attention to detail and a passion for operational excellence.• Experience working in both Agile/Scrum & Waterfall development processes• Must be self-directed and able to perform project duties with minimal direction and supervision Kind regards,Mohamed Yasin SirajudeenSenior Technical RecruiterVDart Inc.Contact : (678) 720-4178",
        "source": "Email",
        "date_posted": "2024-10-23 14:18:30-05:00",
        "unique_id": "192bb19927a79288",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]