[
    {
        "company": "resource-logistics inc.",
        "job_title": "Program Manager with HL7, Integration, CCD and FHIR experience",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "4+ years",
            "degree_required": "Bachelor's degree in computer science, Technology or equivalent experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$60/hr."
        },
        "skills": {
            "core": [
                "HL7",
                "Integration",
                "CCD",
                "FHIR"
            ],
            "primary": [
                "Healthcare implementation",
                "Project management",
                "Middleware Integration suite",
                "REST API",
                "File drop"
            ],
            "secondary": [
                "Web development (Angular JS, PHP, ASP, JSP, CSP, Zen)",
                "InterSystems HealthShare",
                "Ensemble Middleware Integration suite",
                "Object-oriented design"
            ],
            "all": [
                "HL7",
                "Integration",
                "CCD",
                "FHIR",
                "Healthcare implementation",
                "Project management",
                "Middleware Integration suite",
                "REST API",
                "File drop",
                "Web development (Angular JS, PHP, ASP, JSP, CSP, Zen)",
                "InterSystems HealthShare",
                "Ensemble Middleware Integration suite",
                "Object-oriented design"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Jasmine",
        "email": "jasmine.kaur@resource-logistics.com",
        "jd": "From: Jasmine, resource-logistics inc. jasmine.kaur@resource-logistics.com Reply to: jasmine.kaur@resource-logistics.com Hi,Please have a look on below mentioned detailed job description and let me know if you’ve any candidature: Program Manager with HL7/Integration/ CCD/FHIR experienceLocation: RemoteWorking hours would be as per PST time zoneRate $60/hr. on C2CMust have solid experience in HL7/Integration/ CCD/FHIR hands on experience.Job Summary:Strong healthcare implementation & project management experience using HL7 , CCD , FHIR hands-on knowledge.• Coordinate analysis of overall interface solution related to interfacing between HIE and various hospital information management systems, laboratory information systems, electronic health record systems, interface engines and any other third-party applications.• Coordinate with Providers on getting them onboarded with Health Information Exchange (HIE).• Responsible for overall Provider Engagement for their Clinical needs.• Maintain project documentation in accordance with Providence standards.• Provides demo’s to Providers of various HIE tools.• Work on POCs and cutting-edge features related to various HIE initiatives.• Design and develop upgrade roadmap for HIE products.• Prepare Visio diagrams using Microsoft Visio for depicting different workflows to the client. • Work collaboratively with the Project Manager and other HIE Team members to ensure the successful delivery of all HIE projects.• Manage Product pipeline and establish timeline for new features POC and GA.• Implement a framework for community-wide Health Information Exchange (HIE) for secure exchange of clinical data centered on improving patient care.• Provide realistic estimates for Level of Effort and Statements of Work.• Work with customers to ensure technical design meets use cases and functional requirements and stay engaged with the customer through the project lifecycle.• Work with different vendors to identify innovative ways of sharing data for e.g. REST API, File drop etc.• Take responsibility for the documentation of the technical solution including any partner implementation work.• Stay engaged with the customer throughout the lifecycle via regular meetings to review progress.• Provide advice and best practices to client for technical areas related to configuration and infrastructure related to the deployment of HIE.• Support and maintain systems by following supports processes (like ITIL) and makes code changes, wherever required.• Root Cause Analysis of high severity incidents and Engine component related issues.• Supports all SDLC activities in accordance with industry best practices and product lifecycle processes.• Supporting our clients during major go lives• Assist with resolving production issues as needed.4+ years of experience with any of Middleware Integration suite for e.g. Mirth, Cloverleaf, Ensemble etc.4+ years of Healthcare experience using Hl7 , CCD , FHIR and Interfaces/connections using https/vpn is requiredBachelor’s degree in computer science, Technology or equivalent experience.5+ years Product Management experience is preferred.Knowledge of latest standards/tools in APIs and enterprise integrations area.InterSystems HealthShare and Ensemble Middleware Integration suite is preferred.Web development experience (Angular JS, PHP, ASP, JSP, CSP, Zen, etc.) is preferred.Willingness to learn new technologies/tool and train your peers.Strong understanding of software development process and proficient in object-oriented design and development.",
        "source": "Email",
        "date_posted": "2024-10-23 15:41:28-05:00",
        "unique_id": "192bb708e9d54aa7",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]