[
    {
        "company": "Source Infotech Inc",
        "job_title": "Systems Analyst, DOE Application Support",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "4 year college degree or equivalent working experience in business analytics/communications",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ months contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Gathering Requirements",
                "Collaboration",
                "Data Analysis"
            ],
            "primary": [
                "SQL experience",
                "Agile development methodology",
                "Writing test plans"
            ],
            "secondary": [
                "Business analytics",
                "User story writing",
                "Impact mapping",
                "Procurement artifacts"
            ],
            "all": [
                "Gathering Requirements",
                "Collaboration",
                "Data Analysis",
                "SQL experience",
                "Agile development methodology",
                "Writing test plans",
                "Business analytics",
                "User story writing",
                "Impact mapping",
                "Procurement artifacts"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Abhisek Kumar",
        "email": "abhisek.k@sourceinfotech.com",
        "jd": "From: abhisek, source infotech abhisek.k@sourceinfotech.com Reply to: abhisek.k@sourceinfotech.com Title: Systems Analyst, DOE Application SupportLocation: 100% RemoteDuration: 6+ months contractIV: Phone and VideoVisa: No H1b/CPT Need someone with state client experience.Client is currently looking for a Systems Analyst to help round out the team. This position will be expected to collaborate with business and technical team to anticipate and communicate product needs and requirements. Top 3 Skills: Gathering RequirementsCollaborationData Analysis Key Responsibilities:Perform analysis and documentation of business and system interactions. Work with the Application Development team to design and implement technical solutions. Perform business analyses of functional requirements to identify information, procedures, and decision flows.Facilitate processes for the team and vendors to ensure they are meeting MaineIT policy and procedures.Support procurement processes, including gathering business and technical requirements for use in RFPs and assisting in Deployment Certification processes.Evaluate existing procedures and methods, identify and document items such as database content, structure, application subsystems, and develop data dictionary.Define and document interfaces of manual to automated operations within application subsystems, to external systems, and between new and existing systems.Identify candidate business processes for re-design, prototype potential solutions, provide trade-off information and suggest a recommended course of action. Identify the modifications to the automated processes.Be involved in all phases of the SDLC, including Requirements Definition and Documentation, Systems Analysis and Design, System Integration, Testing, and Deployment Coordination.Support and use the selected departmental methodologies. Minimum Qualifications: 5+ years related industry experience. Preferred Education: 4 year college degree or equivalent working experience in business analytics/communications. Demonstrated experience in gathering business requirements for system design including advanced methodologies like story mapping, impact mapping, user story writing and refinementExperience writing queries and analyzing data (SQL experience is a plus)Experience in writing and executing test plans with attention to detail and quality focusExperience with developing procurement artifacts e.g. RFP/RFQ/RFI Ability to establish and maintain effective working relationships in a high paced team environmentExperience in Agile development methodology and practicesKnowledge of all phases of the software development life cycle as well as the project development cycleStrong oral and written communication skills including the ability to write clearly and effectivelyThanks & RegardsAbhisek kumarSource Infotech IncP.O Box 577, EDISON, NJ 08818-0577Email: abhisek.k@sourceinfotech.comPhone: 609-934-3412 | | Hangout: abhishekchoudhary0948",
        "source": "Email",
        "date_posted": "2024-10-24 11:48:35-05:00",
        "unique_id": "192bf9a22ecdde3b",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]