[
    {
        "company": "Solventum",
        "job_title": "Software Development Project Manager (SAP Deployments)",
        "location": "Brookings, SD, USA",
        "full_location": {
            "city": "Brookings",
            "state": "SD",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "5-10 years",
            "degree_required": "Bachelor’s Degree or higher from an accredited university in a technical or business field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months (Possible Extension)",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Software Development",
                "PMP Certification",
                "MS Project",
                "Jira"
            ],
            "primary": [
                "Leadership",
                "Integration Management",
                "Scope Management",
                "Cost Management",
                "Resource Management",
                "Time Management",
                "Quality Management",
                "Communications Management",
                "Risk Management",
                "Procurement Management"
            ],
            "secondary": [
                "Manufacturing Experience",
                "Health Care Manufacturing Environment",
                "SAP Deployments",
                "Software Validation for Computer Systems"
            ],
            "all": [
                "Project Management",
                "Software Development",
                "PMP Certification",
                "MS Project",
                "Jira",
                "Leadership",
                "Integration Management",
                "Scope Management",
                "Cost Management",
                "Resource Management",
                "Time Management",
                "Quality Management",
                "Communications Management",
                "Risk Management",
                "Procurement Management",
                "Manufacturing Experience",
                "Health Care Manufacturing Environment",
                "SAP Deployments",
                "Software Validation for Computer Systems"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Arjun",
        "email": "arjuna@fluxteksol.com",
        "jd": "From: Arjun, fluxteksol.com arjuna@fluxteksol.com Reply to: arjuna@fluxteksol.com Title: Software Development Project Manager (SAP Deployments)Location: Brookings, SD, Hybrid (Relocation is fine)Duration: 12+ Months (Possible Extension) The Brookings Solventum plant is looking to hire a Software Development Project Manager for the replacement of an internal computer system that manages the sterilization of products at its facility. This resource should have extensive experience in software development and project management, preferably a certified project manager (PMP). Minimal work direction needed, highly skilled and knowledgeable in project management and software development and provides best practices. Responsible for and authorized to manage the IT portion of the project. Responsibilities: Provide Leadership to all IT related aspects of the project. Integration (Planning) Management, Global alignment, Provide Scope, Cost and Resource Management for the project. Time Management, Resource planning, Quality Management, Communications Management, Risk Management and Procurement Management. Be objective in setting and assessing work, ensuring team buy-in. In this role, the project manager will be responsible for:• Identifying the project schedule and deliverables required for the project.• Assisting with requirements development and tracking progress of the project (monitoring and controlling).• Identifying risks, developing mitigation plans and addressing issues as they arise.• Determining staffing needs to complete the project on time. • Working with the business team to ensure that software development is meeting business needs and is also compliant with health care computer software validation. Skills: To set you up for success in this role from day one, Solventum requires (at a minimum) the following qualifications:Bachelor’s Degree or higher from an accredited university in a technical or business field.5-10 years in project leadership experience. Preferably PMP.Direct experience in implementing new systems and processes.Fluency in use of project management tools: MS Project, Jira, etc.Experience in presenting to senior leadership.Experience in a manufacturing setting. Added value in a health care manufacturing environment.Experience with SAP deployments.Experience in software validation for computer systems in a regulated environment.Education:Bachelor’s Degree or higher from an accredited university in a technical or business field.",
        "source": "Email",
        "date_posted": "2024-10-24 22:01:15-05:00",
        "unique_id": "192c1bf30ff92533",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]