[
    {
        "company": "Quantum Vision LLC",
        "job_title": "Senior Support Services Project Manager",
        "location": "Baton Rouge, LA, USA",
        "full_location": {
            "city": "Baton Rouge",
            "state": "LA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Proven experience as a Project Manager in IT projects",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "2 years, with possible extension of 3 more years",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "IT Projects",
                "Process Monitoring",
                "Documentation",
                "Cost-Benefit Analysis"
            ],
            "primary": [
                "Operations Management",
                "Risk Mitigation Strategies",
                "Project Management Tools (MS Project, Jira)",
                "Stakeholder Management",
                "Cross-Functional Collaboration"
            ],
            "secondary": [
                "State Procurement Laws",
                "IT Services Management",
                "Leadership Skills",
                "Communication Skills",
                "Multi-Project Management"
            ],
            "all": [
                "Project Management",
                "IT Projects",
                "Process Monitoring",
                "Documentation",
                "Cost-Benefit Analysis",
                "Operations Management",
                "Risk Mitigation Strategies",
                "Project Management Tools (MS Project, Jira)",
                "Stakeholder Management",
                "Cross-Functional Collaboration",
                "State Procurement Laws",
                "IT Services Management",
                "Leadership Skills",
                "Communication Skills",
                "Multi-Project Management"
            ],
            "with_experience": [
                "Project Management",
                "IT Projects",
                "Process Monitoring",
                "Documentation",
                "Cost-Benefit Analysis"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Shiva Kumar",
        "email": "shivakumar@quantumvision.com",
        "jd": "From: Shiva Kumar, Quantum Vision LLC shivakumar@quantumvision.com Reply to: shivakumar@quantumvision.com Hi, Hope you are doing great. Please let me know if you are interested in the below position. Interested in applying? Just reply to this email along with a copy of your latest resume. Job Title: Senior Support Services Project Manager Job Location: Baton Rouge, Louisiana (ONSITE) Contract Duration: 2 years, with possible extension of 3 more years Interview Mode: Video (Only Local Candidates) One of our direct clients in LA is seeking a Project Manager to lead their digitization initiative aimed at transforming the agency's file rooms into a digital repository. The Project Manager will be responsible for overseeing the assessment of current practices and developing a comprehensive roadmap to digitize paper documents, ensuring they are accessible throughout the agency. The Project Manager will also supervise the setup of a centralized scanning location to process both existing and new documents, addressing requirements for special equipment such as oversize scanners. The Project Manager will ensure the project is completed on time, within scope, and on budget, while addressing any challenges that arise during the transition to a digital system. Required Experience: Proven experience as a Project Manager in IT projects, with a focus on support services and operations management. Experience in process monitoring and improvement strategies within government or public sector organizations. Ability to create comprehensive project documentation including schedules, status reports, risks, and issue tracking. Strong knowledge of cost-benefit analysis techniques and risk mitigation strategies. Experience in managing both internal teams and external stakeholders, including vendors and contractors. Proficiency in using project management tools such as MS Project, Jira, or similar software. Familiarity with State procurement laws and regulations. Demonstrated ability to manage multiple projects simultaneously and deliver them on time and within budget. Excellent communication and leadership skills, with a focus on cross-functional collaboration. Experience in IT services management, operations, and support within large organizations. Duties/Responsibilities: Provide day-to-day project management support. Activity and resource planning. Creation of project documentation: daily, weekly, semi-monthly and monthly status reports; project schedules and plans, meeting minutes, risks and issues, other documentation as needed. Analyzing project risks and issues, help identify ways to mitigate risks. Process monitoring. Monitor project deliverables. Provide day-to-day support for on-going processes. Provide on-going evaluation and improvements for processes; work in needed areas to provide support services for agency’s workload demands. Documentation of specifications and requirements tracking. Conduct cost/benefit analysis. Thanks for your time! Shiva kumar Sr. Lead Recruiter Quantum Vision Shivakumar@quantumvision.com",
        "source": "Email",
        "date_posted": "2024-10-23 11:46:33-05:00",
        "unique_id": "192ba6716e360658",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]