[
    {
        "company": "TCS",
        "job_title": "Java Architect",
        "location": "Tampa, FL, USA",
        "full_location": {
            "city": "Tampa",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "10-12+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "DevOps",
                "Docker",
                "Kubernetes",
                "Java 8",
                "REST APIs",
                "Spring Boot",
                "SQL"
            ],
            "primary": [
                "Microservices Architecture",
                "SOAP",
                "Data Structures",
                "Collections",
                "Database Design"
            ],
            "secondary": [],
            "all": [
                "Java",
                "DevOps",
                "Docker",
                "Kubernetes",
                "Java 8",
                "REST APIs",
                "Spring Boot",
                "SQL",
                "Microservices Architecture",
                "SOAP",
                "Data Structures",
                "Collections",
                "Database Design"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Anjali Pandey",
        "email": "anjali.pandey@quantumworldit.com",
        "jd": "From: Anjali Pandey, Quantum World anjali.pandey@quantumworldit.com Reply to: anjali.pandey@quantumworldit.com Greeting, I hope all is well with youFor the following, Quantum World IT is seeking the best consultant profile.Please respond with your most recent resume if you are considering new opportunities.Looking (only local candidate) || Java Architect || Tampa, FL (Onsite)|| TCS Java Architect Tampa, FL. Overview:We are seeking a highly skilled Lead Java developer to join our team. You will be responsible for writing code to develop and support business requirements based on Java applications with a strong focus on data structures. Job Responsibilities:Able to design, Implement, and maintain java Based software applications.Able to contribute to all stages of Software development life cycles.Able to analyze user requirements, features and define application functionality.Able to provide changes to current Java infrastructure of the legacy applications. Required Skills:A minimum of 10-12+ years of experience is required.Hands-On working experience with Devops, Dockers & Kubernetes.Experience in Java and related open-source technologiesVery strong Java and advance Java fundamentalsHands on experience with Java 8 (they should be able to write code using Java 8 features like streams and respective functions)Hands-on experience with developing and implementing REST APIs for the microservices architecture.Good hands-on experience Spring frameworks (Spring Boot)Good experience developing web services (SOAP and REST)Good knowledge in Data Structures, CollectionsStrong Database design skills including SQL, procedures, and query tuning. Please enter the following information is needed for submission and Photo id Position Applied for Candidate Full Name [As per Passport] Contact Number Primary & Secondary Email ID Current Location Work Authorization Experience Had ever worked with TCS in Past (Required filed) Are you comfortable for on-site LinkedIn id Had you gotten covid vaccination doses Rate expectation Warm Regards Anjali PandeyContact: + 18053879682Email: Anjali.Pandey@quantumworldit.com Quantum World Technologies Inc.",
        "source": "Email",
        "date_posted": "2024-10-24 07:53:31-05:00",
        "unique_id": "192beb715fc5706f",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]