[
    {
        "company": "Code InfoTech Inc",
        "job_title": "Certified Microsoft .NET Web Developer III",
        "location": "Madison, WI, USA",
        "full_location": {
            "city": "Madison",
            "state": "WI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "10+ years with .NET if relocating (~ 8 years could work if in WI currently and the candidate has a work history in Wisconsin)",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "ASP.NET CORE",
                "ASP.NET Web Forms",
                "Strong UI design skills",
                "WCF",
                "Web Services",
                "Web APIs",
                "SQL Server"
            ],
            "primary": [
                "Working knowledge of Database Modeling/Design",
                "Expert knowledge of SQL and Stored Procedures",
                "Familiarity with project management methodologies (waterfall, agile)"
            ],
            "secondary": [
                "Certification is a plus but not required"
            ],
            "all": [
                "ASP.NET CORE",
                "ASP.NET Web Forms",
                "Strong UI design skills",
                "WCF",
                "Web Services",
                "Web APIs",
                "SQL Server",
                "Working knowledge of Database Modeling/Design",
                "Expert knowledge of SQL and Stored Procedures",
                "Familiarity with project management methodologies (waterfall, agile)",
                "Certification is a plus but not required"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Deepak Chaudhary",
        "email": "deepak@codeinfotek.com",
        "jd": "From: Deepak Chaudhary, Code InfoTech Inc deepak@codeinfotek.com Reply to: deepak@codeinfotek.com ROLE TITLE: Certified Microsoft .NET Web Developer IIILOCATION: 101 E. Wilson Street, 6th Floor, Madison, Wisconsin, 53703, 60% Remote [in Wisconsin]. Hybrid structure with a minimum of two days a week onsite. Candidates must be CURRENT WI residents at the time of submission. Relocations are allowed (the candidate pays the cost). DETAILSThis position functions as an application development specialist under the general supervision of the Solution Delivery Manager in the Division of Administrative Services and Technology of the DFI. Responsibilities include providing application development and maintenance support, ensuring efficient system operations, and participating in all SDLC activities for DFI. Additional duties include recommending Internet/Intranet applications, ensuring compliance with DFI standards, and mentoring junior developers.The role involves analyzing complex systems, interviewing clients, preparing design documentation, presenting feasibility reports, and developing functional and technical specifications. The developer will also develop, test, and maintain complex systems, facilitate debugging, and plan integration and system testing. Leadership responsibilities include implementing development standards and mentoring.Required Skills:ASP.NET COREASP.NET Web Forms Strong UI design skillsWCF Web Services Web APIsSQL Server Nice to Have Skills:Working knowledge of Database Modeling/DesignExpert knowledge of SQL and Stored ProceduresFamiliarity with project management methodologies (waterfall, agile)Certification is a plus but not required.Interview Process:Conducted via Microsoft Teams (camera on).Additional Details:No travel required.Security requirements in place.Objectives and Tasks: (shared by DFI; required/nice-to-have skills above take priority)Analyze and design complex new systems and maintain or enhance existing systems.Interview prospective system clients to document existing systems and procedures and to define new or revised system requirements.Analyze system design and platform alternatives and prepare general system design documentation, including flowcharts, forms, reports, and processes.Prepare feasibility reports showing the cost benefits of the various alternatives. Present these reports to both client and IT managementCreate detailed project plans and estimates for design, programming, testing, and implementation tasks.Write functional requirements documents defining business and technical system requirements.Review detailed design specifications to assure the integrity and accuracy of the specifications.Write technical specifications for complex programs that other team members will code.Identify technical and application alternatives to meet specifications and recommend most efficient, maintainable, and cost-effective solution.Analyze existing systems and modify as needed to improve system performance.Evaluate impact on existing systems of new and proposed State and Federal regulation changes.Respond to clients' needs for assistance and correct system production problems with appropriate timeliness.Assist in problem resolution, support and diagnosis for databases and the systems using them. Development and testing of complex new computer systems and maintenance or enhancements to existing systems.Review system design specifications or project requests to understand requirements and prepare detailed resource estimates.Code, test, and debug (or facilitate the coding, testing, and debugging of) complex computer systems, utilizing DFI's current development tools, in compliance with current development standards, procedures, and policies.Plan and design integration, system, and/or client acceptance testing to ensure that systems function together correctly and meet client requirements. Coordinate testing with operations and business staff.Prepare and/or update (or facilitate the preparation and/or updating of) documentation, in accordance with current standards, to provide programmers with information required to understand and maintain the systems and/or procedures.Develop deployment documentation to thoroughly test systems, procedures; and production implementations.Conduct training of clients and appropriate IT staff to ensure a thorough understanding of the application system.Redesign and rewrite current systems for maximum efficiency, taking advantage of new utilities, data structures, and software.Model and document database structures to meet the system requirements.Develop data extracts and data conversion routines to transmit data to outside parties and other application systems.Lead Efforts to Implement DFI Application Development Standards.Assist in developing and maintaining development standards, procedures, and policies for agency application development activities.Ensure applications are documented following current standards and procedures to provide development staff with the information required to understand and maintain the system or procedures.Orient new employees to DFI standards, development languages, utilities, procedures, and major application areas.Assist with identifying and implementing appropriate security and privacy protection procedures by working with other DFI staff.Read, review, and comment on proposed programming standards, position papers, peer products, and trade journals.Research and monitor emerging technology, software, and other information that DFI should consider. Knowledge /Skills/Ability (KSA):Knowledge of systems development practices and principles. Knowledge of systems analysis techniques. Knowledge of cost-benefit analysis techniques.Knowledge of object-oriented principles and design patterns.Professional oral and written communication skills. Problem determination and resolution skills. Knowledge of web-enabled and e-commerce applications. Knowledge of client/server and Internet concepts, procedures, and techniques. Knowledge of Windows Server. Knowledge of ASP.NET Web Forms.Expert knowledge of Microsoft .NET technologies such as C# , ASP.NET MVC and CoreExpert knowledge of Web Services, JavaScript, Cascading Style Sheets, Entity Framework and AJAX Working knowledge of Database Modeling/Design.Expert Working knowledge of SQL and Stored Procedures.Knowledge of project management methodologies such as waterfall and agile. Please Read:-The candidate is currently in Wisconsin resident or can relocate at the start of the contract (candidateÆs cost)10+ years with .NET if relocating (~ 8 years could work if in WI currently and the candidate has a work history in Wisconsin)6+ years of ASP.NET COREMost (all?) of the following skills -- ASP.NET Web Forms, WCF, Web Services, Web APIs, SQL Server.",
        "source": "Email",
        "date_posted": "2024-10-23 09:46:12-05:00",
        "unique_id": "192b9fc251ef05ae",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]