[
    {
        "company": "Source Infotech Inc",
        "job_title": "Business Analyst",
        "location": "Brooklyn Center, MN, USA",
        "full_location": {
            "city": "Brooklyn Center",
            "state": "MN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "6+ months",
            "rate": "$60"
        },
        "skills": {
            "core": [
                "data mapping",
                "writing data queries",
                "SQL",
                "ETL",
                "API"
            ],
            "primary": [
                "integration experience",
                "ERP skills",
                "Microsoft Word",
                "Agile Scrum methodology",
                "Business Process Functions",
                "Business Requirement Document"
            ],
            "secondary": [],
            "all": [
                "data mapping",
                "writing data queries",
                "SQL",
                "ETL",
                "API",
                "integration experience",
                "ERP skills",
                "Microsoft Word",
                "Agile Scrum methodology",
                "Business Process Functions",
                "Business Requirement Document"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Pradeep",
        "email": "pradip@sourceinfotech.com",
        "jd": "From: Pradip, Sourceinfotech Inc pradip@sourceinfotech.com Reply to: pradip@sourceinfotech.com Business AnalystBrooklyn Center, MN- Hybrid6+months C2HVisa: GC/USCRate: $60In-person interview Need someone with strong integration experience (integrating processes or integrating systems). It’s a data BA role where they need skills in data mapping and writing data queries. Having SQL/ETL/API experience is a strong bonus. ERP skills are also a bonus!DescriptionThis role is crucial in our company's operations, as it requires coordinating with various internal and external stakeholders to facilitate the implementation and integration of business processes and ERP solutions. As a Business Analyst, you will be tasked with understanding and documenting business requirements, facilitating communication, and ensuring project success.Responsibilities:Develop comprehensive documentation, functional requirements, workflow diagrams, user stories, and data mappings.Facilitate communication between third-party application partners and the product development team.Understand and define problem statements, providing business context to the development team.Validate whether requirements functionalities meet the acceptance criteria and the 'definition of done'.Manage various project types, including third-party software implementation, integrations, and hardware and software solutions.Track transactional data throughout integrated systems.Work closely with business stakeholders and third-party application partners to provide transparency and understanding of product backlog functionalities and timelines.Prioritize the list of backlog items in alignment with the overall strategy and business objectives.Participate actively in daily standups, sprint meetings, and retrospectives.Ensure projects are delivered on schedule, within budget, meeting team expectations, and achieving project goals.Proficient in Microsoft WordExperience with Agile Scrum methodologyUnderstanding of Business Process FunctionsExperience in creating Business Requirement DocumentFamiliarity with ERP - Enterprise Resource Planning Thanks & RegardsPradeepSource Infotech IncP.O Box 577, EDISON, NJ 08818-0577EMAIL: Pradip@sourceinfotech.comPhone: 609-956-0017 | Fax: 732-909-2282 | Hangout: Pradipk906|| Jai Mata Di ||",
        "source": "Email",
        "date_posted": "2024-10-23 12:15:29-05:00",
        "unique_id": "192ba8098171aca0",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]