[
    {
        "company": "Smart Source Technologies Inc",
        "job_title": "Senior Data Architect with AI/ML",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "8+ years",
            "degree_required": "Bachelor's or Master's degree in Computer Science, Information Technology, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "AWS architecture",
                "data architecture",
                "data modeling",
                "ETL/ELT processes",
                "AI/ML technologies"
            ],
            "primary": [
                "data storage",
                "data pipeline development",
                "data governance",
                "cloud infrastructure",
                "data quality"
            ],
            "secondary": [
                "open-source technologies",
                "Jupyter",
                "Anaconda",
                "problem-solving",
                "communication skills"
            ],
            "all": [
                "AWS architecture",
                "data architecture",
                "data modeling",
                "ETL/ELT processes",
                "AI/ML technologies",
                "data storage",
                "data pipeline development",
                "data governance",
                "cloud infrastructure",
                "data quality",
                "open-source technologies",
                "Jupyter",
                "Anaconda",
                "problem-solving",
                "communication skills"
            ],
            "with_experience": [
                "AWS architecture",
                "data architecture",
                "data modeling",
                "ETL/ELT processes",
                "AI/ML technologies"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Abhimanyu",
        "email": "abhimanyu.k@smartsourcetec.com",
        "jd": "From: Abhimanyu, Smart Source Technologies Inc abhimanyu.k@smartsourcetec.com Reply to: abhimanyu.k@smartsourcetec.com Job Title: Senior Data Architect with AI/MLLocation: East- Coast (Preferred anywhere in NJ) We are at the forefront of data innovation, empowering organizations to harness the power of their data.Our team is composed of forward-thinking individuals who are passionate about technology and dedicated to delivering exceptional results.We are currently seeking a Senior Data Architect to join our dynamic team and play a crucial role in shaping our data strategy. Position Overview: As a Senior Data Architect, you will be responsible for designing and implementing robust data architecture solutions that support our organization's data initiatives.You will work closely with cross-functional teams to create scalable data models, optimize data storage and retrieval processes, and ensure the integrity and security of our data systems.Your expertise in AWS architecture and experience with AI/ML integration will be vital in driving our data strategy forward. Key Responsibilities:• Design, implement, and manage data architecture solutions in alignment with business objectives and best practices.• Develop data models and design data storage solutions to optimize performance and scalability.• Create and maintain data pipelines and ETL/ELT processes to ensure efficient data integration and processing.• Establish data governance frameworks to ensure data quality, security, and compliance with regulatory requirements.• Collaborate with cloud infrastructure teams to deploy and manage data solutions on AWS.• Integrate AI/ML technologies into data solutions to enhance analytics capabilities and drive data-driven decision-making.• Utilize open-source technologies (e.g., Jupyter, Anaconda) to support data analysis and visualization efforts.• Provide technical guidance and mentorship to junior team members and stakeholders.• Stay updated on industry trends and emerging technologies to continuously enhance data architecture practices. Qualifications: • Bachelor's or Master's degree in Computer Science, Information Technology, or a related field.• 8+ years of experience in data architecture, with a strong focus on AWS architecture and cloud-based solutions.• Proficiency in data modeling, data storage, and data pipeline development. • Extensive experience with ETL/ELT processes and data governance practices.• Strong understanding of cloud infrastructure and security principles. • Hands-on experience with AI/ML technologies and their integration into data solutions.• Familiarity with open-source technologies such as Jupyter and Anaconda.• Excellent problem-solving skills and the ability to communicate complex technical concepts to non-technical stakeholders.• Proven ability to work collaboratively in a fast-paced, team-oriented environment. Share your resume on abhimanyu.k@smartsourcetec.com",
        "source": "Email",
        "date_posted": "2024-10-23 13:56:19-05:00",
        "unique_id": "192badd4b05c13af",
        "emp_type": [
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]