[
    {
        "company": "Technocraft solutions",
        "job_title": "Project Manager- Mid Level(Only Locals)",
        "location": "Raleigh, NC, USA",
        "full_location": {
            "city": "Raleigh",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "#749436(DHB)",
            "experience_required": "3 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Knowledge of NC Medicaid programs and familiarity with Provider Operations",
                "Excellent analytical, critical thinking and problem-solving skills",
                "Communication and interpersonal skills",
                "Attention to details to ensure accuracy in assigned work",
                "Ability to negotiate and resolve conflicts",
                "Building commitment within the team"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Knowledge of NC Medicaid programs and familiarity with Provider Operations",
                "Excellent analytical, critical thinking and problem-solving skills",
                "Communication and interpersonal skills",
                "Attention to details to ensure accuracy in assigned work",
                "Ability to negotiate and resolve conflicts",
                "Building commitment within the team"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Harsh Tiwari",
        "email": "harsh.tiwari@technocraftsol.com",
        "jd": "From: Harsh Tiwari, Technocraft solutions harsh.tiwari@technocraftsol.com Reply to: harsh.tiwari@technocraftsol.com Job Title: Project Manager- Mid Level(Only Locals)Location: Raleigh NC (Hybrid 4 days a month)Job id - #749436(DHB)Duration :12+ Months Note****Hybrid expectation is 4 days a month ONSITE. Do you accept this requirement.Candidate must be able to attend a webcam interview.Description:Typical Experience: 36-60 monthsNC DHHS Division of Health Benefits Provider Operations monitors the enrollment and credentialing of NC Medicaid Providers. In this position you will be responsible for Project management within the Unit. Job Description:The Provider Operations Project Manager will assume project management duties in Provider Operations, overseeing the daily activities of new initiatives and monitoring of ongoing projects specific to Project Management, Communications, Training, and Healthy Opportunities(PM/Comm/Training/HO). The Provider Operations Project Manager will:· Assisting to identify, evaluate, and resolve complex issues and collaborate closely with leadership and others to develop, implement, and expand new program initiatives.· Oversee new initiatives as assigned, to include participation in planning and development meetings, educational meetings with vendor and state staff throughout implementation, monitoring of work to ensure schedules are maintained and deadlines met, and to minimize uncertainty, maintain effective communication by keeping the customers educated and informed.· Oversee the development and accuracy of provider communications to stakeholders and vendors as well as effective communicate cross functionally with Provider Operations Teams and all other sections within DHB and the Fiscal Agent· Assess, analyze, and establish processes and procedures to ensure the accuracy of provider participation and that the Division does not enroll or retain fraudulent entities or non-participating providers.· Manage the oversight, monitoring, and direct operational performance of vendors, designing applicable protocols/tools/forms to ensure contractual compliance as assigned. Skills: · Knowledge of NC Medicaid programs and familiarity with Provider Operations.· Excellent analytical, critical thinking and problem-solving skills. · Communication and interpersonal skills.· Attention to details to ensure accuracy in assigned work.· Ability to negotiate and resolve conflicts. · Building commitment within the team. Required/Desired Skills SkillRequired /DesiredAmountof ExperienceKnowledge of NC Medicaid programs and familiarity with Provider OperationsRequired3YearsExcellent analytical, critical thinking and problem-solving skillsRequired3YearsCommunication and interpersonal skillsRequired3YearsAttention to details to ensure accuracy in assigned workRequired3YearsAbility to negotiate and resolve conflictsRequired3YearsBuilding commitment within the teamRequired3Years",
        "source": "Email",
        "date_posted": "2024-10-23 13:24:25-05:00",
        "unique_id": "192bad0d7e6f3bfc",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]