[
    {
        "company": "Adventa Tech",
        "job_title": "Azure Applications Architect",
        "location": "Tallahassee, FL, USA",
        "full_location": {
            "city": "Tallahassee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "4+ years",
            "degree_required": "Bachelor’s or Master’s Degree in Computer Science, Information Systems, or other related field. Or equivalent work experience.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Azure Synapse Analytics",
                "Azure SQL Database",
                "T-SQL",
                "Data Architecture Design",
                "Data Governance"
            ],
            "primary": [
                "Microsoft Dynamics 365 Certification",
                "MS Dynamics Power Platform Certifications",
                "Cloud Computing Concepts",
                "Data Integration",
                "Python",
                "Scala"
            ],
            "secondary": [
                "Salesforce",
                "Message MQ",
                "MuleSoft",
                "Analytical Skills",
                "Problem-Solving Skills"
            ],
            "all": [
                "Azure Synapse Analytics",
                "Azure SQL Database",
                "T-SQL",
                "Data Architecture Design",
                "Data Governance",
                "Microsoft Dynamics 365 Certification",
                "MS Dynamics Power Platform Certifications",
                "Cloud Computing Concepts",
                "Data Integration",
                "Python",
                "Scala",
                "Salesforce",
                "Message MQ",
                "MuleSoft",
                "Analytical Skills",
                "Problem-Solving Skills"
            ],
            "with_experience": [
                "Azure Synapse Analytics (4+ years)",
                "Azure SQL Database (4+ years)",
                "T-SQL (5+ years)",
                "Data Architecture Design (4+ years)",
                "Data Governance (3+ years)",
                "Data Integration (3+ years)",
                "Cloud Computing Concepts (2+ years)",
                "Python (1+ years)",
                "Scala (1+ years)",
                "Salesforce (1+ years)",
                "Message MQ (1+ years)",
                "MuleSoft (1+ years)"
            ]
        },
        "job_type": [
            "onsite",
            "remote"
        ],
        "contact_person": "Satyajeet Kumar",
        "email": "satyajeet@adventatech.com",
        "jd": "From: Satyajeet Kumar, Adventa tech satyajeet@adventatech.com Reply to: satyajeet@adventatech.com Hi,Hope you are doing well today!This is Satyajeet working as Technical recruiter at Adventa Tech. I have an exciting opportunity with one of our client. If interested send me your updated resume with contact details, expected pay rate. Job Description -Role: Azure Applications ArchitectSite: Tallahassee, FL Work Performed: (Preference Given to Candidates who canwork onsite)Candidate References: REQUIRED Scope of ServicesA. Applications Architect (Advanced) These positions are to provide technical guidance and expertise in supporting the department in developing, architecting, and maintaining systems, apis, data mappings, and monitoring high-volume complex data integration processes. Education: Bachelor’s or Master’s Degree in Computer Science, Information Systems, or other related field. Or equivalent work experience. (Required) Certifications: Microsoft Dynamics 365 Certification (Desired) and MS Dynamics Power Platform Certifications (Desired) Experience• 4+ years of experience in Synapse Analytics, Dedicated SQL Pools, Azure SQL Database, and Azure Managed Instance.• 5+ years of experience in DDL, DML T-SQL skills, advanced stored procedure writing skills, tables, primary keys, foreign keys, constraints, indexes, transactions, process logging, and error handling.• 4+ years of experience in data architecture design principles, methodologies, and best practices.• 3+ years of experience in data governance principles and compliance requirements related to data security and privacy.• 3+ years of experience in integrating data from various sources and managing large data pipelines.• 2+ years of experience in cloud computing concepts, particularly in Microsoft Azure, including storage solutions and compute capabilities.• 1+ years of Experience with programming languages such as Python or Scala.• 1+ years of experience in Salesforce, Message MQ, and MuleSoft• Strong analytical and problem-solving skills to address complex data challenges.• Ability to design and implement robust, scalable, and efficient data architectures.• Ability to provide excellent customer support; meticulous quality of work and work product. Primary Job Duties/ Tasks • Work with stakeholders and development team to determine project scope and vision, gather and prioritize collected requirements.• Designing and Implementing Data Architectures: Develop comprehensive data architectures that support the organization’s business goals, using Azure Synapse Analytics, Azure SQL, and other Azure data services.• Managing Dedicated SQL Pools: Efficiently manage and optimize Dedicated SQL Pools in Synapse to handle large-scale data warehousing and analytics workloads.• Database Design and Management: Design, implement, and manage databases using Azure SQL and Azure Managed Instance, ensuring high performance, availability, and security.• Data Integration and ETL Processes: Develop and manage ETL (Extract, Transform, Load) processes using Synapse Pipelines, ensuring efficient data flow from various sources to the data warehouse.• Data Governance and Cataloging: Implement data governance practices and manage the data catalog to ensure data quality, consistency, and accessibility.• Building and Maintaining Data Models: Create and maintain data models that accurately represent the data landscape, ensuring they are scalable and optimized for performance.• Ensuring Data Security and Compliance: Implement and oversee data security measures, ensuring compliance with legal and regulatory standards.• Maintain procedures manuals and system documentation.• Research software solutions to support recommendations, analyzing current and future technology trends. Thanks & Regards.!Satyajeet Kumar",
        "source": "Email",
        "date_posted": "2024-10-23 09:17:20-05:00",
        "unique_id": "192b9de190bc293e",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Azure Data Engineer"
    }
]