[
    {
        "company": "Smart IT Frame",
        "job_title": "Python Developer With Terraform",
        "location": "Pleasonton, CA, USA",
        "full_location": {
            "city": "Pleasonton",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Python",
                "Terraform"
            ],
            "primary": [
                "data analysis",
                "model development",
                "algorithm development",
                "documentation",
                "application performance monitoring"
            ],
            "secondary": [
                "training",
                "cross-functional collaboration",
                "data management best practices",
                "stakeholder engagement"
            ],
            "all": [
                "Python",
                "Terraform",
                "data analysis",
                "model development",
                "algorithm development",
                "documentation",
                "application performance monitoring",
                "training",
                "cross-functional collaboration",
                "data management best practices",
                "stakeholder engagement"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Boopathy Rajan",
        "email": "boopathy@smartitframe.com",
        "jd": "From: Boopathy, Smart IT Frame boopathy@smartitframe.com Reply to: boopathy@smartitframe.com HiGreetings from Smart IT Frame, Hope you are doing well!!! Smart IT Frame specializes in enabling you with your most critical line of resources. Whether it’s for permanent staffing, contract staffing, contract-to-hire or executive search, we understand the importance of delivering the most suitable talent; on time and within budget. With our Core focus in emerging technologies, we have provided global technology workforce solutions in North America, Canada & India. We take pride in delivering specialized talent, superior performance, and seamless execution to meet the challenging business needs of customers worldwide. Role: Python Developer With TerraformLocation: Pleasonton, CA (Hybrid)Mode of Hiring – ContractShift timing: 9AM – 6PM ResponsibilitiesDevelop and implement Python/Terraform.Analyze spatial data to identify patterns and trends that can inform business decisions.Collaborate with cross-functional teams to integrate data into existing systems and workflows.Provide technical expertise in the development of models and algorithms.Ensure the accuracy and quality of data through rigorous testing and validation.Create and maintain documentation for processes and methodologies.Oversee the deployment of solutions in a hybrid work environment.Conduct training sessions for team members on tools and techniques.Monitor and optimize the performance of applications.Stay updated with the latest advancements in technologies and methodologies.Contribute to the development of best practices for data management.Support the company's purpose by delivering insights that drive business growth and societal impact.Work closely with stakeholders to understand their needs and provide tailored solutions. --Thanks and RegardsBoopathy Rajan STalent Acquisition GroupEmail: boopathy@smartitframe.comSmart IT Frame LLC.",
        "source": "Email",
        "date_posted": "2024-10-24 14:29:19-05:00",
        "unique_id": "192c08f9da3414cb",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Python developer"
    }
]