[
    {
        "company": "3MK Software Solutions LLC",
        "job_title": "SAP Business Systems Analyst with SAP Manufacturing Domain Experience",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Open / hr"
        },
        "skills": {
            "core": [
                "Requirements gathering",
                "Business process modeling",
                "Data modeling",
                "Database design",
                "Documentation",
                "Report writing",
                "Microsoft Office Suite",
                "SQL",
                "Visio",
                "Power BI",
                "Python",
                "JIRA",
                "SharePoint"
            ],
            "primary": [],
            "secondary": [
                "SSIS",
                "SSRS",
                "Tableau"
            ],
            "all": [
                "Requirements gathering",
                "Business process modeling",
                "Data modeling",
                "Database design",
                "Documentation",
                "Report writing",
                "Microsoft Office Suite",
                "SQL",
                "Visio",
                "Power BI",
                "Python",
                "JIRA",
                "SharePoint",
                "SSIS",
                "SSRS",
                "Tableau"
            ],
            "with_experience": [
                "SQL"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Srikanth M",
        "email": "srikanth@3mkllc.com",
        "jd": "Hello,Greetings for the day!!!Please review the below roles and advise the best time to connect with you. If you are interested, you can reach me on Linkedin linkedin.com/in/srikanth-m-81a540302 and share resumes to srikanth@3mkllc.com Hiring: SAP Business Systems Analyst with SAP Manufacturing Domain Experience – US Citizens ONLY – 8 POSITIONSJob location: RemoteRate: Open / hrContract: Long Term Primary Skill:Requirements gathering, analysis, and interpretation.Business process modeling data modeling and database design.Documentation and report writing.Microsoft Office Suite SQL Visio Power BI Python JIRA SharePoint. Secondary Skills SSIS SSRS Tableau.Manufacturing Domain Experience is mandatoryThe Technical BA role driven by data warehousing and SQL WITH BA skills.This is a role on the BTS Data Warehouse team requires experience in crafting Business Requirement Documents, Functional Requirement Documents and Mapping documents for the development of ETL applications.This role requires extensive SQL experience in writing sophisticated queries across multiple tables' data analysis and profiling skills for the creation of the mapping documents and further discussion with data modelers for the vital table designs.The person should have all of the above skills at authoritative level along with strong verbal and written communication skills to work with various customers gather and formulate business requirements and translate the same to the technical team.The person with prior healthcare and data warehousing experience are preferred.The candidate required to support testing and production releases. Description:Extensive experience in multiple and diverse environments and applicationsKnowledge and experience in all major functions issues and considerations of the subject matter Resource has played a leadership role in establishing standards policies strategy.Ability to discuss industry and marketplace trends, directions, and site relevant case studies.Resource has had an influence on wide or high impact decisions and initiatives and has a theoretical background and understanding of subject is key to this role.Capable of handling diverse and sophisticated suite of projects simultaneously.Experience handling multi-functional projects project teams.",
        "source": "Email",
        "date_posted": "2024-10-23 16:22:30-05:00",
        "unique_id": "192bb62bd302d30c",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]