[
    {
        "company": "Teamware Solutions",
        "job_title": "EPM Project Manager",
        "location": "Bay area, FL, USA",
        "full_location": {
            "city": "Bay area",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party",
                "contract"
            ],
            "experience_required": "5+ years",
            "degree_required": "Bachelor’s degree in Business, Information Technology, Engineering, or related field; PMP or other project management certification preferred.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$65/hour"
        },
        "skills": {
            "core": [
                "Project Management",
                "Stakeholder Management",
                "Risk Management",
                "Budget Management",
                "Team Leadership"
            ],
            "primary": [
                "Communication Skills",
                "Analytical Skills",
                "Time Management",
                "Financial Acumen",
                "Proficiency with project management software"
            ],
            "secondary": [
                "EPM tools",
                "Microsoft Project",
                "JIRA",
                "Asana"
            ],
            "all": [
                "Project Management",
                "Stakeholder Management",
                "Risk Management",
                "Budget Management",
                "Team Leadership",
                "Communication Skills",
                "Analytical Skills",
                "Time Management",
                "Financial Acumen",
                "Proficiency with project management software",
                "EPM tools",
                "Microsoft Project",
                "JIRA",
                "Asana"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Suresh Babu",
        "email": "suresh.b@twsol.com",
        "jd": "From: Suresh Babu, Teamware Solutions suresh.b@twsol.com Reply to: suresh.b@twsol.com Position: EPM Project ManagerLocation: Travel to Bay area, Florida (Onsite)Job Description:The EPM Project Manager is responsible for managing and leading enterprise-wide projects from initiation to completion. This role requires a strategic approach to planning, executing, and delivering projects on time, within scope, and within budget while working with multiple stakeholders. The EPM PM plays a pivotal role in aligning project outcomes with business objectives and ensuring smooth coordination among teams.Key Responsibilities:Project Planning & Execution: Develop and manage detailed project plans, schedules, and deliverables, ensuring timely execution.Stakeholder Management: Collaborate with executives, department heads, and cross-functional teams to ensure alignment on project goals, objectives, and timelines.Risk Management: Identify potential risks and develop mitigation strategies to ensure project success. Monitor risk throughout the project lifecycle.Budget & Resource Management: Track and manage project budgets, ensuring resource allocation aligns with project priorities and goals.Communication: Maintain clear and consistent communication with stakeholders, providing regular updates on project status, issues, and changes.Team Leadership: Lead and motivate cross-functional teams, fostering collaboration and addressing any conflicts or challenges.Process Improvement: Continuously evaluate and improve project management processes and tools to increase efficiency and effectiveness.Compliance & Documentation: Ensure all project documentation is completed and maintained in accordance with company policies and regulatory requirements.Performance Tracking: Establish metrics and KPIs to measure project performance and success, ensuring projects meet or exceed expectations.Key Skills & Qualifications:Education: Bachelor’s degree in Business, Information Technology, Engineering, or related field; PMP or other project management certification preferred.Experience: 5+ years of project management experience, ideally with enterprise-wide projects involving multiple teams or departments.Technical Skills: Proficiency with project management software (e.g., Microsoft Project, JIRA, Asana, etc.); knowledge of EPM tools.Leadership Skills: Proven ability to lead, motivate, and manage project teams in a dynamic, fast-paced environment.Analytical & Problem-Solving Skills: Strong ability to identify issues and implement solutions proactively.Communication Skills: Excellent verbal and written communication skills with the ability to influence stakeholders at all levels.Time Management: Ability to prioritize, multitask, and manage time effectively to meet deadlines.Financial Acumen: Experience in managing project budgets and financial reporting. --“Email is the best way to reach me”Thanks & RegardsSuresh Babu | Talent AcquisitionTeamware Solutions Inc |8951 Cypress Waters Blvd, Suite #1092, Dallas Texas 75019 | : suresh.b@twsol.com LinkedIn : https://www.linkedin.com/in/lorvensureshbabu/",
        "source": "Email",
        "date_posted": "2024-10-24 12:20:21-05:00",
        "unique_id": "192bfab614a0c4e6",
        "emp_type": [
            "third party",
            "contract"
        ],
        "tag": "Project Manager"
    }
]