[
    {
        "company": "Pivotal",
        "job_title": "Business Analyst",
        "location": "Baton Rouge, LA, USA",
        "full_location": {
            "city": "Baton Rouge",
            "state": "LA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "3 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "Permanent",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analytics",
                "Requirements Gathering",
                "Project Management",
                "Business Process Reengineering"
            ],
            "primary": [
                "Agile Methodologies",
                "User Stories",
                "Jira",
                "Natural Resource Damage Assessment",
                "Oil Spill Response"
            ],
            "secondary": [
                "PMI-PBA certification",
                "CBAP certification",
                "Excellent written and verbal communication skills",
                "Waterfall",
                "DevOps",
                "Extreme Programming",
                "Rapid Application Development",
                "Agile Development"
            ],
            "all": [
                "Business Analytics",
                "Requirements Gathering",
                "Project Management",
                "Business Process Reengineering",
                "Agile Methodologies",
                "User Stories",
                "Jira",
                "Natural Resource Damage Assessment",
                "Oil Spill Response",
                "PMI-PBA certification",
                "CBAP certification",
                "Excellent written and verbal communication skills",
                "Waterfall",
                "DevOps",
                "Extreme Programming",
                "Rapid Application Development",
                "Agile Development"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Mayank Mer",
        "email": "mayank.mer@pivotal-technologies.com",
        "jd": "From: Mayank Mer, Pivotal mayank.mer@pivotal-technologies.com Reply to: mayank.mer@pivotal-technologies.com \" State client experience with Oil Spill Response \" Title: Business Analyst Duration: 02+ years with highly possible extension Location: Baton Rouge, LA (Remote) Visa: USC, GC, GCEAD, HAEAD State client experience with Oil Spill Response, Natural Resource Damage Assessment, and Restoration Project tracking systems and programs. The scope of the proposed services will include the following: Define and document business functions and processes; Analyze the integration of business functions with technology; Maintain a working knowledge of accounting, procurement, finance or contract management; Assist with business case development and business process reengineering; Consult with management and personnel to identify, define and document business needs and objectives, current operational procedures, problems, input and output requirements; Recommend new processes that yield operational efficiencies; Conduct cost-benefit analysis; Develop or assist with project work plans, project timelines; Develop or assist with ITBs, RFIs, RFRs, RFPs and contracts. The Business Analyst should be familiar with State of Louisiana procurement laws and procedures, and also have experience in developing technical specifications and negotiating with vendors to acquire IT assets. Expertise and/or relevant experience in the following areas are mandatory: Three (3) years of experience with Business Analytics processes including creating requirements and design documents and facilitating project related meetings with business partners. Expertise and/or relevant experience in the following areas are desirable but not mandatory: Minimum (one) 1-year experience working as a Business Analyst in an Agile Environment (Scrum, Kanban, etc.) Minimum (one) 1-year experience writing complete User Stories, including descriptions and acceptance criteria based on requirements gathering Familiarity with Business Process Re-Engineering (BPR) Familiarity with Jira Familiarity with Jama and/or Zephyr testing systems PMI-PBA or CBAP certification Excellent written and verbal communication skills Experience managing Projects utilizing Software Development methodologies such as but not limited to: Waterfall, DevOps, Extreme Programming, Rapid Application Development, Agile Development, etc. Experience with Oil Spill Response, Natural Resource Damage Assessment, and Restoration Project tracking systems and programs. Thanks & Regards, Mayank Mer Technical Recruiter",
        "source": "Email",
        "date_posted": "2024-10-23 15:28:01-05:00",
        "unique_id": "192bb3147962e953",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]