[
    {
        "company": "Tekinspirations",
        "job_title": "Business Systems Analyst",
        "location": "Schaumburg, IL, USA",
        "full_location": {
            "city": "Schaumburg",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "3-6 month contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "MDI platform experience",
                "Life Insurance Industry processes",
                "SSRS (SQL Server Reporting Services)",
                "ODBC Compliant reporting tool"
            ],
            "primary": [
                "Business applications development",
                "Policy Administration",
                "Accounting software",
                "Data analysis",
                "Project planning"
            ],
            "secondary": [
                "Insurance math",
                "Ad hoc queries",
                "Quality control standards",
                "Strategic thinking",
                "Quantitative analysis",
                "Qualitative analysis",
                "Insurance designations (e.g. FLMI, CLU, ChFC, CFA, CLTC)"
            ],
            "all": [
                "MDI platform experience",
                "Life Insurance Industry processes",
                "SSRS (SQL Server Reporting Services)",
                "ODBC Compliant reporting tool",
                "Business applications development",
                "Policy Administration",
                "Accounting software",
                "Data analysis",
                "Project planning",
                "Insurance math",
                "Ad hoc queries",
                "Quality control standards",
                "Strategic thinking",
                "Quantitative analysis",
                "Qualitative analysis",
                "Insurance designations (e.g. FLMI, CLU, ChFC, CFA, CLTC)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Akash Sharma",
        "email": "akash.s@tekinspirations.com",
        "jd": "From: Akash Sharma, Tekinspirations akash.s@tekinspirations.com Reply to: akash.s@tekinspirations.com Title: Business Systems Analyst (1)Location: Schaumburg, IL (On-Site)Duration: 3-6 month Contract MOI: SkypePlease share DL Visa and LinkedIn at the submission timeBSA with MDI platform experience.Overview:The Business Systems Analyst is focused on the development, integration and support of our business applications for Policy Administration and Accounting software. They will assist the team with the migration to our new applications and then monitor and maintain systems going forward. Must have a strong understanding of Life Insurance Industry processes and procedures. Working knowledge of developing reporting solutions using SSRS (SQL Server Reporting Services) within a SAAS environment. Experience with ODBC Compliant reporting tool is a HUGE PLUS. Requirements:A. Must have a strong product knowledge of life insurance and annuity contracts inclusive of insurance math, specifically life insurance and annuities.B. Must have prior experience working with MDI platform (FIMMAS)C. Focus on the development, integration and support of the business applications for Policy Administration and Accounting software. • Subject matter expert or “super user” for our technology systems.- MDI • Assists team members in the updating and refinement of business requirements. • Assist the team with migration to new applications and then monitor and maintain systems going forward.• Develop a project plan for training, product implementation or projects related to new life insurance or annuity products. • Solve complex problems using data, facts, and situations requiring analysis interpretations and comparisons on a range of options and recommending decisions on the most appropriate approach.D. Create ad hoc queries for reports to address business needs of other departments.E. Create and maintain all standardized reports as requested to each department weekly.F. Provide all standardized reports per schedule to each department weekly G. Maintain nightly reports and determine if all information has been accepted and useableH. Actively participate in project weekly meetings and discussions with Management team.• Review and translate client business strategies, objectives into business requirements for new or enhanced functionality and design a systems approach.• Understand modification requirements for clients.• Research and write detailed business specifications for FIMMAS system modifications.• Research and write detailed technical specifications for developers.• Solve complex problems using data, facts, and situations requiring analysis interpretations and comparisons on a range of options and recommending decisions on the most appropriate approach.I. Work closely with developers and testers to test features and identify and resolve issues.J. Ensure quality control standards for all projects for the client through developing testing requirements.K.. Participate in requirements, estimations, and objectives of solicitations (e.g., RFQs, RFPs, RFIs).L. Demonstrated ability to think strategically, identify and solve difficult business problemsM. Strong quantitative and qualitative analysis skills\\N. Ability to gather, synthesize and analyze data and draw logical conclusionsO. Ability to express oneself clearly and concisely, both verbally and in writingP. Insurance designations (e.g. FLMI, CLU, ChFC, CFA, CLTC, etc.) is Huge plus",
        "source": "Email",
        "date_posted": "2024-10-23 09:57:57-05:00",
        "unique_id": "192ba56d2de54152",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]