[
    {
        "company": "Centraprise",
        "job_title": "Sr GCP Architect",
        "location": "Issaquah, WA, USA",
        "full_location": {
            "city": "Issaquah",
            "state": "WA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "GCP Infra Hands on Architecting",
                "GCP Devops Hands on Architecting",
                "GCPs API"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "GCP Infra Hands on Architecting",
                "GCP Devops Hands on Architecting",
                "GCPs API"
            ],
            "with_experience": []
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Basavaraj",
        "email": "basavaraj@centraprise.com",
        "jd": "From: Basavaraj, Centraprise basavaraj@centraprise.com Reply to: basavaraj@centraprise.com Hi Team, Greetings from Centraprise,Role: - Sr GCP Architect Location – Issaquah, WA - Day 1 OnsiteNOTE: LinkedIn & Passport Number Is Must Job Description:What are the top 3 skills required for this role? 1. GCP Infra Hands on Architecting 2. GCP Devops Hands on Architecting3. GCPs APIJob DescriptionLead the design and architecture of scalable and secure GCP cloud solutions.Oversee the implementation of cloud infrastructure, ensuring optimal performance and reliability.Provide technical guidance and support to development teams on GCP best practices.Collaborate with stakeholders to understand business requirements and translate them into technical solutions. Manage cloud billing and optimize costs through effective resource management. Implement and manage IAM/Cloud Identity to ensure secure access and compliance.Utilize GCPs Operations Suite to monitor and maintain the health of cloud environments. Design and deploy load balancers to ensure high availability and fault tolerance. Configure and manage Compute Engine instances for various workloads. Develop and maintain APIs using GCPs API Management/Market Place. Implement VPCs to ensure secure and efficient network communication. Utilize Cloud Storage for scalable and durable data storage solutions. Develop serverless applications using Cloud Functions. Ensure compliance with security standards and best practices. Provide training and mentorship to junior team members. Stay updated with the latest GCP technologies and trends to continuously improve solutions. Contribute to the companys strategic goals by delivering innovative cloud solutions.Thanks & RegardsBasavaraj | Talent Acquisition AssociateCentraprise Corp33 Wood Avenue South, Suite 600, Iselin NJ 08830Desk : 848-209-8309Email: basavaraj@centraprise.comConnect me on LinkedIn: linkedin.com/in/basavaraj-n-methre-720b55223",
        "source": "Email",
        "date_posted": "2024-10-23 12:19:02-05:00",
        "unique_id": "192ba83da02a6595",
        "emp_type": [
            "third party"
        ],
        "tag": "GCP Data Engineer"
    }
]