[
    {
        "company": "Web Geo Solutions, LLC",
        "job_title": "Project Director",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "NCDHHS - TCLI Project Director (749491)",
            "experience_required": "At least 7 years of project management experience",
            "degree_required": "PMP certification and/or advanced degree in Business, Public Health or Mental Health",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months+",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Agile Development",
                "Risk Management",
                "Communication Skills",
                "Healthcare Systems Implementation"
            ],
            "primary": [
                "Data Collection",
                "Goal Setting",
                "Decision Making",
                "Project Management Tools",
                "Application Acceptance Testing",
                "MS Office"
            ],
            "secondary": [
                "PMP Certification",
                "Presentation Skills",
                "Training Skills",
                "Oral Communication Skills",
                "Written Communication Skills",
                "Quality Control",
                "Business Policy Knowledge",
                "ADA Knowledge",
                "Olmstead Decision Knowledge"
            ],
            "all": [
                "Project Management",
                "Agile Development",
                "Risk Management",
                "Communication Skills",
                "Healthcare Systems Implementation",
                "Data Collection",
                "Goal Setting",
                "Decision Making",
                "Project Management Tools",
                "Application Acceptance Testing",
                "MS Office",
                "PMP Certification",
                "Presentation Skills",
                "Training Skills",
                "Oral Communication Skills",
                "Written Communication Skills",
                "Quality Control",
                "Business Policy Knowledge",
                "ADA Knowledge",
                "Olmstead Decision Knowledge"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Dheeraj",
        "email": "recruiter11@webgeosolutions.com",
        "jd": "Greetings from Web Geo Solutions, LLC. We have an exciting new job opportunity with our direct client, matching your skills. Please review the job description and respond with all the requested details if you are interested. Job Details JOB ID: NCDHHS - TCLI Project Director (749491) Client: State of NC Last day to apply: 10/28 Initial Term: 12 Months+ Tentative start date: ASAP Interview mode: Webcam/In-Person Work location: Remote Job Description: The NC Department of Health and Human Services (DHHS) is seeking a Project Director to support and manage the day-to-day activities in planning and administering the statewide effort of the Transitions to Community Living Initiative (TCLI) as mandated by the US Dept. of Justice and State of NC Voluntary Settlement Agreement dated August 23, 2012. This role serves at a senior level as a member of the leadership team and is responsible for leading and providing project management for the entire program. Job responsibilities include the following: • Manage the day-to-day implementation of all sections of the settlement depending upon the scope and complexity of the work and as delegated by the Special Advisor on ADA • Serve in the capacity of the Special Advisor on ADA in their absence • Direct other managerial, professional and support staff in the delivery of services in the assigned units and program areas of DHHS as their duties pertain to the Olmstead Plan and TCLI Settlement, and act with full delegated authority • Develop goals and objectives collaboratively with team leads from the various divisions within the DHHS and among external partners involved in the TCLI • Transition team requirements as outlined in the TCLI Settlement • Work within a complex matrix of resources, including both personnel and monetary and pre-determined requirements to fulfill the settlement agreement • Provide day to day leadership in developing and maintaining involvement and cooperation with both the public and private sector components of the delivery system This position requires a valid driver's license and travel throughout the 100 counties in the State and occasional overnight travel. The person must demonstrate an extensive track record managing projects delivering large projects within a complex, matrix organization. Must have excellent communications skills, must be well organized and exhibit excellent follow-up and follow-through skills. Position duties include but are not limited to the following: • Provide leadership in managing a large scale, complex project using best practices. • Knowledge and competency in the project schedule building process, including techniques for estimation, developing contingency. • Manage the critical day-to-day operational elements of assigned project including: project goals/objectives, financials, scope, quality, schedule, resourcing, vendor management, dependencies, risks, status reporting, stakeholder engagement, business readiness/organizational change management, value realization necessary to deliver specified requirements, objectives and value. • Document the project charter, roles, tasks and measures of success. • Provide leadership by facilitating project definition, planning, budgeting, scheduling and resource planning to accomplish project objectives while managing applicable scope, quality, time and cost constraints. • Provide leadership and support for both project team and business partners while working cross-functionally to solve problems and implement changes and ensure appropriate and professional communication among stakeholders. • Manage projects throughout the project lifecycle. Evaluate progress and quality, manage issue resolution process and take corrective action, as necessary. • Ensure adherence to DHHS IT Division Project Management Office and other applicable state/federal policies and procedures. • Develop quality business relationships so that client needs can be anticipated and addressed. • Proactively develop innovative approaches, risk mitigation strategies and quality control. • Actively engage in development or oversight of the development of all documentation for project. The position requires the ability to work well in a team environment, as well as skills to facilitate communication, team focus, influence, service-oriented, problem-solving, analytic thinking, planning, personal development and decisiveness. Using these attributes, the candidate will communicate individual roles and project/program expectations for both internal and external teams, develop detailed project plans and schedules, provide work direction and leadership to assigned projects or programs including sub projects and at times, individual project members; including scheduling, assignment of work and review of project efforts using a strong blend of Project Management business analysis and technical experience. This position also monitors and audits project or program milestones and critical dates to identify potential jeopardy of project schedule and identifies ways to resolve schedule issues, provides required project status reporting, assesses variances from the project plan, gathers metrics, and develops and implements changes as necessary to ensure that the project remains within specified scope and is within time, cost, and quality objectives.",
        "source": "Email",
        "date_posted": "2024-10-24 14:25:26-05:00",
        "unique_id": "192c0f98faa604e2",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]