[
    {
        "company": "DMS Visions INC",
        "job_title": "Azure Cloud Technical Lead",
        "location": "Boston, MA, USA",
        "full_location": {
            "city": "Boston",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Bachelor’s in Computer Science, Data Science, Math or related discipline",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ Months Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Microsoft Azure",
                "Google Cloud",
                "Data Factory",
                "Python",
                "Terraform"
            ],
            "primary": [
                "GitHub",
                "PowerBI",
                "SQL",
                "Informatica",
                "Data Quality",
                "Data Cataloging",
                "MDM",
                "Databricks"
            ],
            "secondary": [
                "R",
                "SAS programming",
                "Linux",
                "Kubernetes"
            ],
            "all": [
                "Microsoft Azure",
                "Google Cloud",
                "Data Factory",
                "Python",
                "Terraform",
                "GitHub",
                "PowerBI",
                "SQL",
                "Informatica",
                "Data Quality",
                "Data Cataloging",
                "MDM",
                "Databricks",
                "R",
                "SAS programming",
                "Linux",
                "Kubernetes"
            ],
            "with_experience": [
                "Microsoft Azure (3+ years)",
                "Google Cloud (3+ years)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Abhishek Yadav",
        "email": "abhishek@dmsvisions.com",
        "jd": "From: Abhishek Yadav, DMS Visions INC abhishek@dmsvisions.com Reply to: abhishek@dmsvisions.com Hi,Hope you are doing well !!I have an urgent position. Kindly go through the Job description and let me know if this would be of interest to you. Job Title: Azure Cloud Technical LeadLocation: Boston, MA (Onsite from day 1)Duration: 6+ Months Contract ****While sharing resume mention consultant location and visa status*** Job Description: Need Only LOCAL candidates. Primary ResponsibilitiesSolution DeliveryLead small-to-mid-size projects to scope, design and implement for US-based needs.Business Analysis: Gathering local requirements and documenting to facilitate implementation of requested changes or propose new solutions.Technical: Leverage hands-on technical skills to translate requirements to solutions on a technical stack that currently includes Microsoft Azure, Data Factory, Python, Terraform, GitHub, PowerBI, as well as GCP hosted SAS, Posit RStudioYou will be involved in all technical aspects of the product teamwork, including code practices, solution design, data sourcing, engineering, etc.Data Platform OperationsIdentify and facilitate local issues, in order to provide the most appropriate answersMaintain the data ecosystem in an optimal operational state following established standards and processes, with mindset of continuous improvementEnsure security, privacy, and compliance of data and processes in a highly regulated environment (eg. clinical and patient data)Work collaboratively and influentially in a cross-functional global environmentKeep current with and leverage latest data technologies and concepts, and contribute to stakeholder roadmapsEducation and Required SkillsRequired:Must have 5+ years’ experience, with 3+ years’ experience in cloud data platforms, reporting, and advanced analyticsMust have proven experience with Microsoft Azure or Google CloudStrong listening and communication skills, ability to work in global environmentSolution-oriented critical-thinker, agile mindsetPreferred:Bachelor’s in Computer Science, Data Science, Math or related disciplinePreference for cloud certifications, especially Azure or Google Cloud CertificationsPreference for Pharmaceutical industry experiencePreference for technical experience with some of the following: Sql, Informatica, Data Quality and Data Cataloging, MDM, DatabricksHelpful to have any of the following: R, Python, SAS programming, Linux, Kubernetes If you are interested, please share your updated resume and suggest the best number & time to connect with you. Thanks & Regards, Abhishek YadavDMS Vision Inc. | http://dmsvisions.com/4645 Avon Lane, Suite 210, Frisco, TX 75033Email: abhishek@dmsvisions.com | Phone : 972-645-5314 | EXT - 103",
        "source": "Email",
        "date_posted": "2024-10-24 15:37:00-05:00",
        "unique_id": "192c061701fb9387",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Azure Data Engineer"
    }
]