[
    {
        "company": "CompuSoft Integrated Solutions, Inc.",
        "job_title": "Business Analyst",
        "location": "New Jersey, USA",
        "full_location": {
            "city": "New Jersey",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Excellent communication skills",
                "Customer service skills",
                "Experience with developing systems via a structured SDLC methodology",
                "Experience with testing, training and user support",
                "Ability to analyze and document complex business processes and work flows"
            ],
            "primary": [
                "Ability to gather data via diverse means",
                "Ability to document storyboards, wireframes, system flows, interfaces, use cases, and business rules"
            ],
            "secondary": [
                "Excellent Verbal and Written Communication skills",
                "Ability to interpret relevant information"
            ],
            "all": [
                "Excellent communication skills",
                "Customer service skills",
                "Experience with developing systems via a structured SDLC methodology",
                "Experience with testing, training and user support",
                "Ability to analyze and document complex business processes and work flows",
                "Ability to gather data via diverse means",
                "Ability to document storyboards, wireframes, system flows, interfaces, use cases, and business rules",
                "Excellent Verbal and Written Communication skills",
                "Ability to interpret relevant information"
            ],
            "with_experience": []
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "",
        "email": "dev@compusoft-is.com",
        "jd": "From: Dev, CompuSoft Integrated Solutions, Inc. dev@compusoft-is.com Reply to: dev@compusoft-is.com Title: Business AnalystLocation: New Jersey (Need Only Locals)Short Description:Full-time professional information technology project development work experience and/or function/business process analysis work experience. Develop workflows, requirements, QC testing and production support for projects. Complete Description:NOTE: Work will be on-site 2 days per week, and, remote 3 days per week. No exceptions. Please provide Local candidates.Excellent Verbal and Written Communication skills Required.This position will require the BA to work in an agile environment with other teams and IT developers to lay out and design the portal structure for the Judiciary Enterprise Portal system, the Enterprise Single Sign On system, and any other enterprise feature that would require users to interact with any system or feature within the Enterprise Portal.The BA will be required to:- Write User Stories/Requirements- Track User Stories/Requirements- Create User Interface Mockups- Test- Support production issuesSkills Required:- Excellent communication and customer service skills- Experience with developing systems via a structured SDLC methodology- Experience with testing, training and user support- Ability to analyze and document complex business processes and work flows, and propose areas for improvement- Ability to gather data via diverse means (i.e. interviews, observation, surveys, existing written documentation) and interpret relevant information- Ability to document storyboards, wireframes, system flows, interfaces, use cases, and business rules.",
        "source": "Email",
        "date_posted": "2024-10-23 12:47:40-05:00",
        "unique_id": "192ba9e127c73883",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]