[
    {
        "company": "Panzer Solutions LLC",
        "job_title": "Angular Developer",
        "location": "Fort Worth, TX, USA",
        "full_location": {
            "city": "Fort Worth",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "4+ years",
            "degree_required": "Bachelor's degree in Computer Science, Computer Engineering or equivalent experience/training",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$50/hr on C2C"
        },
        "skills": {
            "core": [
                "Angular",
                "Java",
                "Microservice framework",
                "REST",
                "Spring Framework"
            ],
            "primary": [
                "Kubernetes",
                "Docker",
                "Full Stack Development",
                "J2EE technologies",
                "Agile methodologies"
            ],
            "secondary": [
                "TDD",
                "BDD",
                "Object-oriented design",
                "DevOps",
                "Linux/Unix shell Scripting",
                "IBM MQ",
                "Rabbit MQ",
                "Redis Cache",
                "Git",
                "Maven",
                "JUnit",
                "Mockito",
                "GitHub",
                "Azure DevOps",
                "Azure Data explorer",
                "Elastic Search"
            ],
            "all": [
                "Angular",
                "Java",
                "Microservice framework",
                "REST",
                "Spring Framework",
                "Kubernetes",
                "Docker",
                "Full Stack Development",
                "J2EE technologies",
                "Agile methodologies",
                "TDD",
                "BDD",
                "Object-oriented design",
                "DevOps",
                "Linux/Unix shell Scripting",
                "IBM MQ",
                "Rabbit MQ",
                "Redis Cache",
                "Git",
                "Maven",
                "JUnit",
                "Mockito",
                "GitHub",
                "Azure DevOps",
                "Azure Data explorer",
                "Elastic Search"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Mahesh Kumar",
        "email": "mahesh.kumar@panzersolutions.com",
        "jd": "From: Mahesh Kumar, Panzer Solutions LLC mahesh.kumar@panzersolutions.com Reply to: mahesh.kumar@panzersolutions.com Greetings from Panzer Solutions! I am a Certified LinkedIn Recruiter, and we have been serving clients and candidates in the industry for over a decade. Please review the requirements below and let me know if you are interested in exploring this opportunity further. Angular DeveloperLocation: Onsite --- Fort Worth, TXRate: $50/hr on C2C Note: Requires Onsite Interview Top Skills required;60% in Angular SPA development and 40% in Java development. (Angular 12 and above). Minimum Qualifications Education Prior Job ExperienceBachelor's degree in Computer Science Computer Engineering or equivalent experience/training4+ years of full Software Development Life Cycle SDLC experience designing developing and implementing large-scale applications in hosted production environments2+ years Microservice framework / REST development with Spring Framework Preferred Qualifications Education Prior Job Experience6+ years of full Software Development Life Cycle SDLC experience2+ years of Kubernetes Services with deep understanding of Container Orchestration and Distributed System ConceptsSkills Licenses CertificationsProficiency in Full Stack DevelopmentProficiency and demonstrated experience in the following technologies:J2EE technologies: Java11 JSP JMS JAXB JDBC EJBCloud-based development: Kubernetes and DockerWeb Servers: Tomcat WebSphereWeb Services: REST/SOAP JSON/WSDL/XMLFrameworks: Spring Framework Spring BootBuild/deployment tools: Maven Git Junit MockitoOther Dev Ops Toolchain: GitHub and Azure DevOps Azure Data explorer and Elastic SearchOther: Linux/Unix shell Scripting IBM MQ/Rabbit MQ Redis CacheExperience with TDD and BDD development patternProficiency in object-oriented design techniques and principlesExperience in Agile methodologies such as SCRUMExperience in DevOps Too Warmest Regards, Mahesh KumarTeam Lead - Talent AcquisitionPanzer Solutions -- National Technology AccountsHours of operation: Monday-Friday 9am-5pm ESTConnect with me: Email: mahesh.kumar@panzersolutions.com | LinkedInPanzer Solutions LLC | 50 Washington Street, 9th Floor, SONO Corporate Center | Norwalk CT 06850 📧 Email is the best way to reach meCelebrating 13 Years Notice of Confidentiality:The information contained herein is intended only for the confidential use of the recipient. If the reader of this message is neither the intended recipient, nor the person responsible for delivering it to the intended recipient, you are hereby notified that you have received this communication in error, and that any review, dissemination, distribution, or copying of this communication is strictly prohibited. If you receive this in error, please notify the sender immediately by telephone, and destroy this e-mail message OR reply with the subject \"REMOVE\" or \"Unsubscribe\" such that your email would be taken out of our distribution list. You can also forward your \"REMOVE\" or \"Unsubscribe\" emails to info@panzersolutions.com.",
        "source": "Email",
        "date_posted": "2024-10-03 10:23:31-05:00",
        "unique_id": "1925301a8e12adb1",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]