[
    {
        "company": "Neo Tech Solutions, Inc.",
        "job_title": "Java Technical Lead",
        "location": "Chicago, IL, USA",
        "full_location": {
            "city": "Chicago",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "2+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "SpringBoot",
                "MongoDB"
            ],
            "primary": [
                "IBM MQ",
                "Rabbit MQ",
                "Kafka",
                "Microservices"
            ],
            "secondary": [
                "Communication",
                "Collaboration",
                "Mentoring"
            ],
            "all": [
                "Java",
                "SpringBoot",
                "MongoDB",
                "IBM MQ",
                "Rabbit MQ",
                "Kafka",
                "Microservices",
                "Communication",
                "Collaboration",
                "Mentoring"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Venkat Ram",
        "email": "venkat@neotechusa.com",
        "jd": "From: Venkat Ram, Neo Tech Solutions, Inc. venkat@neotechusa.com Reply to: venkat@neotechusa.com Hi ,Hope you are doing wellPlease find the below Job Description and let me know if you are interested in applying for this position. Position: Java LeadDuration: 12 MonthsLocation: Chicago, IL (Hybrid) Job Description:Tech stack: Java/SpringBoot: Java - At least 2+ yrs hands-on experience in Java 8+ features.Spring boot - At least 2+ yrs hands-on experience in developing SpringBoot based Java apps/microservices. MongoDB: At least 2+ yrs of actual work experience.If MongoDB is the primary DB in last 2-3 projects ? IBM MQ/Rabbit MQ/Kafka: If the candidate has worked on Asynchronous systems like IBM MQ/Rabbit MQ/Kafka ?JD :-Java Microservices Dev Lead - Strong Microservices experience with Sprint Boot implementation and hands on knowledge and expertise in Mongo and MQStrong Java and Spring API Skills ExperienceBeing self-initiated and taking ownership of efforts.Communication and Collaboration with the product teams and the peer developers. Nice to have senior/lead developers experience with mentoring skills Roles :-Lead complex technology initiatives including those that are companywide with broad impact.Act as a key participant in developing standards and companywide best practices for engineering complex and large-scale technology solutions for technology engineering disciplines.Design, code, test, debug, and document for projects and programsReview and analyze complex, large-scale technology solutions for tactical and strategic business objectives, enterprise technological environment, and technical challenges that require in-depth evaluation of multiple factors, including intangibles or unprecedented technical factors.Make decisions in developing standard and companywide best practices for engineering and technology solutions requiring understanding of industry best practices and new technologies, influencing and leading technology team to meet deliverables and drive new initiatives.Collaborate and consult with key technical experts, senior technology team, and external industry groups to resolve complex technical issues and achieve goals. Lead projects, teams, or serve as a peer mentor. Required details for submissionFull Name: Email id:Contact Number:Current Location:Relocation:Interview Availability:Notice Period:Visa Status:Any Interviews in Pipeline:Any offers in Pipeline:Linked in: Pay rate: Thanks & RegardsVenkat RamTalent Acquisition Manager+1 (908) 864-9002venkat@neotechusa.comNeo Tech Solutions, Inc.Suite 204, 515 Plainfield Ave, Edison, NJ 08817",
        "source": "Email",
        "date_posted": "2024-10-03 09:52:30-05:00",
        "unique_id": "19252e3afcab5d76",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]