[
    {
        "company": "Sonitalent Corp",
        "job_title": "Project Manager",
        "location": "Boston, MA, USA",
        "full_location": {
            "city": "Boston",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5-8 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 Months+",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Network Implementation",
                "Technical Specifications",
                "Stakeholder Management",
                "Project Governance"
            ],
            "primary": [
                "IT Project Management",
                "Cross-Functional Collaboration",
                "Communication Skills",
                "Analytical Skills",
                "Leadership"
            ],
            "secondary": [
                "PMP Certification",
                "Government Experience",
                "Process Redesign",
                "Presentation Skills",
                "Negotiation Skills"
            ],
            "all": [
                "Project Management",
                "Network Implementation",
                "Technical Specifications",
                "Stakeholder Management",
                "Project Governance",
                "IT Project Management",
                "Cross-Functional Collaboration",
                "Communication Skills",
                "Analytical Skills",
                "Leadership",
                "PMP Certification",
                "Government Experience",
                "Process Redesign",
                "Presentation Skills",
                "Negotiation Skills"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Shubhra Soni",
        "email": "shubhra.soni@sonitalentcorp.com",
        "jd": "Hope you are doing well,We are looking for Project Manager if you are interested kindly send me your updated resume. Job Title – Project Manager Job Location -Boston, MA – Hybrid Onsite from day one - Need to be local Duration - 6 Months+ Mode Of Interview - Phone/Skype Note - Need LinkedIn Job Description – EOTSS for 8+ months and is a hybrid role with onsite and remote. Looking for someone that is local to MA. Technical PM if infrastructure and Network exp. Network implementation exp EOTSS is seeking a dedicated and skilled individual to join our team as a Senior Technical Project Manager (Contract Role). Reporting to the Enterprise PMO Director and receiving guidance from the PMO Director and Director of Enterprise Technology Planning and Logistics, the Senior Technical Project Manager – Enterprise PMO will play a crucial role in monitoring and ensuring the success of large-scale capital technology projects supporting the One Network Program across multiple agencies and secretariats. One Network is a cross-secretariat program involving all Executive Branch state agencies aimed at folding all secretariats and agencies into a single core network operated by EOTSS. The core network serves as the foundation for all Commonwealth information services including e-mail, data center operations, network communications, business applications, and internet services. The Senior Technical Project Manager will be responsible to oversee the successful delivery of a large-scale capital technology project under the One Network program to ensure proper structure, alignment with goals, and adherence to timelines and budgets while ensuring collaborative cross-functional strategic planning and management of project performance reporting. H/She will identify project's goals, objectives, and scope and create project plans that outline the tasks, timelines, and resources required. The primary work location for this role will be 1 Ashburton Place, Boston, MA, 02108. The work schedule for this position is Monday through Friday, 9:00AM to 5:00PM. This position would be expected to follow a hybrid model of reporting to work that combines in-office workdays and work from home days as needed. Duties and Responsibilities: • Act a single point of contact for the implementation of the MEP systems and subsequent high-level design of the facility converged network to support MEP control system connectivity for the new Veterans/Soldiers Home in Holyoke, MA (Veterans/Soldiers Home) collaborating with various cross functional teams, agency lead PM, and vendor. • Create and maintain project documentation for tactical planning and communication, and high-level presentations for executive-level share-outs. • Elicit and translate business requirements from RFR or submittals into technical specifications and document project scope documentation. • Ensure that the project has detailed project plans, work breakdown structures, project checklists, and budgets to meet established time frames that are aligned with available/approved financing, and staffing availability. • Develop reports as needed and communicate proactively project progress and report out any potential problems before they occur to the appropriate individuals and groups – customer and EOTSS – at the appropriate level of detail and at the appropriate time. • Facilitate and communicate project team meetings and manage project risks, issues, and changes, and develop contingency plans to mitigate risks by providing detailed summaries and next steps to ensure smooth project execution. • Facilitate post project retrospective to assess if desire goals where achieved and ability to explain why or why not, as well as mitigations. • Work closely with the internal Strategy & Planning Team to align project goals with overall strategies and priorities and support the PMO roadmap implementation plan including developing processes and tools to maintain PMO processes and standards. Preferred Knowledge, Skills, and Abilities: • Minimum of five (5-8) years of experience in project management, with proven experience supporting complex, cross-functional IT and network implementation projects with a diverse set of stakeholders. • Familiarity with information technology concepts, systems, network, and solutions, with the ability to understand and communicate technical requirements and challenges effectively. • Strong understanding of project management methodologies, tools, and techniques. • Excellent communication, and interpersonal skills, with the ability to prepare and deliver clear and concise presentations, recommendations, manage and negotiate effectively at all levels including senior level management. • Ability to handle multiple, concurrent priorities with little or no direction, and meet established timeline. • Strong stakeholder management experience, including the ability to work across the organization and interact, influence, manage and negotiate effectively at all levels including senior level management. • Demonstrated leadership with strong organizational and analytical skills with attention to detail, process redesign experience highly desired. • Knowledge of project governance frameworks and best practices, including project oversight, decision-making structures, and accountability mechanisms. • Government or public sector environment experience is a plus. • PMP Certification or equivalent project management certification is a plus.",
        "source": "Email",
        "date_posted": "2024-10-03 15:44:38-05:00",
        "unique_id": "19254211959adff9",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]