[
    {
        "company": "Parin Technologies LLC",
        "job_title": "Senior Software Architect",
        "location": "Indianapolis, IN, USA",
        "full_location": {
            "city": "Indianapolis",
            "state": "IN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "4 year applicable degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 months+",
            "rate": "$55 - $64.97 on W2 OR $68 - 80/hr on C2C"
        },
        "skills": {
            "core": [
                "Core Java",
                "Java EE",
                "Spring MVC Framework",
                "Spring Core",
                "Spring Security"
            ],
            "primary": [
                "Collections",
                "Lambdas",
                "Streams",
                "Concurrency best practices",
                "Migration of applications to AWS",
                "IDE like Eclipse/IDEA/Netbeans",
                "XML Documents",
                "JSON documents",
                "Design Patterns",
                "Data Structures and Algorithms",
                "JDBC",
                "REST/SOAP API Clients",
                "Weblogic",
                "Docker",
                "Kubernetes",
                "Cloud Services like AWS/Azure",
                "Oracle PL/SQL",
                "Agile Scrum Development",
                "Maven build tools"
            ],
            "secondary": [
                "Vue.js",
                "React",
                "Angular JavaScript framework",
                "jQuery",
                "CSS Frameworks like Bootstrap",
                "Selenium automation",
                "Linux server configuration",
                "Web Application server-side Configuration"
            ],
            "all": [
                "Core Java",
                "Java EE",
                "Spring MVC Framework",
                "Spring Core",
                "Spring Security",
                "Collections",
                "Lambdas",
                "Streams",
                "Concurrency best practices",
                "Migration of applications to AWS",
                "IDE like Eclipse/IDEA/Netbeans",
                "XML Documents",
                "JSON documents",
                "Design Patterns",
                "Data Structures and Algorithms",
                "JDBC",
                "REST/SOAP API Clients",
                "Weblogic",
                "Docker",
                "Kubernetes",
                "Cloud Services like AWS/Azure",
                "Oracle PL/SQL",
                "Agile Scrum Development",
                "Maven build tools",
                "Vue.js",
                "React",
                "Angular JavaScript framework",
                "jQuery",
                "CSS Frameworks like Bootstrap",
                "Selenium automation",
                "Linux server configuration",
                "Web Application server-side Configuration"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Panchdev Pathak",
        "email": "panchdev@parintec.com",
        "jd": "Hello Professional,This is Panchdev from Parin Technologies LLC. Just came across your profile on one of the job portals and just wanted to check if you might be interested in the position below. In case you are available and interested please share your most recent resume and reply to me at your earliest.NOTE (FOR RECRUITERS) READ CAREFULLYManager prefers local candidates only but will consider non-local candidates if no viable local candidate is identified. Non-local candidates must be open to relocate to work onsite 3 days per week.Initial 30-45 minute phone screen followed by a required 90 minute technical in-person interview.Selected candidates will be required to complete a Tax Disclosure form prior to onboarding. Please confirm the resource understands this requirement.Rate: $55 - $64.97 on W2 OR $68 - 80/hr on C2CTitle: Senior Software Architect Location: Indianapolis, IN 46241 Hybrid - Onsite 3 days/weekDuration: 6 months+Interview: Phone and 2nd round In-person Interview Job DescriptionArchitect, design & develop scalable architecture systems for Java-based applications. Build and maintain highly complex, high-volume, scalable, maintainable and extensible software on a Java/J2EE application stack using full software development.POSITION AND EXPERIENCE DESCRIPTIONProvides architectural and big picture oversight for development of new or enhanced software products. Responsible for ensuring quality and consistency of the software architecture across the system and providing day-to-day technical guidance to the development teams. Defines the system, technical, and application architectures for major areas of development and recommends courses of action to maintain cost effectiveness and competitiveness. Stays up to date on business initiatives and objectives, particularly as these relate to infrastructure and development architecture issues. Researches and implements best practices frameworks/capability models that will control costs, provide higher quality, and/or increase predictability of service delivery. Researches new technology and development tools to remain abreast of current and emerging technology.4 year applicable degree,10+ years of experience with designing, developing, implementing, and maintaining Java-based software and applications, contributing to all stages of the software development lifecycle. SKILL MATRIX SkillRequired / DesiiredYears RequiredYears UsedLast UsedStrong record of successful architecture, design and delivery across large scale software systems with a successful track record of delivery.Required5 Core Java and Java EE including but not limited to usage of Collections, Lambdas, Streams, and Concurrency best practicesRequired10 Spring MVC Framework, Spring Core, Spring Security, Sprint Data PersistenceRequired5 Migration of applications to AWS, improving scalability and performanceRequired2 IDEs like Eclipse/IDEA/NetbeansRequired10 XML Documents, XML Schemas, JSON documentsRequired5 Design Patterns, Data Structures and Algorithms, JDBCRequired10 Vue.js/React/Angular JavaScript framework, jQuery, Java scriptRequired5 CSS Frameworks like Bootstrap, Angular or similarRequired4 REST/SOAP API Clients and Web ServicesRequired5 Weblogic or similar App/web server administrationRequired2 Containerization platform using Docker/KubernetesRequired2 Working knowledge of Cloud Services like AWS/AzureRequired2 Oracle PL/SQL and ability to develop and use stored proceduresRequired2 Delivery using Agile Scrum Development frameworkRequired5 Maven build toolsRequired2 Selenium automationHighly desired2 Linux server configuration and management, Linux scriptingHighly desired2 Web Application server-side Configuration and DeploymentHighly desired2",
        "source": "Email",
        "date_posted": "2024-10-03 13:49:12-05:00",
        "unique_id": "19253b65ee0485d5",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]