[
    {
        "company": "Maintec",
        "job_title": "SAP HCM Project Manager",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Senior Level, 8 Years Of Experience In Sap Project Management",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SAP Core Project Management Skills",
                "SAP HCM PROJECT MANAGEMENT EXPERIENCE",
                "JIRA PROJECT MANAGEMENT TOOL EXPERIENCE"
            ],
            "primary": [
                "Experience With Pm Tools",
                "Effective At Collaborating With Stakeholders And Partners",
                "Develop Comprehensive Project Plan",
                "Conduct Effective Meetings With Project Plans",
                "Change Management",
                "Develop Weekly Reports"
            ],
            "secondary": [
                "Experience With In-House And Vendor Implementations",
                "Knowledge On Agile Development Methodology"
            ],
            "all": [
                "SAP Core Project Management Skills",
                "SAP HCM PROJECT MANAGEMENT EXPERIENCE",
                "JIRA PROJECT MANAGEMENT TOOL EXPERIENCE",
                "Experience With Pm Tools",
                "Effective At Collaborating With Stakeholders And Partners",
                "Develop Comprehensive Project Plan",
                "Conduct Effective Meetings With Project Plans",
                "Change Management",
                "Develop Weekly Reports",
                "Experience With In-House And Vendor Implementations",
                "Knowledge On Agile Development Methodology"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Arun Kumar",
        "email": "arun.p@maintec.com",
        "jd": "From: Arun, Maintec arun.p@maintec.com Reply to: arun.p@maintec.com Hi ,We have a position open for our client , please have a look into the job description below and share me your updated resume . Job Role : SAP HCM Project Manager Location : REMOTE 10+ Years of profiles Needed MUST HAVE: SAP Core Project Management Skills, Experience With Pm Tools, Effective At Collaborating With Stakeholders And Partners To Facilitate Business Requirements, Project Scope, User-Acceptance Testing Plan Scenarios, And Lessons Learned. Develop Comprehensive Project Plan Working A Vendor And Dependencies, Conduct Effective Meetings With Project Plans, Change Management, Develop Weekly Reports Catered Towards Project Team, Executives And Steering Committee Meetings. Have Experience With In-House And Vendor Implementations. MUST TO HAVE: SAP HCM PROJECT MANAGEMENT EXPERIENCE, JIRA PROJECT MANAGEMENT TOOL EXPERIENCE. EXPERIENCE LEVEL: Senior Level, 8 Years Of Experience In Sap Project Management ONSHORE LOCATION: Candidate Is Expected To Adhere To Up Working Schedule And Be Onsite For Collaboration Sessions And Steering Committee Meetings. DESIRED PROFILE: Lead And Implement Various Projects Stemming From HR Technology Initiatives And Enhancements, Which Influence Our Employee's Experience.Identifying And Negotiating Project Goals, Objectives And Success Measures And Tracking To Ensure We Deliver Excellence.Partner With Tech, HR And Vendor To Project Handle And Implement Business Process Changes To HR Including ON-PREMISES And Cloud Applications, Resulting From Strategic Business Initiatives And Process Improvement Opportunities.Lead And Support Major Company And Hr Initiatives Such As Quarterly Release, Activation Of New Cloud Functionality, Mobile Application Deployment, SAP HCM Components And Business Intelligence (BI) Systems Changes By Providing Consultation And Domain Expertise.Lead The Evaluation, Development, And Implementation Of Additional HR Projects, Including Strategic Or Process Improvement Initiatives, Which Have Business Unit Wide Impact.Identify, Lead, And Direct Multi-Functional Teams To Address Issues, Solve Problems And Resolve Major Or Complex Issues.Support Senior Project Managers In The HR PROJECT MANAGEMENT ORGANIZATION (PMO) On Larger Enterprise-Wide Strategic Initiatives.Handle Fit/Gap Analysis Process And Assessments To Ensure Identification Of Any Functionality Gaps Between The Business Requirements And Current System Functionality.Stay Up To Date With The Latest Developments In HR Technology And How It Can Be Demonstrated At SCEKnowledge On Agile Development Methodology Is A Plus Thank You & Regards,Arun Kumar / Sr. US IT Recruiter",
        "source": "Email",
        "date_posted": "2024-10-03 08:01:18-05:00",
        "unique_id": "192527bca62646a4",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]