[
    {
        "company": "NorthITe",
        "job_title": "Senior .NET Full Stack Developer",
        "location": "Water Street, NY, USA",
        "full_location": {
            "city": "Water Street",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "12+ years",
            "degree_required": "BS or MS degree in Computer Science or Information Technology",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".NET",
                ".NET Core",
                "Angular",
                "Cloud-based technologies",
                "RDBMS"
            ],
            "primary": [
                "Docker",
                "Kubernetes",
                "Continuous integration",
                "ADO",
                "GIT",
                "Jenkins",
                "JSON Libraries",
                "XML libraries",
                "SoapUI",
                "NUnit",
                "jasmine",
                "karma",
                "Postman"
            ],
            "secondary": [
                "Software/enterprise integration design principles",
                "Serverless frameworks",
                "Performance testing",
                "Load testing",
                "Microsoft Office Automation",
                "REST/OData",
                "AWS",
                "IIS",
                "SQL",
                "Oracle"
            ],
            "all": [
                ".NET",
                ".NET Core",
                "Angular",
                "Cloud-based technologies",
                "RDBMS",
                "Docker",
                "Kubernetes",
                "Continuous integration",
                "ADO",
                "GIT",
                "Jenkins",
                "JSON Libraries",
                "XML libraries",
                "SoapUI",
                "NUnit",
                "jasmine",
                "karma",
                "Postman",
                "Software/enterprise integration design principles",
                "Serverless frameworks",
                "Performance testing",
                "Load testing",
                "Microsoft Office Automation",
                "REST/OData",
                "AWS",
                "IIS",
                "SQL",
                "Oracle"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Criz Salvin",
        "email": "criz@northite.com",
        "jd": "From: Criz Salvin, NorthITe criz@northite.com Reply to: criz@northite.com Senior .NET Full Stack Developer (Angular)Location: Water Street, NY or Princeton, NJ (Hybrid) 3 days onsiteThe Team:In partnership with Product Management and Quality Assurance, your team shares a common mission to create products that satisfy our users. Your team will enable product engineering teams, promise engineering excellence and deliver high-quality end products.Business impact:• The client team is having strong presence in the organization, they design and develop services for Rating enterprise systems, specializing in data distribution, management, integration and publishing technologies.• We are looking for a Senior Product Engineer to lead a global staff of software developers for our D&C product line comprising a large suite of interrelated tools, services, business-critical capabilities and applications. You will be responsible for helping to build our agile organization and align to a culture of continuous improvement, partnership, trust and sharing. You will lead a global staff of software engineers and partner with your Product Management and Quality peers to support a large, global group of agile scrum teams.• Fundamental to this position is a demonstrable ability to combine your strong agile leadership and problem-solving skills with deep technical and delivery know-how. You have exceptional collaboration and communication skills, are highly motivated, creative and engaged. As a servant leader, you will enable experienced engineers and the teams they support to drive business value while your organization focuses on planning, building, improving, innovating and contributing to the product vision.Responsibilities:• Hands on senior programmer with strong analytical, development and debugging skills• Team member with empathy and compassion. Focus on building a team culture that is based on trust.• Demonstrate a strong sense of ownership and responsibility with assignments. This includes understanding requirements, technical specifications, design, implementation, unit testing, builds/deployments, and code management.• Ensure compliance through the adoption of enterprise standards and promotion of best practice / guiding principles aligned with organization standards.• Should execute complex technical requirements.• Be in tune with emerging trends in Cloud• Interface with quality assurance testers and other teams as needed.• Excellent written and oration skills.Experience & Qualifications:• 5+ years full stack development experience in modern web development technologies with .NET/.NET Core• software/enterprise integration design principles• Strong experience and understanding in cloud-based technologies, design patterns and best practices.• Good understanding and knowledge of RDBMS• Good Analytical skills to solve problems.• Knowledge in building applications using serverless frameworks and containers using Dockers and Kubernetes• Experience with Continuous integration and deployment tools like ADO, GIT, Jenkins.• Good understanding and usage of JSON Libraries and XML libraries• Experience with tools such as SoapUI, NUnit, jasmine, karma, Postman and be able to create unit test cases, performance testing, load testing• Ability to organize and manage tasks and work to critical project timelines in a fast-paced environment.Preferred qualifications:• BS or MS degree in Computer Science or Information Technology• Full stack development experience in modern web development technologies, .NET/.NET Core, Web API’s, Microsoft Office Automation, REST/OData, AWS, Angular, IIS, SQL, Oracle• proven software/enterprise integration and full-stack knowledge including modern distributed front end and back-end technology stacks• Quality first mindset with a strong background and experience with developing products for a global audience at scale• Excellent analytical thinking, interpersonal, oral, and written communication skills with strong ability to influence both IT and business partners.",
        "source": "Email",
        "date_posted": "2024-10-03 10:48:35-05:00",
        "unique_id": "1925316917f0bfcf",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]