[
    {
        "company": "Vy Systems",
        "job_title": "BUSINESS ANALYST With Commercial Domain",
        "location": "Foster City, CA, USA",
        "full_location": {
            "city": "Foster City",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "10 years",
            "degree_required": "Bachelor's degree in Business Administration, Information Technology, or a related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "business analysis",
                "project management",
                "data analysis",
                "communication",
                "problem-solving"
            ],
            "primary": [
                "commercial project management",
                "project documentation",
                "risk assessment",
                "data interpretation",
                "continuous improvement"
            ],
            "secondary": [
                "project management software",
                "interpersonal skills",
                "organizational skills",
                "time management",
                "team collaboration"
            ],
            "all": [
                "business analysis",
                "project management",
                "data analysis",
                "communication",
                "problem-solving",
                "commercial project management",
                "project documentation",
                "risk assessment",
                "data interpretation",
                "continuous improvement",
                "project management software",
                "interpersonal skills",
                "organizational skills",
                "time management",
                "team collaboration"
            ],
            "with_experience": [
                "business analysis",
                "project management",
                "data analysis"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Kishore V",
        "email": "kishore.v@vysystems.com",
        "jd": "From: Kishore V, Vy Systems kishore.v@vysystems.com Reply to: kishore.v@vysystems.com BUSINESS ANALYST With Commercial Domain -C2C- Foster City - CA(Onsite) Exp 14+Responsibilities : - Lead the analysis and documentation of business requirements for commercial projects.- Oversee the development and implementation of project plans to ensure timely delivery.- Provide detailed insights and recommendations to improve business processes.- Collaborate with cross-functional teams to gather and analyze data. - Ensure that project objectives are met by monitoring progress and addressing any issues.- Facilitate communication between stakeholders to ensure alignment and understanding.- Conduct risk assessments and develop mitigation strategies.- Develop and maintain project documentation, including requirements, plans, and reports.- Utilize data analysis tools to interpret complex data sets and provide actionable insights. - Support the development of business cases and project proposals.- Ensure compliance with industry standards and best practices.- Drive continuous improvement initiatives to enhance project outcomes. - Provide training and support to team members on project management methodologies.Qualifications : - Possess a Bachelors degree in Business Administration, Information Technology, or a related field. - Have a minimum of 10 years of experience in commercial project management. - Demonstrate strong analytical and problemsolving skills :- Show proficiency in project management software and tools.- Exhibit excellent communication and interpersonal skills.- Have experience with data analysis and reporting. - Display a strong understanding of business processes and requirements. - Be able to work effectively in a fast-paced, dynamic environment.- Show a commitment to continuous learning and professional development.- Have a proven track record of successfully delivering complex projects.- Demonstrate the ability to work collaboratively with diverse teams- Exhibit strong organizational and time management skills. - Be detail-oriented and able to manage multiple priorities simultaneously.",
        "source": "Email",
        "date_posted": "2024-10-03 13:57:08-05:00",
        "unique_id": "19253bd6fafc193b",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]