[
    {
        "company": "DMS Visions INC",
        "job_title": "SQL Database Administrator",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "3-6 years",
            "degree_required": "Education in SQL Database Administration",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ Months Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SQL Database",
                "Windows Server OS",
                "SQL Management Studio",
                "SQL",
                "T-SQL"
            ],
            "primary": [
                "SQL scripting",
                "Database management",
                "Data Tuning",
                "Query Tuning",
                "Database Security"
            ],
            "secondary": [
                "Visual Studio",
                "WebSphere Application Server",
                "Access DB experience"
            ],
            "all": [
                "SQL Database",
                "Windows Server OS",
                "SQL Management Studio",
                "SQL",
                "T-SQL",
                "SQL scripting",
                "Database management",
                "Data Tuning",
                "Query Tuning",
                "Database Security",
                "Visual Studio",
                "WebSphere Application Server",
                "Access DB experience"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Abhishek Yadav",
        "email": "abhishek@dmsvisions.com",
        "jd": "From: Abhishek Yadav, DMS Visions INC abhishek@dmsvisions.com Reply to: abhishek@dmsvisions.com Hi,Hope you are doing well !!I have an urgent position. Kindly go through the Job description and let me know if this would be of interest to you. Job Title: SQL Database AdministratorLocation: 100% RemoteDuration: 6+ Months Contract ****While sharing resume mention consultant location and visa status*** Job Description: Brief Description of Job Duties: This position is within the Tools and DBA section of Application Management and will be required to extract data and create reports to address legal questions in conjunction with discovery efforts associated with ongoing legal investigation.Work with our legal analysts in providing data/analysis to adequately address submitted requests in a manner that is meaningful and relative to the legal questions asked. Format and present in a user-friendly format.Consults with programmer/system analysts, peers, business users, outside agencies, third parties and vendors on issues related to the database and application software and if needed, presents written and oral solution and analyses. The procedure to resolve will vary based on the issue/question raised. Convert or transfer database files or tables from existing storage locations and formats to replacement locations and formats; develop and test automated means for performing conversion to assign reports.Ensure software and application documentation is prepared and updated this assigned projects, problem reports, work efforts and service requests.Analyze content and quality of databases, recommend data management procedures, and develops extraction processes.Identify opportunities for process improvement and automation.Work closely with cross-functional teams to understand their data needs and provide support.Other duties as assigned. Preferred skills: At least 3 to 6 years of experience as an SQL Database Administrator in a Windows Server environment 2008, 2012, 2014, 2016 or 2019. Education in SQL Database Administration. Knowledge and experience with application software tools and application development methodology through complete life cycles. - preferredKnowledge and experience with the following system software; database management, SQL scripting/programming and operating systems:SQL Database - must have, current knowledge and trainingWindows Server OS, functions/commands - must haveSQL Management Studio – must haveSQL – must haveSQL scripting and modifications of files generated out of the DB – must haveExtensive knowledge of T-SQL (Stored Procedures, Triggers, Indexing, Agents), Data Tuning and cleansing, Query Tuning, and Database Security – must haveVisual Studio – preferredWebSphere Application Server – optional.Ability to deal effectively with the information technology needs of: IT technicians and development staff; business users; and software vendor and management staff. – Strongly preferredGood organization and workload management skills. - Strongly preferredEffective written and oral communication skills and ability to establish and maintain good rapport with agency staff for effective and timely problem identification, resolution, and work efforts. - Strongly preferred.Capability to work independently and effectively in complex environments.Access DB experience - optional. If you are interested, please share your updated resume and suggest the best number & time to connect with you. Thanks & Regards, Abhishek YadavDMS Vision Inc. | http://dmsvisions.com/4645 Avon Lane, Suite 210, Frisco, TX 75033Email: abhishek@dmsvisions.com | Phone : 972-645-5314 | EXT - 103",
        "source": "Email",
        "date_posted": "2024-10-03 19:53:12-05:00",
        "unique_id": "1925514decc0d15a",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "DB Admin"
    }
]