[
    {
        "company": "Kappium",
        "job_title": "Senior Project Support Agile Delivery Consultant",
        "location": "Bronx, NY, USA",
        "full_location": {
            "city": "Bronx",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Must have existing work authorization",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Maximo"
            ],
            "primary": [
                "Agile Delivery",
                "Communication Skills",
                "Utilities Background"
            ],
            "secondary": [],
            "all": [
                "Maximo",
                "Agile Delivery",
                "Communication Skills",
                "Utilities Background"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Himanshu",
        "email": "himanshu@kappium.com",
        "jd": "From: Himanshu, Kappium himanshu@kappium.com Reply to: himanshu@kappium.com Role: Senior Project Support Agile Delivery Consultant Location: Bronx, New York (REMOTE) (they must be local) Visa: GC/USC Must be from a utilities background. Great communication skill. JD: MUST HAVE MAXIMO EXPERIENCEJob Description -Agile Delivery Consultant develops, automates and manages software production and test environments with focus on feature, deliveries of established Day 2 Items for CworX Maximo and new requirements as established by the Construction Business. The consultant will work the Construction Domains and Information Technology to define requirements and provide guidance with current deployed solution. The consultant Defines and maintains test system configuration and test data. Performs test executions and creates test scripts for Maximo System and other complex Edge integrated systems. Establishes goals and objectives for appropriate testing cycles. Defines and maintains functional requitements for both change requests and product defects. Implements test processes on projects, writes test plans, procedures and scripts, and analyzes test results.",
        "source": "Email",
        "date_posted": "2024-10-03 13:37:49-05:00",
        "unique_id": "19253acc9a602179",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]