[
    {
        "company": "Virginia State Police",
        "job_title": "IT project manager",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Must have existing work authorization",
            "notice_period": "Not specified",
            "duration": "6 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management Professional (PMP)",
                "High-risk project management",
                "Budget management",
                "Scope management",
                "Schedule management"
            ],
            "primary": [
                "Vendor management",
                "Business analysis",
                "Risk management",
                "Contract negotiation",
                "Request for Proposal (RFP) process"
            ],
            "secondary": [
                "Communication skills",
                "Leadership",
                "Stakeholder management",
                "Problem-solving",
                "Team coordination"
            ],
            "all": [
                "Project Management Professional (PMP)",
                "High-risk project management",
                "Budget management",
                "Scope management",
                "Schedule management",
                "Vendor management",
                "Business analysis",
                "Risk management",
                "Contract negotiation",
                "Request for Proposal (RFP) process",
                "Communication skills",
                "Leadership",
                "Stakeholder management",
                "Problem-solving",
                "Team coordination"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Arudhi Singh",
        "email": "arulhi.singh@tekinspirations.com",
        "jd": "Hi,Hope you are doing great!!!Job Description - Title IT project manager Location : onsite in Richmond, VA need local Duration: 6months Visa: Must be USC , GC , GCEAD, h4EADOnlyMOI: Skype+ f2f Inperson interviewNeed Dl and LinkedIn,mgr not finding candidates with the sr level experience in managing HIGH-COMPLEXITY, HIGH-RISK projects($10M +) ABOUT THE ROLEThe Virginia State Police is looking for a Project Manager with 10+ years of experience in the field. A PM is needed to address and coordinate the replacement of the existing criminal history systems utilized by the Virginia State Police. The Project Manager will work with Business Analysts, program manager, and serve as the liaison between the business community/end users and the IT organization. The project manager is responsible for managing the project scope, schedule and budget and reporting to VSP IT management and the business stakeholders/owners on a weekly basis or as agreed upon. The successful candidate must have the following qualifications:* Active Project Management Institute (PMI) Project Management Professional (PMP)certification REQUIRED* Documented high-risk project management experience* Completion of a Category 1 or 2 Commonwealth project of $5M or more, OR completion of non-COV project with a value greater than $10M as PM of record. Duties may include managing/coordinating a Request for Proposal (RFP) process composed of RFP related tasks such the review and assistance with drafting of the evaluation criteria, contract terms, RFP format, and other procurement-related documentation in coordination with the VSP procurement staff.The project manager will assist the VSP IT Division staff in responding to vendor queries, performing the vendor evaluation process and contract negotiations, as necessary. The PM will direct the Business Analyst throughout the project to ensure the objectives and requirements for a new system are fully defined. The PM will oversee the vendor efforts on the design, development and implementation of the solution and will coordinate with the vendor PM and VSP IT Division and business stakeholders/owners as needed.The Project Manager, in coordination with the Business Analyst, will be responsible for the identification, analysis, tracking and recommending appropriate actions to project issues including those that are technology related. They will also be responsible for the identification and management of project risks. The PM, coordinating with the VSP IT Division, will provide overall direction to the vendor as to any interfaces to existing VSP (and non-Agency) systems. In general, the PM is responsible for the coordination and completion of the assigned projects that will result in the design, execution, delivery, and implementation of a new VSP criminal history system.",
        "source": "Email",
        "date_posted": "2024-10-03 17:43:59-05:00",
        "unique_id": "19254e46ff7be021",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]