[
    {
        "company": "VBeyond Corp",
        "job_title": "Senior Azure Cloud Engineer",
        "location": "Dallas, TX, USA",
        "full_location": {
            "city": "Dallas",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "8-10 years",
            "degree_required": "Bachelor's degree (in Computer Science, Math or Engineering)",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Azure Storage",
                "Azure SQL",
                "Azure Cloud Services",
                "Azure Web App",
                "Azure Networking"
            ],
            "primary": [
                "Azure CLI",
                "Powershell",
                "ARM Templates",
                "Azure Virtual Networks",
                "ExpressRoute",
                "Site to Site VPN",
                "NSG",
                "App Service",
                "Azure SQL DB",
                "Azure DevOps",
                "Identity Management",
                "Azure AD",
                "Azure Key Vault",
                "HSTS SSL TLS Certificate management",
                "Azure Security Center Threat Detection",
                "Azure Log Analytics",
                "Azure Monitor",
                "Application Insights"
            ],
            "secondary": [
                "PowerShell scripting",
                "Python",
                "Business Continuity",
                "Disaster Recovery planning",
                "Knowledge of other cloud hosting solutions (e.g. Google, AWS, Helion Cloud, SoftLayer)"
            ],
            "all": [
                "Azure Storage",
                "Azure SQL",
                "Azure Cloud Services",
                "Azure Web App",
                "Azure Networking",
                "Azure CLI",
                "Powershell",
                "ARM Templates",
                "Azure Virtual Networks",
                "ExpressRoute",
                "Site to Site VPN",
                "NSG",
                "App Service",
                "Azure SQL DB",
                "Azure DevOps",
                "Identity Management",
                "Azure AD",
                "Azure Key Vault",
                "HSTS SSL TLS Certificate management",
                "Azure Security Center Threat Detection",
                "Azure Log Analytics",
                "Azure Monitor",
                "Application Insights",
                "PowerShell scripting",
                "Python",
                "Business Continuity",
                "Disaster Recovery planning",
                "Knowledge of other cloud hosting solutions (e.g. Google, AWS, Helion Cloud, SoftLayer)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Vaibhav Kumar",
        "email": "vaibhavk@vbeyond.com",
        "jd": "From: vaibhav kumar, VBeyond Corp vaibhavk@vbeyond.com Reply to: vaibhavk@vbeyond.com HI,Please go through the JD and revert me your interest in the same :- Job Title: Senior Azure Cloud EngineerExperience: 8-10 YearsSkills: Azure Storage, Azure SQL, Azure Cloud Services, Azure Web App, basic Azure Networking technologiesLocation: Dallas, TX – Local Candidates Need someone local to Dallas Tx who has Azure Storage, Azure SQL, Azure Cloud Services, Azure Web App, basic Azure Networking technologies and 10+ experience needed and devops developer profile will not work on this role The Cloud Engineer will work closely with all areas of IT to assist in the architecture, design, build, operation, security, and monitoring of Customer’s cloud infrastructure within Microsoft Azure. In this role, the engineer will use holistic thinking and architectural aptitude to drive proper requirements gathering, analysis, design, and implementation of solutions in both Azure Infrastructure as a Service (IaaS) and Platform as a Service (PaaS) offerings. This person will also be responsible for generating documentation as needed; conforming to cloud security and architectural quality standards; and staying current on emerging trends. The person will work very closely with Software, Data and Security teams of the Technology group. Have experience in architecting/deploying Azure environments with considerations to optimized cost and capacity, monitoring, scaling, DR scenarios, and Azure security.Have experience with Azure Storage, Azure SQL, Azure Cloud Services, Azure Web App, basic Azure Networking technologies.Have good understanding of Identity and Access Management products such as Azure AD, ADFS, Azure AD Connect, Conditional Access, Azure AD Proxy, SAML.Be able to provide recommendations with respect to cloud migrations and prepare technical implementation roadmaps for optimizations, upgrades, and enhancements.Possess PowerShell scripting experience. Responsibilities and Duties Contribute to the strategy for establishing a secure and well-managed enterprise environment in Azure.Configure and manage Customer’s Virtual Networks in Azure, establish our core services in the VNET, enable Azure to serve as a part of Customer network.Design and implement network connectivity to Azure (e.g., VPN, Express Route, DNS, IP allocation and traffic routing, NSG’s and Azure Firewall, etc.).Integrate, configure, deploy, and manage cloud services which may include: IAM, networking, monitoring, operating systems, VMs, App Services, DBaaS, Containers, etc.Administrate Windows Servers, automating deployments, patching, and scripting.Utilize native Azure services to meet the firm’s technology and resiliency requirements. Define and implement the configuration of Azure PAAS and IAAS services for high availability data redundancy, data loss prevention, site recovery, and resilience.Implement the security architecture to ensure data security at rest and in transit, application security, key management, identity management, authentication and authorization with OIDC and OAuth2, and infrastructure security with Azure VNets, NSGs, UDR, etc.Implement monitoring and management infrastructure for both availability and performance management.Extend customer standard systems management processes into the cloud including change, incident, and problem management.Support software, data and security team on cloud architecture, provisioning and compliance needs.Evaluate changes/updates to cloud technologies and makes substantiated recommendations for improving solution capabilities.Support the engineering of secure technology solutions that adopt DevSecOps, Cloud (IaaS, PaaS, SaaS) in a healthcare industry.Mentor and support the development of other members of the team on cloud technology. Requirements:. Bachelor's degree (in Computer Science, Math or Engineering).8+ years of experience as a full time IT professional.3+ years of experience designing and supporting Azure environments, including IaaS and PaaS.Microsoft Azure Certification (MCSE: Cloud Platform and Infrastructure or equivalent).Demonstrable experience with these Azure components:Azure CLI, Powershell, and ARM Templates.Azure Networking, Azure Virtual Networks, ExpressRoute, Site to Site VPN, NSG, App Service, Azure SQL DB.Azure DevOps configuration and management.Identity Management, Azure AD, Azure Key Vault, HSTS SSL TLS Certificate management, Azure Security Center Threat Detection.Cloud monitoring Experience with Azure Log Analytics, Azure Monitor, Application Insights.Azure administration portal.Demonstrable experience deploying enterprise workloads to Azure.Knowledge of at least one other cloud hosting solution in addition to Azure (e.g. Google, AWS, Helion Cloud, SoftLayer).Proficiency with PowerShell, Python, or other scripting languages.Experience designing and supporting enterprise core services as well as cloud deployments of these services.Extensive knowledge of the Microsoft Enterprise software products and services.Business Continuity or Disaster Recovery planning experience, a plus. Regards,Vaibhav KumarVBeyond CorporationRecruitment Lead # +1-9086334110E: Vaibhavk@vbeyond.com | www.vbeyond.comhttps://www.linkedin.com/in/vaibhav-kumar-06966b97/390 Amwell Road, Suite # 107, Hillsborough, NJ 08844 Note – VBeyond is fully committed to Diversity and Equal Employment Opportunity.",
        "source": "Email",
        "date_posted": "2024-10-03 14:20:10-05:00",
        "unique_id": "19253d28680e9ff6",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Azure Data Engineer"
    }
]