[
    {
        "company": "ITech US Inc.",
        "job_title": "Lead Java API Developer",
        "location": "Minneapolis, MN, USA",
        "full_location": {
            "city": "Minneapolis",
            "state": "MN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Bachelor's or equivalent experience in Computer Science, Software/Electronics Engineering, Information Systems, or a closely related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Kafka",
                "Microservices",
                "Spring Boot",
                "API platform"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Kafka",
                "Microservices",
                "Spring Boot",
                "API platform"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Bandana Das",
        "email": "bandana.d@itechus.net",
        "jd": "From: Bandana Das, iTech US bandana.d@itechus.net Reply to: bandana.d@itechus.net Hi, Greetings, This is Bandana from ITech US Inc. Given below are the details of the position with one of our clients and was wondering if you would be interested or can recommend someone who would be interested in this job. Role: Lead Java API Developer Location: Minneapolis Downtown, MN & Hopkins, MN (Need local ID proof) Duration: 12+ Months Contract Years of Experience: 10+ Years Onsite from Day 1 Visa: H1B | Need passport number along with the submission Must have: Kafka, Microservices, Spring Boot and API platform Role Description: Creates design principles and prepares technical and infrastructure architecture deliverables that meet business requirements and customer needs. Work is conducted in accordance to standards and methodologies and is consistent with the target business architecture strategy Participates in product design recommendations that span the entire infrastructure framework. Manage and prioritize the product and feature backlog for your products and APIs Lead the API/Micro-Services solution development and delivery, including hands on development Responsible for program design, coding, testing, debugging, documentation and preparing detailed specifications from which complex programs will be written. Provide application support, which includes problem research, analysis, resolution, and on-call support Work with QA/Testing groups to resolve issues and to ensure software quality Meet with clients to understand their needs and offer consulting services to internal groups. Develop and maintain APIs for multiple lines of business within an efficient Agile SDLC and act as an advocate for the API platform Builds technical relationships with business, operations, and technical teams and leads design efforts that provides innovative solutions and complex architectures Work cross-functionally with various Architects, Engineers, and Product owners across multiple teams in a rapidly evolving environment to translate business needs into API interface and functional requirements Education: At least a bachelor’s degree (or equivalent experience) in Computer Science, Software/Electronics Engineering, Information Systems, or a closely related field is required Thanks & Regards BANDANA DAS",
        "source": "Email",
        "date_posted": "2024-10-03 09:34:34-05:00",
        "unique_id": "19252d41517c54f0",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]