[
    {
        "company": "AI Spins INC",
        "job_title": "D365 Program Manager with F&O",
        "location": "Emeryville, CA, USA",
        "full_location": {
            "city": "Emeryville",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "11+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Program Management",
                "Project Management",
                "Data (ETL)",
                "D365 F&O",
                "D365 Commerce"
            ],
            "primary": [
                "Technical Project Management",
                "Data Visualization",
                "Mobile App Development",
                "Testing",
                "PMP",
                "Scrum Master"
            ],
            "secondary": [
                "Stakeholder Management",
                "Team Management",
                "Quality Assurance",
                "Continuous Improvement"
            ],
            "all": [
                "Program Management",
                "Project Management",
                "Data (ETL)",
                "D365 F&O",
                "D365 Commerce",
                "Technical Project Management",
                "Data Visualization",
                "Mobile App Development",
                "Testing",
                "PMP",
                "Scrum Master",
                "Stakeholder Management",
                "Team Management",
                "Quality Assurance",
                "Continuous Improvement"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "madhavan",
        "email": "madhavan@aispins.com",
        "jd": "From: madhavan, AI Spins INC, madhavan@aispins.com Reply to: madhavan@aispins.com This role must be senior person (11+ years) who can do program management of an enterprise level account. Please find someone with the following.Ready to work from SFO (Emeryville, CA)Good Program Management & Project Management ExperienceExperience in delivering Data (ETL) and Dynamics (F&O, Commerce, CRM) projects Technical Skills:We are seeking a highly skilled Onsite Technical Project Manager to join our dynamic team. The ideal candidate will have a strong background in data projects and a proven track record of successfully managing support and development projects in Data, ETL, Visualization, D365 F&O, D365 Commerce, Mobile App, and Testing. This role requires a combination of technical expertise, strong project management skills, and the ability to effectively manage distributed teams both onshore and offshore. Minimum of 5 years of experience in program management, with a focus on Data and D365.PMP, Scrum Master, or other relevant certifications are a plus.Proven ability to manage distributed teams and work effectively across different time zones. Key Responsibilities:Project Planning and Execution:o Develop and implement comprehensive project plans, including timelines, resource allocation, and risk management strategies for both onshore and offshore teams.o Monitor project progress, identify potential issues, and take corrective actions to ensure projects are delivered on time, within budget, and to the highest quality standards.Technical Leadership:o Provide technical guidance and support to both onshore and offshore project teams, ensuring alignment with project objectives and best practices.o Collaborate with technical experts to evaluate and select appropriate technologies and tools for project implementation.Stakeholder Management:o Effectively communicate project status, risks, and challenges to stakeholders at all levels, including executive management, clients, and team members.o Manage expectations and build strong relationships with stakeholders to ensure project success.Team Management:o Lead and motivate both onshore and offshore project teams to achieve project goals and deliver exceptional results.o Foster a collaborative and productive work environment, promoting teamwork and knowledge sharing across distributed teams.Quality Assurance:o Implement quality assurance processes and standards to ensure project deliverables meet the highest quality requirements.o Conduct thorough testing and validation to identify and address defects.Continuous Improvement:o Identify opportunities for process improvement and implement best practices to enhance project efficiency and effectiveness.o Stay up-to-date with industry trends and emerging technologies to ensure the team remains competitive.",
        "source": "Email",
        "date_posted": "2024-10-03 17:44:30-05:00",
        "unique_id": "19254e66c8a94683",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]