[
    {
        "company": "Tekinspirations",
        "job_title": "PeopleSoft Business Analyst",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Initial contract period is 12 months, with possibility to extend",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "PeopleSoft Financials",
                "business analysis",
                "functional/technical documentation",
                "test planning",
                "quality assurance validation"
            ],
            "primary": [
                "system design and development",
                "process improvement",
                "business and technical requirements gathering",
                "documenting workflow processes",
                "developing test plans",
                "user acceptance testing",
                "regression testing",
                "developing training materials",
                "conducting user training",
                "strong interpersonal and communication skills"
            ],
            "secondary": [
                "General Ledger",
                "Accounts Payable",
                "Purchasing",
                "Accounts Receivable",
                "Billing",
                "Asset Management for Lease Administration",
                "Project experience with COV projects"
            ],
            "all": [
                "PeopleSoft Financials",
                "business analysis",
                "functional/technical documentation",
                "test planning",
                "quality assurance validation",
                "system design and development",
                "process improvement",
                "business and technical requirements gathering",
                "documenting workflow processes",
                "developing test plans",
                "user acceptance testing",
                "regression testing",
                "developing training materials",
                "conducting user training",
                "strong interpersonal and communication skills",
                "General Ledger",
                "Accounts Payable",
                "Purchasing",
                "Accounts Receivable",
                "Billing",
                "Asset Management for Lease Administration",
                "Project experience with COV projects"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Akash Sharma",
        "email": "akash.s@tekinspirations.com",
        "jd": "From: Akash Sharma, Tekinspirations akash.s@tekinspirations.com Reply to: akash.s@tekinspirations.com Title: PeopleSoft Business AnalystLocation: Richmond, VA. Duration of contract – Initial contract period is 12 months, with possibility to extendRemote/onsite/hybrid – HYBRID - ON SITE REQUIRED: 3-4 days /weekLocal candidates onlyMOI: Virtual and In-person interviewsSend proof of residence with resume - driver’s license, state-issued ID or copy of rental agreement/deed are strongly preferred (one page) Deadline to submit resumes – October 4, 2024 at 11amAgain, please do not send resumes longer than 4 pages. Let me know if you have any questions. Emails only please. No calls. Thank you again for your time and consideration.JOB DESCRIPTION:The client is looking for a Business Analyst with documentation and testing experience in support of PeopleSoft Financials systems.This position is primarily responsible for business analysis, functional/technical documentation and test planning of the company's PeopleSoft Financials system. This person will work closely with a small team of technical analysts and financial officers as the company works to streamline both the security and the operations of its PeopleSoft Financials system. The selected candidate in this position will work closely with stakeholders, Fiscal Subject Matter Experts (SMEs), and development teams. The Business Analyst will report to the Project manager. This position should expect to work 40 hours per week.Required Experience, Knowledge, Skills, and Abilities:-Experience in system design and development, with a focus on process improvement and business and technical requirements gathering-Experience with PeopleSoft Financials-Experience documenting workflow processes-Experience developing test plans, use cases, and performing quality assurance validation, user acceptance testing, and regression testing-Experience in the development of training materials and conducting user training-Strong interpersonal and communication skills –The successful candidate should be a self-starter with the ability to drive work to completion.Preferred Experience:-Specific experience with General Ledger, Accounts Payable, Purchasing (functionality limited to storing POs and Receipts for matching), Accounts Receivable, Billing and Asset Management for Lease Administration.-Project experience with COV projects.Specific Tasks may include:-Documenting changes to PeopleSoft processes-Documenting PeopleSoft configurations-Documenting business workflows related to PeopleSoft-Preparing user and technical documentation-Developing test plans-Working with customer SMEs and project team to develop business requirements in response to requests for systems enhancements, modifications, and newly identified business initiatives.-Working with ISS technical team and vendors to ensure requirements are incorporated into systems design and testing.-Developing business requirements documentation and flow diagrams – this work may expand into technical requirements gathering, design, and systems documentation.-Actively participating in functional and systems integration unit testing; creating use case scenarios, test plans, and testing results.-Assisting with testing and track testing results-Developing and presenting training to Fiscal Services and agency users-Meeting regularly with customer and project teams and regularly demonstrating quality work output.-Keeping the Business Owner and ISS technical team informed of key issues that may impact project implementation.-Please note we are looking for a self-motivated and proactive Business Analyst who is detail oriented.",
        "source": "Email",
        "date_posted": "2024-10-03 09:32:59-05:00",
        "unique_id": "19252d1c6645a045",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]