[
    {
        "company": "Paychex",
        "job_title": "DevOps AI Engineer with Solid Java",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5-10 years",
            "degree_required": "Bachelor's Degree in Computer Science related discipline or equivalent work experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Month",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Kotlin",
                "AI tools",
                "DevOps",
                "Continuous Delivery"
            ],
            "primary": [
                "Cloud Technologies",
                "Docker",
                "Python",
                "Groovy",
                "Bash",
                "PowerShell",
                "REST",
                "SQL",
                "Jenkins",
                "Agile"
            ],
            "secondary": [
                "Generative AI models",
                "Configuration Management",
                "Version Control Concepts"
            ],
            "all": [
                "Java",
                "Kotlin",
                "AI tools",
                "DevOps",
                "Continuous Delivery",
                "Cloud Technologies",
                "Docker",
                "Python",
                "Groovy",
                "Bash",
                "PowerShell",
                "REST",
                "SQL",
                "Jenkins",
                "Agile",
                "Generative AI models",
                "Configuration Management",
                "Version Control Concepts"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "sangya kumari nahak",
        "email": "sangya@adventatech.com",
        "jd": "From: sangya kumari nahak, adventa sangya@adventatech.com Reply to: sangya@adventatech.com Title - DevOps AI Engineer with Solid JavaLocation – RemoteDuration - 12+ MonthVisa – USC/GC/GC EAD/h4 EADMOI – SkypeLinkedin MustNeed Brief Writeup on AI tools and Java DevelopementWill need to do assessments before I set up a zoom meeting.MUST have Excellent communicationOverview: This is a senior Dev Ops Engineer with Java (Kotlin) background and experience in AI. AI tools: LangSmith, Codium.ai, and Azure AI ( ones that they are either using or going to use)Purpose of project: The goal of this project is to join the team (4 developers and Solution Lead) to help develop best practices and workflow in the AI DevOps space. Research industry trends and assess available tools that would help in the current Devops workflow. The resource really needs to understand the value of DevOps and have solid development skills in Java. They will do a mix of DevOps and AI work so that not all AI goes to one person. Make sure they are willing to do both.Goal: The goal is to help the Paychex Dev organization increase productivity and improve performance. Help increase quality deliverables through automation via AI. TITLESenior Software Engineer DESCRIPTIONInterested in DevOps, Continuous Delivery, Automation in the SDLC, and having fun at work?Paychex Development Services is looking for a highly motivated, self-starting individual that can apply software development techniques and modern programming to help drive integration and automation in the SDLC. Our objective is to enable our customers to deliver their changes to market faster with quality through our build and deployment platform. We work closely with Dev/Sec/Ops teams to streamline delivery through our software factory by evangelizing and consulting on best practices to drive higher maturity in Continuous Delivery practices. This an ideal position for a Software Engineer, who is passionate about CI/CD best practices, automation, and making tools that make Paychex Software Engineers’ lives easier. Individual will join an exciting, fast paced work environment where we leverage agile practices to manage our work.You’ll be sure to exercise the Paychex Values of INNOVATION, PARTNERSHIP, ACCOUNTABILITY, RESPECT, INTEGRITY and SERVICE in this role while also driving continuous improvement for ourselves and our customers.What you can expect to do in this role?Research AI solutions for the SDLCImplement integration points between critical SDLC applications and phasesSupport our automated build and deploy platform across several environments and hundreds of serversWork in an Agile (Scrum and Kanban) environmentFrequent features releases, multiple times per weekHelp drive innovative approaches for tackling complex needsOpen, fun culture embracing innovation and improvementWe hold ourselves to the same high standards of software development that we expect and enforce on our customers PREFERRED QUALIFICATIONS / TECHNOLOGIESGenerative AI models used to enhance workflows and data insightsPrevious experience with Cloud/Container Technologies (OpenShift, Docker)Programming Languages: Java and/or KotlinUnit Testing, Mocking, TDDScripting Languages: Python, Groovy, Bash, PowerShellWeb Services (REST)SQLContinuous Integration Environment (Jenkins or other)Configuration Management (Puppet, Chef, Ansible or other)Version Control ConceptsAgile principles (Scrum, Kanban)POSITION REQUIREMENTSPOSITION REQUIREMENTSBachelor's Degree in Computer Science related discipline or equivalent work experienceDemonstrated project leadership experience.Experience using one or more programming language(s).5-10 years of experience in Related field.",
        "source": "Email",
        "date_posted": "2024-10-03 18:18:55-05:00",
        "unique_id": "19254ad17cc42e9a",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]