[
    {
        "company": "Stellent IT",
        "job_title": "Healthcare Business Analyst",
        "location": "Boston, MA, USA",
        "full_location": {
            "city": "Boston",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "5+ years",
            "degree_required": "Bachelor’s degree in computer science, Information Systems, Business Administration, or a related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12mth+ contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "SDLC",
                "Use Cases",
                "Healthcare Industry"
            ],
            "primary": [
                "Jira",
                "Long Term Care Population",
                "Complex eligibility systems",
                "Microsoft 365",
                "Excel",
                "Word",
                "PowerPoint",
                "Access",
                "Visio",
                "Computer systems analysis",
                "Database development",
                "Relational database theory"
            ],
            "secondary": [
                "Flow charts",
                "Diagrams",
                "Organizational skills",
                "Problem-solving aptitude",
                "Attention to detail",
                "Project management"
            ],
            "all": [
                "Business Analysis",
                "SDLC",
                "Use Cases",
                "Healthcare Industry",
                "Jira",
                "Long Term Care Population",
                "Complex eligibility systems",
                "Microsoft 365",
                "Excel",
                "Word",
                "PowerPoint",
                "Access",
                "Visio",
                "Computer systems analysis",
                "Database development",
                "Relational database theory",
                "Flow charts",
                "Diagrams",
                "Organizational skills",
                "Problem-solving aptitude",
                "Attention to detail",
                "Project management"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Avnish Rao",
        "email": "avnish@stellentit.com",
        "jd": "Hi, We have urgent requirement of Business Analyst | Hybrid. Please revert if you are interested to apply. Business Analyst Location Boston, MA (Hybrid 2 days onsite) Duration 12mth+ contract Must have: 5+ yr BA exp SDLC exp Use Cases exp Healthcare Industry exp Preferred Qualifications: Knowledge of the principles of software development using the approved SDLC. Proficient knowledge of Jira, Long Term Care Population, Complex eligibility systems, and Unified processes. Proficiency in Microsoft 365, Excel, Word, PowerPoint, Access, and Visio. Knowledge of methods and techniques of computer systems analysis, design, technical terminology, codes, and standard abbreviations. Experience with one or more of the following: data structures, application programming, database development, or relational database theory and technology. Ability to prepare flow charts, diagrams, and Use Cases. Deliver oral and written instructions in a precise, understandable manner. Prepare required deliverables in accordance with established procedures. Strong organizational skills with the ability to maintain accurate records and status reporting. Ability to understand and apply the policies, procedures, specifications, standards, and guidelines governing assigned unit activities. Knowledge of MA HIX or other State Health Exchange. Ability to work with multiple vendors. Strong organizational skills, problem-solving aptitude, and attention to detail. Ability to work well with others in a fast fast-paced, dynamic environment. Strong initiative and ability to manage multiple projects, as well as strong follow-through skills. Must be able to work collaboratively, collegially, and cooperatively with others in an environment where deliverables are potentially dependent on the output of others. Education and Certifications: Bachelor’s degree in computer science, Information Systems, Business Administration, or a related field. Minimum of (3) three years of extensive experience with project management as a Senior Business Analyst of a large-scale application. Minimum of (3) years of experience in working in all phases of the Software Development Life Cycle (SDLC), including postproduction verification. Prior healthcare experience desired.",
        "source": "Email",
        "date_posted": "2024-10-03 11:43:19-05:00",
        "unique_id": "1925345b89d1529d",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]