[
    {
        "company": "Panasonic Connect",
        "job_title": "MES Program Manager",
        "location": "Hoffman Estates, IL, USA",
        "full_location": {
            "city": "Hoffman Estates",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Minimum of 7 years of program management experience",
            "degree_required": "Bachelor’s or master’s degree in computer science, Engineering, or related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "MES technologies",
                "MOM technologies",
                "project management",
                "manufacturing processes",
                "leadership"
            ],
            "primary": [
                "communication skills",
                "negotiation skills",
                "software development life cycles",
                "risk management"
            ],
            "secondary": [
                "PMP certification",
                "EV Battery Manufacturing experience",
                "multilingual capabilities"
            ],
            "all": [
                "MES technologies",
                "MOM technologies",
                "project management",
                "manufacturing processes",
                "leadership",
                "communication skills",
                "negotiation skills",
                "software development life cycles",
                "risk management",
                "PMP certification",
                "EV Battery Manufacturing experience",
                "multilingual capabilities"
            ],
            "with_experience": [
                "MES technologies",
                "MOM technologies",
                "project management"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "shyam",
        "email": "shyam@4-serveinc.com",
        "jd": "From: shyam, 4 serve shyam@4-serveinc.com Reply to: shyam@4-serveinc.com MES Program Manager, Hoffman Estates,ILyou will oversee the deployment and integration of MES solutions at some of the world’s largest EV Battery Manufacturing sites. This role demands deep expertise in MES and MOM technologies and involves project management and organizational change management framework for all sub-projects.\nResponsibilities\nAt Panasonic Connect, we connect the power of people and technology to change work, advance society and help connect to tomorrow. Empathy, results, relentlessness and teamwork are the foundations of the Panasonic Connect Culture. Our mission is to elevate the employee experience by empowering individuals to use their voice and have a positive impact on our business. As part of our team, you will push boundaries, take action, and face challenges alongside our customers to innovate experiences that define the changing world of work.\nKey Responsibilities\nWhat You'll Get To Do: Lead MES-specific deployment strategies and oversee their execution to meet the technological and business needs of large-scale manufacturing facilities. Manage daily interactions with System Integrator Partners to ensure seamless integration and functionality of MES and MOM systems. Coordinate project teams across multiple disciplines, ensuring timely completion of milestones within set budgets. Build and maintain robust relationships with all stakeholders, including internal teams, external partners, and customers. Provide expert guidance on MES technology, advocating for best practices and innovative approaches to system integration. Monitor project progress through rigorous management practices, adjusting strategies as necessary to handle the complexities of MES environments. Prepare and present detailed progress reports to senior management, highlighting the achievements and challenges of the MES program. Implement risk management plans to mitigate potential impacts on project timelines and budgets. Ensuring program closure including completion of lessons learned and required documentation.\nRequired Qualifications\nBachelor’s or master’s degree in computer science, Engineering, or related field with a strong focus on manufacturing systems. Minimum of 7 years of program management experience, specifically with MES and MOM implementations in the manufacturing sector. Minimum of 3 years experience implementing commercial MES products. Extensive knowledge of MES technologies, software development life cycles, and manufacturing processes. Demonstrated leadership abilities in managing large-scale projects and multi-disciplinary teams. Strong communication and negotiation skills, capable of working effectively with diverse groups of people.\nPreferred Qualifications\nCertification in Project Management (e.g., PMP) with a focus on technology implementation. Prior experience in the EV Battery Manufacturing industry is highly desirable. Multilingual capabilities are advantageous for international project coordination.",
        "source": "Email",
        "date_posted": "2024-10-03 11:32:19-05:00",
        "unique_id": "192533b145f8e8e7",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]