[
    {
        "company": "ICS Global Soft",
        "job_title": "SAP Manufacturing Support Analyst (5356)",
        "location": "Coolidge, AZ, USA",
        "full_location": {
            "city": "Coolidge",
            "state": "AZ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 months, extensions possible",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SAP",
                "Production Planning",
                "Inventory Management",
                "Warehouse Management",
                "Quality Management"
            ],
            "primary": [
                "Data Analysis",
                "Excel",
                "PowerBI",
                "Jira"
            ],
            "secondary": [
                "Agile"
            ],
            "all": [
                "SAP",
                "Production Planning",
                "Inventory Management",
                "Warehouse Management",
                "Quality Management",
                "Data Analysis",
                "Excel",
                "PowerBI",
                "Jira",
                "Agile"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "sunil",
        "email": "sunil@icsglobalsoft.com",
        "jd": "From: sunil, ICS sunil@icsglobalsoft.com Reply to: sunil@icsglobalsoft.com Role: SAP Manufacturing Support Analyst (5356)Location: Coolidge, AZ(Onsite)Duration: 6 months, extensions possible We are looking for a business analyst, not necessarily an SAP consultant. The ideal candidate will have prior business analyst experience and have a full understanding of manufacturing business processes and how SAP supports them. So, we are looking for someone that has PP, MM, IM, WM, and QM experience. This is not necessarily configuration experience, but someone from the business side who has worked as an SAP business analyst in the past. Agile experience is a huge plus. The location is the Nikola manufacturing plant in Coolidge, AZ. This is a small town between Phoenix and Tucson. It is possible that you may find someone in Phoenix or Tucson that is willing to commute but otherwise you’ll have to find someone really to relocate as this is on-site job. Daily ResponsibilitiesProcess support tickets issued from Manufacturing related to SAP. The resolutions can vary between providing instructional documentation, answers to questions, escalations to the Functional Team, or 1-on-1 desktop support.Identify gaps in processes related to the processing of transactions in SAPWork with business super-users to write Requirements and User Stories Attend daily stand-ups and report on the status of tickets and other activitiesContinuously update tickets with process and blockersIndependently prioritize support based on an understanding of business needs by having a close relationship with the leaders within manufacturing Required Skills:SAP knowledge in Production, Planning, Engineering, Inventory, Warehouse, and QualitySAP deliverable document writing including Business Requirements Documents, User Stories, Step-by-Step Instructions, Process Flow DiagramsData Analysis including Excel and/or PowerBIJira or similar ticket management system",
        "source": "Email",
        "date_posted": "2024-10-03 12:59:37-05:00",
        "unique_id": "192538da1ae60f3e",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]