[
    {
        "company": "Client-X",
        "job_title": "Oracle cloud project manager",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Minimum 7 years of Oracle SAAS/EBS Project Management experience.",
            "degree_required": "Bachelor’s degree from an accredited institution.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle SAAS/EBS Project Management",
                "Microsoft Projects",
                "Project Management certification (Oracle Project Management or PMP preferred)",
                "Strong numerical skills",
                "Communication skills"
            ],
            "primary": [
                "Adaptability",
                "Resilience",
                "Client-facing pre-sales activities",
                "Management of remote, global project teams",
                "Fixed Price and Time and Materials contracts"
            ],
            "secondary": [
                "Understanding of business processes in industries like Oil & Gas, Engineering & Construction, Public Sector, or Manufacturing",
                "Knowledge or experience with Oracle Infrastructure technologies",
                "Experience in People and Performance Management of direct reports"
            ],
            "all": [
                "Oracle SAAS/EBS Project Management",
                "Microsoft Projects",
                "Project Management certification (Oracle Project Management or PMP preferred)",
                "Strong numerical skills",
                "Communication skills",
                "Adaptability",
                "Resilience",
                "Client-facing pre-sales activities",
                "Management of remote, global project teams",
                "Fixed Price and Time and Materials contracts",
                "Understanding of business processes in industries like Oil & Gas, Engineering & Construction, Public Sector, or Manufacturing",
                "Knowledge or experience with Oracle Infrastructure technologies",
                "Experience in People and Performance Management of direct reports"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Shubham Sharma",
        "email": "shubhams@vyzeinc.com",
        "jd": "From: Shubham sharma, VyzeInc shubhams@vyzeinc.com Reply to: shubhams@vyzeinc.com Oracle cloud project managerREMOTEUSC /GC NEED LINKEDINGood communication skills Role OverviewClient-X is seeking an experienced Senior Project Manager with directive leadership skills to lead medium to large, complex, high-value transformational Oracle projects, often impacting regional or global operations. As a Client-X Project Manager, the candidate will be a business leader who consistently delivers project governance and controls, exceeds targets, and creates innovative ways to deliver when presented with challenges.In this highly visible role, you have an excellent opportunity to make a significant and positive impact. Client-X fosters an environment where creativity, invention, and discovery become reality each day. It is where bold, bright professionals like you can reach your full potential—and help us reach ours. Skills & ExperienceEssential Skills, Qualities & Qualifications:Bachelor’s degree from an accredited institution.Industry Project Management certification (Oracle Project Management or PMP preferred).Proficiency in Microsoft Projects and other Microsoft Office tools.Strong numerical skills and communication skills across all organizational levels.Adaptability and resilience.Essential Experience:Minimum 7 years of Oracle SAAS/EBS Project Management experience.Professional Services delivery.Experience managing Oracle implementation projects with commercial and customer management.Led at least two end-to-end Oracle SAAS ERP/HCM implementation projects as a system integrator, including data migration.Led at least one global implementation and one multi-pillar implementation.Management of remote, global project teams.Successfully managed Fixed Price and Time and Materials contracts.Owned and managed Oracle SAAS environment plans.Experience in client-facing pre-sales activities.Desirable Experience:Understanding of business processes in industries like Oil & Gas, Engineering & Construction, Public Sector, or Manufacturing.Experience managing Oracle projects on the customer-side.Knowledge or experience with Oracle Infrastructure technologies.Experience in People and Performance Management of direct reports. Key Responsibilities1. Contract Project Management:Plan, control, and execute project requirements following Client-X's methodology to meet both Client-X and client business objectives while adhering to governance and control procedures.Collaborate with Practice Leaders to staff projects and build a cohesive, effective project team through strong leadership, setting an example, and managing performance issues as necessary.Perform risk management planning, risk identification, and mitigation.Demonstrate critical thinking and strong problem-solving skills to accelerate issue resolution and escalations.Support integration of complex process and organizational change management into project delivery.Work with functional and technical team members to define and document tasks required for tracking Oracle projects, maintaining quality project documentation.Manage client and external supplier deliverables, identifying and escalating issues or delays impacting critical path and/or commercial aspects.2. Commercial Management:Contribute to client Statements of Work (SoW), ensuring project scope details are defined for management.Track and forecast project budgets using Oracle Analytics Cloud Service to monitor budget-to-actuals.Provide regular project status updates to Client-X leadership and customer stakeholders, ensuring governance and issue resolution to maximize project profitability.Ensure in-depth understanding of SoW and adherence to contract terms, driving margin growth through change governance.Protect Client-X’s commercial interests by managing risks, limiting exposure, and ensuring official views are communicated externally.3. Stakeholder Management:Build strong, trusted relationships with clients where your expertise is valued, and work collaboratively to drive project success.Identify and document change requests while ensuring communication strategies are effectively executed for key stakeholders, including client C-level stakeholders.4. Internal Governance, Project Controls, and Practice Contributions:Adhere to Client-X’s internal governance and control procedures.Contribute to practice development by sharing best practices and building project governance materials.Note: The above responsibilities are not exhaustive but indicate the primary duties required.",
        "source": "Email",
        "date_posted": "2024-10-03 11:01:20-05:00",
        "unique_id": "19253272dab0e0d5",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]