[
    {
        "company": "AnchorPoint/Commscope",
        "job_title": "SAP Project Manager",
        "location": "Charlotte, NC, USA",
        "full_location": {
            "city": "Charlotte",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Bachelor’s Degree in business administration, IS or related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 months",
            "rate": "$65-$75 C2C"
        },
        "skills": {
            "core": [
                "project management",
                "Microsoft Office",
                "Microsoft Project",
                "Visio",
                "communication"
            ],
            "primary": [
                "project management tools",
                "structured methodologies",
                "resource management",
                "planning",
                "negotiation"
            ],
            "secondary": [
                "PMP certification",
                "conflict resolution",
                "SAP expertise",
                "manufacturing industry knowledge"
            ],
            "all": [
                "project management",
                "Microsoft Office",
                "Microsoft Project",
                "Visio",
                "communication",
                "project management tools",
                "structured methodologies",
                "resource management",
                "planning",
                "negotiation",
                "PMP certification",
                "conflict resolution",
                "SAP expertise",
                "manufacturing industry knowledge"
            ],
            "with_experience": [
                "project management (5+ years)",
                "Microsoft Office",
                "Microsoft Project",
                "Visio"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Manoj Kumar",
        "email": "manoj@indsoft.com",
        "jd": "From: ManojKumar, indsoft inc manoj@indsoft.com Reply to: manoj@indsoft.com HiHope you are doing wellPlease go through the below requirements and share your consultant availability. SAP Project Managerwe can go with 65-75 C2C range, based on experience. Client: AnchorPoint/CommscopeDuration : 6 monthsPreferred Location : Charlotte, NCHybrid work schedule: (Charlotte, Claremont, and Catawba in North Carolina) The Project Manager II is responsible for planning, monitoring and managing the delivery of projects to meet agreed deliverables, scheduled timeframes and allocated budgets. Focuses on meeting project commitments, including communications with sponsors, stakeholders, etc.RESPONSBILITIES• Lead multiple small or medium sized projects simultaneously or a large project based on complexity factors.• Lead project team including technical and non-technical staff in analysis, design, development, testing and implementation efforts.• Create project plans, including deliverables, activities, timelines and budgets.• Monitor or track project milestones and deliverables.• Work closely with various internal departments to ensure successful completion of projects.• Ensure appropriate use of Client’s IT project management tools, governance, processes, and methodologies.• Identify and track issues, assess impact, and execute timely resolution.• Conduct project status sessions with representatives from any or all department involved in the project.• Prepare reports reporting on issues and risk mitigation.• Assess, manage, resolve and escalate (if necessary) risks and issues.• Provide scheduled and on-demand status reports and updates. SKILLS• Bachelor’s Degree in business administration, IS or related field• At least 5 years of project management experience• Experience with project management tools and structured methodologies• Expertise with Microsoft Office, Microsoft Project and Visio• Strong Communication Skills• Demonstrated ability to manage resources in matrixed environment• Effective planner and ability to develop reliable estimates• Ability to negotiate and influence diverse project teams to reach project goals PREFERRED• PMP or equivalent professional project management certification• Demonstrated conflict resolution skills• Expertise in SAP• Knowledge of Manufacturing industry Thanks & RegardsManoj Kumar Technical RecruiterIndSoft Inc1700 Wall St, Suite 100, Naperville, IL 60563E-mail: manoj@indsoft.comExceeding your expectations since 19982009,2010,2011 & 2013: Awarded Inc 500 fastest growing private companies in Americawww.IndSoft.com – Technology, Finance and Accounting, HR and Engineering - Staffing and Solutions",
        "source": "Email",
        "date_posted": "2024-10-03 12:19:20-05:00",
        "unique_id": "192539be48e92782",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]