[
    {
        "company": "VKore Solutions",
        "job_title": "Senior Business Systems Analyst - Supplier Collaboration",
        "location": "Fremont, CA, USA",
        "full_location": {
            "city": "Fremont",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SAP",
                "Procure to Pay processes",
                "SQL",
                "Business Analysis",
                "Project Management"
            ],
            "primary": [
                "Supplier Collaboration systems",
                "SAP Portals",
                "BI/Dashboards",
                "Transportation Management System (TMS)",
                "Agile methodologies"
            ],
            "secondary": [
                "No code platforms",
                "S4 functionalities",
                "ProcessWeaver",
                "Communication",
                "Data Analysis"
            ],
            "all": [
                "SAP",
                "Procure to Pay processes",
                "SQL",
                "Business Analysis",
                "Project Management",
                "Supplier Collaboration systems",
                "SAP Portals",
                "BI/Dashboards",
                "Transportation Management System (TMS)",
                "Agile methodologies",
                "No code platforms",
                "S4 functionalities",
                "ProcessWeaver",
                "Communication",
                "Data Analysis"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Clark Adam",
        "email": "clark@vkoresolutions.com",
        "jd": "From: Clark Adam, VKore Solutions clark@vkoresolutions.com Reply to: clark@vkoresolutions.com Urgent position of Senior Business Systems Analyst - Supplier CollaborationLocation - Fremont ,CA ( 3 Day Onsite) Job Summary: The Business Systems Analyst is a high-performing leader, problem solver, and innovator who challenges the status quo and drives innovation. In this role, you will analyze complex business problems to be solved with re-engineered processes and automated technology solutions. You will provide consultation to end users and lead cross-functional teams to address business or systems issues.Job Responsibilities:• Architect and design integration capabilities and systems solutions in support of business objectives• Solid hands-on experience in end to end Procure to Pay processes, e.g., RFQ, forecasting, PO Management, Consignment, Sub-contracting and Supplier Collaboration, Capacity planning and Constraints, Inbound logistics, Costing and Supplier invoicing• Collaborate with the project team in leveraging various Supplier Collaboration systems through SAP Portals, BI/Dashboards, Supplier B2B technologies, .Net applications, SQL proficiency etc. to enable the organization's interim and future-state business capabilities• Experience in S4 functionalities such as Quoting tool, BTP app design, etc. preferred• Experience in Transportation Management System (TMS) applications, e.g. ProcessWeaver, SAP TM, etc. preferred• Able to put on multiple hats: Business Analyst, Data Analyst, System Analyst and communicate effectively to a diverse audience• Ability to understand business functionality and translate it into business use cases.• Translate the business requirements to functional specifications document, develop and own requirements traceability matrix• Assist the Solution/Technical Architects in identifying and managing functionality and Application issues, risks, and scope creep• Experience with both waterfall and agile project management methodologies, and ability to deliver on responsibilities during various project phases including:o Requirements (Validation and Alignment)o Design (Blueprint and Spec)o Develop (Technical Spec, Prototyping, Configuration, and Unit testing)o Test (Integration testing and User acceptance testing)o Training/Documentationo Deploy (Cutover, Go Live)o Run (Post mortem, Hypercare)• Able to manage multiple projects with competing priorities.Minimum Qualifications:• 10+ years overall SAP experience with 5+ years of experience in ECC & S/4 (MM, PP), SAP Ariba• Demonstrated expertise across multiple enterprise systems include SAP and No code platforms• Have worked in multiple end-to-end implementation projects, that included: Analysis, design, configuration, development build, test, and deployment, including training and data conversion Please share to Clark@vkoresolutions.com",
        "source": "Email",
        "date_posted": "2024-10-03 16:01:59-05:00",
        "unique_id": "1925430ba38d133f",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]