[
    {
        "company": "State of Michigan",
        "job_title": "Infrastructure Business Analyst",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "4-6 years",
            "degree_required": "Bachelor's Degree",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Microsoft Project",
                "Excel",
                "Remedy/Helix",
                "Telecommunications",
                "Clarity",
                "DevOPs"
            ],
            "primary": [
                "Data processing",
                "Business requirements gathering",
                "Technical requirements gathering",
                "Project management",
                "Customer service",
                "Communication skills",
                "Network platforms"
            ],
            "secondary": [
                "Organization skills",
                "Prioritization skills",
                "Interpersonal skills"
            ],
            "all": [
                "Microsoft Project",
                "Excel",
                "Remedy/Helix",
                "Telecommunications",
                "Clarity",
                "DevOPs",
                "Data processing",
                "Business requirements gathering",
                "Technical requirements gathering",
                "Project management",
                "Customer service",
                "Communication skills",
                "Network platforms",
                "Organization skills",
                "Prioritization skills",
                "Interpersonal skills"
            ],
            "with_experience": [
                "Microsoft Project (4-6 years)",
                "Excel (4-6 years)",
                "Remedy/Helix (4-6 years)",
                "Telecommunications (4-6 years)",
                "Clarity (2-4 years)",
                "DevOPs (3-4 years)"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "ashish",
        "email": "ashish@tekinspirations.com",
        "jd": "Hi,Job Description -Infrastructure Business AnalystClient : State of Michigan (State Client Experience is Must have)Lansing, MI (Must live within a commute to Lansing)HybridNo H1/CPT/OPT- Interviews: 1st round interviews will be held via MS Teams. There is potential a 2nd round interview could be held in-person, so please make sure your candidate is available to come onsite for an interview if requested.Overview:Receive, process, present data, and information regarding our weekly Service Requests (Infrastructure Service Requests). Responsible for gathering business and technical requirements during the client kick off meetings. Consult SMEs (Subject Matter Experts) on tasks required to complete integrated projects for all Telecommunication services, such as, WAN, WLAN, MLAN, Security, Contact/Call Centers, Telephony, and Video. Manage multiple projects based on Agency assignments. Facilitate meetings with clients to gather requirements for all IT solutions and to identify impacted business processes and determine best process and IT solution integration.Ability to obtain and report business and technical requirementsFacilitate review sessions to discuss projectsExcellent customer and communication service skillsWork with multiple network platforms, such as, WAN, MLAN, WLAN, Security, Voice, and VideoconferencingDisseminate information effectively to all technical teams, customers, and technical managersUnderstand a large (enterprise) and complex network environmentSkills, Experience and Education: Bachelors Degree, RequiredPrevious experience working with multiple agencies and/or vendors and/or departments in an enterprise environment are RequiredMinimum 4-6 years experience with Microsoft Project and Excel is RequiredMinimum 4-6 years experience with Remedy/Helix is RequiredMinimum 4-6 years working within a Telecommunications environment is RequiredMinimum 4-6 years experience in a large Enterprise setting is RequiredMinimum 4-6 years work experience with multiple network platforms is RequiredMinimum 4-6 years working with multiple network lines of service is RequiredOrganization and Prioritization skills are MandatoryCommunication and Interpersonal skills are MandatoryMinimum 2-4 years experience with Clarity Minimum 3-4 years experience with DevOPs",
        "source": "Email",
        "date_posted": "2024-10-03 19:09:34-05:00",
        "unique_id": "19254db75a845fe4",
        "emp_type": [
            "full-time",
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]