[
    {
        "company": "LARGETON INC.",
        "job_title": "Project Manager",
        "location": "Albany, NY, USA",
        "full_location": {
            "city": "Albany",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "84 Months",
            "degree_required": "Bachelor’s Degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "+6Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management Professional Certification",
                "Project Management",
                "Budget Management",
                "Microsoft Project"
            ],
            "primary": [
                "Infrastructure Projects Management",
                "Stakeholder Management",
                "Requirements Gathering",
                "Technical Integration"
            ],
            "secondary": [
                "Communication Plans",
                "Quality Standards",
                "System Documentation",
                "Facilitating Requirement Sessions"
            ],
            "all": [
                "Project Management Professional Certification",
                "Project Management",
                "Budget Management",
                "Microsoft Project",
                "Infrastructure Projects Management",
                "Stakeholder Management",
                "Requirements Gathering",
                "Technical Integration",
                "Communication Plans",
                "Quality Standards",
                "System Documentation",
                "Facilitating Requirement Sessions"
            ],
            "with_experience": [
                "Project Management (84+ Months)",
                "Infrastructure Projects Management (84 Months)",
                "Stakeholder Management (48 Months)",
                "Technical Integration (24 Months)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Manisha Gupta",
        "email": "manisha@largeton.us",
        "jd": "Hello!Hope you are doing well.I would like to share job description with you. Please review and help us to find suitable candidate.Job Title: Project ManagerLocation: ALBANY New York (Relocation will work but local will be Preferred)-OnsiteDuration: +6Months Project Management Professional Certification Mandatory Qualifications:· Expert 84+ MonthsCandidate is able to provide guidance to large teams and/or has extensive industry experience and is considered at the top of his/her field.Secondary Qualifications:84 Months experience as a Project Manager, managing infrastructure projects (building management systems, temperature monitoring systems, VOIP, wireless access and other systems) execution and control, including maintaining project budgets, Microsoft project schedules, scope requirements, status reports, communication plans, and quality standards. 60 Months experience as a project manager working as a liaison between Requesting Entity (i.e. Government Agency or Private Company) and Vendors from requirements gathering through implementation for infrastructure projects48 Months experience working on projects that require working with architecture and infrastructure team to comprehend technical requirements for integration of central server and facility systems 48 Months Project Management experience leading projects with direct stakeholder involvement at state government director level and above. 48 Months experience managing IT projects for facility moves, facility construction24 Months experience working on projects that require working with architecture and infrastructure team to comprehend technical requirements for integration of central server and facility systems and the related networking 24 Months experience in creating and maintaining system documentation artifacts for communication of requirements, including Context Diagrams, High Level Entity Relationship Diagrams, High Level and detailed architecture diagrams, high level process flow, use cases, current and to be process models, business requirements document, logical data model, non-functional requirements, and test plans. 24 Months experience facilitating requirement sessions, to ensure requirements are understood, conveyed and met Bachelor’s Degree Thanks, and RegardsManisha GuptaLARGETON INC. 13800 Coppermine Rd,Herndon, VA 20171 Disclaimer: Largeton is an equal opportunity employer. There is no discrimination based on race, color, religion, sex, national origin, age, disability, or any other protected status.",
        "source": "Email",
        "date_posted": "2024-10-03 09:11:24-05:00",
        "unique_id": "19252d3f01ff4b78",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]