[
    {
        "company": "Nukasani Group",
        "job_title": "Sr Project Manager 2",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "10 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Best competitive rate"
        },
        "skills": {
            "core": [
                "Project Management",
                "PMP Certification",
                "Risk Management",
                "Microsoft Word",
                "Microsoft Excel"
            ],
            "primary": [
                "Process Optimization",
                "Change Management",
                "Interpersonal Skills",
                "Oral Communication",
                "Written Communication",
                "Presentation Skills",
                "Applications Development"
            ],
            "secondary": [
                "Internal/External Consulting",
                "Vendor Management",
                "Team Management"
            ],
            "all": [
                "Project Management",
                "PMP Certification",
                "Risk Management",
                "Microsoft Word",
                "Microsoft Excel",
                "Process Optimization",
                "Change Management",
                "Interpersonal Skills",
                "Oral Communication",
                "Written Communication",
                "Presentation Skills",
                "Applications Development",
                "Internal/External Consulting",
                "Vendor Management",
                "Team Management"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Nancy",
        "email": "recruiter5@nukasanigroup.com",
        "jd": "Dear Partner, Good Morning, Greetings from Nukasani Group Inc! We have below urgent long-term contract project immediately available for **Sr Project Manager 2, Richmond, VA, Onsite** need submissions you please review the below role, if you are available, could you please send me updated word resume, and below candidate submission format details, immediately. If you are not available, any referrals would be greatly appreciated. Interviews are in progress, urgent response is appreciated. Looking forward for your immediate response and working with you. **Candidate Submission Format - needed from you** Full Legal Name Personal Cell No (Not google phone number) Email Id Skype Id Interview Availability Availability to start, if selected Current Location Open to Relocate Work Authorization Total Relevant Experience Education./ Year of graduation University Name, Location Last 4 digits of SSN Country of Birth Contractor Type DOB: mm/dd Home Zip Code Assigned Job Details Job Title: Sr Project Manager 2 Location: Richmond, VA, Onsite Rate: Best competitive rate Interviews will be IN PERSON ONLY ABOUT THE ROLE The Virginia State Police is looking for a Project Manager with 10+ years of experience in the field. A PM is needed to address and coordinate the replacement of the existing criminal history systems utilized by the Virginia State Police. The Project Manager will work with Business Analysts, program manager and serve as the liaison between the business community/end users and the IT organization. The project manager is responsible for managing the project scope, schedule and budget and reporting to VSP IT management and the business stakeholders/owners on a weekly basis or as agreed upon. The successful candidate must have the following qualifications: * Active Project Management Institute (PMI) Project Management Professional (PMP) certification REQUIRED * Documented high-risk project management experience * Completion of a Category 1 or 2 Commonwealth project of $5M or more, OR completion of non-COV project with a value greater than $10M as PM of record. Duties may include managing/coordinating a Request for Proposal (RFP) process composed of RFP related tasks such the review and assistance with drafting of the evaluation criteria, contract terms, RFP format, and other procurement-related documentation in coordination with the VSP procurement staff. The project manager will assist the VSP IT Division staff in responding to vendor queries, performing the vendor evaluation process and contract negotiations as necessary. The PM will direct the Business Analyst throughout the project to ensure the objectives and requirements for a new system are fully defined. The PM will oversee the vendor efforts on the design, development and implementation of the solution and will coordinate with the vendor PM and VSP IT Division and business stakeholders/owners as needed. The Project Manager, in coordination with the Business Analyst, will be responsible for the identification, analysis, tracking and recommending appropriate actions to project issues including those that are technology related. They will also be responsible for the identification and management of project risks. The PM, coordinating with the VSP IT Division, will provide overall direction to the vendor as to any interfaces to existing VSP (and non-Agency) systems. In general, the PM is responsible for the coordination and completion of the assigned projects that will result in the design, execution, delivery and implementation of a new VSP criminal history system. Skill Required / Desired Amount of Experience Review, analyze and evaluate user/system needs Required 10 Years Project management experience with a PMP Certification. Required 10 Years Proficient with Microsoft Word and XL Required 10 Years Demonstrated ability to manage multiple projects lasting 6 to 12 months, with teams of 3 to 4 people. Required 10 Years Process optimization, best practices, change management, facilitation and internal/external consulting is highly preferred. Required 10 Years Should have excellent interpersonal, oral/written communication and presentation skills. Required 10 Years Extensive knowledge of applications development Required 10 Years Documented high risk management experience Required 10 Years Completion of a Category 1 or 2 Commonwealth project of $5M or more, or completion of non-COV project with a value greater than $10M as PM of record. Required 10 Years",
        "source": "Email",
        "date_posted": "2024-10-03 02:19:19-05:00",
        "unique_id": "192513e9e05710e5",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]