[
    {
        "company": "State of DC",
        "job_title": "SQL Database Services - Hybrid Role - Need 10+ Years of Experience",
        "location": "Washington, DC, USA",
        "full_location": {
            "city": "Washington",
            "state": "DC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Bachelor’s Degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "7 days",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SQL Database Administration",
                "Database Management",
                "Performance Tuning",
                "Database Migration",
                "Database Backup"
            ],
            "primary": [
                "9-1-1 Call Handling Protocol Systems",
                "Criteria Based Dispatch",
                "Relational Database Management Systems",
                "SQL Server",
                "Database Schema Development"
            ],
            "secondary": [
                "Microsoft SQL Server Certification",
                "Next Generation 9-1-1 Technologies",
                "Troubleshooting",
                "Issue Resolution",
                "Database Object Management"
            ],
            "all": [
                "SQL Database Administration",
                "Database Management",
                "Performance Tuning",
                "Database Migration",
                "Database Backup",
                "9-1-1 Call Handling Protocol Systems",
                "Criteria Based Dispatch",
                "Relational Database Management Systems",
                "SQL Server",
                "Database Schema Development",
                "Microsoft SQL Server Certification",
                "Next Generation 9-1-1 Technologies",
                "Troubleshooting",
                "Issue Resolution",
                "Database Object Management"
            ],
            "with_experience": [
                "SQL Database Administration (10+ years)",
                "Relational Database Management Systems (10+ years)",
                "Database Performance Monitoring (10+ years)",
                "Logical and Physical Database Backups (10+ years)"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Satya Reddy",
        "email": "satya@proit-usa.com",
        "jd": "From: Satya Reddy, proit-usa satya@proit-usa.com Reply to: satya@proit-usa.com Job Title : SQL Database Services - Hybrid Role - Need 10+ Years of ExperienceLocation : Washington, DC (Hybrid Role)Client : State of DCDuration : Long Term. REQUIREMENTS SQL Database Administration Support Services The OUC is seeking to procure SQL Database Administration services from a highly qualified vendor with extensive expertise in the 9-1-1 public safety industry. The SQL Database Administrator (DBA) shall provide support services that include database management, database object and security management, database backup development, performance tuning / optimization, jobs scheduling (including backups), database migration setup and any other work related to the role of a CAD Application Database Administrator.The DBA will be responsible for applying best-practice database administration techniques and procedures to maintain and support the Agency’s CAD Application databases and database systems in addition to recommending, creating, and implementing enhancements to improve performance, security, and reliability of the systems. The DBA will be expected to identify and quickly resolve database and database server problems (for PowerPhone and Criteria Based Dispatch) if they arise and will be the primary resource for designated database applications.The DBA shall report directly to the OUC’s CAD IT Manager and provide the following services:Build, configure and harden a new CAD Application database to support and implement a Total Response Call Handling Solution for the agency. The delivered solution will include Total Response software for call handling and provide access to PowerPhone’s full range of educational services. Database schema development: Assist OUC-IT in modifying existing or creating a new database schema including but not limited to table and view design, indexing design, trigger development and stored procedure development for Total Response Call Handling Solution.Troubleshooting / Issue Resolution: The DBA shall rectify unexpected problems or issues. Unless prevented by a hardware failure or vendor support, it is expected that issues should be resolved within a (2) hour timeframe for any Tier 1 application and within a four (4) hour timeframe for any non-Tier 1 application from the time the emergency was discovered. This work could require both on-site and / or off-site work. Database migration preparation: Assist OUC-CAD team in preparing for a database migration as the agency transitions of Criteria Based Dispatch to PowerPhone. The administrator must be skilled and proficient in Criteria Based Dispatch DC medical protocol database necessary to modify existing or create new database schema including but not limited to table and view design, indexing design, trigger development and stored database procedure development, for the Criteria Based Dispatch database migration to Total Response Call Handling Solution. Database migration: Assist OUC-CAD team to execute a database migration as the agency transitions off Criteria Based Dispatch to PowerPhone. The administrator must be skilled and proficient in Criteria Based Dispatch Update Tool, and the customized DC nuances related to Criteria Based Dispatch to complete migration to PowerPhone. Performs other duties and responsibilities as required, assigned, or requested. Key Personnel The Vendor shall submit no more than one (1) resume for a DBA that meets or exceeds the required qualifications.Required Qualifications 2-3 years of experience providing DBA services to an Emergency Communications Center (ECC) 2-3 years of experience with 9-1-1 call handling protocol systems with Criteria Based Dispatch.2+ years of experience in an Emergency Communications Center with knowledge of Next Generation 9-1-1 technologies and processes 10+ years of experience with relational database management systems including SQL Server. 10+ years of experience monitoring database performance and soliciting user feedback. 10+ years of experience performing both logical and physical database backups. C.5.2.1.1.7. Bachelor’s DegreeC.5.2.1.1.8. Microsoft SQL Server Certification (MCSA with SQL Server, MCSE) preferred The proposed SQL DBA must be available to interview for this position at the request of the Agency.The DBA must be available to start work within seven (7) days of Notice to Proceed (NTP). The work provided shall include both off-site (remote) and on-site DBA services. It t is expected that some of the work will fall outside of regular working hours and will involve some work on evenings and weekends (if required). The objective of this engagement is to ensure that the databases are monitored regularly and that maintenance actions are performed proactively to ensure high availability of the databases.If the selected 9-1-1 Consultant is no longer able to work on the project, the Vendor must provide resumes for a replacement 9-1-1 Consultant within fourteen (14) calendar days for the OUC’s review and approval. The replacement candidate must meet or exceed the minimum qualifications in section C.5.2.1.1. Vendor agrees they will not assign any employee to perform services at OUC without conducting a FBI fingerprint background check. Vendor warrants they are assigning only employees who have passed a background check. Vendor specifically warrants they are screening employees for criminal arrests and / or convictions and such screenings shall be no more than three (3) months old. Vendor shall supply written confirmation that it has conducted such background check and has determined that the employee does not have any criminal conviction or pending criminal matter that would disqualify the employee from performing services at OUC. Upon request, Vendor shall deliver to OUC the results of anemployee’s criminal background check to consider suitability. Vendor agrees to defend, indemnify and hold harmless OUC and its employees for any claims, suits or proceedings alleging a breach of this warranty.",
        "source": "Email",
        "date_posted": "2024-10-03 09:24:51-05:00",
        "unique_id": "1925368837f9a957",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "DB Admin"
    }
]