[
    {
        "company": "TEK Inspirations LLC",
        "job_title": "Sr. ServiceNow Project Manager",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "IT project management",
                "IT service management",
                "ServiceNow",
                "Waterfall methodology",
                "project management"
            ],
            "primary": [
                "Planview",
                "excellent communication",
                "PowerPoint presentations",
                "project management software tools",
                "Jira",
                "Smartsheet",
                "Teams",
                "O365"
            ],
            "secondary": [
                "organizational skills",
                "resource estimating skills",
                "self-starter",
                "enthusiasm for the mission of the team"
            ],
            "all": [
                "IT project management",
                "IT service management",
                "ServiceNow",
                "Waterfall methodology",
                "project management",
                "Planview",
                "excellent communication",
                "PowerPoint presentations",
                "project management software tools",
                "Jira",
                "Smartsheet",
                "Teams",
                "O365",
                "organizational skills",
                "resource estimating skills",
                "self-starter",
                "enthusiasm for the mission of the team"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Shekhar Bhadauria",
        "email": "shekhar.bhadauria@tekinspirations.com",
        "jd": "From: Shekhar Bhadauria, TEK Inspirations LLC shekhar.bhadauria@tekinspirations.com Reply to: shekhar.bhadauria@tekinspirations.com Hi, We have an urgent opening with Sr. ServiceNow Project Manager and I have sent you job description, please go through it and let me know your comfort with it and also send me your updated resume ASAP Title: Sr. ServiceNow Project ManagerLocation: RemoteType: Contract ob descriptionMust have experience:10+ years of IT project management5+ years of IT service management and ServiceNow experienceExperience at communicating at all levels (team to executive)Understanding of Waterfall methodologyProven working experience in project management through all facets of project lifecycle.Proven track record to drive results and navigating challenges successfully.Sr. PMs should have experience coordinating work across PMs in a matrix environment, able to provide roll up of status and metric reporting, have exceptional issue management skills, and have experience defining roles and responsibilities on projects to bring clarity on the accountability of work across team members. Key Preferred Skills:Planview experience and be familiar with managing project resources, financial planning, etc. Not a must and can be trained.Excellent Communication – oral and written.Ability to lead teams through planned schedules and proactively address issues/risks.Proficient in creating effective PowerPoint presentations.Flexible to be in details and at summarized/high-level.Strong familiarity with project management software tools, methodologies, and best practices; McKesson uses Jira, Smartsheet, Teams, O365Solid organizational skills including attention to detail and multitasking skills.Effective resource estimating skills.Self-starter with a strong work ethic, who sets high standards for self and others and demonstrates enthusiasm for the mission of the team. Project Management Duties:Support the McKesson Delivery Leader through all duties to support the overall execution of the project/initiative. This includes driving collaboration, alignment and integrated delivery for a given project/initiative.Document scope, timeline, resource plan, and stakeholders.Lead the project team through each phase of the project.Identify and manage all issues and risks on the project; escalate items timely.Ensure that all the project tasks and deliverables remain on track and within cost.Manage the project folder and related documentation, ensuring decisions and status updates are captured timely.Communicate and maintain project progress and decisions via meetings and status reports on a regular basis and on demand based on stakeholder need.Establish and manage realistic and committed project schedules; taking into consideration deadlines, dependencies, resources, and costs when making changes and decisions to schedule.Ensure that the Project Team shares a common understanding of the project, that adequate resources are being applied consistent with the set timeframe.Secure acceptance and approval of deliverables from the Project Sponsor and Stakeholders, as required for the given project.Establish a project site and organize and maintain project documentation to support needs.Track financial spend against budget on third party purchases where needed.Maintain stakeholder list, develop communication plans, and assist with creating communications deliverables as needed.Use the following technologies: Microsoft: Teams, SharePoint, Outlook, Excel and PowerPoint; JiraMeasure project performance to identify areas for improvement.Adjust project management approaches as needed, based on industry best practices and professional judgement.Facilitate discussions to drive decision making, share information and collect information, as required by the project.Proactively manage change control and communicate impact in project scope, identify risks/issues, and devising contingency plans.Deliverables for each Project to be created and/or maintainedLean Business Case (justification, deliverables, milestones, level of effort by resource type, budget, schedule)High level Gantt chart and detailed project workplan/ScheduleStakeholder ListCommunications PlanResource ScheduleWeekly Status UpdatesExecutive Updates (e.g. PPTs) as needed (frequency TBD)Issue/Risk LogProject budget/forecastOthers as required, based on business need.",
        "source": "Email",
        "date_posted": "2024-10-03 12:44:13-05:00",
        "unique_id": "19253a1d7f15a7af",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]