[
    {
        "company": "Brillius",
        "job_title": "Business Analyst",
        "location": "Charleston, WV, USA",
        "full_location": {
            "city": "Charleston",
            "state": "WV",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "3+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Application Development",
                "JAD",
                "Business Warehouse",
                "Relational Database Concepts"
            ],
            "primary": [
                "Systems Development Life Cycle (SDLC)",
                "Functional Specifications",
                "Technical Specifications"
            ],
            "secondary": [],
            "all": [
                "Business Analysis",
                "Application Development",
                "JAD",
                "Business Warehouse",
                "Relational Database Concepts",
                "Systems Development Life Cycle (SDLC)",
                "Functional Specifications",
                "Technical Specifications"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Mounika",
        "email": "mounikaj@brillius.com",
        "jd": "From: mounika, brillius mounikaj@brillius.com Reply to: mounikaj@brillius.com Title: Business Analyst (Onsite)Location: Charleston, WVPLEASE SEND LOCAL CANDIDATES ONLY (registered and currently located in Charleston, WV).Must-have skills: 3+y as BA with application development exp; JAD;business warehouse/intelligence support exp; experience with relational database concepts Additional information: The candidate should be able to provide an ID if the interview is requested. The candidate interviewing must be the same individual who will be assigned to work with our client. Requirements:• Availability to work 100% of the time at the Client’s site in Charleston, WV (required);• Experience with standard concepts, practices, and procedures within application development (3+ years);• Experience with facilitating meetings or Joint Application Development (JAD) sessions in eliciting business requirements, operational constraints, and assumptions (3+ years);• Experience with Systems Development Life Cycle (SDLC) (3+ years);• Experience in preparing and documenting Functional and Technical Specifications for reporting and data warehouse work, business warehouse/intelligence support and enhancements. (3+ years);• Experience with relational database concepts, and client-server concepts (3+ years).Thank you for your interest in doing business with us. Also, I’d like to remind you that as per the executed Letter of Intent, your company has certified the following below:The same Candidate that interviews with our Recruiters will be the one who needs to show up at the Client’s site.The same resume submitted under his/her name will belong to that Candidate appearing in person.Resumes and Skill Matrixes will be completed fully and accurately and reflected in the resume consistently with verifiable work experience and credentials. Resumes can’t be edited or ‘customized’ to fit the job description.References will be of past supervisors at the client companies where you had placed your Candidate.If you want to submit candidates who are not currently your W2 employees, please ensure that you obtain their right-to-represent form prior to sending them to us. We may request this form in the event of a conflict. Our experience shows that such candidates may ask to engage directly, claiming that they have no relationship with the vendor presenting them.Any Candidate you submit to us, to the best of your knowledge, is ready to take the job, and remain on it for the duration of the project.You will inform us immediately if a Candidate you submitted to us, is hired or in advanced negotiations to be hired by another Client, to limit the damage to our client and our relationship.",
        "source": "Email",
        "date_posted": "2024-10-03 13:42:49-05:00",
        "unique_id": "19254025337e6d75",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]