[
    {
        "company": "Smart IT Frame",
        "job_title": "SR. Data Engineer",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Unix",
                "SQL",
                "AWS",
                "PySpark",
                "Python"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Unix",
                "SQL",
                "AWS",
                "PySpark",
                "Python"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Boopathy Rajan",
        "email": "boopathy@smartitframe.com",
        "jd": "From: Boopathy, Smart IT Frame boopathy@smartitframe.com Reply to: boopathy@smartitframe.com HiGreetings from Smart IT Frame, Hope you are doing well!!! Smart IT Frame specializes in enabling you with your most critical line of resources. Whether it’s for permanent staffing, contract staffing, contract-to-hire or executive search, we understand the importance of delivering the most suitable talent; on time and within budget. With our Core focus in emerging technologies, we have provided global technology workforce solutions in North America, Canada & India. We take pride in delivering specialized talent, superior performance, and seamless execution to meet the challenging business needs of customers worldwide. Role: SR. Data EngineerLocation: Richmond, VA(Onsite)Experience: 10+Mode of Hiring – ContractShift timing: 9AM – 6PM Job summaryWe are seeking a Sr. Business Analyst with 8 to 10 years of experience to join our team.The ideal candidate will possess strong technical skills in Unix, SQL, AWS, PySpark, and Python.This hybrid role requires a proactive individual who can analyze business needs and translate them into technical solutions.The position operates during day shifts and does not require travel.ResponsibilitiesAnalyze business requirements and translate them into technical specifications.Collaborate with stakeholders to understand their needs and provide effective solutions.Utilize Unix, SQL, AWS, PySpark, and Python to develop and implement data-driven solutionsOversee the development and maintenance of data pipelines and workflowsProvide insights and recommendations based on data analysis to support business decisions.Ensure data integrity and accuracy through rigorous testing and validation processes.Develop and maintain documentation for all data processes and workflows.Conduct regular reviews and updates of existing systems to ensure optimal performance.Work closely with cross-functional teams to ensure seamless integration of new solutions.Monitor and troubleshoot issues related to data processing and analysis.Lead efforts to improve data quality and streamline data management processes.Provide training and support to team members on new tools and technologies.Stay updated with the latest industry trends and best practices in data analysis and business intelligence.QualificationsPossess a strong background in Unix, SQL, AWS, PySpark, and Python.Demonstrate excellent analytical and problem-solving skills.Exhibit strong communication and collaboration abilities.Show proficiency in developing and maintaining data pipelines.Have experience in data validation and ensuring data accuracy.Be capable of documenting technical processes clearly and concisely.Display a proactive approach to learning and implementing new technologies. --Thanks and RegardsBoopathy Rajan STalent Acquisition GroupEmail: boopathy@smartitframe.comSmart IT Frame LLC.",
        "source": "Email",
        "date_posted": "2024-10-03 09:39:40-05:00",
        "unique_id": "19252da3d8d0a004",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]