[
    {
        "company": "HMG America LLC",
        "job_title": "Technical Business Analyst",
        "location": "Austin, TX, USA",
        "full_location": {
            "city": "Austin",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "CSDM",
                "ServiceNow",
                "Business Analysis",
                "Data Modeling",
                "Database Management"
            ],
            "primary": [
                "Data Analysis",
                "Application Development",
                "Cloud Computing",
                "Agile Development",
                "Business Process Modeling"
            ],
            "secondary": [
                "Certification in business analysis",
                "Technical Guidance",
                "Playbook Development",
                "Architectural Diagrams",
                "Technical Standards"
            ],
            "all": [
                "CSDM",
                "ServiceNow",
                "Business Analysis",
                "Data Modeling",
                "Database Management",
                "Data Analysis",
                "Application Development",
                "Cloud Computing",
                "Agile Development",
                "Business Process Modeling",
                "Certification in business analysis",
                "Technical Guidance",
                "Playbook Development",
                "Architectural Diagrams",
                "Technical Standards"
            ],
            "with_experience": [
                "CSDM",
                "ServiceNow"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "sanjeev",
        "email": "sanjeev@hmgamerica.com",
        "jd": "From: sanjeev, HMG America LLC sanjeev@hmgamerica.com Reply to: sanjeev@hmgamerica.com Title: Technical Business AnalystLocation: Austin/Houston/Dallas , Texas Local candidates onlyPrimary Skills: CSDM AND ServicenowPlease share senior ServiceNow Business Analyst ( Not Developers or Admin) Job Description:Technical Business Analyst (TBA)The Technical Business Analyst (TBA) will play a pivotal role in bridging the gap between business needs and technical solutions in ServiceNow. This individual will be responsible for analyzing business requirements, translating them into technical specifications, and ensuring that the delivered solution aligns with the overall business objectives.Responsibilities: Business Analysis: Gather, analyze, and document business requirements, including process flows, use cases, and data models. Collaborate with stakeholders to understand their needs and priorities. Develop and maintain business process documentation. Analytical Skills: Utilize data analysis techniques to identify trends, patterns, and opportunities for improvement. Develop and maintain data dictionaries and data quality standards. Application Development: Work closely with development teams to ensure that technical solutions align with business requirements. Provide technical guidance and support throughout the development lifecycle. CSDM Experience: Possess a deep understanding of the Common Services Data Model (CSDM) and its application in enterprise data management. Contribute to the design and implementation of CSDM-based data solutions. PlaybookRunbook Development: Create detailed playbooks and runbooks to guide operational activities and incident response. Ensure that playbooks and runbooks are well-documented and easy to follow. Architectural Diagrams: Develop and maintain architectural diagrams, including system, data, and network diagrams. Communicate complex technical concepts to both technical and non-technical audiences. Technical Skills: Proficiency in data modeling and database management tools. Strong understanding of software development methodologies and tools. Familiarity with business process modeling and analysis techniques. Knowledge of cloud computing platforms and technologies (e.g., AWS, Azure, GCP). Preferred Qualifications: Certification in business analysis (e.g., CBAP, CCBA). Experience with Agile development methodologies. Knowledge of specific industry standards or regulations. (1.) To be responsible for providing technical guidance or solutions ;define, advocate, and implement best practices and coding standards for the team. (2.) To develop and guide the team members in enhancing their technical capabilities and increasing productivity (3.) To ensure process compliance in the assigned module, and participate in technical discussionsorreview as a technical consultant for feasibility study (technical alternatives, best packages, supporting architecture best practices, technical risks, breakdown into components, estimations). (4.) To prepare and submit status reports for minimizing exposure and risks on the project or closure of escalations.",
        "source": "Email",
        "date_posted": "2024-10-03 09:53:04-05:00",
        "unique_id": "19252e38c0ef2fb0",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]