[
    {
        "company": "Indsoft Inc.",
        "job_title": "SAP Project Manager",
        "location": "Charlotte, NC, USA",
        "full_location": {
            "city": "Charlotte",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "At least 5 years of project management experience",
            "degree_required": "Bachelor’s Degree in business administration, IS or related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ Months Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "project management",
                "Microsoft Office",
                "Microsoft Project",
                "Visio",
                "communication"
            ],
            "primary": [
                "project management tools",
                "structured methodologies",
                "resource management",
                "planning",
                "negotiation"
            ],
            "secondary": [
                "PMP",
                "conflict resolution",
                "SAP",
                "manufacturing industry knowledge"
            ],
            "all": [
                "project management",
                "Microsoft Office",
                "Microsoft Project",
                "Visio",
                "communication",
                "project management tools",
                "structured methodologies",
                "resource management",
                "planning",
                "negotiation",
                "PMP",
                "conflict resolution",
                "SAP",
                "manufacturing industry knowledge"
            ],
            "with_experience": [
                "project management (5+ years)",
                "Microsoft Office",
                "Microsoft Project",
                "Visio"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Alka Rai",
        "email": "alka@indsoft.com",
        "jd": "Hello, My name is Alka Rai and I am a Staffing Specialist at Indsoft Inc. I am reaching out to you on an exciting job opportunity with one of our clients Position: SAP Project ManagerLocation: Charlotte, NC-HybridDuration:- 6+ Months ContractVisa:-W2 and C2C The Project Manager II is responsible for planning, monitoring and managing the delivery of projects to meet agreed deliverables, scheduled timeframes and allocated budgets. Focuses on meeting project commitments, including communications with sponsors, stakeholders, etc. RESPONSBILITIES• Lead multiple small or medium sized projects simultaneously or a large project based on complexity factors.• Lead project team including technical and non-technical staff in analysis, design, development, testing and implementation efforts.• Create project plans, including deliverables, activities, timelines and budgets.• Monitor or track project milestones and deliverables.• Work closely with various internal departments to ensure successful completion of projects.• Ensure appropriate use of Client’s IT project management tools, governance, processes, and methodologies.• Identify and track issues, assess impact, and execute timely resolution.• Conduct project status sessions with representatives from any or all department involved in the project.• Prepare reports reporting on issues and risk mitigation.• Assess, manage, resolve and escalate (if necessary) risks and issues.• Provide scheduled and on-demand status reports and updates. SKILLS• Bachelor’s Degree in business administration, IS or related field• At least 5 years of project management experience• Experience with project management tools and structured methodologies• Expertise with Microsoft Office, Microsoft Project and Visio• Strong Communication Skills• Demonstrated ability to manage resources in matrixed environment• Effective planner and ability to develop reliable estimates• Ability to negotiate and influence diverse project teams to reach project goals PREFERRED• PMP or equivalent professional project management certification• Demonstrated conflict resolution skills• Expertise in SAP• Knowledge of Manufacturing industry",
        "source": "Email",
        "date_posted": "2024-10-03 10:51:27-05:00",
        "unique_id": "192531a80453b1f5",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]