[
    {
        "company": "Prospect Infosystem Inc",
        "job_title": "Business Analyst with EHR Exp",
        "location": "Madison, WI, USA",
        "full_location": {
            "city": "Madison",
            "state": "WI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "$55/Hr on C2C (Non Negotiable)"
        },
        "skills": {
            "core": [
                "EHR / EMR Systems",
                "Business Objects Reporting Solution",
                "SQL",
                "PL SQL",
                "CCL code writing"
            ],
            "primary": [
                "Agile environment",
                "System Development Life Cycle",
                "User Acceptance Testing (UAT)",
                "Test script maintenance",
                "Test automation",
                "Business process mapping",
                "Process improvements",
                "I.T. systems integration"
            ],
            "secondary": [
                "JIRA tool experience",
                "Good understanding of Scheduling and Registration",
                "HIM",
                "Provider",
                "Pharmacy",
                "Lab and Nursing Workflows",
                "Good communication and presentation skills",
                "Identifying integration points",
                "Reporting and dashboard maintenance"
            ],
            "all": [
                "EHR / EMR Systems",
                "Business Objects Reporting Solution",
                "SQL",
                "PL SQL",
                "CCL code writing",
                "Agile environment",
                "System Development Life Cycle",
                "User Acceptance Testing (UAT)",
                "Test script maintenance",
                "Test automation",
                "Business process mapping",
                "Process improvements",
                "I.T. systems integration",
                "JIRA tool experience",
                "Good understanding of Scheduling and Registration",
                "HIM",
                "Provider",
                "Pharmacy",
                "Lab and Nursing Workflows",
                "Good communication and presentation skills",
                "Identifying integration points",
                "Reporting and dashboard maintenance"
            ],
            "with_experience": [
                "EHR / EMR Systems",
                "Business Objects Reporting Solution",
                "SQL",
                "PL SQL",
                "CCL code writing"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Harry",
        "email": "harry@prospectinfosystem.com",
        "jd": "From: Harry, Prospect Infosystem Inc harry@prospectinfosystem.com Reply to: harry@prospectinfosystem.com Dear All, I represent Prospect Infosystem Inc. I found your resume online and wanted to reach out to you to see if the position below would be of any interest to you: I would appreciate it if you can connect back with me either by email at harry@prospectinfosystem.com or at 636-536-0505 X 127 Job Title: Business Analyst with EHR ExpLocation: Madison, WI (Hybrid)Duration: Long TermRate: $55/Hr on C2C (Non Negotiable) Job Description: Position Summary This role is completely remote, except for the initial day which requires reporting to the office for onboarding. The person implements, maintaining, and configuring projects related to the support of the DOC’s Health and Behavior Solutions team. Oracle Cerner offers the EHR platform as a vendor solution for the State of Wisconsin’s Corrections Support Bureau of Health Services. The EHR core team is composed of department employees from the Bureau of Technology Management, medical staff from other program divisions, and EHR private vendors. By working closely with the Reporting Committee and EHR, this role helps identify opportunities for optimizing business processes within EHR workflows. In addition, this position will perform the necessary build and testing for successful EHR optimizations, reporting through Discern analytics and SAP Business Objects (BO), and upgrades in Provider, Nursing, and Pharmacy workflow, Dentrix, and Dragon Medical One, and more. Experience in Agile environment and System Development Life Cycle Test script maintenance and test automation. Working in a government or correctional environment. Good understanding of Scheduling and Registration, HIM, Provider, Pharmacy, lab and Nursing Workflows. B.A. shall have experience with the ability to understand and document business requirements for reporting in a HIPAA regulated environment. Experience in change management systems. Knowledge of vendor-based application release cycle and ticket management. Good business process mapping and process capture through Visio flow diagrams. Ability to identify integration points. Knowledge of reporting and dashboard maintenance. Experience in process improvements and I.T. systems integration. Ability to work with cross-functional teams. Ability to work with business teams and good communication and presentation skills. Experience in User Acceptance Testing (UAT), running regression tests on systems, and identifying, designing, and optimizing new and existing test cases. JIRA tool experience. (nice to have) Experience with SQL, PL SQL and CCL code writing. Follow good reporting practice based on HIPAA and WI DOC rules. Existing knowledge of Discern Reporting Portal (Static and Interactive Reporting). Required Skills & Years of Experience: 5+ years of experience in the following: Maintaining and vendor-managed software, performing maintenance, testing, upgrades, and configurations.Communicating software configuration with external and internal stakeholders.Working with external stakeholders to identify process improvements and optimizations.Experience engaging with users to troubleshoot and resolve application-related issues.Existing knowledge of EHR / EMR Systems.Existing knowledge of implementing and integration new analytics and reporting platform for healthcare.Existing Knowledge of Business Objects Reporting Solution. Nice to have skills:Experience with SQL, PL SQL and CCL code writing.Experience in Agile environment and System Development Life CycleExperience in User Acceptance Testing (UAT), running regression tests on systems, and identifying, designing, and optimizing new and existing test cases.Good understanding of Scheduling and Registration, HIM, Provider, Pharmacy, lab and Nursing Workflows.B.A. shall have experience with the ability to understand and document business requirements for reporting in a HIPAA regulated environment.JIRA tool experience. Details Required:Full Name: Phone: Email: Last 4 digits of SS#: Linked IN:Birthday (month & day only): Work Status in US: Location (city, state): Passport number:Availability to do a video interview: Availability to start: Current Situation / Reason for Looking: Full Address: 2 Professional References:Reference 1:Full Name:Client:Role:Email:Phone: Reference 2:Full Name:Client:Role:Email:Phone:",
        "source": "Email",
        "date_posted": "2024-10-03 14:13:08-05:00",
        "unique_id": "19253cc157fd7524",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]