[
    {
        "company": "Mphasis",
        "job_title": "Senior Java AWS Developer",
        "location": "Wilmington, DE, USA",
        "full_location": {
            "city": "Wilmington",
            "state": "DE",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "5+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Spring",
                "Spring Boot"
            ],
            "primary": [
                "React",
                "Angular",
                "AWS",
                "Microservices",
                "REST API",
                "CI/CD"
            ],
            "secondary": [
                "Terraform",
                "Kafka",
                "Junit",
                "Mockito"
            ],
            "all": [
                "Java",
                "Spring",
                "Spring Boot",
                "React",
                "Angular",
                "AWS",
                "Microservices",
                "REST API",
                "CI/CD",
                "Terraform",
                "Kafka",
                "Junit",
                "Mockito"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Manohar Reddy",
        "email": "manohar.n@procorpsystems.com",
        "jd": "From: Manohar Reddy, Procorp Systems Inc manohar.n@procorpsystems.com Reply to: manohar.n@procorpsystems.com Senior Java AWS Developer Wilmington, DE (Onsite) Need local consultants or nearby locations Mphasis Job responsibilities Executes software solutions, design, development, and technical troubleshooting with ability to think beyond routine or conventional approaches to build solutions or break down technical problems. Creates secure and high-quality production code and maintains algorithms that run synchronously with appropriate systems. Produces architecture and design artifacts for complex applications while being accountable for ensuring design constraints are met by software code development. Gathers, analyzes, synthesizes, and develops visualizations and reporting from large, diverse data sets in service of continuous improvement of software applications and systems. Proactively identifies hidden problems and patterns in data and uses these insights to drive improvements to coding hygiene and system architecture. Contributes to software engineering communities of practice and events that explore new and emerging technologies. Adds to team culture of diversity, equity, inclusion, and respect Required qualifications, capabilities, and skills Formal training or certification on software engineering concepts and 5+ years applied experience Hands-on practical experience in system design, application development, testing, and operational stability Proficient in coding in one or more languages; Java, Spring, Spring Boot Experienced in React, Angular, experience in building user interfaces with a great focus on user experience; be able to lead technical design and build outs independently Experienced in integrating UI components with micro-services. Experience in developing, debugging, and maintaining code in a large corporate environment with one or more modern programming languages and database querying languages. Overall knowledge of the Software Development Life Cycle Solid understanding of agile methodologies such as CI/CD, Applicant Resiliency, and Security Demonstrated knowledge of software applications and technical processes within a technical discipline (e.g., cloud, artificial intelligence, machine learning, mobile, etc.) Preferred qualifications, capabilities, and skills Familiarity with modern front-end technologies Exposure to AWS cloud technologies Good analytical thinking and problem solving abilities. Solid understanding of object-oriented programming Familiar with various design and architectural patterns Experience in creating & consuming REST API, Microservices Experience in Spring Boot, Spring Security & Spring ecosystem. Good working experience in Kafka. Working experience in writing Unit test cases with Junit & Mockito Good experience with AWS services such as IAM, EKS, S3, Secrets Manager, CloudWatch, ALB & Route53 Experience in working with CICD pipeline. Skillset: Java, Spring, Spring Boot, Experienced in React, Angular & AWS Experience in Terraform will be a plus.",
        "source": "Email",
        "date_posted": "2024-10-03 09:57:01-05:00",
        "unique_id": "19252eab41eadedf",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]