[
    {
        "company": "SourceMantra Inc",
        "job_title": "Sr. Java Full Stack Developer with P&C insurance experience",
        "location": "Boston, MA, USA",
        "full_location": {
            "city": "Boston",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Bachelor’s or master’s degree (preferred) in Computer Science or related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "J2EE",
                "AWS",
                "RESTful Web Services",
                "Spring",
                "Spring Boot",
                "SQL"
            ],
            "primary": [
                "Angular (version 12 and/or above)",
                "Hibernate/MyBatis",
                "WebSphere",
                "JBOSS",
                "ESB (Mule)",
                "JUnit",
                "Unix Shell Scripting",
                "JavaScript",
                "SOAP"
            ],
            "secondary": [
                "Mobile/iOS/Android development",
                "Java Certifications",
                "Class diagrams",
                "Sequence diagrams",
                "Activity diagrams",
                "Knowledge of IT concepts",
                "Object Oriented Design Patterns",
                "P&C (property and casualty) insurance industry experience"
            ],
            "all": [
                "Java",
                "J2EE",
                "AWS",
                "RESTful Web Services",
                "Spring",
                "Spring Boot",
                "SQL",
                "Angular (version 12 and/or above)",
                "Hibernate/MyBatis",
                "WebSphere",
                "JBOSS",
                "ESB (Mule)",
                "JUnit",
                "Unix Shell Scripting",
                "JavaScript",
                "SOAP",
                "Mobile/iOS/Android development",
                "Java Certifications",
                "Class diagrams",
                "Sequence diagrams",
                "Activity diagrams",
                "Knowledge of IT concepts",
                "Object Oriented Design Patterns",
                "P&C (property and casualty) insurance industry experience"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Srujan Burra",
        "email": "srujan@sourcemantra.com",
        "jd": "Greetings, We have the below requirement with our Client. Kindly go through the JD below and let me know your interest. Position: Sr. Java Full Stack Developer with P&C insurance experienceLocation: Boston, MA (4 days/week onsite)Duration: Long Term Contract Need USC, H1B & H4 EAD candidates only. LinkedIn & Passport Number Must for Submission. Need 10+ years’ experience F2F interview is required Job Description:Looking for a senior-level Java Developer to join a high performing engineering team to drive the modernization of our internal eService systems (the primary customer-facing website). You will play a pivotal role in enhancing our applications, providing production support and technical upgrades. Essential Functions and Responsibilities:Hands-on full-stack Java development.Working cross-functionally with business colleagues, you'll address technical challenges and ensure quality through collaborative discovery, design, and development.You will develop customer-centric applications with the understanding that your stakeholders and the products you develop will keep the end-user at the forefront.Enhance quality, usability, performance, security, and reliability of systems.Maintain awareness of internet trends, technologies, and best practices.Using a proactive mindset and initiative, you will find ways to improve performance, quality, and efficiency.Contribute to technical architecture decisions/efforts to build and maintain highly scalable software platforms.This person will handle all stages of the development lifecycle (including the review of business requirements, design, construction, test, and deployment).Architect, implement, and optimize scalable databases.Mentor junior level developers and direct others while promoting a spirit of partnership and collegiality across all functional areas of the firm.Work with stakeholders and Business Analysts to understand requirements and translate to design.Functional/system integration testing support and deployment. Qualifications and Education:6-8+ years of frontend and backend experience building scalable applications in Java/J2EE required (Java version 8 and above preferred).AWS and RESTful Web Services.Spring, Spring boot, WebSphere, JBOSS, ESB (Mule), Rule Engines (e.g., Drools), JUnit, Hibernate/MyBatis, Web Service, Unix Shell Scripting.Angular (version 12 and/or above)Experience with JavaScript based systems such as AngularJS, ExpressJS, NodeJS or ReactJS.SQL, XML and DB2.Mobile/iOS/Android development experience is a plusJava Certifications preferred (developer, web component).Experience in design; class diagrams, sequence diagrams, activity diagrams, etc.SOAP and REST web services design and development experience.Bachelor’s or master’s degree (preferred) in Computer Science or related field.Knowledge of IT concepts, strategies, methodologies.Knowledge of diverse technologies and new technical architecture principles and concepts.Understanding of layered systems architectures and layered solutions and designs.Object Oriented Design Patterns.P&C (property and casualty) insurance industry experience preferred but not required.",
        "source": "Email",
        "date_posted": "2024-10-03 14:32:58-05:00",
        "unique_id": "19253de3e09121ce",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]