[
    {
        "company": "Upward Talent",
        "job_title": "Senior Java Developer",
        "location": "New York City, NY, USA",
        "full_location": {
            "city": "New York City",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "9+ years",
            "degree_required": "Bachelor’s or Master’s degree in Computer Science, Engineering, Finance, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Actimize ACT One",
                "Apache Spark",
                "Apache Camel",
                "SpringBoot",
                "NoSQL databases"
            ],
            "primary": [
                "Financial services",
                "Compliance monitoring",
                "Data management",
                "Problem-solving",
                "Analytical skills"
            ],
            "secondary": [
                "Experience with other compliance and surveillance platforms",
                "Knowledge of regulatory frameworks and requirements in financial services"
            ],
            "all": [
                "Java",
                "Actimize ACT One",
                "Apache Spark",
                "Apache Camel",
                "SpringBoot",
                "NoSQL databases",
                "Financial services",
                "Compliance monitoring",
                "Data management",
                "Problem-solving",
                "Analytical skills",
                "Experience with other compliance and surveillance platforms",
                "Knowledge of regulatory frameworks and requirements in financial services"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Diksha Tiwari",
        "email": "dtiwari@upwardtalent.com",
        "jd": "Hope you are doing good. I am hiring a Consultant for one of my client's requirements. Job Description for the same is written below. Job Title: Senior Java Developer Location: : New York City, NY (Hybrid) Duration: 12+ Months Any Visa 13+ Experience Must— Essential Responsibilities :- Develop, maintain, and optimize high-quality software solutions using advanced Java programming skills. Engage in system integration, performance tuning, and troubleshooting complex issues. Ensure the quality and reliability of software through code reviews, testing, and adherence to best practices. Design, develop, and implement solutions using the Actimize ACT One platform. Customize and configure the platform to align with specific business needs, enhancing compliance monitoring and reporting capabilities. Utilize technologies like Apache Spark for big data processing and analytics. Implement solutions using Apache Camel for integrating various systems and services. Design and manage data models using NoSQL databases. Work with Finacle data models, APIs, and workflows for efficient data management. Apply understanding of financial services, particularly compliance and regulatory requirements. Leverage knowledge of financial products and markets, including equities and OTC, to develop effective solutions. Essential Requirements : Bachelor’s or Master’s degree in Computer Science, Engineering, Finance, or a related field. 9+ years of experience in software development, with a strong focus on Java. Proven experience with Actimize ACT One, Spark, Apache Camel, SpringBoot, and NoSQL databases. Familiarity with Finacle data models, APIs, and workflows. Excellent problem-solving and analytical skills. Ability to work collaboratively in a fast-paced environment. Preferred Skills : Experience with other compliance and surveillance platforms. Knowledge of regulatory frameworks and requirements in financial services.",
        "source": "Email",
        "date_posted": "2024-10-03 15:58:17-05:00",
        "unique_id": "192542d30957c6c6",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]