[
    {
        "company": "Texas Education Agency (TEA)",
        "job_title": "AWS App Developer",
        "location": "Austin, TX, USA",
        "full_location": {
            "city": "Austin",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "8 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 + Month",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "JavaScript",
                "Python programming",
                "AWS IAM",
                "AWS S3"
            ],
            "primary": [
                "Cloud Solution Architect",
                "AWS Glue",
                "AWS Amplify",
                "AWS MQ",
                "AWS SQ"
            ],
            "secondary": [
                "Experience with Windows OS",
                "Experience with Linux OS"
            ],
            "all": [
                "Java",
                "JavaScript",
                "Python programming",
                "AWS IAM",
                "AWS S3",
                "Cloud Solution Architect",
                "AWS Glue",
                "AWS Amplify",
                "AWS MQ",
                "AWS SQ",
                "Experience with Windows OS",
                "Experience with Linux OS"
            ],
            "with_experience": [
                "Java (8 years)",
                "JavaScript (8 years)",
                "Python programming (8 years)",
                "AWS IAM (8 years)",
                "AWS S3 (8 years)",
                "Cloud Solution Architect (4 years)",
                "AWS Glue (4 years)",
                "AWS Amplify (4 years)",
                "AWS MQ (4 years)",
                "AWS SQ (4 years)"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Prasun Srivastav",
        "email": "prasun.srivastava@gvrinfotek.com",
        "jd": "Job Description –Position: AWS App DeveloperClient: The Texas Education Agency (TEA),Location: Austin, TX (Remote)Duration: 12 + MonthInterview: Virtual Visa: GC/USC/GCEAD/H4EADMust Have: Must Have public sector experience, then experience from \"education type where \"education is a major part of the job. All REQUIRED or PREFERRED client requirements in years of experience must be met or exceededNeed references Public sector in Dept of Education should be your immediate focus. The Texas Education Agency (TEA), is looking for an AWS App Developer. If you have an exclusive candidate that meets/exceeds these requirements, please let me know and I’ll get the forms to you for completion. Here are the details. JOB TITLE: AWS DeveloperLOCATION: Austin, TX (100% remote anywhere from continental United States)JOB DESCRIPTION/MINIMUM REQUIREMENTS:Plans, develops, tests, and documents computer programs, applying knowledge of programming techniques and computer systems. Evaluates user request for new or modified program, such as data ETL pipelines (using Python/AWS Glue) or front-end data submission app development (using Javascript/AWS Amplify). Consults with user to identify current operating procedures and clarify program objectives. Formulates plan outlining steps required to develop program, using methodologies such as structured analysis and design or object-oriented development. Participate the implementation of AWS Data Lake instance by translating program needs into technical requirements, supporting program leads in defining the long-term vision for the project, defining and implementing data governance / identity and access management policies, tracking project expenses, testing and validating new functionality, enabling program staff to use new tools, and regularly interfacing with both internal and external stakeholders. Role includes programming to implement new data feeds via API, maintaining AWS Amplify data upload platform, and implementing and maintaining crawlers and jobs in AWS Glue. Minimum Requirements:Candidates that do not meet or exceed the minimum stated requirements (skills/experience) will be displayed to customers but may not be chosen for this opportunity. YearsRequired/PreferredExperience8RequiredJava, JavaScript or Python programming8RequiredAWS IAM8RequiredAWS S34RequiredCloud Solution Architect4PreferredAWS Glue4PreferredAWS Amplify4PreferredAWS MQ, SQ4PreferredExperience with Windows and Linux OS",
        "source": "Email",
        "date_posted": "2024-10-03 10:02:20-05:00",
        "unique_id": "19252ecd0fa967cf",
        "emp_type": [
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]