[
    {
        "company": "SSPEARHEAD INC",
        "job_title": "Principal Database Administrator",
        "location": "Roswell, GA, USA",
        "full_location": {
            "city": "Roswell",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Bachelor’s degree in information technology or a related field is preferred.",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Permanent",
            "rate": "Disclose later"
        },
        "skills": {
            "core": [
                "Oracle Database technologies",
                "Microsoft SQL Server",
                "Oracle E-Business Suite (EBS)",
                "SOX compliance"
            ],
            "primary": [
                "Database administration",
                "Database security",
                "High-availability (HA) strategies",
                "Disaster recovery (DR) strategies"
            ],
            "secondary": [
                "Mentorship",
                "Installation and configuration",
                "Patching of Oracle RAC",
                "Collaboration with application teams"
            ],
            "all": [
                "Oracle Database technologies",
                "Microsoft SQL Server",
                "Oracle E-Business Suite (EBS)",
                "SOX compliance",
                "Database administration",
                "Database security",
                "High-availability (HA) strategies",
                "Disaster recovery (DR) strategies",
                "Mentorship",
                "Installation and configuration",
                "Patching of Oracle RAC",
                "Collaboration with application teams"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Yogesh Dahiya",
        "email": "yogeshd@sspearhead.com",
        "jd": "Hi, Hope you are doing good. Please have a look on below position and let me know if you are interested?\n\nRequired Documentation: Make sure you if you are fine with this job then please share the below details at the time submission time. If you are not going to provide these details then please don’t apply for this job.\n1: Passport mandatory for these visa’s ( EAD, GC and H1B)\n2: Visa stamping copy required for H1 B\n3: Must be provide 3 references with full name, email id, client name and phone number.\n\nWe are pleased to announce an exciting direct hire career opportunity for a Principal Database Administrator at our client’s organization in Roswell, GA. Candidates MUST have: 10+ years of experience Expert-level knowledge in Oracle Database technologies and Microsoft SQL Server USC or GC only Must already be located within driving distance to Roswell, GA 30075. The client will not accept any candidates who need to relocate for hybrid work.\n\nTitle: Principal Database Administrator\nDuration: Full-Time Employee (FTE)\nDirect Hire Salary: Disclose later + benefits (no bonus)\nWork Location: 1035 Alpharetta Street, Roswell, GA 30075\nHybrid (On-site/remote): 3 days on-site / 2 days remote\nVisa Status: US Citizen or Green Card Only, the client cannot sponsor any visas at this time\nReports to: DBA Manager\nClient Req #: JA #1008566\n\nPlease submit Word.doc Resume, Photo ID and/or LinkedIn Full Legal Name:\nFirst: Middle: Last: Email Address: Telephone Number #: Current Location: [City, State] Availability for the assignment: Communication Skills Rating (1-10): Available face-to-face interview in 1035 Alpharetta Street, Roswell, GA 30075 (Yes/No): Commitment to On-Site/Hybrid Work from assignment start: [Yes/No] Last 4 Digits of SSN (For All Other Clients): Date of Birth (Month/Day): Status and Expiry Date (Month/Year): Education Background for Bachelors & Masters (Must be Reflected on Resume) Degree, Field of Study, Educational Institution, Graduation Date, Month/Year\n\nAs the most senior member of the DBA team, the Principal Database Administrator will be responsible for architecting, managing, and optimizing the organization’s database infrastructure. This role requires expert-level technical proficiency in database administration, particularly with Oracle and Microsoft SQL Server, along with specialized expertise in Oracle E-Business Suite (EBS) administration and configuration.\n\nKey Responsibilities:\nProvide mentorship to other DBA team members while managing the architecture, administration, monitoring, and optimization of databases for optimal performance.\nOversee complex installation, configuration, upgrades, and patching of Oracle RAC and Microsoft SQL Server HA clusters.\nDesign and implement high-availability (HA) and disaster recovery (DR) strategies aligned with business needs.\nCollaborate with application teams to enhance EBS application performance and support deployment processes while ensuring compliance.\n\nKey Qualifications:\n10+ years of hands-on database administration experience with expert-level knowledge in Oracle Database technologies and Microsoft SQL Server.\nExtensive experience with Oracle E-Business Suite (EBS) and strong understanding of SOX compliance.\nProficiency in database security, encryption, and regulatory compliance.\nA Bachelor’s degree in information technology or a related field is preferred.\n\nWorking Environment:\nThis position offers a flexible working environment, allowing for remote work, while also requiring on-site collaboration three days a week.\n\nIf you are interested in this opportunity and believe you meet the qualifications outlined above, please reply to this email with your updated resume or feel free to reach out with any questions. We look forward to connecting with you soon! E-mail is the best way to reach me, if I don’t pick your call.",
        "source": "Email",
        "date_posted": "2024-10-30 10:07:34-05:00",
        "unique_id": "192de17bb436577f",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Oracle DBA"
    }
]