[
    {
        "company": "iTech US, Inc.",
        "job_title": "PAM Project/program manager",
        "location": "Jersey City, NJ, USA",
        "full_location": {
            "city": "Jersey City",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "IAM",
                "PAM",
                "Risk Management",
                "Stakeholder Communication"
            ],
            "primary": [
                "Budget Management",
                "Resource Allocation",
                "Continuous Improvement",
                "Technical Requirements Gathering",
                "Prototyping"
            ],
            "secondary": [
                "Process Automation",
                "Documentation",
                "KPI Monitoring",
                "Relationship Building"
            ],
            "all": [
                "Project Management",
                "IAM",
                "PAM",
                "Risk Management",
                "Stakeholder Communication",
                "Budget Management",
                "Resource Allocation",
                "Continuous Improvement",
                "Technical Requirements Gathering",
                "Prototyping",
                "Process Automation",
                "Documentation",
                "KPI Monitoring",
                "Relationship Building"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Varsha Tarange",
        "email": "varsha@itechus.net",
        "jd": "From: Varsha Tarange, iTech US, Inc. varsha@itechus.net Reply to: varsha@itechus.net Hi We Have an urgent Opening with one of our clients, please see the job description below for your review. Location : Jersey City, NJ, Hybrid presence is mandatory (No remote)Role: PAM Project/program manager JDDefine project scope, goals, timelines, and budgets for IAM initiatives. Develop detailed project plans, work breakdown structures, and resource allocation strategies. Manage project risks, issues, and dependencies, escalating as needed. Drive continuous improvement for the security of Identity and Access Management.Deliver timely guidance and robust PAM solutions to address IAM security needs.Review and lead the gathering of business, functional and technical requirements for establishing secure IAM environment.Build prototypes and proofs of concept to demonstrate feasibility for new, innovative security technologies.Facilitating the establishment and implementation of standards, processes, and documentation that guide the design of technology solutions including architecting and implementing solutions around privileged access management. Identifying opportunities for system process automation including technologies required; documenting and presenting ideas to management.Present PAM concepts to stakeholders with various level of technical understanding.Monitor project progress against established timelines and KPIs, providing regular status updates to stakeholders.Build strong relationships with key stakeholders across different departments, including IT, security, compliance, and business leadership. Communicate project plans, updates, and potential impacts to stakeholders effectively. Address concerns and manage expectations throughout the project lifecycle Thanks & Regards Varsha TarangeiTech US, Inc.",
        "source": "Email",
        "date_posted": "2024-10-30 07:23:11-05:00",
        "unique_id": "192dd814729d51d0",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]