[
    {
        "company": "Techgene Solutions, LLC",
        "job_title": ".NET Developer",
        "location": "Indianapolis, IN, USA",
        "full_location": {
            "city": "Indianapolis",
            "state": "IN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Bachelor’s degree in Computer Science or Information Technology",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "ASP.NET",
                "C#",
                "MVC",
                "Oracle",
                "SDLC"
            ],
            "primary": [
                "Web Services",
                "Healthcare EDI",
                "Excellent verbal and written communication skills",
                "Ability to solve complex programming issues",
                "Experience in the health industry"
            ],
            "secondary": [],
            "all": [
                "ASP.NET",
                "C#",
                "MVC",
                "Oracle",
                "SDLC",
                "Web Services",
                "Healthcare EDI",
                "Excellent verbal and written communication skills",
                "Ability to solve complex programming issues",
                "Experience in the health industry"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Gyan Prakash Rai",
        "email": "gyanprakash.r@techgene.com",
        "jd": "Hello Vendors,\n\nI hope this email finds you well. We are currently seeking a .Net developer for an exciting opportunity in Indianapolis, IN. Please review the job details below and let us know if you are interested.\n\nWe are looking local candidates from INDIANA Only- 10+ years of exp\n\nSkills\n- Bachelor’s degree in Computer Science or Information Technology – Required\n- Working experience with ASP.NET – Required, 10 years\n- Working experience with C# and MVC – Required, 5 years\n- Work experience in analyzing and addressing security-related issues for applications built in multiple languages – Required, 5 years\n- Working experience with Oracle – Required, 5 years\n- Bachelor’s degree in Computer Science or related fields with IT experience – Required\n- Healthcare EDI experience – Highly desired\n- Expert understanding of SDLC – Highly desired\n- Current working experience with Web Services – Highly desired\n- Excellent verbal and written communication skills – Highly desired\n- Ability to solve complex programming issues – Highly desired\n- Experience in the health industry – Highly desired\n\nEssential Duties / Responsibilities:\n- Responsible for complete SDLC for project assignment and participate in full development life cycle including requirements analysis and design.\n- Working with technical and functional staff on detailed business requirements, understanding business processes and technology, agency standards, federal and state policies to align with project’s goals.\n- Write technical specifications based on conceptual design and stated business requirements.\n- Use object-oriented techniques and best practices for design, development, unit testing, and deployment.\n- Development of code along with unit testing strategy & plans.\n- Use Microsoft .NET Framework and a supported MVC framework, C# programming language to development of the applications.\n- Work with Project Manager to ensure project plan is maintained and project milestones are being met.\n- Work with PM, technical staff, and end user to prototype, refine, test, and debug programs to meet needs of the application.\n- Have ability to work independently with less guidance and work with ISDH externals partners as needed.\n- Take agency web applications architecture and business decisions into consideration for design.\n- Have ability to work independently and under general supervision with latitude for independent judgment.",
        "source": "Email",
        "date_posted": "2024-10-30 15:20:47-05:00",
        "unique_id": "192df367bff86a04",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]