[
    {
        "company": "DIA SOFTWARE SOLUTIONS LLC",
        "job_title": "FullStack Developer",
        "location": "Plano, TX, USA",
        "full_location": {
            "city": "Plano",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "8+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Core Java",
                "Angular",
                "Spring",
                "AWS"
            ],
            "primary": [
                "Testing Experience"
            ],
            "secondary": [],
            "all": [
                "Core Java",
                "Angular",
                "Spring",
                "AWS",
                "Testing Experience"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Anil Kumar",
        "email": "anil@diasoftwaresolutions.com",
        "jd": "Hi, I am reaching out to you about an exciting job opportunity with one of our clients. Please review the requirements and let me know if you are interested in this position.\n\nJob Title: FullStack Developer (70%/30% backend vs Front end)\nLocation: Plano TX OR Reston VA - In person interviews only\nDuration: 8+ Months\n\nOnsite Job Description :\nCore Java\nAngular\nSpring/Spring Boot\nAWS\nTesting Experience\n\nAngular, Core Java, Spring, Testing Experience and AWS (In no particular order) are the only things we look for\nTesting Experience with associated test frameworks, unit/regression testing, T-Shaped developer\nDoesn’t need to be UI expert but we definitely need someone able to grasp Angular concepts and someone that has previous hand’s on experience\nAWS extensive experience also isn’t a huge dealbreaker but being able to navigate components like EC2, S3 are a must.. application this person would be supporting is fully hosted in cloud environment, person doesn’t need to be “expert” but also can’t have zero experience at same time\nSeems AWS is the only area they can compromise, if the person is very proficient in other areas\nNot a senior or Lead level position, but they definitely need someone that is a self-starter and doesn’t require extensive hand-holding\nCan’t have someone that relies heavily on lead for delegating work, must be inquisitive and able to problem solve",
        "source": "Email",
        "date_posted": "2024-10-30 12:30:34-05:00",
        "unique_id": "192de9aa32316741",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]