[
    {
        "company": "Techgene Solutions, LLC",
        "job_title": "Project Manager",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "10 years",
            "degree_required": "Bachelor’s degree in a related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$57.34/hr"
        },
        "skills": {
            "core": [
                "Bachelor’s degree in a related field",
                "Active PMP certification from PMI or equivalent Project Management certification",
                "Experience leading projects of high complexity",
                "Expertise in MS Project",
                "Expertise in MS Visio",
                "Expertise in SharePoint",
                "Expertise in all MS O365 Software"
            ],
            "primary": [
                "Experience leading server-based application and software development/enhancement projects of moderate to high complexity",
                "Experience working in state government",
                "IT project management or equivalent IT team leadership experience"
            ],
            "secondary": [
                "Master’s degree",
                "Experience within the last 5 years leading/coordinating vendor-managed projects"
            ],
            "all": [
                "Bachelor’s degree in a related field",
                "Active PMP certification from PMI or equivalent Project Management certification",
                "Experience leading projects of high complexity",
                "Expertise in MS Project",
                "Expertise in MS Visio",
                "Expertise in SharePoint",
                "Expertise in all MS O365 Software",
                "Experience leading server-based application and software development/enhancement projects of moderate to high complexity",
                "Experience working in state government",
                "IT project management or equivalent IT team leadership experience",
                "Master’s degree",
                "Experience within the last 5 years leading/coordinating vendor-managed projects"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Gyan Prakash Rai",
        "email": "gyanprakash.r@techgene.com",
        "jd": "Hello Vendors,\n\nI hope this email finds you well. We are currently seeking a Project Manager for an exciting opportunity in Atlanta, GA. Please review the job details below and let us know if you are interested. Looking local to GA only, rate - $57.34 /hr. on C2C.\n\nSkills:\n- Bachelor’s degree in a related field – Required\n- Experience leading server-based application and software development/enhancement projects of moderate to high complexity – Required, 10 years\n- Active PMP certification from PMI or equivalent Project Management certification – Required (MUST UPLOAD CERTIFICATION)\n- Experience leading projects of high complexity (must have occurred in the last 2 years) – Required, 5 years\n- Expertise in MS Project, MS Visio, SharePoint, and all MS O365 Software – Required\n- Experience working in state government – Highly desired\n- IT project management or equivalent IT team leadership experience – Required, 3 years\n- Experience within the last 5 years leading/coordinating vendor-managed projects – Highly desired\n- Master’s degree – Highly desired.\n\nJob Duties:\n- Oversees and controls, schedules, resources, scope, and risks.\n- Ensure stakeholders take necessary action steps to achieve the goals and objectives of the project.\n- Work with the project steering committee and senior project management to resource the tasks of the project.\n- Work with State NextGen PMO and quality assurance team to extend the expected project standards, procedures, and quality objectives to the agency level.\n- Chairs, manages, or facilitates agency project meetings, communicating individual roles and project expectations.\n- Ensure that all project team members have the tools and training required to perform effectively.\n- Manage scope by using a variety of data sources to support project negotiations related to time, scope, and/or quality.\n- Develops, monitors and coordinates project activities, such as scheduling, tracking, and reporting; leads change efforts impacting own projects.\n- Works with senior project management to Identify specific opportunities or weakness within assigned projects and makes specific change recommendations to structures, processes, or people to improve project performance.\n- Provides work direction and leadership to assigned project activities, including scheduling, assignment of work, and review of project efforts.\n- Monitors project milestones and critical dates to identify potential jeopardy of project schedule. Identify ways to resolve schedule issues. Keeps management aware of the situation.\n- Assesses variances from the project plan, gathers metrics, and develops and implements changes as necessary to ensure that the project remains within specified scope and is within time, cost, and quality objectives.\n- Conduct formal review with business sponsor at project completion to confirm acceptance and satisfaction.\n- Provide the team with constructive feedback as it pertains to project performance.\n- Develops and maintains a productive working relationship with project sponsors, vendors, and key clients.",
        "source": "Email",
        "date_posted": "2024-10-30 10:28:40-05:00",
        "unique_id": "192de50332ed2586",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]