[
    {
        "company": "Vdart",
        "job_title": "ServiceNow Project Manager",
        "location": "California, USA",
        "full_location": {
            "city": "California",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "8+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "PROJECT MANAGEMENT"
            ],
            "primary": [
                "ServiceNow",
                "ITAM",
                "ServiceNow CMP"
            ],
            "secondary": [],
            "all": [
                "PROJECT MANAGEMENT",
                "ServiceNow",
                "ITAM",
                "ServiceNow CMP"
            ]
        },
        "job_type": [],
        "contact_person": "Sahana",
        "email": "sahana.r@vdartinc.com",
        "jd": "From: Sahana, Vdart sahana.r@vdartinc.com Reply to: sahana.r@vdartinc.com ServiceNow PMCalifornia nearby customer office location\n\nAs a Customer Engagement Manager, you will be responsible for managing key internal and external initiatives with the aim of adding significant value to the customers as well as helping the broader organization innovate. Deliverables will include the implementation of new/existing projects, as well as managing and navigating the customers’ during these projects.\n\nTime Zones covered: PST/MST/CST\n\nManage cross-functional projects and teams, senior-level business executives and customers to provide a unique customer experience during the projects.\n\nProvide weekly/monthly, quarterly updates to the customer as well as to internal executive teams\n\nManage each phase of the project and be able to navigate the cross-functional team, both internal and external\n\nInitiate and/or participate in strategic initiatives that impact the tactical approach to the effort as well as influencing the direction of the project.\n\nDevelop and present the value proposition to the customer as part of the initiative and on-going collaboration\n\nMentor team members to achieve the engagement's deliverables and promote the customer's desired results.\n\nIdentify gaps between actuals and plan of record, proposing solutions and driving resolutions.\n\nMinimum of 6 years of high-tech/SaaS industry experience\n\n8+ years in Customer Engagement or Project Management roles\n\nPrior experience with implementing or supporting ServiceNow products in an Enterprise\n\nStrong cross-functional, technical Project Management experience including planning, scheduling, monitoring, and stakeholder reporting\n\nDemonstrated experience in leading key projects, including strategic customer programs from inception to successful roll-out and beyond\n\nStrong documentation and presentation skills including creative thinking and willingness to work hands-on to deliver impactful outcomes.\n\nExcellent negotiation and persuasion skills.\n\nExperience with analytics and understanding of metrics and KPIs (as defined) for the customer\n\nThought leadership and strategic thinking\n\nAbility to gather and analyze data to understand the pros and cons of different decisions and options\n\nAbility to communicate abstract ideas clearly and independently manage complex project objectives\n\nFacilitation skills in leading and planning meetings, reviews, and retrospectives.\n\nStrong customer orientation and an innate ability to anticipate and act",
        "source": "Email",
        "date_posted": "2024-10-30 14:26:41-05:00",
        "unique_id": "192df255f6612c31",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]