[
    {
        "company": "Yochana IT Solutions",
        "job_title": "MDM-Business analyst",
        "location": "San Jose, CA, USA",
        "full_location": {
            "city": "San Jose",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "5+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Project Management",
                "User Acceptance Testing (UAT)",
                "Communication Skills",
                "Analytical Skills"
            ],
            "primary": [
                "Stakeholder Management",
                "Cross-Functional Collaboration",
                "Process Improvement",
                "Risk Management",
                "Technical Understanding"
            ],
            "secondary": [
                "Test Plans",
                "Test Cases",
                "User Training",
                "Project Trackers",
                "Workflow Implementation"
            ],
            "all": [
                "Business Analysis",
                "Project Management",
                "User Acceptance Testing (UAT)",
                "Communication Skills",
                "Analytical Skills",
                "Stakeholder Management",
                "Cross-Functional Collaboration",
                "Process Improvement",
                "Risk Management",
                "Technical Understanding",
                "Test Plans",
                "Test Cases",
                "User Training",
                "Project Trackers",
                "Workflow Implementation"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Nagesh Galam",
        "email": "nagesh@yochana.com",
        "jd": "Hello,\n\nHope you doing well\n\nRole: MDM BSA\nSan Jose, CA / Austin, TX / NYC, NY Onsite\n\nJob duties and project work will consist of, but not limited to:\n- Act as the liaison between the Program Manager and project team to define business requirements, build test scenarios and establish a business requirements traceability matrix.\n- Work closely with Project Managers, Business Analysts, Product Owners, Developers, Quality Assurance and Application Engineering teams to complete and/or support project deliverables related to business case, business analysis, use cases, delivery management, test plans, test cases, test execution, user training guide, post go live support communications activities.\n- Support teams to implement business requirements and communicate system enhancements.\n- Manage deliverables for initiatives and adhere to development methodologies.\n- Assist in the development of user story scenarios and high level business requirements and detailed system & functional requirements.\n- Conduct research and analysis into the nature, effect and results of system problems.\n- Consult frequently with internal users to ensure a complete understanding of their needs and concerns.\n- Conduct meetings and presentations with stakeholders and business users.\n- Effectively communicate insights and plans to cross-functional team members and management.\n- Provide support for any tool issues or challenges that may arise.\n- Provide ongoing status as requested by the business.\n- Collaborate with leads to tackle ongoing issues and partner on continuous improvement with enhancements.\n- Ability to work cross functionally with other departments to achieve goals.\n\nPGM:\n- Ability to plan, manage, and execute multiple, time-sensitive projects with competing priorities.\n- Ability to work separately to drive projects to completion with low guidance and high attention to detail.\n- Ability to streamline complex processes and implement workflows designed to increase efficiency/productivity.\n- Ability to guide, influence, and direct cross-functional groups to meet goals and deadlines.\n- Exceptional communication skills and ability to understand the different perspectives of stakeholders across various functional areas.\n- Gather relevant data, conduct business analysis, develop and manage project trackers and timelines, and direct cross-functional groups to deliver on project goals.\n- Identify gaps and propose changes to existing policy, systems, and process frameworks.\n- Develop scalable solutions and work to manage risks across the organization.\n- Design, roll out, and implement new processes and program initiatives to influence global consistency, increase productivity, and improve overall program and organization operations.\n- Build narratives and communication tailored to different audience levels to advance the team strategy and deliver on priorities.\n\nResponsibilities:\n- Facilitate clear and concise communication across all levels of the organization, both written and verbal.\n- Oversee all aspects of User Acceptance Testing (UAT) and ensure a smooth and successful go-live process.\n- Manage program risks and issues proactively, developing and implementing mitigation plans as necessary.\n- Track program performance against key metrics and report on progress to stakeholders.\n- Maintain a deep understanding of the program's technical components and dependencies.\n\nQualifications:\n- Minimum 5+ years of experience in program management with a proven track record of success.\n- Experience leading User Acceptance Testing (UAT) for complex programs.\n- Excellent communication skills, both written and verbal, with the ability to tailor messages to different audiences.\n- Strong analytical and problem-solving skills.\n- Proficient in project management methodologies and tools.\n- Solid understanding of technical concepts relevant to the program.\n- Ability to manage multiple priorities and work effectively in a fast-paced environment.",
        "source": "Email",
        "date_posted": "2024-10-30 15:39:37-05:00",
        "unique_id": "192df47b5ed39083",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]