[
    {
        "company": "Shrive Technologies",
        "job_title": "Pega Architect",
        "location": "Miami, FL, USA",
        "full_location": {
            "city": "Miami",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "10-12 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Pega Architect",
                "AIML",
                "Generative AI",
                "Agile",
                "Service Oriented Architecture"
            ],
            "primary": [
                "Telecom domain experience",
                "Workflow Orchestration Frameworks",
                "Mobile Technologies",
                "Web Technologies",
                "Voice Chat Technologies"
            ],
            "secondary": [
                "PEGA Workflow Case Management",
                "Pega recommendation",
                "Google GCP",
                "Google CCAI",
                "LLM Models",
                "Adobe",
                "ReactJS",
                "JSON",
                "RESTful APIs"
            ],
            "all": [
                "Pega Architect",
                "AIML",
                "Generative AI",
                "Agile",
                "Service Oriented Architecture",
                "Telecom domain experience",
                "Workflow Orchestration Frameworks",
                "Mobile Technologies",
                "Web Technologies",
                "Voice Chat Technologies",
                "PEGA Workflow Case Management",
                "Pega recommendation",
                "Google GCP",
                "Google CCAI",
                "LLM Models",
                "Adobe",
                "ReactJS",
                "JSON",
                "RESTful APIs"
            ]
        },
        "job_type": [
            "remote",
            "onsite"
        ],
        "contact_person": "Sri",
        "email": "sri@shrivetechnologies.com",
        "jd": "Role: Pega architect/ Gen Ai exp\nLocation: Miami, FL or Frisco, TX - Local candidates on priority.\nRemote: OK (but candidates based in EST)\nTelecom domain experience is must.\nPega Architect - mandatory skill\n\nRole Responsibility: The Senior Solutions Architect will lead High Level Design, Reference Architecture and Implementation for variety of programs within the Customer Experience, Service Management, AIML across Omni Channel Systems for the Verizon Consumer Group (VCG). The solutions architect will be responsible for driving solutions and design patterns that promote flexible customer experience and workflow orchestration, reusable components, consistent common domain logic. The Solutions architect will also be responsible for designing solutions across all sales and service transactions that client offers to our customers. These involve complex business processes including managing multiple products, offer and device eligibility rules, business process flows across ordering, billing, provisioning and technical support.\n\nThe architect will be expected to bring strong expertise on Agile along with Industry Standard Workflow Orchestration Frameworks, Voice of Customer, Service Oriented Architecture, Mobile, Web, Voice Chat Technologies. The architect will help drive experiences that are personalized by leveraging insights from systems of intelligence and AIML modeling. The role will demand knowledge in AIML and Generative AI to enhance customer experience framework with Large Language Model solutioning. The role will demand high standards and technical acumen along with strong attention to scalability and performance to build solutions that can sustain ultra-high volume of traffic. The role will involve heavy collaboration with large functional teams across business, IT, and Data Scientist Data Engineering to design solutions for business transformation use cases across the entire customer lifecycle. The resource will be expected to work independently and bring in technical expertise and thought leadership to drive best in class architecture and also alignment adoption of solutions across the GTS group. The role will involve in the Discovery and prototype of new technology for AI solutions. Experiences in PEGA Workflow Case Management, Pega recommendation, Google GCP, Google CCAI, LLM Models, Adobe are a plus. Define methodologies, best practices, perform research, evaluate open source and vendor products in the most critical space of non-functional requirements (NFRs) such as performance, and scalability in the DevOps pipeline. The resource will independently drive prioritization and phasing of features and user stories to enable solution delivery, working with dev and business teams and achieving alignment. The resource will balance business priorities, complexity of work involved and GTS dev team readiness to ensure HLDs and solution designs can drive business outcomes. Resource will be expected to make all related decisions autonomously.",
        "source": "Email",
        "date_posted": "2024-10-30 11:45:38-05:00",
        "unique_id": "192de972b2934336",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "PEGA Developer"
    }
]