[
    {
        "company": "TEKSALT",
        "job_title": "AWS Cloud Lead",
        "location": "Fort Mill, SC, USA",
        "full_location": {
            "city": "Fort Mill",
            "state": "SC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "8-10 Years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 month",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "AWS Cloud Certification",
                "Cloud solutions",
                "Networking",
                "Containers",
                "Fault tolerance"
            ],
            "primary": [
                "SQL",
                "MySQL",
                "NoSQL",
                "Agile/SCRUM methodologies",
                "Ansible",
                "AWS Cloud Formation",
                "MAG Resource Manager",
                "DevOps",
                "Scripting",
                "Configuration Management",
                "Infrastructure automation"
            ],
            "secondary": [],
            "all": [
                "AWS Cloud Certification",
                "Cloud solutions",
                "Networking",
                "Containers",
                "Fault tolerance",
                "SQL",
                "MySQL",
                "NoSQL",
                "Agile/SCRUM methodologies",
                "Ansible",
                "AWS Cloud Formation",
                "MAG Resource Manager",
                "DevOps",
                "Scripting",
                "Configuration Management",
                "Infrastructure automation"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Shekar Patel",
        "email": "shekar.patel@teksalt.com",
        "jd": "Role: AWS Cloud Lead - Onsite\nLocation: Fort Mill, SC (Onsite)\nDuration: 12 month\n\nJob Description:\nAWS cloud Engineer would be responsible for implementing & and maintaining cloud infrastructure and services. The role involves working with cloud providers, developing automation scripts, ensuring security and compliance, and collaborating with cross-functional teams to optimize cloud-based solutions.\n\n• A good understanding of various PaaS services like Lambda, Elasticache, Open search, Loadbalancer, Eventbridge and DB\n• Deploy, and manage scalable and reliable cloud infrastructure on AWS platform.\n• Collaborate with architecture and development teams to ensure cloud solutions align with business requirements.\n• Define and develop blueprints and roadmaps for building solutions on the cloud\n• Good understanding and work experience on reporting on service health, Incidents, performance trends and capacity/utilization of AWS services.\n• Knowledge on access control on public cloud environment, tools used to operate and monitor IaaS and PaaS services and measure characteristics (e.g., performance, incidents, problems, issues, and events) to identify, correlate, report and resolve incidents and problems.\n• Work experience on Monitoring, operating, maintaining, and supporting the OS (Operating Systems) installed on EC2 instances\n• Provide regular support for permission related (IAM) issues, and creation of new IAM roles and policies.\n• Systematically distribute and apply software updates and oversee system currency up/down the stack\n• Good understanding of event management system to detect events, assess their potential impact, and determine the appropriate control actions\n• Monitor workload performance and so that capacity meets current and future demands.\n• Meet Incident/Problem management SLAs to promptly restore service operations and reduce adverse business impact\n• Provide support, and break-fix, for cloud Infrastructure workloads in AWS\n• Team and workload management\n\nDesired Skill Set:\n• 8-10 Years of work experience on Cloud solutions\n• Proven experience as AWS Cloud Certification.\n• Strong understanding of networking, containers, and fault tolerance\n• Experience with SQL and MySQL (NoSQL experience is a plus).\n• Knowledge of, and preferably experienced with, Agile/SCRUM methodologies.\n• Familiarity or experience with Ansible, AWS Cloud Formation, and MAG Resource Manager.\n• DevOps, Scripting, Configuration Management, and Infrastructure automation.\n• Manage cloud specific tool sets.",
        "source": "Email",
        "date_posted": "2024-10-29 14:34:49-05:00",
        "unique_id": "192de050b1737400",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]