[
    {
        "company": "UST/Cox Corporation",
        "job_title": "UKG Pro-Testing",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Bachelor’s degree in human resources, information technology or a related field",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "Long term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "UKG accrual configuration",
                "Workday",
                "testing"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "UKG accrual configuration",
                "Workday",
                "testing"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Karthik",
        "email": "karthik@hclglobal.com",
        "jd": "The HR Technology Partner, UKG is a business analyst role participating in a full life cycle system implementation migrating from Kronos Workforce Central (WFC) to UKG Pro Workforce Management (UKG Dimensions). This functional role will partner with key stakeholders to define Accruals and timekeeping business requirements, participate in system design sessions, support configuration of the tool, actively participate in testing and support the change management and rollout strategies of the program. The new timekeeping system will be integrated with Workday HCM and Workday US Payroll. The role reports to the HRT Senior Manager for Pay, Time, and Absence. The scope of the project includes implementing modern timekeeping software and physical timeclock solution for approximately 15,000 employees who are in the US/Puerto Rico.\n\nKey Responsibilities:\n• Develop critical working relationships with internal business owners and key stakeholders to understand and document enterprise accruals and timekeeping business requirements; participate in the program as a accruals and timekeeping SME representing the identified business stakeholders\n• Act as a functional subject matter expert, partnering with key business users in all aspects of analysis, design, testing, and deployment for system integration with Workday. Understand current state processes and identify opportunities for improving systems and processes with the new tool\n• Understand the end-to-end integration design between Workday HCM / US Payroll and UKG Dimensions and any other downstream systems\n• Support configuration of the tool by CEI technology partners\n• Develop test cases to be conducted during system testing and user acceptance testing phases\n• Active participant in system testing; execute defined test cases and document test results; retest as necessary\n• Participate in Parallel testing efforts and work to identify, and resolve discrepancies\n• Facilitate User Acceptance Testing (UAT) for key business stakeholders\n• Work with the Training team to develop and roll out end user training materials for the new solution\n• Support communication/change management and deployment / cutover activities for the project\n• Provide Hypercare support\n\nRequired:\n• Bachelor’s degree in human resources, information technology or a related field",
        "source": "Email",
        "date_posted": "2024-10-30 08:20:20-05:00",
        "unique_id": "192ddb58f6de8cdf",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]