[
    {
        "company": "Yochana IT",
        "job_title": "Scrum Master",
        "location": "El Segundo, CA, USA",
        "full_location": {
            "city": "El Segundo",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "onsite",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified",
            "job_code": "",
            "contact_person": "Pavan Kumar",
            "email": "pavank@yochana.com"
        },
        "skills": {
            "core": [
                "Scrum",
                "Agile",
                "WMS",
                "Logistics"
            ],
            "primary": [
                "Facilitating Scrum Events",
                "Coaching the Team",
                "Stakeholder Communication",
                "Process Optimization",
                "Integration Management"
            ],
            "secondary": [
                "Conflict Resolution",
                "User Story Prioritization",
                "Quality Assurance",
                "Technical Design Discussion",
                "Risk Management"
            ],
            "all": [
                "Scrum",
                "Agile",
                "WMS",
                "Logistics",
                "Facilitating Scrum Events",
                "Coaching the Team",
                "Stakeholder Communication",
                "Process Optimization",
                "Integration Management",
                "Conflict Resolution",
                "User Story Prioritization",
                "Quality Assurance",
                "Technical Design Discussion",
                "Risk Management"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "jd": "Need only local to California consultants who have logistics and WMS experience.\n\nOnsite from day1\n\nFacilitating Scrum Events: Organize and lead daily stand-ups, sprint planning, sprint reviews, and retrospectives.\n\nRemoving Impediments: Identify and eliminate obstacles that may hinder the team’s progress.\n\nCoaching the Team: Guide the team on Scrum practices and Agile principles.\n\nShielding the Team: Protect the team from external distractions and interruptions.\n\nEnsuring Adherence to Scrum Practices: Make sure the team follows the agreed-upon processes and practices.\n\nDomain Expertise: Leverage knowledge of logistics and WMS to better understand the team’s challenges and needs.\n\nStakeholder Communication: Act as a liaison between the Scrum team and logistics/WMS stakeholders to ensure clear communication and alignment of goals.\n\nProcess Optimization: Use insights from logistics and WMS to suggest improvements in workflows and processes.\n\nIntegration Management: Oversee the integration of WMS with other systems, ensuring smooth data flow and operational efficiency.\n\nAssist the team as a coach and mentor, providing help and guidance to help them improve their Scrum practices. Work with the product owner and other stakeholders to ensure that the team's efforts align with the organization's goals. Ensure the team follows the Scrum framework and carries out the Scrum ceremonies.\n\nResponsibilities\n\nCreate and maintain a Scrum Master responsibilities list, and Scrum Master tasks list to ensure that all duties are being performed. Follow the team's progress and provide feedback and direction as needed. Help with team discussions and conflict resolution. Assist the team in identifying and removing any impediments to the team's progress. Assist the product owner in creating and prioritizing user stories. Ensure that the team is following the Scrum framework and that all scrum ceremonies are being conducted. Act as an intermediary between the team and other stakeholders, such as management, to ensure that the team's efforts align with the organization's goals. Collaborate with other Scrum Masters within the organization to share knowledge and best practices and to improve the Scrum process. As a Scrum Master, assess the team's performance and adapt the Scrum Master responsibilities list, Scrum Master duties, and Scrum Master tasks. Improve the scrum process and install changes to increase the efficiency and effectiveness of the team. A Scrum Master's role and responsibilities at this level also include assisting the team in improving their skills and delivering high-quality products. (1.) To oversee quality assurance processes, ensuring adherence to coding standards, implementation of best practices and perform Value creation and KM activities. (2.) To ensure process improvement and compliance| and participate in technical design discussion and to review technical documents. (3.) Responsible for shaping the overall project strategy working closely with stakeholders to define project scope, objectives, deliverables and keeping track of schedule to ensure on time delivery as per the defined quality standards. (4.) To work closely with the development team, On-site Engineers to understand technical requirements and work with them to address and resolve technical issues. (5.) Identify & flag potential risks and issues that may impact project timelines or quality, develop mitigation strategies / contingency plans to address risks and provide regular project updates to key stakeholders.",
        "source": "Email",
        "date_posted": "2024-10-30 10:00:30-05:00",
        "unique_id": "192de1141974ffa3",
        "emp_type": [
            "onsite",
            "third party"
        ],
        "tag": "Scrum Master"
    }
]