[
    {
        "company": "Dia Softwares Solutions",
        "job_title": "NextGen Project Manager",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "12+ Years",
            "degree_required": "Bachelor’s degree in related field or specialized training",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "7+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "PMP certification from PMI or equivalent certification",
                "Expert with MS Project",
                "Expert with MS Visio",
                "Expert with SharePoint",
                "Expert with all MS O365 Software"
            ],
            "primary": [
                "Experience leading projects of high complexity",
                "Experience working in state government",
                "Experience leading server-based application and software development/enhancement projects of moderate to high complexity"
            ],
            "secondary": [
                "Master’s degree",
                "Experience within the last 5 years leading/coordinating vendor managed projects"
            ],
            "all": [
                "PMP certification from PMI or equivalent certification",
                "Expert with MS Project",
                "Expert with MS Visio",
                "Expert with SharePoint",
                "Expert with all MS O365 Software",
                "Experience leading projects of high complexity",
                "Experience working in state government",
                "Experience leading server-based application and software development/enhancement projects of moderate to high complexity",
                "Master’s degree",
                "Experience within the last 5 years leading/coordinating vendor managed projects"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Aravind",
        "email": "aravind@diasoftwaresolutions.com",
        "jd": "Title: NextGen Project Manager\nExperience: 12+ Years\nAny State Client Experience is Mandatory\nC2C Work Arrangement: Hybrid\nVisa: Any Visa Except TN\nWork Location: 47 Trinity Ave SW, Atlanta, GA 30334\nAgency Interview Type: Web Cam Interview Only\nDuration of the Project: 7+ Months\n\nResponsibilities:\nAs a member of the State NextGen PMO team and DHS Project Manager the PM will manage and/or provide project scope management consultation to ensure DHS is actively involved throughout the project’s software development lifecycle activities. Works closely with the agency resource manager, vendor, business analysts, and subject matter experts assigned to the NextGen agency support team. Leads agency stakeholder meetings to determine the best approaches for reaching objectives; during planning, developing project management tools including plans for stakeholder management, scope management, risk management, communications, change control, and performance measurement and tracking. During project activities execution, monitors performance and reports to management project status and pertinent issues, including major milestones and potential project risks. Provides continuing direction to the project team, conducts status meetings, assesses proposed changes in scope, and recommends courses of action to project sponsors during the execution phase. Near the end of the project, uses the product verification process to make sure that the project has delivered what the client expected and performs a lesson learned for all projects.\n\nJob Duties:\nOversees and controls, schedules, resources, scope, and risks. Ensure stakeholders take necessary action steps to achieve the goals and objectives of the project. Work with the project steering committee and senior project management to resource the tasks of the project. Work with State NextGen PMO and quality assurance team to extend the expected project standards, procedures, and quality objectives to the agency level. Chairs, manages, or facilitates agency project meetings, communicating individual roles and project expectations. Ensure that all project team members have the tools and training required to perform effectively. Manage scope by using a variety of data sources to support project negotiations related to time, scope, and/or quality. Develops, monitors and coordinates project activities, such as scheduling, tracking, and reporting; leads change efforts impacting own projects. Works with senior project management to Identify specific opportunities or weakness within assigned projects and makes specific change recommendations to structures, processes, or people to improve project performance. Provides work direction and leadership to assigned project activities, including scheduling, assignment of work, and review of project efforts. Monitors project milestones and critical dates to identify potential jeopardy of project schedule. Identify ways to resolve schedule issues. Keeps management aware of the situation. Assesses variances from the project plan, gathers metrics, and develops and implements changes as necessary to ensure that the project remains within specified scope and is within time, cost, and quality objectives. Conduct formal review with business sponsor at project completion to confirm acceptance and satisfaction. Provide the team with constructive feedback as it pertains to project performance. Develops and maintains a productive working relationship with project sponsors, vendors, and key clients.\n\nMinimum Qualifications:\nBachelor’s degree in related field or specialized training and three years of IT project management or equivalent IT team leadership experience. PMP certification from PMI or equivalent certification. 5 years' experience leading projects of high complexity (must have occurred in the last 2 years). Expert with MS Project, MS Visio, SharePoint, and all MS O365 Software. Experience working in state government. Experience working in an outsourced environment.\n\nPreferred Qualifications:\nMaster’s degree in related field. Experience within the last 5 years leading/coordinating vendor managed projects.",
        "source": "Email",
        "date_posted": "2024-10-30 11:10:14-05:00",
        "unique_id": "192de51163c5b934",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]