[
    {
        "company": "tek inspirations llc",
        "job_title": "Technical Product/Program Manager",
        "location": "Englewood, CO, USA",
        "full_location": {
            "city": "Englewood",
            "state": "CO",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Bachelor's Degree in Electrical Engineering, Computer Science, Telecommunications Engineering, Networking, or a similar discipline",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Technical Program Management",
                "WiFi technologies",
                "Product Strategy",
                "Data Analytics",
                "Customer Experience"
            ],
            "primary": [
                "Electrical Engineering",
                "Telecommunications Engineering",
                "Networking",
                "Agile environment",
                "JIRA",
                "Sharepoint",
                "MS Office"
            ],
            "secondary": [
                "Communication skills",
                "RF Fundamentals",
                "WiFi standards",
                "Wireless security standards",
                "Certifications (CWNP, CWNA, CWAP, CCNA, CCNP, PMP)"
            ],
            "all": [
                "Technical Program Management",
                "WiFi technologies",
                "Product Strategy",
                "Data Analytics",
                "Customer Experience",
                "Electrical Engineering",
                "Telecommunications Engineering",
                "Networking",
                "Agile environment",
                "JIRA",
                "Sharepoint",
                "MS Office",
                "Communication skills",
                "RF Fundamentals",
                "WiFi standards",
                "Wireless security standards",
                "Certifications (CWNP, CWNA, CWAP, CCNA, CCNP, PMP)"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Sahanbaz Khan",
        "email": "sahanbaz.khan@tekinspirations.com",
        "jd": "Job Description -Job Title: Technical Product/Program Manager\nLocation: Englewood, CO\nDuration : 12 months\nWorkstyle: Hybrid (4 days per week on-site, non-negotiable)\n\nTechnical Program Manager Key Responsibilities:\n\nProduct Strategy & Roadmap Development:\nDefine and execute the WiFi product roadmap, focusing on next-generation WiFi standards (802.11ax, 802.11be) and emerging technologies (6 GHz WiFi, mesh networking).\nConduct market research and competitive analysis to identify customer needs and emerging trends in WiFi and wireless connectivity.\nPartner with business stakeholders to align WiFi product strategy with the organization's broader goals, customer expectations, and technology roadmap.\n\nTechnical Oversight:\nOversee the technical design, testing, and implementation of WiFi products, including radios operating in the 2.4 GHz, 5 GHz, and 6 GHz bands.\nCollaborate with engineering teams to integrate advanced features (e.g., MU-MIMO, OFDMA, beamforming) and ensure seamless interoperability across various devices and platforms.\nEnsure products meet industry standards and regulatory requirements, focusing on performance, security, and reliability.\n\nCross-Functional Program Management:\nLead cross-functional teams, including Engineering, Marketing, Customer Support, and Operations, to ensure timely product launches.\nCreate and manage project timelines, deliverables, and resources to drive projects through the product lifecycle stages (concept, design, development, testing, deployment).\nAct as the main point of contact between technical teams and non-technical stakeholders, translating complex technical information into clear, actionable business insights.\n\nCustomer Experience & Performance Optimization:\nUse data analytics to monitor product performance, customer feedback, and network metrics to identify areas for improvement.\nDefine KPIs and analyze WiFi usage data to ensure products meet performance standards and deliver a best-in-class customer experience.\nManage troubleshooting, customer support, and continuous improvement processes to maintain high product quality.\n\nVendor & Partner Management:\nCollaborate with vendors and technology partners to integrate new features, hardware components, and software updates.\nOversee third-party partnerships, ensuring all integrations and developments align with Charter’s quality and performance standards.\n\nQualifications :\nBachelor's Degree in Electrical Engineering, Computer Science, Telecommunications Engineering, Networking, or a similar discipline\n5+ years as a technical program manager or product manager within telecommunications, WiFi technologies, or network services\nExtensive knowledge of 2.4GHz and 5GHz WiFi frequencies\nHands-on experience with WiFi protocols (802.11a/b/g/n/ac/ax, WiFi 6/6E, and emerging WiFi 7), radio frequencies, and wireless security standards (WPA2, WPA3).\nDeep understanding of RF Fundamentals, WiFi standards, and wireless networking technologies\nFamiliarity with data analytics, performance monitoring tools, and customer experience metrics\nProficiency in JIRA, Sharepoint, and MS Office\nExcellent Communication skills and the ability to explain technical information to a non-technical audience\nMust be able to fluently read, write, and speak in English\nExperience in an Agile environment is desired\nCertifications such as a CWNP, CWNA, CWAP, CCNA, CCNP, and/or PMP are desired.",
        "source": "Email",
        "date_posted": "2024-10-30 12:52:16-05:00",
        "unique_id": "192deae7e5f4c2d5",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]