[
    {
        "company": "Metasys Inc",
        "job_title": "Senior Program Manager - Global Payroll",
        "location": "Richardson, TX, USA",
        "full_location": {
            "city": "Richardson",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "3 Year Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Payroll experience",
                "ECP",
                "Time Tracking in SuccessFactors"
            ],
            "primary": [
                "Project planning",
                "Project delivery",
                "Strong communication skills",
                "Stakeholder management"
            ],
            "secondary": [
                "Innovative",
                "Agile",
                "Ability to manage multiple workstreams",
                "Ability to manage conflicting priorities"
            ],
            "all": [
                "Payroll experience",
                "ECP",
                "Time Tracking in SuccessFactors",
                "Project planning",
                "Project delivery",
                "Strong communication skills",
                "Stakeholder management",
                "Innovative",
                "Agile",
                "Ability to manage multiple workstreams",
                "Ability to manage conflicting priorities"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Sampath Goud",
        "email": "sgoud@metasysinc.com",
        "jd": "Senior Program Manager - Global Payroll\n\nLocation: Richardson, TX (onsite)\n\nDuration: 3 Year Contract\n\nAs Senior Project Manager for the Global Payroll Project, you will support the HR Transformation Program by working with local payroll teams to implement a global payroll strategy across 11 pilot countries, transitioning from the current model to a new global standard. You will coordinate with the Global Transition and Cutover Manager, Business Program Director, and key stakeholders to manage day-to-day setup and migration from existing systems to new ones. This role requires aligning with the Global Payroll Lead on Shared Services for HRSS service commencement. You’ll report to the HR Sub Program Manager and collaborate with HR workstream leads as needed.\n\nResponsibilities:\n- Acting as the escalation point and day to day contact for Global Payroll Lead and the HR Business Program Director.\n- Ensuring that on the ground teams are fully up to date on all program decisions and deliverables in alignment with the OnePeople communication.\n- Create and manage the plan to ensure HRSS and payroll are operationally ready for each country service commencement.\n- Finalize the approach to adoption of new processes, technology, and ways of working for the new HR Service.\n- Act as the SPOC for these teams and interfacing with other HR Sub Program Leads.\n- Working with the HR Sub Program Manager to ensure the plans are aligned with Organization Design, End to End Process Design, Business Transition, Global HRIS and HRSS workstreams to be clear on dependencies and deliverables.\n- Weekly Progress Reporting.\n- Plan, Risk and issue management.\n\nSkills and experience:\n- Payroll experience – ECP and Time Tracking in SuccessFactors.\n- Experience with planning and delivering projects.\n- Being innovative & agile.\n- Strong communication skills and an ability to build good working relationships with multiple stakeholders are essential.\n- Ability to manage multiple workstreams and conflicting priorities in a fast-paced environment.",
        "source": "Email",
        "date_posted": "2024-10-30 13:17:39-05:00",
        "unique_id": "192dec5bec0c4e7a",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]