[
    {
        "company": "Dept of Transportation",
        "job_title": "Senior .NET Application Development Analyst (Financial Systems; Angular/React/ETL/Azure services/cloud solutions)",
        "location": "Tallahassee, FL, USA",
        "full_location": {
            "city": "Tallahassee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "11-12+ years",
            "degree_required": "Bachelor's Degree in a field of study related to technology or finance",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Microsoft .NET (C#)",
                "ASP.NET",
                ".NET Core",
                "Azure DevOps",
                "CI/CD Pipelines",
                "Azure Functions",
                "Entity Framework",
                "SQL Server",
                "JavaScript UI libraries (Angular, React)"
            ],
            "primary": [
                "Cloud Migration and Modernization Project",
                "Financial systems (ERP)",
                "Data management concepts (ETL, Data Warehousing, Operational Data Stores, Data Lakes, Master Data Management)",
                "SCRUM Framework",
                "Full stack development"
            ],
            "secondary": [
                "Legacy applications",
                "SOA",
                "Full SDLC",
                "Agile",
                "Scrum",
                "SAFe",
                "DAD",
                "Documentation"
            ],
            "all": [
                "Microsoft .NET (C#)",
                "ASP.NET",
                ".NET Core",
                "Azure DevOps",
                "CI/CD Pipelines",
                "Azure Functions",
                "Entity Framework",
                "SQL Server",
                "JavaScript UI libraries (Angular, React)",
                "Cloud Migration and Modernization Project",
                "Financial systems (ERP)",
                "Data management concepts (ETL, Data Warehousing, Operational Data Stores, Data Lakes, Master Data Management)",
                "SCRUM Framework",
                "Full stack development",
                "Legacy applications",
                "SOA",
                "Full SDLC",
                "Agile",
                "Scrum",
                "SAFe",
                "DAD",
                "Documentation"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Anusha",
        "email": "sam@vitaforms.com",
        "jd": "From: anusha, vitaforms sam@vitaforms.com Reply to: sam@vitaforms.com This is with Dept of Transportation so it will be plus to have DOT experience + Govt exp. Make sure that we have about 3+ Top candidates who can provide 3 ref (if needed). Start will be Dec 2024 so ideally we need candidates who are NOT on Bench. We would need the Resume and Signed Resume certification + On-site form for each candidate submitted. Official Title: FDOT Job 1250 Applications Development Analyst C. Advanced (RFQ) Request #: PR626292-R120787 – Use for R-TR # of positions: 3 This closes Monday (11/04/2024) by NOON. Candidate need to show up first day to the office – This is a 100% on-site position from day one. NO EXCEPTION Telecommuting: For candidates residing in the immediate Tallahassee area, 3-days in office and 2-days remote are allowed. MANDATORY Technical/Business Skill Set Requirements Bachelor's Degree in a field of study related to technology or finance. Work experience can substitute on a year for year basis for the degree. 1. Min 11-12+ years of IT experience with Eight (8) + years of broad experience working with Microsoft development technologies including Microsoft .NET (C#), ASP.NET and .NET Core, Azure DevOps and CI/CD Pipelines, Azure Functions, ORMS including Entity Framework. 2. minimum of 2 years' experience in Javascript UI libraries such as Angular and React, Backend databases such as SQL Server and Oracle, and on-premises and cloud based (Azure) platforms. Preferred KSAs: 3. Knowledge of various development platforms and full stack development. 4. Knowledge of the SCRUM Framework 5. Knowledge of financial systems such as an ERP 6. Familiarity with data management concepts such as ETL, Data Warehousing, Operational Data Stores, Data Lakes, and Master Data Management 7. Candidates with a deep understanding of Azure services and experience in implementing cloud solutions will be prioritized. in order to submit we need A) An up to date resume and Cover letter (why you should be the selected candidate) in word format only. Please make sure all the skills listed in the JD are reflected in your resume (only if you have the experience). B) Manual signed Resume certification form with Blue ink including the witness signature. GIS will provide the 2 witness signature. DL copy or passport copy is needed as form of identification to witness the persons signature. Please leave the date blank so we DO NOT have you bother you with this STEP for any future positions C) Manual signed “on-site Acknowledgement” form with Blue/Black ink by the consultant providing the services. Only place the signature at the bottom; the above info box will be filled by GIS, Inc; D) No Double submission to the state of Florida. Please confirm E) Rate as agreed - $XX/hr (All Inclusive) C-2-C with once a month billing terms NET 30. Please confirm This is in ref to the position listed below Position ID: 426201-AZNET Title: Senior .NET Application Development Analyst (Financial Systems; Angular/React/ETL/Azure services/cloud solutions) Location: Tallahassee, FL Pay Rate: DOELength: Long Term Travel Required: none Telecommute: no Skills: \"Lead developer\", \"Cloud Migration and Modernization Project\"; \"financial systems such as an ERP\"; Microsoft .NET (C#), ASP.NET and .NET Core, Azure DevOps, CI/CD Pipelines, Azure Functions, ORMS including Entity Framework, SQL Server, JavaScript front end frameworks (such as Angular, React), HTML5, CSS; reporting platforms; data migration/replication experience; ETL solutions; Data Warehousing, Operational Data Stores, Data Lakes, Master Data Management; Azure services; \"Implementing cloud solutions\"; Legacy applications; SOA; Full SDLC; Agile, Scrum, SAFe, DAD; DOCUMENTATION, GOVT Job description: Note : Please reply ONLY if you 1) can report to work on-site from day 1 and then Candidates are expected to work a minimum of three (3) full days per week in the office. 2) have all the Required skill set and have experience as an \"Senior .NET Application Development Analyst (Financial Systems; Angular/React/ETL/Azure services/cloud solutions)\". Prefer to have Public sector projects. 3) can provide at least 3 verifiable experience from completed and/or substantially completed jobs that closely match this request (Filling the client provided form) + Sign a Resume Certification Form 4) Can go through a background check including fingerprinting + Agree to a Web Cam. 5) have A Competitive Rate 6) will be available in Dec 2024 timeframe as it takes a minimum of 3 weeks for a start after a successful interview. Each staff member assigned to this project must have a background screening that is equivalent to a Level Two (2) screening standard. This is a fixed fee/hourly based project which is inclusive of travel, lodging, per diem expenses and all other costs associated with the completion of the associated tasks. Face to Face Interviews: At the hiring manager’s discretion, interviews may be conducted via Microsoft Teams or in person. Telecommuting: Candidates are expected to work a minimum of three (3) full days per week in the office. The selected candidate is required to start their first day in the office. In the future, and at the Department's discretion, this option may return to full-time, in the office. Scope of Services Background: As a result of the Department's efforts to re-engineer and modernize core financial systems, there has been over 1,500 computing assets identified as performing some level of financial planning, analysis, and management functionality that are impacted by the State of Florida's accounting system. The Florida Planning, Accounting, and Ledger Management (PALM) project is a multiyear endeavor to replace the State of Florida's accounting and cash management systems with a modern financial management solution. The Florida PALM Project is targeted to replace Central, Payroll, and Departmental FLAIR functionality, with go-live scheduled for January 6, 2026. The 1,500+ computing assets are comprised of interfaces, enterprise applications, databases, automated processes, and reporting programs within Client that will require remediation due to:· Adoption of the Florida PALM Standardized Business Process Model· Transition to the Florida PALM Chart of Accounts values· Replacement of Central, Payroll and Departmental FLAIR functionality· Redevelopment of agency incoming and outgoing interfaces to the statewide accounting system· Implementation of Information Warehouse data to support agency specific reporting requirements. The computing asset modifications to complete the Client PALM System Transition (FPST) will take place over the course of two years in alignment with the Florida PALM Project scheduled timeline. To prepare for the transition to Florida PALM, our agency is seeking a resource knowledgeable in .NET, Angular, React, SQL Server, Oracle, for on-premises and cloud-based applications, to analyze and remediate applications in preparation for the new Statewide PALM system go-live. It is important we find a resource capable of analyzing these programs, documenting their specifications, and remediating the code and database assets. MANDATORY Technical/Business Skill Set Requirements Bachelor's Degree in a field of study related to technology or finance. Work experience can substitute on a year for year basis for the degree. 1. Min 11-12+ years of IT experience with Eight (8) + years of broad experience working with Microsoft development technologies including Microsoft .NET (C#), ASP.NET and .NET Core, Azure DevOps and CI/CD Pipelines, Azure Functions, ORMS including Entity Framework. 2. minimum of 2 years' experience in Javascript UI libraries such as Angular and React, Backend databases such as SQL Server and Oracle, and on-premises and cloud based (Azure) platforms. 3. Experience with Scrum, SAFe, DAD, or other agile approach. Preferred KSAs: 4. Knowledge of various development platforms and full stack development. 5. Knowledge of the SCRUM Framework 6. Knowledge of financial systems such as an ERP 7. Familiarity with data management concepts such as ETL, Data Warehousing, Operational Data Stores, Data Lakes, and Master Data Management 8. Candidates with a deep understanding of Azure services and experience in implementing cloud solutions will be prioritized. Primary Job Duties/ Tasks The submitted candidate must be able to perform the following duties and/or tasks. Duties of the selected candidate will include, but not be limited to: 1. Analyze current web applications and document the specifications. 2. Work with management to develop an overall remediation strategy for all impacted web-based applications and databases. 3. Analyze existing web applications and work with business users to determine how these applications can be improved based on current business needs and within the constraints of remediation activities. 4. Remediate web applications based on analysis to prepare them for Client use of PALM. 5. Work with database administrators from the Office of Information Technology to create database views and stored procedures that will facilitate the remediation of application databases. 6. Update web applications to incorporate chart of account and other changes mandated by Florida PALM. 7. Analyze financial data and make recommendations to improve the data model of financial systems. 8. Utilize Azure DevOps to manage work tasks, code assets, and deployments. 9. Attend regular scrum and team meetings. Participate in collaborative activities with team members and customers. 10. Work on maintenance activities for Application Services. 11. Perform knowledge transfer with technical staff of the office of the Comptroller and Application Services. Job Specific Knowledge, Skills, and Abilities (KSAs) 1. Experience developing applications in ASP.NET, Angular or React, SQL Server and/or Oracle. 2. Familiarity with on-premises and cloud-based web applications. 3. Strong SQL skills and experience with the SQL Server and/or Oracle relational database management system. 4. Well versed in software development and agile best practices. 5. Analytical and critical thinking. 6. Understanding of how to implement solutions with multiple data sources and across a variety of technologies. General Knowledge Skills and Abilities (KSAs): The submitted candidate must be able to apply common knowledge, skills, and abilities in the following areas: 1. Communication: Ability to clearly convey information, in both written and verbal formats, to individuals or groups in a wide variety of settings (i.e., project team meetings, management presentations, etc.). Must have the ability to effectively listen and process information provided by others. 2. Customer Service: Works well with clients and customers (i.e., business office, public, or other agencies). Able to assess the needs of the customer, provide information or assistance to satisfy expectations or resolve a problem. 3. Decision Making: Makes sound, well-informed, and objective decisions. 4. Flexibility: Open to change, new processes (or process improvement), and new information. Has the ability to adapt in response to new information, changing conditions, or unexpected obstacles. Ability to receive and give constructive criticism and maintain effective work relationships with others. 5. Interpersonal: Shows friendliness, courtesy, understanding, and politeness to others. 6. Leadership: Motivates, encourages, and challenges others. Adapt leadership styles in a variety of situations. 7. Problem Solving: Ability to identify, evaluate, and use sound judgement to generate and evaluate alternative actions, and make recommendations as accordingly. 8. Team Building: Encourages, inspires, and guides others toward accomplishing the common goal. \"When replying please make sure to list your (All Inclusive) Compensation requirements !!!\" Note: This is a Full Time ON SITE Contract Position with NO remote options allowed!! # of positions: 3 ESTIMATED Start date : Dec 2024",
        "source": "Email",
        "date_posted": "2024-10-30 14:37:51-05:00",
        "unique_id": "192df4fb1ea8ea89",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]