[
    {
        "company": "Msys Inc",
        "job_title": "Senior .Net Developer",
        "location": "Indianapolis, IN, USA",
        "full_location": {
            "city": "Indianapolis",
            "state": "IN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10 years",
            "degree_required": "Bachelor's Degree in Computer Science or related fields with IT experience",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Long term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "ASP.NET",
                "C#",
                "MVC",
                "Oracle"
            ],
            "primary": [
                "Web Services",
                "Security analysis",
                "SDLC"
            ],
            "secondary": [
                "Healthcare EDI",
                "Excellent verbal and written communication skills",
                "Problem-solving"
            ],
            "all": [
                "ASP.NET",
                "C#",
                "MVC",
                "Oracle",
                "Web Services",
                "Security analysis",
                "SDLC",
                "Healthcare EDI",
                "Excellent verbal and written communication skills",
                "Problem-solving"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "saikiran",
        "email": "resume@msysinc.com",
        "jd": "Title: Senior .Net Developer - Hybrid - w2 or 1099\nLocation: Indianapolis, IN, USA\nLength: Long term\nRestriction: W2 only\n\nDescription:\nInterview Type: Webcam Interview\n*** Very long term project expect to go for 4+ years ***\n*** Hybrid ***\n*** Possible contract to hire***\nLocal candidates to IN only ***\n\nShort Description:\nSenior .NET developer to work building a new CSHCS Web application.\n\nJob Description:\nThe manager has indicated the position is a possible contract to hire opportunity for eligible candidates only. Candidates presented must be eligible for full time hire, without requiring sponsorship.\n\nResponsible to analyze existing application at Indiana State Department of Health towards building new Web application. Developer will work with PM, other developers, business analysts, and functional team members on the project activities.\n\nEssential Duties / Responsibilities:\nResponsible for complete SDLC for project assignment and participate in full development life cycle including requirements analysis and design.\nWorking with technical and functional staff on detailed business requirements, understanding business processes and technology, agency standards, federal and state policies to align with projects goals.\nWrite technical specifications based on conceptual design and stated business requirements.\nUse object oriented techniques and best practices for design, development, unit testing, and deployment.\nDevelopment of code along with unit testing strategy & plans.\nUse Microsoft .NET Framework and a supported MVC framework, C# programming language to development of the applications.\nWork with Project Manager to ensure project plan is maintained and project milestones are being met.\nWork with PM, technical staff, and end user to prototype, refine, test, and debug programs to meet needs of the application.\nHave ability to work independently with less guidance and work with ISDH externals partners as needed.\nTake agency web applications architecture and business decisions into consideration for design.\nHave ability to work independently and under general supervision with latitude for independent judgement.\n\nRequired Skills:\nWorking experience with ASP.NET. 10 Years\nWorking experience with C#, MVC 5 Years\nWork experience in analysis and addressing security related issues for applications built in multiple languages. 5 Years\nWorking experience with Oracle. 5 Years\nBachelors Degree in Computer Science or related fields with IT experience.\n\nHighly desired Skills:\nBachelors Degree in Computer Science or related fields with IT experience.\nHealthcare EDI experience\nExpert understanding of SDLC\nCurrent working experience with Web Services.\nExcellent verbal and written communication skills.\nAbility to solve complex programming issues.\nExperience in Health Industry is a plus.",
        "source": "Email",
        "date_posted": "2024-10-30 10:53:15-05:00",
        "unique_id": "192de64769f19835",
        "emp_type": [
            "contract",
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]