[
    {
        "company": "Sonitalent Corp",
        "job_title": "Senior .Net Developer",
        "location": "New York, NY, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "8+ years",
            "degree_required": "Bachelor's degree in Information Technology or equivalent years of experience required",
            "visa_sponsorship": "Must have existing work authorization",
            "notice_period": "Not specified",
            "duration": "Permanent",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "C#",
                ".Netcore",
                "SQL Server",
                "MVC",
                "TFS",
                "VB.Net"
            ],
            "primary": [
                "Healthcare applications",
                "EDI",
                "HIPAA X12",
                "Claims processing",
                "Transact-SQL",
                "PL/SQL",
                "Webservices",
                "SSIS",
                "SSRS",
                "BizTalk Server"
            ],
            "secondary": [
                "QNXT",
                "Facets",
                "Business analysis",
                "Customer service",
                "Team collaboration",
                "Interpersonal skills",
                "Communication skills"
            ],
            "all": [
                "C#",
                ".Netcore",
                "SQL Server",
                "MVC",
                "TFS",
                "VB.Net",
                "Healthcare applications",
                "EDI",
                "HIPAA X12",
                "Claims processing",
                "Transact-SQL",
                "PL/SQL",
                "Webservices",
                "SSIS",
                "SSRS",
                "BizTalk Server",
                "QNXT",
                "Facets",
                "Business analysis",
                "Customer service",
                "Team collaboration",
                "Interpersonal skills",
                "Communication skills"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Abdul Rahman",
        "email": "abdul.rahman@sonitalentcorp.com",
        "jd": "Job Role: Senior .Net Developer\nJob Location: NYC, NY- Hybrid- Onsite-Need to be local\nDuration: Full Time\nVisa: USC, GC Only\nMode of Interview: Phone/Skype\n\nNote - Need LinkedIn\n\nOne position needs Healthcare applications including EDI, Hipaa x-12, claims processing. A plus would be QNXT, Facets.\n\nThe other Sr. NET DEVELOPER needs 8 plus years of experience with C#, .Netcore, SQL/SERVER, MVC, TFS, VB.Net.\n\nJob Description – Responsibilities\n- Develop and provide day-to-day support for the internally-developed Document Management System and other third-party applications.\n- Develop and maintain healthcare payer EDI solutions (primarily HIPAA X 12 transactions) around Cognizant's QNXT Claims Processing System.\n- Work on development of non-X12 EDI imports and exports, XML and text file processing, data mapping and data conversion projects.\n- Participate in project and new initiative meetings as necessary and represent the development team, making recommendations and decisions on behalf of the team.\n- Analyze and translate business requests/requirements to functional requirements and technical specifications, develop and/or manage the development, perform code reviews, and work with IT and business areas to test and deliver the results in a timely manner.\n- Maintain relationship with software vendors and EDI trading partners and lead development and troubleshooting efforts of others in the group.\n- Looks for ways to improve how and what we develop/deploy and make suggestions.\n- Perform additional duties and projects as assigned by management.\n\nQualifications\n- Bachelor's degree in Information Technology or equivalent years of experience required.\n- Minimum three (3) years' of experience with healthcare payer technologies, preferably with claims processing systems (such as QNXT).\n- Minimum five (5) years application development and integration experience using Microsoft technologies (e.g., C#.NET, SSIS, SSRS, SQL Server, Visual Studio).\n- Minimum three (3) years' experience managing skilled technical staff and vendors.\n- Proficient in Transact-SQL, PL/SQL, C#.NET, and Webservices.\n- Proficient in Microsoft SQL Server, SSIS, SSRS, BizTalk Server development.\n- Experience with EDI and HIPAA X 12 transaction sets (e.g., 837, 835, 277).\n- Strong business analysis/needs assessment skills; must be comfortable and effective working directly with end users.\n- Strong customer service skills; able to professionally and effectively resolve requests in a high volume and fast-paced environment, while interacting with other IT Department staff, business users, and senior management.\n- Ability to work well in a team environment, meet tight deadlines, and handle several projects simultaneously.\n- Must have excellent communication, managerial, interpersonal, and collaborative skills.",
        "source": "Email",
        "date_posted": "2024-10-30 10:24:31-05:00",
        "unique_id": "192de549bdc7d021",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]