[
    {
        "company": "W3Global",
        "job_title": "Project Manager-SAP Learning Hub",
        "location": "Sunnyvale, CA, USA",
        "full_location": {
            "city": "Sunnyvale",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12-24 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "writing",
                "communication",
                "presentation development",
                "data analysis"
            ],
            "primary": [
                "SAP Learning Hub",
                "Learning and Development (L&D) Coordination",
                "Keynote",
                "Pages",
                "storytelling"
            ],
            "secondary": [
                "monitoring",
                "reporting",
                "troubleshooting",
                "optimizing functionality"
            ],
            "all": [
                "writing",
                "communication",
                "presentation development",
                "data analysis",
                "SAP Learning Hub",
                "Learning and Development (L&D) Coordination",
                "Keynote",
                "Pages",
                "storytelling",
                "monitoring",
                "reporting",
                "troubleshooting",
                "optimizing functionality"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Raghuteja",
        "email": "raghu.miriyala@w3global.com",
        "jd": "Job: Project Manager-SAP Learning Hub\nLocation: Sunnyvale, CA (hybrid)\nLength: 12-24 months\nVisa: H1B, H4 EAD, USC, GC\n\nHere is the new role. The manager is not looking for SAP learning Hub experience, he is looking for someone who is strong in writing and communication to write and tell the story of the usage of SAP Learning Hub, which is a licensed subscription for employees to go to the SAP website and complete their certification courses. Manager is looking for someone who can tell the story, present to the stakeholders and develop reports.\n\nMandatory: Local consultants that don’t need to relocate\nPrefer previous Apple experience\nLook for Program Manager that has Learning and Development experience or tracking trainings\nExperience writing and telling a story to stakeholders\nNeeds to have experience with developing presentations in Keynote and Pages for stakeholder Program Manager for SAP Learning and Content Optimization - Sunnyvale, CA long term contract.\n\nResponsibilities: \n- Program Manager for working within SAP Learning Hub\n- Monitor, analyze and report on SAP website for Learning Hub progress of certifications and develop reports on usage\n- Monitor progress within SAP learning Hub for certifications and report to managers so they can encourage employees to complete certifications\n- Prepare Leadership reports using Keynote, Pages. Creative writing skills are mandatory, with ability to tell a story and develop presentations from this data for stakeholders.\n- Listen to Feedback from managers and update reports\n\nQualifications: \n- Proficiency in monitoring, analyzing, and reporting on SAP Learning Hub usage data.\n- Ability to troubleshoot and optimize SAP Learning Hub functionality to support continuous learning.\n- Learning and Development (L&D) Coordination Experience: coordinating between multiple teams involved in learning and development initiatives, including both content creation and distribution.\n- Strong Presentation and Communication Design Proficient in creating engaging and visually appealing narratives using Keynote, Pages, or similar tools for leadership-level presentations.\n- Strong storytelling skills with the ability to turn complex data into easy-to-understand visual reports.\n- Data Analysis and Reporting Ability to generate, interpret, and present data-driven reports related to learning/certification platform usage, providing actionable insights to leadership.",
        "source": "Email",
        "date_posted": "2024-10-30 11:16:56-05:00",
        "unique_id": "192de7d66b76df9f",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]