[
    {
        "company": "Yochana IT",
        "job_title": "Release Train Engineer (RTE)",
        "location": "Raritan, NJ, USA",
        "full_location": {
            "city": "Raritan",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Release Train Engineer",
                "Agile methodologies",
                "Scrum",
                "Project management",
                "SAP environments"
            ],
            "primary": [
                "Agile Release Trains (ARTs)",
                "Program Increments (PIs)",
                "People management",
                "Communication skills",
                "Continuous improvement"
            ],
            "secondary": [
                "Risk management",
                "Impediment handling",
                "Coaching Agile teams",
                "Facilitating ART events",
                "Complex environments"
            ],
            "all": [
                "Release Train Engineer",
                "Agile methodologies",
                "Scrum",
                "Project management",
                "SAP environments",
                "Agile Release Trains (ARTs)",
                "Program Increments (PIs)",
                "People management",
                "Communication skills",
                "Continuous improvement",
                "Risk management",
                "Impediment handling",
                "Coaching Agile teams",
                "Facilitating ART events",
                "Complex environments"
            ]
        },
        "job_type": [
            "onsite",
            "hybrid"
        ],
        "contact_person": "Pavan Kumar",
        "email": "pavank@yochana.com",
        "jd": "Greetings! I am Pavan Kumar, reaching out to check your availability. Please review the job description below and submit your latest resume if you are looking for new opportunities. Also, if someone else in your network is qualified for the position, then please feel free to forward this mail to them.\n\nJob Title : RTE\nLocation : Raritan, NJ (Onsite-Hybrid)\nDuration : Long Term Contract\n\nJob Description:\nResponsibilities:\n• Individual will ensure end-to-end planning and coordinated communication between all scrum teams and shared teams throughout the project lifecycle.\n• RTE will ensure project commitments are consistently planned, coordinated, and met across Product Managers, scrum masters, and shared teams.\n• Individual is responsible for impediments handling in timely manner, cross-scrum and shared teams.\n• RTE will drive the process, cadence, and ceremonies across scrum and shared teams, not individual scrum teams including PI planning and release planning.\n• RTE will maintain release tracker for technical objects and sets guidelines for DSU’s and scrum team performance.\n• You will support risk management and mitigations\n\nQualifications:\n• Individual should have least 5 years of experience as a release train engineer/agile management.\n• Proven experience as a Scrum master, RTE, project management, Agile methodologies, and SAP environments is crucial.\n• Experience with Agile Release Trains (ARTs) and Program Increments (PIs).\n• Demonstrated Release Train Engineer experience in big program implementations involving multiple applications.\n• Understanding of SAP and S/4 Hana systems and how they integrate with Agile practices.\n• Ability to lead and coach Agile teams, facilitate ART events, and foster continuous improvement.\n• Experience with complex environments and multiple phases of project running in parallel.\n• Extensive experience in Agile Product Development with a strong focus on delivery.\n• People management experience and effectively lead the team through change.\n• Very strong communication skills and ability to work in a fast-paced environment.",
        "source": "Email",
        "date_posted": "2024-10-30 14:40:13-05:00",
        "unique_id": "192df11557716842",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Scrum Master"
    }
]