[
    {
        "company": "KPG Technologies",
        "job_title": "Senior Business Analyst",
        "location": "Chicago, IL, USA",
        "full_location": {
            "city": "Chicago",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Technical Degree or related work experience",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "Long term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SQL",
                "Database Management",
                "Analytical Abilities",
                "Process Documentation",
                "Business Objects"
            ],
            "primary": [
                "Entertainment Streaming Platform",
                "Broadband Connectivity",
                "Systems Development",
                "Quality Assurance",
                "User Requirements Development"
            ],
            "secondary": [
                "ITIL Foundations",
                "Communication Skills",
                "Project Management",
                "Stakeholder Engagement",
                "Systems Analytics"
            ],
            "all": [
                "SQL",
                "Database Management",
                "Analytical Abilities",
                "Process Documentation",
                "Business Objects",
                "Entertainment Streaming Platform",
                "Broadband Connectivity",
                "Systems Development",
                "Quality Assurance",
                "User Requirements Development",
                "ITIL Foundations",
                "Communication Skills",
                "Project Management",
                "Stakeholder Engagement",
                "Systems Analytics"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Vivek",
        "email": "vivek@kpgtech.com",
        "jd": "JOB DESCRIPTION: Must be local to Chicago, IL. Hybrid onsite from day one. 2 days a week. Must have experience with entertainment streaming platform and broadband connectivity.\n\n· Drive identification of requirements across business units and identify substandard systems processes through evaluation of real-time data.\n\n· Serve as thought leader for technical business processes, developing forward-thinking systems prototypes that promote increased efficiency and productivity on multiple levels.\n\nPrimary Responsibilities:\n\n· Create and implement precise management plans for every project, with attention to transparent communication at all levels.\n\n· Perform, evaluate, and communicate thorough quality assurance at every stage of systems development.\n\n· Determine and develop user requirements for systems in production, to ensure maximum usability.\n\n· Partner with other stakeholder teams across business units (i.e., sales, finance, security, compliance) to develop necessary analysis and documentation in a collaborative way, communicating effectively and efficiently with production, managerial, and executive teams.\n\n· Evaluate, analyze, and communicate systems requirements on a continuing basis, and maintain systems processes, including the delivery of monthly status reports to all appropriate parties.\n\n· Author and update internal and external documentation, and formally initiate and deliver requirements and documentation.\n\n· Conduct daily systems analytics to maximize effectiveness and troubleshoot problems.\n\n· Develop meaningful and lasting relationships with partners for optimized systems integration, and respond to questions and concerns from managers and executives with supporting research and recommendations.\n\nQualifications:\n\n· Technical Degree or related work experience.\n\n· Proven experience in an analytics and systems development capacity.\n\n· High proficiency with SQL language and database management.\n\n· Proven analytical abilities.\n\n· Practical experience generating process documentation and reports.\n\n· Excellent communicator with the ability to translate data into actionable insights.\n\n· Experience working with Business Objects.\n\n· Knowledge of ITIL Foundations.",
        "source": "Email",
        "date_posted": "2024-10-30 13:30:06-05:00",
        "unique_id": "192ded127450680e",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]