[
    {
        "company": "SPAR Information Systems",
        "job_title": "GCP Data Engineer with Bigquery & Retail client exp",
        "location": "Bentonville, AR, USA",
        "full_location": {
            "city": "Bentonville",
            "state": "AR",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "6+ years",
            "degree_required": "Bachelor’s degree in Computer Science, Computer Engineering or a software related discipline",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "GCP",
                "BigQuery",
                "Hadoop",
                "Scala",
                "SQL",
                "Spark"
            ],
            "primary": [
                "Data Warehouse",
                "Data Analysis",
                "Data Cleaning",
                "Data Validation",
                "Data Migration",
                "Data Pipeline",
                "Airflow",
                "Kubernetes"
            ],
            "secondary": [
                "Hive",
                "Pig",
                "Python",
                "ETL",
                "Cloud Administration",
                "Machine Learning",
                "Java",
                "Reactjs",
                "NodeJs"
            ],
            "all": [
                "GCP",
                "BigQuery",
                "Hadoop",
                "Scala",
                "SQL",
                "Spark",
                "Data Warehouse",
                "Data Analysis",
                "Data Cleaning",
                "Data Validation",
                "Data Migration",
                "Data Pipeline",
                "Airflow",
                "Kubernetes",
                "Hive",
                "Pig",
                "Python",
                "ETL",
                "Cloud Administration",
                "Machine Learning",
                "Java",
                "Reactjs",
                "NodeJs"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Rahul Kumar",
        "email": "rahul.k@sparinfosys.com",
        "jd": "Hello Folks, (Must have exp with Retail client, GCP- Google Cloud Platform, BIGQuery, Hadoop, Hive, Spark, Scala, Airflow, Script, SQL skills) - Note itHope you all are doing good.\n\nPlease go through the Job description and let me know your interest.\n\nTitle: GCP Data Engineer with Bigquery & Retail client exp\nLocation: Bentonville, AR (Day 1 Onsite)\nDuration: 12+ Months contract\n\nYou bring:\n• Bachelor’s degree in Computer Science, Computer Engineering or a software related discipline. A Master’s degree in a related field is an added plus\n• 6+ years of experience in Data Warehouse and Hadoop/Big Data\n• 3+ years of experience in strategic data planning, standards, procedures, and governance\n• 4+ years of hands-on experience in Scala\n• 4+ years of experience in writing and tuning SQLs, Spark queries\n• 3+ years of experience working as a member of an Agile team\n• Experience with Kubernetes and containers is a plus\n• Experience in understanding and managing Hadoop Log Files.\n• Experience in understanding Hadoop multiple data processing engines such as interactive SQL, real time streaming, data science and batch processing to handle data stored in a single platform in Yarn.\n• Experience in Data Analysis, Data Cleaning (Scrubbing), Data Validation and Verification, Data Conversion, Data Migrations and Data Mining.\n• Experience in all the phases of Data warehouse life cycle involving Requirement Analysis, Design, Coding, Testing, and Deployment., ETL Flow\n• Experience in architecting, designing, installation, configuration and management of Apache Hadoop Clusters\n• Experience in analyzing data in HDFS through Map Reduce, Hive and Pig is a plus\n• Experience building and optimizing ‘big data’ data pipelines, architectures and data sets.\n• Strong analytic skills related to working with unstructured datasets\n• Experience in Migrating Big Data Workloads\n• Experience with data pipeline and workflow management tools: Airflow\n• Cloud Administration\n\nAs a Senior Data Engineer this is your opportunity to:\n• Assembling large to complex sets of data that meet non-functional and functional business requirements\n• Identifying, designing and implementing internal process improvements including re-designing infrastructure for greater scalability, optimizing data delivery, and automating manual processes\n• Building required infrastructure for optimal extraction, transformation and loading of data from various data sources using GCP/Azure and SQL technologies\n• Building analytical tools to utilize the data pipeline, providing actionable insight into key business performance metrics including operational efficiency and customer acquisition\n• Working with stakeholders including data, design, product and executive teams and assisting them with data-related technical issues\n• Working with stakeholders including the Executive, Product, Data and Design teams to support their data infrastructure needs while assisting with data-related technical issues\n• Strong background in data warehouse design\n• Overseeing the integration of new technologies and initiatives into data standards and structures\n• Strong Knowledge in Scala, Spark, PySpark, Python, SQL\n• Experience in Cloud platform (GCP/Azure) data migration – Source/Sink mapping, Build pipelines, work flow implementation, ETL and data validation processing\n• Strong verbal and written communication skills to effectively share findings with shareholders\n• Experience in Data Analytics, optimization, machine learning techniques is added advantage\n• Understanding of web-based application development tech stacks like Java, Reactjs, NodeJs is a plus\n\nKey Responsibilities\n• 20% Requirements and design\n• 60% coding & testing and 10% review coding done by developers, analyze and help to solve problems\n• 10% deployments and release planning\n\nFor this role, we value:\n• The ability to adapt quickly to a fast-paced environment\n• Excellent written and oral communication skills\n• A critical thinker that challenges assumptions and seeks new ideas\n• Proactive sharing of accomplishments, knowledge, lessons, and updates across the organization\n• Experience designing, building, testing and releasing software solutions in a complex, large organization\n• Demonstrated functional and technical leadership\n• Demonstrated analytical and problem-solving skills (ability to identify, formulate, and solve engineering problems)\n\nOverall Experience level: 8+ years in IT with min 6+ years of Data Engineering and Analyst experience.",
        "source": "Email",
        "date_posted": "2024-10-30 09:30:14-05:00",
        "unique_id": "192ddf58ea207b04",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "GCP Data Engineer"
    }
]