[
    {
        "company": "Yochana IT",
        "job_title": "Senior Delivery Lead/PM",
        "location": "Foster City, CA, USA",
        "full_location": {
            "city": "Foster City",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified",
            "job_code": "",
            "contact_person": "Pavan Kumar",
            "email": "pavank@yochana.com"
        },
        "skills": {
            "core": [
                "GxP Pharma Biotech experience"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "GxP Pharma Biotech experience"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Pavan Kumar",
        "email": "pavank@yochana.com",
        "jd": "Mandatory Skills: GxP Pharma Biotech experience\nNeed local to CA consultants only\n\nJob Details: Senior Delivery Lead/PM is responsible for planning and coordinating the execution of large program deliverables which requires engagement across multiple organizations. The ideal candidate will have pharma experience with GxP Technical Development or Pharma Biotech experience.\n\nMandatory: Senior customer-facing role responsible for planning and coordinating the execution of large program deliverables across multiple business capabilities\n\nMandatory: Plan and coordinate the execution of large program deliverables which requires engagement across multiple business capabilities.\n\nMandatory: Communicate target outcomes, coordinate delivery, resource planning, provide visibility of program health, and manage program risks, compliance, and financials. Ensure delivery and meet customer’s expectations in terms of the target outcomes, timeline, and cost and facilitate sync points between business and technology leaders and Risk and Compliance partners.\n\nMandatory: Interact with Business Leads and BPOs in Technical Development and manufacturing operations to provide planning, delivery updates, and risk management\n\nLead and coordinate routines to support the delivery of large programs, such as kick-offs, status reviews, stakeholder meetings, change controls, and implementation gates\n\nMandatory: Translate business objectives and requirements to implement technical solutions with traceability to business objectives\n\nDevelop clear communication plans\n\nManage program financials and supports resource planning\n\nMaintain compliance with IT policies, controls, and regulations, driving operational excellence, industry best practices and clearly interpret GxP Part 11 requirements\n\nCoordinate internal and external resources, ensure projects remain within scope, schedule and cost",
        "source": "Email",
        "date_posted": "2024-10-30 15:01:44-05:00",
        "unique_id": "192df3e64e9a884c",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]