[
    {
        "company": "Zealhire",
        "job_title": "Senior Program Manager",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Bachelor’s degree in Business, Finance, or related field (MBA or relevant certification like PMP or PgMP preferred)",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Program Management",
                "Financial Management",
                "Stakeholder Management",
                "Risk Management",
                "Project Planning"
            ],
            "primary": [
                "Leadership",
                "Communication",
                "Organizational Skills",
                "Regulatory Compliance",
                "Project Management Tools"
            ],
            "secondary": [
                "MS Project",
                "JIRA"
            ],
            "all": [
                "Program Management",
                "Financial Management",
                "Stakeholder Management",
                "Risk Management",
                "Project Planning",
                "Leadership",
                "Communication",
                "Organizational Skills",
                "Regulatory Compliance",
                "Project Management Tools",
                "MS Project",
                "JIRA"
            ]
        },
        "job_type": [],
        "contact_person": "Shweta",
        "email": "shweta@zealhire.com",
        "jd": "From: shweta, zealhire shweta@zealhire.com Reply to: shweta@zealhire.com econdary SkillsSr Program Manager w..Job DescriptionUSC/GCneed LinkedIn We are seeking a Senior Program Manager with extensive experience in the financial industry to lead and manage strategic projects from initiation to completion. This individual will play a key role in driving project success, aligning business goals with project deliverables, and ensuring that all initiatives are executed on time, within budget, and to the highest quality standards.\n\nKey Responsibilities:\n\nProgram Leadership: Lead, oversee, and manage multiple projects within a larger program in a financial environment, ensuring alignment with organizational objectives and regulatory standards.\n\nStakeholder Management: Establish strong relationships with internal and external stakeholders, including executive leadership, cross-functional teams, and clients, to facilitate program success.\n\nProject Planning & Execution: Define project scope, goals, and deliverables, and develop comprehensive project plans that align with business objectives.\n\nRisk & Issue Management: Identify, assess, and mitigate risks and issues that could impact program objectives; develop contingency plans as needed.\n\nFinancial Management: Oversee budgets, forecasts, and financial performance, ensuring effective cost management and alignment with financial targets.\n\nCompliance & Reporting: Ensure all projects adhere to financial regulations and compliance requirements, providing regular updates and reports to stakeholders.\n\nRequired Qualifications:\n\nExperience: Minimum of 10+ years in program/project management, with at least 5 years in the financial sector.\n\nEducation: Bachelor’s degree in Business, Finance, or related field (MBA or relevant certification like PMP or PgMP preferred).\n\nSkills: Strong understanding of financial services, including regulatory compliance and risk management. Proven track record of successfully managing large-scale, cross-functional programs. Excellent leadership, organizational, and communication skills. Proficiency in project management tools (e.g., MS Project, JIRA, etc.).",
        "source": "Email",
        "date_posted": "2024-10-30 08:26:53-05:00",
        "unique_id": "192ddbba5e1b4064",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]