[
    {
        "company": "Shrive Technologies LLC",
        "job_title": "Scrum master",
        "location": "El Segundo, CA, USA",
        "full_location": {
            "city": "El Segundo",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "5-9 Years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Scrum Master",
                "WMS background",
                "logistics"
            ],
            "primary": [
                "Test Management"
            ],
            "secondary": [],
            "all": [
                "Scrum Master",
                "WMS background",
                "logistics",
                "Test Management"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Thanusha",
        "email": "thanusha@shrivetechnologies.com",
        "jd": "Role/Responsibilities\nMust have WMS background in logistics area.\nAssist the team as a coach and mentor, providing help and guidance to help them improve their Scrum practices.\nWork with the product owner and other stakeholders to ensure that the team's efforts align with the organization's goals.\nEnsure the team follows the Scrum framework and carries out the Scrum ceremonies.\nResponsibilities\nCreate and maintain a Scrum Master responsibilities list, and Scrum Master tasks list to ensure that all duties are being performed.\nFollow the team's progress and provide feedback and direction as needed.\nHelp with team discussions and conflict resolution.\nAssist the team in identifying and removing any impediments to the team's progress.\nAssist the product owner in creating and prioritizing user stories.\nEnsure that the team is following the Scrum framework and that all scrum ceremonies are being conducted.\nAct as an intermediary between the team and other stakeholders, such as management, to ensure that the team's efforts align with the organization's goals.\nCollaborate with other Scrum Masters within the organization to share knowledge and best practices and to improve the Scrum process.\nAssess the team's performance and adapt the Scrum Master responsibilities list, Scrum Master duties, and Scrum Master tasks.\nImprove the scrum process and install changes to increase the efficiency and effectiveness of the team.\nAssist the team in improving their skills and delivering high-quality products.",
        "source": "Email",
        "date_posted": "2024-10-30 09:27:55-05:00",
        "unique_id": "192ddf36ca365cb3",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Scrum Master"
    }
]