[
    {
        "company": "Tek Inspirations",
        "job_title": "Jaggaer Implementation Project Manager",
        "location": "Rhode Island, USA",
        "full_location": {
            "city": "Rhode Island",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Bachelor’s degree in Project Management, Information Technology, Business Administration, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "10 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Coordination",
                "Production Support",
                "Change Management",
                "User Support"
            ],
            "primary": [
                "SaaS",
                "ERP Systems",
                "Training Coordination",
                "Communication"
            ],
            "secondary": [],
            "all": [
                "Project Coordination",
                "Production Support",
                "Change Management",
                "User Support",
                "SaaS",
                "ERP Systems",
                "Training Coordination",
                "Communication"
            ],
            "with_experience": [
                "Project Coordination (5+ years)",
                "Production Support (5+ years)"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Ankit",
        "email": "ankit.rajoriya@tekinspirations.com",
        "jd": "Job Description - Job Title: Jaggaer Implementation Project Manager\nLocation: Rhode Island (Remote)\nDuration: 10 months\nTeams interview\n\nPosition Overview:\nThe Jaggaer Implementation Project Manager will lead the phased rollout of the Jaggaer procurement system to designated user groups, focusing on production support, issue management, and collaboration with organizational change management (OCM). The role involves working closely with a dedicated training manager to coordinate effective training execution, ensuring a smooth transition for each user group and ongoing system adoption.\n\nKey Responsibilities:\nPhased Rollout Management\nPlan and execute the phased rollout of Jaggaer to three or four user groups, ensuring smooth implementation for each phase. Communicate timelines, activities, and dependencies to stakeholders and gather feedback from each phase to refine the process for subsequent groups.\n\nProduction Support and Issue Management\nServe as the primary point of contact for production support, managing user inquiries, troubleshooting, and issue resolution. Implement issue tracking workflows and maintain knowledge bases to support end-users and enhance the system's usability.\n\nCollaboration with Organizational Change Management (OCM)\nWork with OCM to drive adoption and support a seamless transition for each rollout phase. Coordinate communications with users, including emails, FAQs, and change management materials, to ensure clarity and engagement.\n\nCoordination with Training Manager\nCollaborate closely with the dedicated training manager to ensure training schedules align with rollout phases and that all training objectives are met. Provide feedback to the training manager on user needs and monitor training effectiveness as each group transitions to Jaggaer.\n\nPerformance Monitoring and Continuous Improvement\nTrack system performance and engagement metrics, implementing improvements as needed. Collaborate with stakeholders to evaluate the rollout’s success and identify opportunities for process and support improvements.\n\nMust Have Skills;\nBachelor’s degree in Project Management, Information Technology, Business Administration, or a related field.\n5+ years of project or rollout management experience in SaaS or ERP systems, preferably within procurement.\nStrong knowledge of change management and user support best practices.",
        "source": "Email",
        "date_posted": "2024-10-30 13:51:31-05:00",
        "unique_id": "192df0cbc227ffe4",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]