[
    {
        "company": "Wisconsin Department of Public Instruction",
        "job_title": "Sr Internal Business Systems Analyst II",
        "location": "USA",
        "full_location": {
            "city": "Madison",
            "state": "WI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "8+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "11/18/2024 to 06/30/2025 with the possibility of extension",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business and Systems Analysis (BA/SA)",
                "Writing user stories with acceptance criteria",
                "Quality Assurance and UAT",
                "Agile (Scrum) and Waterfall methodologies",
                "Stakeholder and Product Owner management",
                "Technical proficiency with Microsoft Azure DevOps",
                "SQL",
                "relational databases"
            ],
            "primary": [
                "Knowledge of database technologies (SQL Server, Oracle PL/SQL)",
                "Familiarity with project management tools (JIRA, Azure Boards, Asana)",
                "Experience in K12 education software systems",
                "Experience with Cloud solutions and distributed systems"
            ],
            "secondary": [],
            "all": [
                "Business and Systems Analysis (BA/SA)",
                "Writing user stories with acceptance criteria",
                "Quality Assurance and UAT",
                "Agile (Scrum) and Waterfall methodologies",
                "Stakeholder and Product Owner management",
                "Technical proficiency with Microsoft Azure DevOps",
                "SQL",
                "relational databases",
                "Knowledge of database technologies (SQL Server, Oracle PL/SQL)",
                "Familiarity with project management tools (JIRA, Azure Boards, Asana)",
                "Experience in K12 education software systems",
                "Experience with Cloud solutions and distributed systems"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "sophia rwaltz",
        "email": "sophia@rwaltz.com",
        "jd": "ROLE TITLE: Sr Internal Business Systems Analyst II\n· START / END: 11/18/2024 to 06/30/2025 with the possibility of extension.\n· CLIENT LOCATION: 201 West Washington Avenue, Madison, Wisconsin, 53703\n· WORK ARRANGEMENT: 100% Remote [in Wisconsin]. Candidates must be Wisconsin residents or willing to relocate to Wisconsin before starting. This role can be 100% remote within the state.\n\nDETAILS\nThe Wisconsin Department of Public Instruction seeks a Sr Internal Business Systems Analyst II to join its Applications Development Team under the Division of Libraries and Technology. The team manages the enterprise architecture, development, system testing, analysis, and maintenance of systems capturing critical K12 education data for Wisconsin, including finance, budget, and data collection applications.\n\nThis position will maintain and enhance the department's most complex enterprise applications by bridging the gap between business needs and technical solutions. It plays a critical role in understanding business requirements, analyzing systems, and translating those needs into clear functional specifications for development teams.\n\nREQUIRED SKILLS (8+ YEARS):\n· Business and Systems Analysis (BA/SA)\n· Writing user stories with acceptance criteria\n· Quality Assurance and UAT\n· Agile (Scrum) and Waterfall methodologies\n· Stakeholder and Product Owner management\n· Technical proficiency with Microsoft Azure DevOps, SQL, and relational databases\n\nNICE TO HAVE SKILLS:\n· Knowledge of database technologies (SQL Server, Oracle PL/SQL)\n· Familiarity with project management tools (JIRA, Azure Boards, Asana)\n· Experience in K12 education software systems\n· Experience with Cloud solutions and distributed systems.\n\nKEY RESPONSIBILITIES:\n· Requirements Gathering & Analysis: Interact with internal and external stakeholders to define and document business needs and develop business requirements for new systems/data collections, system/data collection enhancements, and maintenance projects. Analyze current workflows and identify areas for improvement.\n· Business Process Modeling: Work with stakeholders to assess and document current business processes, create flow diagrams, and recommend process improvements to streamline operations. Develop a deep understanding of LEA and DPI operations to meet their IT needs effectively.\n· Elicit Functional Specifications: Collaborate with stakeholders and technical teams to translate business needs into functional and non-functional requirements. Develop detailed documentation, including business rules, use cases, user stories, and acceptance criteria.\n· System Design Consultation: Work closely with developers to ensure business requirements are accurately and fully translated into technical specifications.\n· Collaboration & Stakeholder Management: Liaison between DPI business units, developers, quality assurance teams, external vendors, and customers, ensuring that all stakeholders have a clear understanding of system requirements and business needs. Demonstrate project milestones to ensure the system functionality is well understood by the stakeholders/ product owners and address any concerns or questions so that the delivered product meets customer needs.\n· User Acceptance Testing (UAT): Develop test plans and UAT and ensure that solutions meet business requirements. Facilitate feedback collection and assist in resolving defects.\n· Production Verification: Support post-deployment verification to ensure that systems are functioning as expected in the production environment, addressing any issues that arise.\n· Documentation: Create and maintain comprehensive documentation, including functional specs, use cases, and end-user guides. Proficient in writing user stories with acceptance criteria to guide development. Ensure documentation is up-to-date and accessible for future reference.\n\nOTHER SKILLS:\n· Business Analysis Expertise: 8+ years of experience in performing business and systems analysis, with a proven ability to capture and document requirements clearly and in detail. Extensive experience managing multiple analysis tasks on different initiatives simultaneously.\n· Collaboration & Communication: Strong written and verbal communication skills, with the ability to work effectively in a team environment and independently. Experience working with both business and technical stakeholders.\n· Agile/Scrum Experience: Demonstrated experience working in Agile/Scrum environments, including writing user stories with well-defined acceptance criteria and participating in sprint planning, backlog refinement, and retrospectives.\n· Testing & Validation: Experience preparing and executing test plans, creating test data, conducting UAT, and performing regression testing for IT systems.\n· Technical Understanding: Ability to grasp technical concepts and communicate effectively with development teams in a .NET-based development environment. Familiarity with API integration and testing, system integration, and data validation processes.\n\nINTERVIEW PROCESS:\n· Required submission of a technical assessment questionnaire along with WI Cover Sheet, Right to Represent, and candidate resume with legal name. Candidates withdrawn from the process cannot be replaced.\n\nADDITIONAL DETAILS:\n· No specific equipment details were provided. Candidates are expected to meet remote.",
        "source": "Email",
        "date_posted": "2024-10-30 14:01:30-05:00",
        "unique_id": "192df3c2cda66ba2",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]