[
    {
        "company": "Altitude Technology Solutions",
        "job_title": "Oracle HCM Tester/BA",
        "location": "San Jose, CA, USA",
        "full_location": {
            "city": "San Jose",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified",
            "job_code": ""
        },
        "skills": {
            "core": [
                "Oracle HCM",
                "QA",
                "Business Analysis",
                "Testing",
                "Requirement Gathering"
            ],
            "primary": [
                "Test Planning",
                "Test Execution",
                "Defect Management",
                "Documentation",
                "User Acceptance Testing"
            ],
            "secondary": [
                "HR Processes",
                "Process Flow Diagrams",
                "Cross-functional Collaboration",
                "Regulatory Compliance",
                "Continuous Improvement"
            ],
            "all": [
                "Oracle HCM",
                "QA",
                "Business Analysis",
                "Testing",
                "Requirement Gathering",
                "Test Planning",
                "Test Execution",
                "Defect Management",
                "Documentation",
                "User Acceptance Testing",
                "HR Processes",
                "Process Flow Diagrams",
                "Cross-functional Collaboration",
                "Regulatory Compliance",
                "Continuous Improvement"
            ]
        },
        "job_type": [
            "remote",
            "onsite"
        ],
        "contact_person": "Ravinder Sharma",
        "email": "r.sharma@atsitinc.com",
        "jd": "Oracle HCM Tester/BA\n\nWe are seeking a skilled and detail-oriented Oracle HCM QA / BA to join our team. The ideal candidate will have experience in requirement gathering / testing Oracle HCM applications, with a strong understanding of HR processes and systems. You will be responsible for ensuring the quality and functionality of Oracle HCM modules by developing and executing test plans, cases, and scripts.\n\n**Requirements Gathering & Documentation:**\nWork with key stakeholders (HR, Payroll, Benefits teams) to understand business needs and challenges. Elicit, analyze, and document functional and technical requirements for HCM systems. Create detailed business requirement documents (BRDs), use cases, and process flow diagrams.\n\n**Test Planning and Strategy:**\nDevelop, document, and maintain comprehensive test plans and test cases based on business requirements, functional specifications, and technical designs. Collaborate with cross-functional teams to define test strategy and testing standards for Oracle HCM modules.\n\n**Test Execution:**\nExecute manual and automated test scripts across Oracle HCM modules, including Core HR, Payroll, Benefits, Talent Management, and Time and Labor. Perform functional, integration, regression, and end-to-end testing to ensure the accuracy, stability, and performance of Oracle HCM applications.\n\n**Defect Management:**\nIdentify, document, and track defects using standard defect management tools. Work closely with developers and business analysts to resolve issues and validate fixes. Conduct root cause analysis for defects and work towards continuous improvement of testing processes.\n\n**Documentation and Reporting:**\nDocument test results, provide detailed bug reports, and create test metrics to track testing progress. Communicate test findings and status to stakeholders through regular reports and meetings.\n\n**User Acceptance Testing (UAT) Support:**\nAssist in UAT by preparing test environments, data, and guiding end-users through the testing process. Validate that all business requirements are met in the final solution.\n\n**Compliance and Best Practices:**\nEnsure that testing procedures comply with industry standards and best practices, including SOX, GDPR, and other regulatory requirements.",
        "source": "Email",
        "date_posted": "2024-10-30 07:43:23-05:00",
        "unique_id": "192dda1ad3d1d341",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]