[
    {
        "company": "Yochana IT Solutions Inc.",
        "job_title": "Azure and .net full stack",
        "location": "Redmond, WA, USA",
        "full_location": {
            "city": "Redmond",
            "state": "WA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Core .NET",
                "API Integration",
                "Azure",
                "C#",
                ".NET core",
                "Web App development",
                "Azure Functions",
                "Azure Logic Apps",
                "Azure Service Bus",
                "Azure Event Grid",
                "Azure Pipelines",
                "ReactJS",
                "JavaScript"
            ],
            "primary": [
                "Azure Data skills",
                "ADF Pipelines",
                "Azure Synapse",
                "Azure Data Lake",
                "Dynamics 365 CE skills",
                "Power Platform",
                "TypeScript"
            ],
            "secondary": [],
            "all": [
                "Core .NET",
                "API Integration",
                "Azure",
                "C#",
                ".NET core",
                "Web App development",
                "Azure Functions",
                "Azure Logic Apps",
                "Azure Service Bus",
                "Azure Event Grid",
                "Azure Pipelines",
                "ReactJS",
                "JavaScript",
                "Azure Data skills",
                "ADF Pipelines",
                "Azure Synapse",
                "Azure Data Lake",
                "Dynamics 365 CE skills",
                "Power Platform",
                "TypeScript"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Pallavi Boola",
        "email": "pallavi@yochana.com",
        "jd": "Hello,\n\nI’m Technical Recruiter with Yochana Solutions Inc., a national IT staffing solutions provider with 14+ years of experience delivering value to leading companies across the U.S.A. and Canada, I'm currently staffing for Please share local Candidates only Title: Azure and .net full stack Location -Redmond WA Onsite\n\nBelow you will find the job description, if you are qualified and interested, please send me your Updated Word Document Resume. I'm very sorry if this position is not an ideal fit, We'll keep you in mind for other suitable positions and referrals would be appreciated. Thank you so much for your attention and participation Locals Only with Washington DL\n\nTitle: Azure and .net full stack\nLocation - Redmond WA Onsite\nDuration: Contract\n\nJob Description:\n\"Must Have Skills: Strong hands-on experience in Core .NET + API Integration skills + Azure (Senior resource who can also unblock team members in case of technical issues blockers) C#, .NET core Web App developer capable of deploying hosting on App Services. Azure Functions Azure Logic Apps Azure Service Bus, Azure Event Grid Deployment using Azure Pipelines ReactJS JavaScript\n\nGood To Have: Azure Data skills like, ADF Pipelines, Azure Synapse, Azure Data Lake, Dynamics 365 CE skills and Power Platform TypeScript\"\n\n(1.) To be responsible for providing technical guidance to a team of developers, enhancing their technical capabilities and increasing productivity. (2.) To conduct comprehensive code reviews, establish and oversee quality assurance processes, performance optimization, implementation of best practices and coding standards to ensure successful delivery of complex projects. (3.) To ensure process compliance in the assigned module and participate in technical discussions/review as a technical consultant for feasibility study (technical alternatives, best packages, supporting architecture best practices, technical risks, breakdown into components, estimations). (4.) To collaborate with stakeholders to define project scope, objectives, deliverables and accordingly prepare and submit status reports for minimizing exposure & closure of escalations.",
        "source": "Email",
        "date_posted": "2024-10-30 10:56:08-05:00",
        "unique_id": "192de442ef2d5f64",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]