[
    {
        "company": "Uniglobe Technologies, Inc",
        "job_title": "Sr.Python Developer",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "experience_required": "12-13 Years",
            "degree_required": "Bachelor's degree in Computer Science, Engineering, or related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Python",
                "React.js",
                "AWS Lambda",
                "RESTful APIs",
                "SQL Server",
                "PostgreSQL"
            ],
            "primary": [
                "Secure coding practices",
                "Vulnerability management",
                "Agile/Scrum methodologies",
                "Version control systems (Git, SVN)",
                "HTML5",
                "CSS3",
                "JavaScript ES6+"
            ],
            "secondary": [
                "API Gateway",
                "DynamoDB",
                "S3",
                "Jenkins",
                "Azure DevOps",
                "Behave",
                "Cucumber",
                "Jest",
                "Penetration testing",
                "Static code analysis",
                "GDPR",
                "HIPAA",
                "SOC 2",
                "IAM",
                "KMS",
                "AWS Config"
            ],
            "all": [
                "Python",
                "React.js",
                "AWS Lambda",
                "RESTful APIs",
                "SQL Server",
                "PostgreSQL",
                "Secure coding practices",
                "Vulnerability management",
                "Agile/Scrum methodologies",
                "Version control systems (Git, SVN)",
                "HTML5",
                "CSS3",
                "JavaScript ES6+",
                "API Gateway",
                "DynamoDB",
                "S3",
                "Jenkins",
                "Azure DevOps",
                "Behave",
                "Cucumber",
                "Jest",
                "Penetration testing",
                "Static code analysis",
                "GDPR",
                "HIPAA",
                "SOC 2",
                "IAM",
                "KMS",
                "AWS Config"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Babu Amburu",
        "email": "babu@ouruniglobe.com",
        "jd": "From: Babu, Uniglobe Technologies, Inc\nCandidate must from EST or CTS-only.\n12+ Years of Experience Must\nRole : Python Fullstack Developer\nLocation: Remote\nExperience Required: 12-13 Years\nWe are looking for an experienced Senior Full Stack Python & React Developer to lead the design, development, and implementation of scalable web applications and strong expertise in App Security. The ideal candidate will have a strong background in both Python with AWS lambda and React, with a passion for delivering high-quality software solutions that meet business requirements. This role offers the opportunity to work on exciting projects, collaborate with cross-functional teams, and drive innovation in a fast-paced environment.\n\nKey Responsibilities:\n1. Design, develop, and maintain robust and scalable web applications using Python with serverless architecture and React.\n2. Collaborate with product managers, designers, and other stakeholders to define project requirements and deliverables.\n3. Strong understanding of security principles, protocols, and standards (e.g., OWASP, TLS/SSL, encryption).\n4. Lead technical discussions and provide guidance to junior developers on best practices and code quality.\n5. Participate in code reviews to ensure adherence to coding standards, scalability, and performance requirements.\n6. Identify and address technical debt, performance bottlenecks, and other software issues.\n7. Stay current with emerging technologies and trends in web development, and propose new solutions and frameworks to improve efficiency and productivity.\n8. Work closely with QA engineers to ensure the quality and reliability of the software through comprehensive testing and validation.\n9. Provide technical support and troubleshooting for production issues as needed.\n\nQualifications:\n1. Bachelor's degree in Computer Science, Engineering, or related field\n2. 5+ years of professional experience in software development, with a focus on full stack web development.\n3. Proficiency in Python, AWS Lambda for backend development.\n4. Proficiency in secure coding practices and vulnerability management.\n5. Strong experience with React.js and related libraries/tools (Redux, Hooks) for frontend development.\n6. Solid understanding of RESTful APIs, JSON/XML, and web services integration.\n7. Experience with database design and optimization (SQL Server/ PostgreSQL).\n8. Familiarity with modern web technologies such as HTML5, CSS3, JavaScript ES6+, and responsive design principles.\n9. Experience with Agile/Scrum methodologies and version control systems (Git, SVN, etc.).\n10. Excellent problem-solving skills and attention to detail\n11. Strong communication and interpersonal skills, with the ability to collaborate effectively in a team environment\n\nQualifications Needed:\n1. Familiarity with AWS services such as API Gateway, DynamoDB, and S3\n2. Familiarity with DevOps practices and tools (Jenkins, Azure DevOps)\n3. Familiarity with unit testing frameworks like Behave, Cucumber, Jest, etc.\n4. Experience with security testing tools and techniques (e.g., penetration testing, static code analysis)\n5. Familiarity with security compliance frameworks (e.g., GDPR, HIPAA, SOC 2).\n6. Experience with AWS security services such as IAM, KMS, and AWS Config.",
        "source": "Email",
        "date_posted": "2024-10-30 13:06:55-05:00",
        "unique_id": "192defad1b75e1f3",
        "emp_type": [
            "third party"
        ],
        "tag": "Python developer"
    }
]