[
    {
        "company": "Georgia Department of Human Services (DHS)",
        "job_title": "Business Analyst",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "7 years",
            "degree_required": "Bachelor's Degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "7 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analyst",
                "MS O365 applications",
                "interpersonal skills",
                "written communication skills",
                "problem-solving skills"
            ],
            "primary": [
                "requirements gathering",
                "SDLC",
                "documentation",
                "testing",
                "training"
            ],
            "secondary": [
                "experience working with government organizations",
                "ability to work with cross-functional teams"
            ],
            "all": [
                "Business Analyst",
                "MS O365 applications",
                "interpersonal skills",
                "written communication skills",
                "problem-solving skills",
                "requirements gathering",
                "SDLC",
                "documentation",
                "testing",
                "training",
                "experience working with government organizations",
                "ability to work with cross-functional teams"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Megha",
        "email": "mveeranki@infologitech.com",
        "jd": "Job Position: GA DHS NextGen Business Analyst\nJob Location: Atlanta, GA\nJob Duration: 7 Months\n\nJob Description:\nThe Georgia Department of Human Services (DHS), Office of Information Technology (OIT) is seeking a qualified candidate for the position of Business Analyst (BA) to join the agency based in Atlanta, Georgia. This position is part of a DHS team tasked to provide agency support for the State-Wide NextGen Enterprise Resource Planning (ERP) Project. The select individual will be working with the agency team, State NextGen ERP service providers, State Accounting Office/Department of Human Services PMO, and the DHS Finance and Human Resource business units to coordinate the NextGen project implementation activities at the agency level. This position is accountable to the DHS NextGen Project Manager and the OIT Project Management Officer.\n\nResponsibilities:\nThe BA serves as the communication catalysts, ensuring that agency business stakeholders and NextGen solution teams are in sync. The BA will serve as a facilitator to resolve business process issues and successfully deliver established project schedules and closing timelines.\n\nJob Duties:\nAt the direction of the Project Manager the BA will:\n- Establish Stakeholder Register\n- Assisting in scheduling and facilitating agency project meetings\n- Assist stakeholders take the necessary actions/steps to achieve the goals and objectives of the project.\n- Assists in coordinating project activities\n- Assists in developing test plans\n- Assists stakeholders with test scripts\n- Documents and distributes meeting minutes\n- Identifies and defines business requirements by quickly understanding business process requirements based on the input and opinions of a diverse group of users\n- Works closely with Project manager to maintain project artifacts\n- Develops and maintains a productive working relationship with project sponsors, vendors, and key clients.\n- Documents agency business requirements in a suitable format that communicates the specific actions developed for the product and obtains appropriate approvals.\n\nQualifications:\n- Bachelor’s Degree\n- 7 years’ working as a BA or 3 years’ BA experience and a BA certification\n- Expert in the use of MS O365 applications\n- Strong interpersonal and written communication skills\n- Ability to work well with business unit SMEs, other PMs/BAs, vendors, and end users in cross-functional teams\n- Possesses a broad understanding of IT and business skills\n- Extremely detail-oriented, organized, structured, analytical, and logical, with strong problem-solving skills.\n- Experience working with government organizations",
        "source": "Email",
        "date_posted": "2024-10-30 08:27:16-05:00",
        "unique_id": "192ddbbe62c255df",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]