[
    {
        "company": "Agama Consulting Group",
        "job_title": "Senior Project Manager",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10 years",
            "degree_required": "Bachelor's degree",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "12 months contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "PMP Certification",
                "Project Management",
                "Microsoft Office",
                "Agile",
                "Waterfall"
            ],
            "primary": [
                "Cloud hosted SaaS implementation",
                "Business and IT resource management",
                "Analytical skills",
                "Interpersonal skills",
                "Communication skills"
            ],
            "secondary": [
                "Process engineering",
                "Project Management Office methodologies",
                "Commonwealth IT procurement processes"
            ],
            "all": [
                "PMP Certification",
                "Project Management",
                "Microsoft Office",
                "Agile",
                "Waterfall",
                "Cloud hosted SaaS implementation",
                "Business and IT resource management",
                "Analytical skills",
                "Interpersonal skills",
                "Communication skills",
                "Process engineering",
                "Project Management Office methodologies",
                "Commonwealth IT procurement processes"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Deepsikha",
        "email": "deepsikha@agamaamerica.com",
        "jd": "Role: Senior Project Manager\nLocation: Richmond, VA (2-3 days onsite a week, local or within 45 minutes drive)\nDuration: 12 months contract\nVisa: No H1B, No CPT & NO TN\nInterview: Video\n\nAddress Proof required\nCandidate MUST possess PMP certification through PMI. No other certifications qualify.\n\nResponsibilities:\nSuccessfully planning, organizing, and motivating diverse project teams throughout all phases of Waterfall, Agile, and Hybrid projects, and for delivering projects that provide exceptional value to the Commonwealth's internal and external stakeholders.\nCoordinate vendors and consultants, and IT and business staff as assigned, in the execution of IT projects and related procurements.\nCoordinate and oversee the development of proposals, statement of work, statement of requirements and RFP responses.\nAssist in team development while holding teams accountable for their commitments and removing roadblocks to their work.\nFacilitate multi-disciplinary teams in the development of plans, goals, objectives, policies, and procedures for completion of a project.\nOversee and manage execution and/or coordination of day-to-day project activities as required.\nManage working relationships with key stakeholders, including executive management, business management, vendors, project sponsors, suppliers, and technology management.\nSet project goals that are consistent with technical objectives and the agency’s overall technology strategy.\nTrack and communicate a project's progress from a schedule, cost, and risk perspective to the project team, customers, and project stakeholders.\nCollaborate with technology leads and solution architects to incorporate agency best practices into project plans.\nDrive consistent project delivery through the entire project lifecycle, including, execution of procurements, definition of project plans, resource allocation, management of project risks, scope, and schedule, delivery of value, and well-ordered transitions to operations.\nMonitor progress by third-party vendors and define and measure their progress with metrics.\nDevelop and maintain project budget, plans, task lists, schedules, risks, and status, to include resource allocation and schedules.\nAdhere to the project management practices and governance requirements.\nExhibit significant emotional quotient (EQ) in handling project challenges and maintain a positive project culture in line with the mission and shared values.\n\nKnowledge, Skills, and Abilities:\nStrong experience in developing, executing, and managing cloud hosted SaaS implementation projects.\nStrong experience leading the business and IT resources through the discovery and documentation of business and technical requirements in request for proposal and statement of requirement formats.\nStrong analytical, organizational, and decision-making skills.\nExceptional interpersonal skills for collaborating and team building.\nExceptional verbal and written communication skills with the demonstrated ability to simplify and briefly, succinctly communicate complex issues to multiple audiences.\nAbility to lead others to implement new approaches, systems, structures, and methods.\nAbility to define and balance the competing demands for quality, scope, schedule, and cost.\nCommunicate timelines and expectations to technical and business staff.\nAbility to analyze and document system processes.\nSolid understanding of software development lifecycle models.\nExceptional knowledge of both Agile and Waterfall project management principles and practices. In addition, the ability to blend them together in the right proportions to fit a particular project and business environment.\nKnowledge of process engineering and re-engineering techniques and practices.\nMust have a minimum of 10 years of experience managing large projects and a bachelor's degree.\nFluency in Project Management tools such as Microsoft Project, Visio, and Office required.\nPMP Certification through PMI\nExperience with Commonwealth Technology Portfolio (CTP) system and ECOS process is strongly preferred.\nExperience with Project Management Office methodologies and practices is strongly preferred.\nExperience with the core Commonwealth IT procurement processes (RFP, Statewide Contract, and CAI SOW) is preferred.",
        "source": "Email",
        "date_posted": "2024-10-30 10:47:40-05:00",
        "unique_id": "192de69bfc93c584",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]