[
    {
        "company": "Vyze Inc",
        "job_title": "Healthcare Project Manager",
        "location": "Iowa City, IA, USA",
        "full_location": {
            "city": "Iowa City",
            "state": "IA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6 Month Contract + Extensions",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Healthcare Background",
                "Organizational Skills",
                "Leadership Skills",
                "Communication Skills"
            ],
            "primary": [
                "IT Project Management",
                "PMP Certification",
                "Stakeholder Communication",
                "Vendor Management",
                "Risk Management"
            ],
            "secondary": [
                "Project Management Software",
                "SharePoint",
                "PowerPoint",
                "MS Teams",
                "Zoom",
                "MS Office Suite",
                "Waterfall Methodology"
            ],
            "all": [
                "Project Management",
                "Healthcare Background",
                "Organizational Skills",
                "Leadership Skills",
                "Communication Skills",
                "IT Project Management",
                "PMP Certification",
                "Stakeholder Communication",
                "Vendor Management",
                "Risk Management",
                "Project Management Software",
                "SharePoint",
                "PowerPoint",
                "MS Teams",
                "Zoom",
                "MS Office Suite",
                "Waterfall Methodology"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Sriparna Mohanty",
        "email": "sriparna@vyzeinc.com",
        "jd": "Job Description – Healthcare Project Manager A-UIOWA-PM6-HCIS Project Manager Must have healthcare background experience mostly. Please send candidates linkedin with submission State of Iowa Location: Onsite- Iowa City, IA – Please send local profiles Terms: 6 Month Contract + Extensions Visa: No Restrictions Interview Mode: Video- 1-2 Rounds Interview Dates: November 6th- 8th NOTE: The goal for finding resources for this position is to have them be ONSITE- the contractor will be located at the University of Iowa Health Care, 200 Hawkins Drive, Iowa City, IA 52242. Local and regional candidates only. MUST HAVE Qualifications: Proven experience in project management, particularly IT projects in the healthcare delivery domain. Strong organizational and leadership skills. Excellent communication and interpersonal skills. Ability to manage multiple tasks and projects simultaneously. PMP or similar certification. Scope of Work: As a Senior Project Manager, you will be responsible for the day-to-day management of the project. Your specific responsibilities will include: Project Planning and Development: Develop the project charter, scope, schedule, budget, and plan. Team Management: Assemble the project team and manage team performance. Monitoring and Adjusting: Monitor project progress and make necessary adjustments to timelines, resources, and costs. Stakeholder Communication: Manage communication across all stakeholders. Deliver regular status reports to sponsors and stakeholders. Issue and Risk Management: Escalate issues and risks to the project sponsor. Vendor and Supplier Management: Manage relationships with vendors and suppliers. Required Tools and Technologies: Candidates should be proficient in the following tools and technologies: Project Management Software SharePoint PowerPoint MS Teams Zoom MS Office Suite Methodology: The project management methodology for these projects will primarily be Waterfall. The PMO provides Project Management support for the University of Iowa Health Care community, through the application of the Project Management Institute global standard methodology, for delivering projects within budget, on schedule, according to scope, and in a way that best contributes to accomplishing the University of Iowa Health Care strategic plan. The responsibility for this position will be to ensure that project goals and objectives are met, within the established time frames, budgetary and hospital requirements, preparing project status reports, resource management, conducting/facilitating project meetings, ensuring the project progress on schedule, addressing constraints, mitigating risks and challenges in a timely manner. This position will work with a range of stakeholders including staff-level employees, department-level leadership, hospital administration, medical & clinical staff, division leadership and technical users to analyze project requirements, develop implementation strategies and provide guidance and oversight throughout the program/project management life cycle, serving as change agents for the organization, working effectively in a diverse environment. Health Care Information Systems (HCIS) provides and supports information and communication systems and technology that facilitate quality patient care, progressive medical education, and innovative research. This project manager will be dedicated to supporting, leading, and overseeing the Health Care Information Systems strategic initiatives across the enterprise. Project Purpose: We are seeking two Senior Project Managers to join our team at the University of Iowa Hospitals and Clinics. The primary goal of these roles is to support the implementation of a new Radiology Picture Archiving and Communication System (PACs) and manage other miscellaneous Radiology and Pathology projects. Key Deliverables: The main deliverables for these projects include: Successful implementation of the Radiology PACs system. Full migration of legacy data. Seamless integration with Epic.",
        "source": "Email",
        "date_posted": "2024-10-30 20:19:16-05:00",
        "unique_id": "192e047bdf382555",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]