[
    {
        "company": "NITYA Software Solutions Inc.",
        "job_title": "Global Financial Crimes PMO Project Manager",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Stakeholder Management",
                "Risk Management",
                "Communication"
            ],
            "primary": [
                "Financial Crimes Programs",
                "Regulatory Compliance",
                "Cross-Functional Team Coordination"
            ],
            "secondary": [
                "Problem Solving",
                "Innovative Solutions",
                "Reporting",
                "Presentation Skills"
            ],
            "all": [
                "Project Management",
                "Stakeholder Management",
                "Risk Management",
                "Communication",
                "Financial Crimes Programs",
                "Regulatory Compliance",
                "Cross-Functional Team Coordination",
                "Problem Solving",
                "Innovative Solutions",
                "Reporting",
                "Presentation Skills"
            ]
        },
        "job_type": [],
        "contact_person": "Rajkumar",
        "email": "rajkumar.v@nityainc.com",
        "jd": "Role: Global Financial Crimes PMO Project Manager\n\nParticipate in the design, development, delivery and maintenance of best-in-class Financial Crimes programs, policies and practices for GFCD.\n\nResponsible for assessing, creating and gaining signoff on key project management tools such as; project plan, charter, stakeholder management plan, risk & issues log, communication plan and governance structures.\n\nIdentify resource requirements for projects by partnering with stakeholders to understand scope of effort, deliverables, and project milestones and dependencies.\n\nActively manage project plans and help ensure they meet project objectives in agreed project milestones.\n\nLead in the preparation of all monitoring and reporting activities across program/project.\n\nProvide in-depth support with interpretive thinking to define problems and develop innovative solutions.\n\nCreate reports, presentation material, and communications for senior stakeholders and committees.\n\nEnsure all stakeholders are identified, included in project scope definition activities and understand the project schedule and key milestones.\n\nDrive program enhancements by working collaboratively with all members of the program.\n\nCoordinating with global cross-function teams to identify, prioritize and facilitate execution of potential enhancements to projects/overall program.\n\nKeeping abreast of regulatory changes, new regulations and internal policy changes in order to further identify new key risk areas.\n\nWork collaboratively across functional teams within GFCD to ensure effective and efficient operations with clearly defined roles and responsibilities.\n\nDemonstrated ability to manage multiple projects simultaneously.",
        "source": "Email",
        "date_posted": "2024-10-30 06:51:42-05:00",
        "unique_id": "192dd6468432347b",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]