[
    {
        "company": "Nukasani Group",
        "job_title": "NextGen Project Manager",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "5 years",
            "degree_required": "Bachelor’s degree in related field or specialized training",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Best competitive rate"
        },
        "skills": {
            "core": [
                "IT project management",
                "PMP certification",
                "MS Project",
                "MS Visio",
                "SharePoint",
                "MS O365 Software"
            ],
            "primary": [
                "Vendor management",
                "Stakeholder management",
                "Risk management",
                "Change control",
                "Performance measurement"
            ],
            "secondary": [
                "Experience working in state government",
                "Experience working in an outsourced environment",
                "Master’s degree in related field"
            ],
            "all": [
                "IT project management",
                "PMP certification",
                "MS Project",
                "MS Visio",
                "SharePoint",
                "MS O365 Software",
                "Vendor management",
                "Stakeholder management",
                "Risk management",
                "Change control",
                "Performance measurement",
                "Experience working in state government",
                "Experience working in an outsourced environment",
                "Master’s degree in related field"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Bhavani",
        "email": "bhavaniATnukasanigroupusa.com",
        "jd": "Dear Partner,\n\nGood Morning,\n\nGreetings from Nukasani Group Inc! We have below urgent long-term contract project immediately available for **NextGen Project Manager, Atlanta, GA, Hybrid**. We need submissions; could you please review the below role? If you are available, could you please send me an updated word resume and below candidate submission format details immediately? If you are not available, any referrals would be greatly appreciated. Interviews are in progress, urgent response is appreciated. Looking forward to your immediate response and working with you.\n\n**Candidate Submission Format - needed from you**\n- Full Legal Name\n- Personal Cell No (Not Google phone number)\n- Email Id\n- Skype Id\n- Interview Availability\n- Availability to start, if selected\n- Current Location\n- Open to Relocate\n- Work Authorization\n- Total Relevant Experience\n- Education / Year of graduation\n- University Name, Location\n- Last 4 digits of SSN\n- Country of Birth\n- Contractor Type\n- DOB: mm/dd\n- Home Zip Code\n\n**Assigned Job Details**\n- Job Title: NextGen Project Manager\n- Location: Atlanta, GA, Hybrid\n- Rate: Best competitive rate\n\nThe Project Manager will assist the Department of Human Services (DHS) in managing the agency’s support for the State-Wide NextGen Enterprise Resource Planning (ERP) Project. The select individual will work with the State NextGen ERP service providers, State Accounting Office/Department of Human Services PMO, and the DHS Finance and Human Resource business units to coordinate the NextGen project implementation activities at the agency level. The position is accountable to the DHS Deputy Commissioner of Finance, DHS Deputy Commissioner of Human Resources, and the Project Management Officer.\n\n**Responsibilities:**\nAs a member of the State NextGen PMO team and DHS Project Manager, the PM will manage and/or provide project scope management consultation to ensure DHS is actively involved throughout the project’s software development lifecycle activities. Works closely with the agency resource manager, vendor, business analysts, and subject matter experts assigned to the NextGen agency support team. Ensures the State NextGen project scope is timely communicated to the appropriate agency stakeholders while keeping the GA AT WORK group (agency steering committee) informed of the project’s progress. Leads agency stakeholder meetings to determine the best approaches for reaching objectives; during planning, developing project management tools including plans for stakeholder management, scope management, risk management, communications, change control, and performance measurement and tracking. During project activities execution, monitors performance and reports to management project status and pertinent issues, including major milestones and potential project risks. Provides continuing direction to the project team, conducts status meetings, assesses proposed changes in scope, and recommends courses of action to project sponsors during the execution phase. Near the end of the project, uses the product verification process to make sure that the project has delivered what the client expected and performs a lesson learned for all projects.\n\n**Job Duties:**\n- Oversees and controls, schedules, resources, scope, and risks.\n- Ensure stakeholders take necessary action steps to achieve the goals and objectives of the project. Work with the project steering committee and senior project management to resource the tasks of the project.\n- Work with State NextGen PMO and quality assurance team to extend the expected project standards, procedures, and quality objectives to the agency level.\n- Chairs, manages, or facilitates agency project meetings, communicating individual roles and project expectations. Ensure that all project team members have the tools and training required to perform effectively.\n- Manage scope by using a variety of data sources to support project negotiations related to time, scope, and/or quality.\n- Develops, monitors, and coordinates project activities, such as scheduling, tracking, and reporting; leads change efforts impacting own projects.\n- Works with senior project management to identify specific opportunities or weaknesses within assigned projects and makes specific change recommendations to structures, processes, or people to improve project performance.\n- Provides work direction and leadership to assigned project activities, including scheduling, assignment of work, and review of project efforts.\n- Monitors project milestones and critical dates to identify potential jeopardy of project schedule. Identify ways to resolve schedule issues. Keeps management aware of the situation.\n- Assesses variances from the project plan, gathers metrics, and develops and implements changes as necessary to ensure that the project remains within specified scope and is within time, cost, and quality objectives.\n- Conduct formal review with business sponsor at project completion to confirm acceptance and satisfaction.\n- Provide the team with constructive feedback as it pertains to project performance.\n- Develops and maintains a productive working relationship with project sponsors, vendors, and key clients.\n\n**Minimum Qualifications**\n- Bachelor’s degree in related field or specialized training and three years of IT project management or equivalent IT team leadership experience.\n- PMP certification from PMI or equivalent certification.\n- 5 years' experience leading projects of high complexity (must have occurred in the last 2 years).\n- Expert with MS Project, MS Visio, SharePoint, and all MS O365 Software.\n- Experience working in state government.\n- Experience working in an outsourced environment.\n\n**Experience Preferred Qualifications**\n- Master’s degree in related field.\n- Experience within the last 5 years leading/coordinating vendor managed projects.",
        "source": "Email",
        "date_posted": "2024-10-30 10:07:46-05:00",
        "unique_id": "192de3f0961b15ec",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]