[
    {
        "company": "Yochana IT Solutions Inc",
        "job_title": "Sr. Scrum Master",
        "location": "Newark, NJ, USA",
        "full_location": {
            "city": "Newark",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "onsite",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified",
            "job_code": "",
            "contact_person": "Gopi Pabbu",
            "email": "pgopi@yochana.com"
        },
        "skills": {
            "core": [
                "Scrum Alliance CSM",
                "CSP certification",
                "PMI’s Agile Certified Professional (ACP)",
                "Agile techniques",
                "Automated Testing"
            ],
            "primary": [
                "Agile Central",
                "User Stories",
                "TDD",
                "Continuous Integration",
                "Testing",
                "Pairing",
                "Agile Games"
            ],
            "secondary": [
                "Mentoring",
                "Facilitating Agile processes",
                "Risk and issue identification",
                "Metric reporting",
                "Transparency and visibility"
            ],
            "all": [
                "Scrum Alliance CSM",
                "CSP certification",
                "PMI’s Agile Certified Professional (ACP)",
                "Agile techniques",
                "Automated Testing",
                "Agile Central",
                "User Stories",
                "TDD",
                "Continuous Integration",
                "Testing",
                "Pairing",
                "Agile Games",
                "Mentoring",
                "Facilitating Agile processes",
                "Risk and issue identification",
                "Metric reporting",
                "Transparency and visibility"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "jd": "From: Gopi Pabbu, Yochana IT Solution pgopi@yochana.com Reply to: pgopi@yochana.com Hi, Hope you are doing Great! Please find the below job description, if anyone are available please send me their updated resume with contact details at pgopi@yochana.com Sr. Scrum Master Newark, NJ Onsite Scrum Alliance CSM CSP certification or PMI’s Agile Certified Professional (ACP)Knowledge and experience with Agile techniques – Automated Testing, Agile Central, User Stories, TDD, Continuous Integration, Testing, Pairing, Agile Games, etc.Directs Associate level Scrum Masters; leads setting up of “best practices” to exemplify the values and principles of Agile and ScrumMentors the project Scrum team to exemplify the values and principles of Agile and Scrum with coaching provided by the Professional Scrum Master, or Release Train EngineersFacilitates Agile processes including: sprint iteration planning, backlog refinement, daily stand-ups, sprint demo and retrospectives and release planningEnsures successful completion of assigned projects and programs through effective facilitation and leadershipEnsures user stories, acceptance criteria, assumptions, and all related documentation are timely and complete, supporting development, testing, and user acceptance activitiesSupport risk and issue identification, and mitigation activities with the agile team including raising those in a proactive and professional fashion, when appropriateFacilitates periodic Reviews and Retrospectives by tracking report status through consistent, standardized dashboards and metric reportingImprove transparency and visibility across the Broadridge organization within and outside of the team Gopi Pabbu Resource Specialist Yochana IT Solutions Inc Mail Id :pgopi@yochana.com www.yochana.com Address : 23000 Commerce Drive, Farmington Hills, MI 48335, USA Join the Referral Revolution of Yochana by Sharing, Earning, and Empowering! Ask us about our rewarding referral program.",
        "source": "Email",
        "date_posted": "2024-10-29 08:45:15-05:00",
        "unique_id": "192d8a631d629901",
        "emp_type": [
            "onsite",
            "third party"
        ],
        "tag": "Scrum Master"
    }
]