[
    {
        "company": "Techgene Solutions",
        "job_title": "Sr. Java Backend Developer",
        "location": "San Dimas, CA, USA",
        "full_location": {
            "city": "San Dimas",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "14+ years",
            "degree_required": "Bachelor's degree in technology, Master's preferred",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Spring",
                "REST API"
            ],
            "primary": [
                "AWS Technologies",
                "mySQL",
                "Multithreading"
            ],
            "secondary": [],
            "all": [
                "Java",
                "Spring",
                "REST API",
                "AWS Technologies",
                "mySQL",
                "Multithreading"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Vennu Vinay Kumar",
        "email": "vinay.v@techgene.com",
        "jd": "From: Vennu Vinay Kumar, Techgene Solutions vinay.v@techgene.com Reply to: vinay.v@techgene.com Job Title: Sr. Java Backend Developer Location: San Dimas, CA (Locals Only & Onsite role)Job Type: Long term Contract Exp Level: Min 14+ YearsNOTE: We’re looking for the local candidates who can go on-site. Job Description Requires programming skills, involved in the development of software applications. Knowledge of programming languages to develop necessary specifications for the software by following the technical designs. In specific cases, knowledgeable on Agile/iterative development methodologies will be required (and called out). We are seeking an experienced Java Backend Developer to join our engineering team. The ideal candidate will have a passion for building high-performance, scalable backend systems. As a key member of our team, you will collaborate closely with front-end developers, architects, and stakeholders to deliver secure, efficient, and innovative solutions. We highly prefer local candidates for this role to facilitate close collaboration with our team. Skill/Experience/Education • Mandatory Skills 10+ years relevant client experience in similar technology (does not include training period), Including at least 5 years of on-site client experience in similar technology and domain - Min Education - bachelor’s degree in technology, Masters preferred • Desired Skills Java, Spring, AWS Technologies. Skill Matrix SearchSkill Name Level (1-5, 5 being the highest) 1 2 3 4 5 Years Mandatory(Yes/No) Job Description Java, Springboot 9-10 Years Yes REST API 9-10 Years Yes AWS Technology (SQS) 6-8 Years Yes mySQL 6-8 Years Yes Multithreading 6-8 Years Yes",
        "source": "Email",
        "date_posted": "2024-10-29 15:31:40-05:00",
        "unique_id": "192da1a1d5223c1d",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]