[
    {
        "company": "Convextech inc.",
        "job_title": "Project Manager",
        "location": "Darlington, MD, USA",
        "full_location": {
            "city": "Darlington",
            "state": "MD",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "10+ Years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Dredging",
                "PMP Certification",
                "Stakeholder Management",
                "Cost Tracking"
            ],
            "primary": [
                "Microsoft Projects",
                "Scheduling Systems",
                "Mentoring"
            ],
            "secondary": [
                "Highly Organized"
            ],
            "all": [
                "Project Management",
                "Dredging",
                "PMP Certification",
                "Stakeholder Management",
                "Cost Tracking",
                "Microsoft Projects",
                "Scheduling Systems",
                "Mentoring",
                "Highly Organized"
            ]
        },
        "job_type": [
            "onsite",
            "hybrid"
        ],
        "contact_person": "ALISHA Singh",
        "email": "alisha@convextech.com",
        "jd": "From: Alisha Sharma, Convextech inc. alisha@convextech.com Reply to: alisha@convextech.com Hi,Hope you are doing good.!!Please let me know if you are interested in the below position.!!Title : Project Manager Location : onsite Darlington, MD Duration : 6 months Visa : No H1b/CPT About the jobJob Description:We are seeking a dynamic and experienced Project Manager to join our team in the utilities sector. The ideal candidate will be responsible for overseeing and managing a variety of utility projects, ensuring they are completed on time, within budget, and to the highest standards of quality and safety. This role involves coordinating with multiple stakeholders, managing project teams, and ensuring compliance with all regulatory requirements. They will work to oversee dredging and infrastructure projects at multiple sites. The ideal candidate will be responsible for the design, permitting, and execution of dredging operations, managing the RFP process, and ensuring compliance with licensing and flow regulations. This role requires strong coordination with internal and external stakeholders, as well as hands-on involvement in engineering studies and site management. This position is a contract through the end of 2025 and extending. It will be a hybrid position 3-4 days a week onsite in Darlington, MD or Holtwood, PA Benefit packages for this role will start on the 31st day of employment and include medical, dental, and vision insurance, as well as HSA, FSA, and DCFSA account options, and 401k retirement account access with employer matching. Employees in this role are also entitled to paid sick leave and/or other paid time off as provided by applicable law. Qualifications: - 10+ Years of Experience as a Project Manager working with Dredging - PMP Certification - Comfortable dealing with Internal and External Stakeholders - Tracking Costs Experience, Highly Organized, Comfortable mentoring Junior PMs - Experience using Microsoft Projects or comparable scheduling systemThanks and RegardsALISHA SinghUS IT Recruiter |Convex Tech Inc.Email : alisha@convextech.com linkedin.com/in/alisha-singh-993670295",
        "source": "Email",
        "date_posted": "2024-10-29 15:34:15-05:00",
        "unique_id": "192da1c7c8d325f7",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]