[
    {
        "company": "Sibitalent",
        "job_title": "MS Data Analytics Developer",
        "location": "Wayne, PA, USA",
        "full_location": {
            "city": "Wayne",
            "state": "PA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Minimum five years of industry or field experience",
            "degree_required": "Undergraduate degree in a related field or the equivalent combination of training and experience",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Microsoft Fabric",
                "DataLake",
                "Azure Synapse",
                "Power BI",
                "Power Query"
            ],
            "primary": [
                "SharePoint",
                "PowerShell",
                "Azure Data Factory",
                "Graph API",
                "Viva Analytics"
            ],
            "secondary": [
                "Tableau",
                "Google Analytics",
                "JIRA",
                "ServiceNow",
                "Power Apps",
                "Power Automate",
                "Power Virtual Agents",
                "Azure",
                "Dataverse",
                "Datalake",
                "Power Query",
                "AI-900",
                "PL-300",
                "DP-600"
            ],
            "all": [
                "Microsoft Fabric",
                "DataLake",
                "Azure Synapse",
                "Power BI",
                "Power Query",
                "SharePoint",
                "PowerShell",
                "Azure Data Factory",
                "Graph API",
                "Viva Analytics",
                "Tableau",
                "Google Analytics",
                "JIRA",
                "ServiceNow",
                "Power Apps",
                "Power Automate",
                "Power Virtual Agents",
                "Azure",
                "Dataverse",
                "Datalake",
                "Power Query",
                "AI-900",
                "PL-300",
                "DP-600"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Deepali Jha",
        "email": "deepali@sibitalent.com",
        "jd": "Hello,Hope you are doing well!!My name is Deepali Jha and I am a Staffing Specialist at Sibitalent. I am reaching out to you on an exciting job opportunity with one of our clients. Job Title – MS Data Analytics DeveloperJob Location – Wayne, PA (Hybrid) [Need Local Candidates]Duration – 6+ MonthsVisa – No CPT/H1BMode of Interview – Phone/Skype Job DescriptionThe Data Analytics Developer/Engineer will work with the Data Analytics team to drive best-in-class adoption and develop methods to improve the client experience through the implementation of advanced data analytics capabilities. The Data Analytics Developer/Engineer will be responsible for developing, implementing, automating, and scaling the system design, system administration, and system deployment to deliver best-in-class services using Microsoft Fabric DataLake, Azure Synapse, Power BI, Power Query, Graph API, Viva Analytics and related technologies. Duties and ResponsibilitiesDesign end-to-end solutions using SharePoint, PowerShell, PowerBI, Microsoft Fabric, and other tools to improve collaboration, productivity, and knowledge sharing. Obtain project approval and funding. Identify stakeholders and form project teams. Conduct pilots and recommend go/no-go decisions. Verify software solutions meet production acceptance standards. Provide expert-level support services for the most complex issues related to data analytics elevated from the Support Center and Technical Services groups. Troubleshoot and resolve chronic and catastrophic problems. Demonstrate knowledge of Microsoft Fabric, DataLake, Azure Synapse, Azure Data Factory, and related architectures, capabilities, implementation requirements, integrations, and future roadmaps. Data Collection and Management: This involves gathering data from various sources, ensuring its accuracy, and storing it in a structured manner for analysis. This can include using tools like Microsoft Fabric DataLake and Azure Synapse Data Analysis and Interpretation: Analyzing the collected data to identify trends, patterns, and insights. This often involves using statistical methods and software tools like PowerBI Reporting and Visualization: Creating reports and visualizations to present the findings in a clear and understandable way. This helps stakeholders make informed decisions based on the data Collaborate between business units, architecture, operations, and security on the development and implementation of solutions that meet operational and compliance standards while meeting relevant regulatory requirements. Act as a subject matter expert in data analytics and facilitate and champion data analytics and Office 365 communities of practice. Work closely with project managers and developers to implement reliable, manageable, and secure solutions for internal and external connections. Identify opportunities to automate or improve existing processes. Understand and comply with IT and IS policies and procedures, especially those for quality and productivity standards that enable the team to meet established client service levels. Maintain consistent, quality documentation including SOP and runbook documentation to meet ongoing operations and business continuity requirements. Participate in special projects and perform other duties as assigned.",
        "source": "Email",
        "date_posted": "2024-10-29 09:53:03-05:00",
        "unique_id": "192d9220d336146c",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Azure Data Engineer"
    }
]