[
    {
        "company": "Parmesoft",
        "job_title": "PMO Lead",
        "location": "Miami, FL, USA",
        "full_location": {
            "city": "Miami",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "PMO management",
                "Portfolio management",
                "Financial management",
                "Budgeting",
                "Communication"
            ],
            "primary": [
                "Program and Portfolio Management (PPM) tools",
                "Leadership skills",
                "Cross-functional collaboration"
            ],
            "secondary": [],
            "all": [
                "PMO management",
                "Portfolio management",
                "Financial management",
                "Budgeting",
                "Communication",
                "Program and Portfolio Management (PPM) tools",
                "Leadership skills",
                "Cross-functional collaboration"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Shanu Francis",
        "email": "shanu.f@parmesoft.com",
        "jd": "Hi, This is Shanu Francis from Parmesoft. We have an immediate opening for PMO Lead - Miami, FL with my client. So, Please have a look on the Job Description below and reply me back if you are interested. Position: PMO Lead Location: Miami, FL Contract • Set up and implement PMO structures, governance, and portfolio management processes. • Drive the successful delivery of programs and projects through effective collaboration with project and program managers. • Manage portfolio intake and assessment processes, including prioritization, resource allocation, and risk management. • Provide regular insights to the CIO and IT leadership on project performance, budgeting, and financial metrics. • Oversee portfolio budgeting and financial tracking to ensure alignment with organizational goals. • Coordinate with IT and business leadership teams to ensure smooth execution of budgeting and planning cycles. Qualifications: • Proven experience in setting up and managing PMO and portfolio management frameworks. • Expertise with Program and Portfolio Management (PPM) tools and processes. • Strong background in financial management, budgeting, and reporting for IT projects. • Excellent communication and leadership skills with the ability to work cross-functionally.",
        "source": "Email",
        "date_posted": "2024-10-29 13:00:29-05:00",
        "unique_id": "192d98fb55fa1d7c",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]