[
    {
        "company": "Broadridge Financial Solutions Pvt",
        "job_title": "Sr. Scrum Master",
        "location": "Newark, NJ, USA",
        "full_location": {
            "city": "Newark",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "5+ Years of Scrum Master Experience",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Scrum Alliance CSM",
                "CSP certification",
                "PMI’s Agile Certified Professional (ACP)",
                "Agile techniques",
                "Automated Testing"
            ],
            "primary": [
                "Agile Central",
                "User Stories",
                "TDD",
                "Continuous Integration",
                "Testing",
                "Pairing",
                "Agile Games"
            ],
            "secondary": [],
            "all": [
                "Scrum Alliance CSM",
                "CSP certification",
                "PMI’s Agile Certified Professional (ACP)",
                "Agile techniques",
                "Automated Testing",
                "Agile Central",
                "User Stories",
                "TDD",
                "Continuous Integration",
                "Testing",
                "Pairing",
                "Agile Games"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Alok Kumar",
        "email": "alok.kumar@resource-logistics.com",
        "jd": "From: Alok Kumar, Resource Logistics Inc. alok.kumar@resource-logistics.com Reply to: alok.kumar@resource-logistics.com Hi,Hope you are doing well, This Alok from Resource Logistics Inc., I'm working as Sr. Technical Recruiter. I have a great opportunity for you, I'm sharing the job description with you.Please check the JD and send me your updated resume or you can reach me for further details. Job Title/Role: Sr. Scrum MasterLocation: Newark, NJ Contract Minimum Mandatory Skills: Scrum Alliance CSM CSP certification or PMI’s Agile Certified Professional (ACP)Knowledge and experience with Agile techniques – Automated Testing, Agile Central, User Stories, TDD, Continuous Integration, Testing, Pairing, Agile Games, etc.2Broadridge Financial Solutions Pvt 10+ Years of IT Experience5+ Years of Scrum Master Experience5+ Years of Project Management Experience in IT/Finance ServicesJob Responsibilities:Directs Associate level Scrum Masters; leads setting up of “best practices” to exemplify the values and principles of Agile and ScrumMentors the project Scrum team to exemplify the values and principles of Agile and Scrum with coaching provided by the Professional Scrum Master, or Release Train EngineersFacilitates Agile processes including: sprint iteration planning, backlog refinement, daily stand-ups, sprint demo and retrospectives and release planningEnsures successful completion of assigned projects and programs through effective facilitation and leadershipEnsures user stories, acceptance criteria, assumptions, and all related documentation are timely and complete, supporting development, testing, and user acceptance activitiesSupport risk and issue identification, and mitigation activities with the agile team including raising those in a proactive and professional fashion, when appropriateFacilitates periodic Reviews and Retrospectives by tracking report status through consistent, standardized dashboards and metric reportingImprove transparency and visibility across the Broadridge organization within and outside of the team.",
        "source": "Email",
        "date_posted": "2024-10-29 13:22:40-05:00",
        "unique_id": "192da0e3a0248eef",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Scrum Master"
    }
]