[
    {
        "company": "Integrated Technology Strategies, Inc.",
        "job_title": "Project Manager - Electronic Case Management (ECM)",
        "location": "Harrisburg, PA, USA",
        "full_location": {
            "city": "Harrisburg",
            "state": "PA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "7-9 years",
            "degree_required": "A four (4) year college degree or equivalent technical study is preferred.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "11/18/2024 - 06/30/2025",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "PMP Certification",
                "Budgeting",
                "Communication",
                "Leadership"
            ],
            "primary": [
                "Negotiation",
                "Organizational Skills",
                "Problem-solving",
                "Team Building",
                "Technical Knowledge"
            ],
            "secondary": [
                "Experience implementing Enterprise solutions",
                "Familiarity with Pennsylvania DHS",
                "Soft Interpersonal Skills"
            ],
            "all": [
                "Project Management",
                "PMP Certification",
                "Budgeting",
                "Communication",
                "Leadership",
                "Negotiation",
                "Organizational Skills",
                "Problem-solving",
                "Team Building",
                "Technical Knowledge",
                "Experience implementing Enterprise solutions",
                "Familiarity with Pennsylvania DHS",
                "Soft Interpersonal Skills"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Goutham",
        "email": "goutham@itstrategiesinc.com",
        "jd": "Hi, please share local to PA profile with Current location, Visa and hourly rate? The client is State of PA Agency is Department of Human Services Role is of a Project Manager - Electronic Case Management (ECM) - (PMP Certification Must) - Please get the PMP Cert copy Interview Type is Video / In-Person Role is Hybrid, candidate must reside in PA and willing to come to Harrisburg, PA based on Needs / Requests. Title/Role: DHS- EXCEPTION - Project Manager 4 Start Date: 11/18/2024 End Date: 06/30/2025 Short Description: Project Manager 4 ** see also Operational Requirements in the Reference tab ** Complete Description: DHS and the HHS DC worked with the Centers for Medicare & Medicaid Services (CMS), and other federal partners responsible for the programs, to develop plans and obtain the required approvals to implement new applications on a common enterprise platform. The enterprise platform-based approach was developed to facilitate and meet the following organizational goals; easier sharing of data and information, reduced effort, and cost to maintain applications, and enhanced data security and compliance with governing laws and regulations. The Electronic Case Management (ECM) platform-based solution will replace several custom-coded systems and allow the Department to realize the benefits of leveraging best practices available in the platform-based tools. The scope of ECM spans several program offices and federal partners and includes case-management functionality needed for the following areas: • Office of Medical Assistance Program (OMAP) • Office of Mental Health and Substance Abuse Support (OMHSAS) • Office of Children and Youth and Family (OCYF) • Office of Long-Term Living (OLTL) • Bureau of Hearings and Appeals (BHA) within the Office of Administration • Office of Developmental Programs (ODP) • Office of Child Development and Early Learning (OCEL) • Centers for Medicaid & Medicare Services (CMS) • Administration for Children and Families (ACF) INCURRING COSTS: • DHS is not responsible for any costs or expenses incurred by the service providers in the preparation of their quotes. • The DHS is not responsible for any costs or expenses incurred by the contractor for parking. • The DHS is not responsible for any costs or expenses incurred by the contractor for the carrying out of assigned duties. • The DHS is not responsible for the costs or expenses related to Teleworking (working from home). RESOURCES: Part-time Telework (via a Virtual Private Network (VPN) connection) is permitted. The HHS DC PMO area will also have “hoteling space” available at 2525 North Seventh Street, Third Floor in Harrisburg, Pennsylvania. Based on the needs/requests from the PMO and/or Program area the contractor may be required to be physically present in Harrisburg, Pennsylvania. DHS will supply all necessary hardware, software, network connection, business telephone number and VPN necessary to complete all assigned work, as needed. OBJECTIVES OF ENGAGEMENT: The primary objective of this engagement is to serve as the Enterprise Project Manager (PM) for the implementation of the ECM system. It is also expected that through this process the individual will obtain subject matter expertise (SME) regarding the case management for all agencies and this individual will also work cooperatively and lead other program PMs to ensure a successful implementation of the ECM system and associated business processes. Communicate and participate in the established governance structures for ECM with executive leadership, DHS program office stakeholders, and HHS DC as required. Establish plans and define activities to onboard and support program offices to the new ECM platform. Establish plans to decommission existing systems as onboarding is completed. CONTRACTOR SKILLS AND EXPERIENCE REQUIREMENTS: • Seven (7) to nine (9) years of relevant experience directly managing technical initiatives with a large complement of project team members throughout the various IT areas, technical complexity, and vendor involvement. • This position requires a high degree of skills, including but not limited to, budgeting, communication (verbal and written), leadership, negotiation and influencing, organizational, problem-solving, team building, human resource, and soft interpersonal skills. • Experience implementing Enterprise solutions. • The position requires a high degree of business and technical knowledge • The ability for the contractor to start quickly and perform independently is essential. • Project management professional (PMP) certification through the PMI is preferred. • A four (4) year college degree or equivalent technical study is preferred. • Familiarity and experience with the Pennsylvania DHS are considered important. • Candidate will need to provide points of contacts (POCs). • A criminal history background check is required. • A Pennsylvania State Policy (PSP) PATCH report is required for security access.",
        "source": "Email",
        "date_posted": "2024-10-29 08:14:29-05:00",
        "unique_id": "192d889e203ac12f",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]