[
    {
        "company": "zealhire",
        "job_title": "Supplier Relations Program Manager / Supplier Performance Management (SPM) Lead",
        "location": "Michigan, MI, USA",
        "full_location": {
            "city": "Michigan",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Minimum of 5 years of experience managing suppliers or third-party service/product providers.",
            "degree_required": "Bachelor's degree in Business, Finance, or a related field. Relevant experience can substitute for the educational requirement.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Supplier Performance Management",
                "Risk Management",
                "Data Analysis",
                "Contract Management",
                "Communication"
            ],
            "primary": [
                "Collaboration",
                "Performance Monitoring",
                "Continuous Improvement",
                "Training and Development",
                "Technical Skills"
            ],
            "secondary": [
                "Contract Lifecycle Management (CLM)",
                "Archer for risk management",
                "Negotiation skills",
                "Multitasking",
                "Third-party risk management frameworks"
            ],
            "all": [
                "Supplier Performance Management",
                "Risk Management",
                "Data Analysis",
                "Contract Management",
                "Communication",
                "Collaboration",
                "Performance Monitoring",
                "Continuous Improvement",
                "Training and Development",
                "Technical Skills",
                "Contract Lifecycle Management (CLM)",
                "Archer for risk management",
                "Negotiation skills",
                "Multitasking",
                "Third-party risk management frameworks"
            ]
        },
        "job_type": [],
        "contact_person": "shweta",
        "email": "shweta@zealhire.com",
        "jd": "From: shweta, zealhire shweta@zealhire.com Reply to: shweta@zealhire.com Job DescriptionUSC/GCneed LinkedInLocal to MI The Supplier Relations Program Manager / Supplier Performance Management (SPM) Lead is responsible for overseeing and delivering the enterprise-wide Supplier Performance Management (SPM) program. This role involves working closely with First Line of Defense (FLOD) Supplier Relations Managers (SRMs) and Supplier Initiative Managers (SIMs) to ensure that designated suppliers meet performance expectations. The role requires managing risk, analyzing performance metrics, and reporting outcomes to senior leadership while ensuring compliance with internal governance standards and external regulatory requirements.In addition, this position will be instrumental in building and maintaining a governance program for supplier performance, collaborating with Enterprise Risk Management and Third-Party Risk Management teams to ensure a comprehensive and disciplined approach to supplier risk and performance management. The ideal candidate will have excellent communication skills, a strong analytical mindset, and the ability to manage relationships and negotiate with external partners.Key Responsibilities:Supplier Performance Management: Lead the delivery of the Supplier Performance Management (SPM) program across the enterprise, ensuring compliance with company standards and regulatory guidelines.Governance and Compliance: Build and maintain the supplier performance governance program, developing procedures and documentation in alignment with intra-agency and regulatory requirements.Risk Management: Partner with the Enterprise Risk and Third-Party Risk Management teams to gather and analyze supplier performance metrics, ensuring suppliers meet the agreed-upon standards.Performance Monitoring: Coordinate updates for supplier performance scorecards and track performance gaps. Ensure that issues are addressed, and actions are taken to resolve deficiencies.Collaboration and Stakeholder Engagement: Work closely with Supplier Relations Managers, Business Stakeholders, and managed service providers to enhance risk management, communicate standards, and ensure smooth operations.Continuous Improvement: Lead initiatives to enhance and streamline supplier performance processes, applying best practices and continuous improvement methodologies to optimize the supplier management lifecycle.Reporting and Communication: Develop and deliver performance reports to senior management, Corporate Boards, and risk governance committees, ensuring that all required elements of supplier performance are reported accurately.Training and Development: Design and implement training programs for Supplier Relationship Managers, and assist in the development of communications and content to support ongoing supplier performance monitoring.Contract Management: Collaborate with Enterprise Risk and Risk Domain Leaders to ensure supplier contract requirements are met, and enforce contract terms with suppliers.Data Analysis and Reporting: Manage the collection, analysis, and reporting of key supplier performance data, ensuring metrics are used effectively to measure supplier success and compliance.Qualifications:Education:Bachelor's degree in Business, Finance, or a related field. Relevant experience can substitute for the educational requirement.Experience:Minimum of 5 years of experience managing suppliers or third-party service/product providers.Strong background in supplier performance management, risk assessment, and compliance.Proven ability to analyze supplier performance metrics and deliver actionable insights.Extensive experience in collaboration across teams, including internal stakeholders and external suppliers.Experience working with metrics and data analytics tools to monitor supplier performance.Strong experience in presenting findings and recommendations to senior management and governance committees.Technical Skills:Experience with Contract Lifecycle Management (CLM) tools, such as ContractPodAI.Knowledge of Archer for risk management is helpful.Strong data analytics and proficiency in tools for supplier performance tracking and reporting.Soft Skills:Excellent communication and negotiation skills, with the ability to influence and collaborate across various teams and stakeholders.Strong multitasking skills, capable of managing several projects and processes simultaneously in a fast-paced environment.Ability to demonstrate a strong commanding presence and effectively challenge and validate supplier performance information.Preferred Qualifications:Familiarity with third-party risk management frameworks and industry best practices for supplier performance management.Experience working in a regulated industry or environment with complex supplier relationships.Certifications in risk management or supplier relationship management are a plus.",
        "source": "Email",
        "date_posted": "2024-10-29 11:20:41-05:00",
        "unique_id": "192d946f099126ef",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]