[
    {
        "company": "ConvexTech Inc.",
        "job_title": "GIS Python Developer",
        "location": "Lincoln, NE, USA",
        "full_location": {
            "city": "Lincoln",
            "state": "NE",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "1 year",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6-12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Python",
                "SQL",
                "Geographic Information Systems (GIS)"
            ],
            "primary": [
                "Scripting languages",
                "Django"
            ],
            "secondary": [
                "Geospatial data processing",
                "Web mapping applications",
                "GIS automation",
                "Quality assurance"
            ],
            "all": [
                "Python",
                "SQL",
                "Geographic Information Systems (GIS)",
                "Scripting languages",
                "Django",
                "Geospatial data processing",
                "Web mapping applications",
                "GIS automation",
                "Quality assurance"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Raj Khan",
        "email": "raj@convextech.com",
        "jd": "From: Raj Khan, Convextech inc. raj@convextech.com Reply to: raj@convextech.com Hi,Hope you are doing good.!!Please let me know if you are interested in the below position.!! Position: GIS Python DeveloperLocation: Fully Onsite(Lincoln, NE )- candidates that are in the Lincoln, NE area, or able to relocate immediatelyDuration: 6-12MonthsVisa: Only USC/GC/EADInterview: Video Job Description: Required Experience and Skills: The ideal candidate will have a strong background in Geographic Information Systems (GIS) and extensive experience in Python programming ,and SQL . Must have least 1 year of experience with scripting languages.The GIS Python Developer will play a crucial role in developing, implementing, and maintaining GIS applications and tools, contributing to the efficient analysis and visualization of geospatial data. Responsibilities:GIS Application Development: Design, develop, and maintain GIS applications and tools using PythonCollaborate with cross-functional teams to understand project requirements and deliver innovative solutionsGeospatial Data Processing: Write scripts and programs to process and analyze geospatial data efficientlyImplement algorithms for spatial analysis and modellingIntegration of GIS with Enterprise Systems: Integrate GIS functionalities into enterprise systems using PythonCollaborate with database administrators for seamless data integrationWeb Mapping Applications: Develop interactive and user-friendly web mapping applicationsUtilize Python frameworks (eg, Django) to build geospatial web applicationsGIS Automation: Implement automation scripts to streamline GIS workflows and processesDevelop tools for automating data updates and spatial analysesQuality Assurance: Conduct testing and debugging of GIS applications to ensure functionality and data accuracyWork collaboratively with quality assurance teams for comprehensive testing Thanks and Regards MD. Raj KhanTechnical RecruiterConvexTech Inc.Email id- raj@convextech.comLinkedIn - linkedin.com/in/md-raj-khan-9b1498204",
        "source": "Email",
        "date_posted": "2024-10-29 15:12:38-05:00",
        "unique_id": "192da08b0ec89bba",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Python developer"
    }
]