[
    {
        "company": "AvanGrid",
        "job_title": "PROJECT MANAGER",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "University Degree (high) in a technical subject (f. ex: Computer Science, Telecommunications, Mathematics, etc.)",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Incident Management",
                "Change Management",
                "Problem Management",
                "Team Management",
                "Project Management"
            ],
            "primary": [
                "Technical Knowledge",
                "Critical Incident Management",
                "Reporting",
                "Knowledge Management"
            ],
            "secondary": [
                "Root Cause Analysis",
                "Service Coverage",
                "On Call Management",
                "Service Management"
            ],
            "all": [
                "Incident Management",
                "Change Management",
                "Problem Management",
                "Team Management",
                "Project Management",
                "Technical Knowledge",
                "Critical Incident Management",
                "Reporting",
                "Knowledge Management",
                "Root Cause Analysis",
                "Service Coverage",
                "On Call Management",
                "Service Management"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Mohit Kumar",
        "email": "kumar.mohit@tekinspirations.com",
        "jd": "From: Mohit Kumar, Tek Inspirations kumar.mohit@tekinspirations.com Reply to: kumar.mohit@tekinspirations.com PROJECT MANAGER INCIDENT & PROBLEM MANAGEMENT Remote Client - AvanGrid Degree Requirements University Degree (high) in a technical subject (f. ex: Computer Science, Telecommunications, Mathematics, etc.) Demonstrable Experience Demonstrable experience of at least 5 years in team, project and decision-making management tasks within its technological perimeter. Technical Areas Experience Demonstrable experience of at least 3 years in the technical areas, platforms, tools and languages of its technological perimeter. Number of Profiles 1 Service Hours Service coverage from 7:00 am to 6:00 pm. Service coverage will be managed globally by team members. On Call There is a possibility that the service may require on-call. Incident Management Specific knowledge Knowledge of Incident, Change and Problem Processes. Prior experience managing Critical and Major Incidents (min. 3 years exp) MAIN FUNCTIONS AND TASKS Non-Critical Incident Management *The Incident Managers should be experienced in managing any Non-Critical Incident independently, but with the ability to seek guidance from the Internal Operation Managers when necessary. The management of incidents of this nature should include, but not be limited to, the following skills: Critical Incident Management The Incident Managers should assist Internal Operation Managers on Critical Incidents. The responsibility for driving these Incidents sits with the Internal Operation Managers but are supported by Incident Managers in the following Recurrent Incident Management Responsible to identify recurring incidents, investigate, follow up, and establish root cause and resolution. Recurring incidents should be reported to and managed in conjunction with the Problem Management team. Knowledge Management Incident Managers will be responsible for the maintenance of an Incident Management Knowledge Database Known Error registry. The Incident Managers will collaborate with Problem Management and Internal Operation Managers to create Known Errors records using recorded data from previously managed incidents. Reporting Incident Managers will create set reports with varying frequency: Morning Sunrise Report detailing any Incidents being tracked, along with Root Cause Analysis progress. This will be shared with the Operations Management team who will publish the details in their early morning daily report. Provide Draft Critical Incident Reports Other reports will be created and provided as requested.",
        "source": "Email",
        "date_posted": "2024-10-29 18:45:57-05:00",
        "unique_id": "192daf39459b562c",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]