[
    {
        "company": "Entrust",
        "job_title": "Senior Oracle Business Systems Analyst",
        "location": "Shakopee, MN, USA",
        "full_location": {
            "city": "Shakopee",
            "state": "MN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "5+ years",
            "degree_required": "B.S. Degree in Computer Science, Information Systems, Business or related field",
            "visa_sponsorship": "Must have existing work authorization",
            "notice_period": "Not specified",
            "duration": "6+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle Contracts",
                "Install Base",
                "Business Analysis",
                "SQL",
                "PL/SQL"
            ],
            "primary": [
                "Order to Cash processes",
                "Project Management",
                "Customer Orientation",
                "Communication Skills"
            ],
            "secondary": [
                "Oracle E-Business Suite",
                "Advanced Pricing",
                "Oracle Field Service",
                "Receivables",
                "Process Improvement"
            ],
            "all": [
                "Oracle Contracts",
                "Install Base",
                "Business Analysis",
                "SQL",
                "PL/SQL",
                "Order to Cash processes",
                "Project Management",
                "Customer Orientation",
                "Communication Skills",
                "Oracle E-Business Suite",
                "Advanced Pricing",
                "Oracle Field Service",
                "Receivables",
                "Process Improvement"
            ],
            "with_experience": [
                "Oracle Contracts (5+ years)",
                "Install Base (5+ years)"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Aditya Raj",
        "email": "araj@vyzeinc.com",
        "jd": "Job Description -Job Title: Senior Oracle Business Systems Analyst Location: Hybrid - Shakopee, MNDuration: 6+months C2HVisa: USC and GCMOI: SkypeCandidates must be local to MN.Requirement Hi all,I need a strong Oracle DBA for Entrust Data card in Shakopee, MN.From Hiring Manager:full-time Senior Oracle Business Systems Analyst with experience in the Service Contracts and Install Base modules, but we're looking for a hybrid resource located in the greater Minneapolis area (our headquarters is in Shakopee).JD:Career Growth, Flexibility and Collaboration!Entrust is an innovative leader in identity-centric security solutions, providing an integrated platform of scalable, AI-enabled security offerings. Headquartered in Minnesota, we offer our colleagues the ability to work globally, in a flexible and collaborative environment. Our team makes an impact!! The Company: Entrust relies on curious, dedicated and innovative individuals whom anticipate the future and provide solutions for a more connected, mobile and secure world. Entrust’s technologies and expertise help government agencies, enterprises and financial institutions in more than 150 countries serve and safeguard citizens, employees and consumers. We Believe: Securing identities is most effective when we value all identities. We are committed to ensuring that, through diversity and inclusion, the many voices that make up our communities are heard. From unconscious bias training for managers to global affinity groups that create connections both within and across our enterprise, Entrust expects and encourages all individuals to accept and respect one another. And, of course, to be themselves.We are looking for a Senior Business Systems Analyst (Sr. BSA) to join our experienced team. This position will be comprised of functional, technical, and support related tasks and will play an integral role in the success of new business initiatives as well as the continued success of current processes. The incumbent will work directly with business leaders, business users, and IT colleagues to manage and support enterprise applications, such as Oracle E-Business Suite and others. The Sr. BSA role requires a good mix of business experience, functional and technical knowledge of Oracle Contracts and Install Base functionality. Entrust is currently on Oracle E-Business Suite version 12.2.8. Responsibilities: · Lead projects, enhancements and upgrades specific to Service Contracts business processes · Participate in projects for sales order processing functions involving Oracle Service Contracts and Install Base functionality · Participate in business functional group meetings on a regular basis to understand business needs and challenges, and to facilitate improvements · Define, document and implement system configuration changes in enterprise business systems · Create process/system models, specifications, diagrams and charts as required for clearly communicating project business requirements· Write functional specifications and closely work with application development and business intelligence teams · Create and maintain test scenarios, test scripts and test data for validating system design, configuration, integration and performance · Assist in project management and implementation planning · Responsible for level 3 and 4 support on assigned enterprise systems · Perform other duties and projects as assigned Basic Qualifications:· Undergraduate degree or equivalent education and/or work experience· 5+ years of Business Analyst experience working with Oracle Contracts and Install Base modules is required· 5+ years of experience supporting Order to Cash global processes is strongly preferred· Understands business analysis concepts, including requirements planning, management, elicitation, communication, documentation and solution validation · Ability to juggle competing demands and priorities while maintaining strong attention to detail · Strong customer orientation and commitment to quality · Proven written and verbal communications skills · Knowledge of SQL or PL/SQL and relevant tools · Up to 10% travel may be required · Must be able to lawfully work within the US and have unrestricted work authorization for the US Preferred Qualifications: · B.S. Degree in Computer Science, Information Systems, Business or related field · Experience working with other Oracle modules (including Order Management, Advanced Pricing, Oracle Field Service and Receivables) is preferred but not required · Knowledge of project management tools and techniques · Experience leading projects · Experience supporting a global client base · Participation in the creation and implementation of new standards and procedures",
        "source": "Email",
        "date_posted": "2024-10-29 13:15:12-05:00",
        "unique_id": "192d99d316e63b99",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]