[
    {
        "company": "Crayola",
        "job_title": "SAP Business Analyst with FICO/COPA",
        "location": "Eaton, PA, USA",
        "full_location": {
            "city": "Eaton",
            "state": "PA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "10 years",
            "degree_required": "4 years college degree in finance preferred",
            "visa_sponsorship": "Must have existing work authorization",
            "notice_period": "Not specified",
            "duration": "Long Term Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SAP FICO",
                "COPA",
                "Financial master data",
                "Problem solving",
                "Analytical skills"
            ],
            "primary": [
                "Production support",
                "End user training",
                "Configuration",
                "Integration",
                "Testing"
            ],
            "secondary": [
                "US GAAP",
                "Taxation",
                "Communication skills",
                "Customer service",
                "Project management"
            ],
            "all": [
                "SAP FICO",
                "COPA",
                "Financial master data",
                "Problem solving",
                "Analytical skills",
                "Production support",
                "End user training",
                "Configuration",
                "Integration",
                "Testing",
                "US GAAP",
                "Taxation",
                "Communication skills",
                "Customer service",
                "Project management"
            ]
        },
        "job_type": [
            "onsite",
            "remote"
        ],
        "contact_person": "Sanjaya Kumar Behera",
        "email": "sanjaya@adventatech.com",
        "jd": "Hope you are doing well please find the requirement below and kindly let me know if you have right candiateRole: SAP Business Analyst with FICO/COPALocation: Eaton, PA (Two days on-site, three remote at the present time.)Visa : USC/GC/GC EAD/H4 EADDuration: Long Term ContractMOI - Skype Need Excellent Communication Skills..!!I am reaching out to begin the search for an IT contractor, specifically someone to fill a SAP Business Analyst role, but with FICO/COPA knowledge and skillsets. Ideally, we would like someone with 10 years of experience, with a Finance degree. The location is in Forks Township, Easton, PA. Two days on-site, three remote at the present time. We expect this role to last about 6 months, working 8 hours within the window of 8 a.m. to 5 p.m. We would cap the hours at 40 per week, so no overtime without discussing it first. Crayola has inspired children to express their creativity since 1903. Crayolians take pride in fulfilling our mission of helping parents and educators raise creatively alive children around the world. Join our team and be part of an iconic brand that develops quality art products and experiences that are loved by families and preferred by teachers. Our company culture is mission focused, and encourages fun, collaboration, transparency, and helping others. We are committed to diversity and inclusion. Crayola believes a diverse workforce provides a broad spectrum of perspectives which enables us to create innovate products and continuously improve our work processes. We have an intentional focus on fostering a work environment where all employees feel valued and appreciated.Sr. SAP Business Analyst, FICO/COPASr. SAP Consultant-FICO/COPA is responsible for the maintenance and enhancements in SAP FICO module with experience in COPA. Responsibilities include supporting the business in FICO/COPA areas, including, production issue resolution, implementing new functionalities and enhancements, testing and end user training.PRINCIPAL DUTIES & RESPONSIBILITIES:Provide production support and implement new functionality and enhancements in FICO / COPA modules in ECCDevelop design specification documents and work with the technical developers in implementing solutions in FICO and COPA moduleProvide training to end usersSupport the finance department in the areas of AR/AP/P&L/GL/Balance sheet Dispute Management/Credit Management.Strong knowledge in COPA module is a mustHands on design and configuration is a mustIn accordance with the NIST CSF and Hallmark Standards, ensure adherence to policies and processes to remain in compliance for maintenance, security continuous monitoring and recovery areas including Asset Management, Change Management, Incident Management, Problem Management, Vulnerability & Patch Management, Data Security, Disaster Recovery and Business Continuity.Analyze business requirements and perform customizing, configuration, integration, upgrades, testing, documentation preparation, implementation and operational support for FICO / COPA module in the below areasFinancial master data related to vendor, customer, bank, cost center, general ledgerCost element / center accounting, Profit center accounting and Product costingDispute and collection managementSupporting and implementing solutions in COPA reporting moduleExposure to EDI/ALE/IDOCSExperience in integration areas with SD, MM and PP modulesJOB SPECIFICATIONS:Minimum of 10 years’ experience in SAP ECC FICO and COPA functional area.4 years college degree in finance preferredExperience in Leading SAP projectsGood verbal and written communications skillsMust have excellent problem solving and analytical skillsMust be able to work on simultaneous projectsKnowledge in US GAAP, taxation is a plusAbility to present ideas in user-friendly languageMaintain a high level of customer service to both internal and external clients",
        "source": "Email",
        "date_posted": "2024-10-29 16:47:03-05:00",
        "unique_id": "192da5f20aef4d84",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]