[
    {
        "company": "Millennium Infotech",
        "job_title": "Business Analyst with State Client Experience",
        "location": "Augusta, ME, USA",
        "full_location": {
            "city": "Augusta",
            "state": "ME",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "4-year college degree and/or equivalent years of direct leadership experience in technology/business",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Agency IT Account Representative",
                "Business relationships",
                "IT budget preparation",
                "Emotional intelligence",
                "Customer service"
            ],
            "primary": [
                "Knowledge of current IT tools",
                "Strong communication skills",
                "Knowledge of governance and policies",
                "Understanding of information technology systems"
            ],
            "secondary": [
                "Networking",
                "Telecommunications platforms",
                "Operating systems",
                "Integration",
                "Information security"
            ],
            "all": [
                "Agency IT Account Representative",
                "Business relationships",
                "IT budget preparation",
                "Emotional intelligence",
                "Customer service",
                "Knowledge of current IT tools",
                "Strong communication skills",
                "Knowledge of governance and policies",
                "Understanding of information technology systems",
                "Networking",
                "Telecommunications platforms",
                "Operating systems",
                "Integration",
                "Information security"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "bala",
        "email": "bala@mitiweb.com",
        "jd": "Hi,We are looking for Business Analyst with State Client Experience.This is an onsite role looking for local candidates from Maine location.Kindly send profiles from Maine location only. Required Skills·Function as Agency IT Account Representative·Know business/ Agency mission·Create business relationships with key business leaders within Agencies·Understand/monitor the quality, effectiveness and sustainability of all IT services provided in support of the agencies’ mission·Participate and consult in the preparation of Agencies’ IT budgets·Identify critical business applications along with agency service expectations of those applications (assist with Business Impact Analysis of agencies’ applications)·Work across MaineIT to ensure business needs are being met·Raise awareness of common IT business solutions·Work collaboratively with other MaineIT resources to identify common business solutions·A thorough understanding of emotional intelligence and empathy. It is important we anticipate and meet the technological needs as well as the emotional needs of our Agency partners.·Ability to handle difficult situations while maintaining positive relationships.·Ability to demonstrate our core values with every customer interaction.·A strong understanding and ability to assist agencies with biennial budget preparation.·Prior experience/understanding of State of Maine billing and procurement processes. Minimum Qualifications:·A 4-year college degree and/or equivalent years of direct leadership experience in technology/business with evidence of teambuilding.·Knowledge of current IT tools and best practices as well as emerging information technology including client computing, networking, telecommunications platforms, operating systems, integration, and information security.·Strong communication skills will be required with the ability to communicate complex technology terms into business understanding. Highly effective verbal and written communication skills are a must.·Knowledge of governance, policies, and processes of State budgeting.·An understanding of information technology systems and equipment to facilitate and assist with State agency information technology requests while providing excellent customer service.",
        "source": "Email",
        "date_posted": "2024-10-29 15:17:29-05:00",
        "unique_id": "192da2c84345096b",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]