[
    {
        "company": "Techgene Solutions LLC",
        "job_title": "Business Analyst",
        "location": "Des Moines, IA, USA",
        "full_location": {
            "city": "Des Moines",
            "state": "IA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "8 years",
            "degree_required": "Bachelor’s degree in management information systems, Business, or related field, and/or relevant experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Experience working on large, complex IT systems",
                "Experience eliciting requirements, writing user stories and design documents",
                "Experience with SDLC procedures and system development methodologies",
                "Experience managing stakeholder expectations and priorities",
                "Excellent task management skills",
                "Ability to prioritize and manage multiple projects",
                "Experience with Microsoft development platforms and software",
                "Experience in an Agile environment"
            ],
            "primary": [
                "Experience with Application Lifecycle Management tools",
                "Working experience with Microsoft SQL Server Management Studio",
                "Familiarity with advanced information management practices"
            ],
            "secondary": [
                "Experience delivering software as part of an Agile delivery team",
                "Excellent interpersonal, verbal and written communication skills",
                "Experience in process mapping, group facilitation, data gathering and analysis",
                "Proficient in Microsoft Office Suite",
                "Experience with requirement gathering software",
                "Ability to analyze business strategies and user needs",
                "Experience providing consulting services to governmental entities"
            ],
            "all": [
                "Experience working on large, complex IT systems",
                "Experience eliciting requirements, writing user stories and design documents",
                "Experience with SDLC procedures and system development methodologies",
                "Experience managing stakeholder expectations and priorities",
                "Excellent task management skills",
                "Ability to prioritize and manage multiple projects",
                "Experience with Microsoft development platforms and software",
                "Experience in an Agile environment",
                "Experience with Application Lifecycle Management tools",
                "Working experience with Microsoft SQL Server Management Studio",
                "Familiarity with advanced information management practices",
                "Experience delivering software as part of an Agile delivery team",
                "Excellent interpersonal, verbal and written communication skills",
                "Experience in process mapping, group facilitation, data gathering and analysis",
                "Proficient in Microsoft Office Suite",
                "Experience with requirement gathering software",
                "Ability to analyze business strategies and user needs",
                "Experience providing consulting services to governmental entities"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Jatin Keshav",
        "email": "jatin.k@techgene.com",
        "jd": "From: Jatin Keshav, Techgene Solutions LLC jatin.k@techgene.com Reply to: jatin.k@techgene.com Role: Business AnalystLocation: Des Moines, IA 50319 - HybridDuration: 12 Months NOTE:Interviews will be conducted on [November 5, 6, 7, 8].Either Web Cam or In Person Interview The Division provides adaptable, secure, and cost-effective technology services and solutions for the Department and its Partners. We manage all HHS IT assets, projects, and resources, as well as provide technology and expertise to support Iowa’s citizens and families. Does this by consistently delivering top tier performance and value to citizens as a trusted partner and service provider.Committed to the pursuit of creative and innovative solutions that enable our agency to help Iowans achieve healthy, safe, stable, and self-sufficient lives through the programs and services we provide. We strive for an IT culture that identifies the newest, most effective solutions through discovery, open discussion and collaboration. We have fun together, care about each other, and take pride in the solutions we provide. We believe in continuously optimizing our processes, refining our solutions, and improving ourselves for the benefit of the Iowans we serve.Role is to be involved with multiple projects, primarily for Health and Human Services, though that will expand to other departments as needed. The current need is for coverage in the HHS EDBI group [Data Warehouse] working with Elias reports, Iowa Medicaid Enterprise, and other areas with new projects currently in the pipeline. REQUIRED SKILLSExperience working on large, complex IT systems (8 years)Experience eliciting requirements, writing user stories and design documents, defining acceptance criteria, testing outcomes, and facilitating communication between business stakeholders, developers, and project teams. (8 years)Experience with SDLC procedures and system development methodologies. (8 years)Experience managing stakeholder expectations and priorities. (8 years)Experience working within a project governance structure (methodology, required templates, and reporting). (8 years)Excellent task management skills. Ability to balance and manage multiple tasks, with changing priorities, in a cross-functional environment. (8 years)Ability to prioritize and manage multiple projects, and project activities, simultaneously, while meeting established deadlines. (8 years)Experience with Microsoft development platforms and software. (8 years)Experience in an Agile environment. (6 years)Experience with Application Lifecycle Management [ALM] tools; Microsoft’s Team Foundation Server (TFS), Visual Studio Team Services (VSTS), Azure DevOps (ADO), Atlassian’s Jira, IBM’s Rational Team Suite (RTC). (5 years)Working experience with Microsoft SQL Server Management Studio or other relational database software. (5 years)Familiarity with advanced information management practices, data modeling standards, and/or architecture design and analysis. (3 years)Bachelor’s degree in management information systems, Business, or related field, and/or relevant experience (8 years) Responsibilities of the Business Analyst role include but are not limited to: Working directly with business leaderships, SME’s, and technical partners on system-aligned teams, to gather and document requirements for various Iowa applications and systems. Creating, presenting and maintaining user stories, acceptance criteria, and design documents in HHS defined systems to be used by team members at all levels.Directly responsible for documenting, tracing, maintaining, prioritizing, and assessing changes to business practices, workflows, and associated system processes.May act in the role of project manager / quality assurance analyst for smaller efforts.Conducting research to query data, analyze problems, and determine solutions, such as the installation of alternate methods and procedures, implementing changes in processing methods, or the redesign of products or services.Consistently updating project information, statuses, risks, issues, and timelines for reporting purposes.Working within an agile methodology framework with a focus on delivering value while adjusting rapidly to produce the most effective outcome.May be called upon to participate in database and forms analysisA successful candidate for this role is expected to possess the following skills and experience: Excellent interpersonal, verbal and written communication skills and the ability to interact with a diverse group of team members, including executives, managers, IT professionals, and subject matter experts.Experience in process mapping, group facilitation, data gathering and analysis, and all phases of a project life cycle (requirements, design, development, testing, deployment, documentation, training, and measuring effectiveness.)Experience delivering software as part of an Agile delivery team.Strong ability to work effectively and autonomously against deadlines and potential priority shifts.Proficient in Microsoft Office Suite including Excel, Word, PowerPoint, Project, and Visio.Experience with requirement gathering software such as Azure DevOps, TFS, Jira, or RTCAbility to analyze business strategies and user needs, document specifications, and translate business objectives into proper system requirements and specifications.Guide stakeholders through business case development for new applications/functionality, including cost benefit analysis, risks and issues, and impact analysis.Ability to recognize value through benefit realization, avoidance of cost, new opportunities, and organizational modernization.Experience with continuous process improvement via underlying technologies and system support.Strong ability to break down complex concepts into smaller, simply defined tasks, while maintaining a focus on end-to-end business processes.Work closely with other Business Units to identify and deliver Enterprise value.Skilled at consulting with executive-level stakeholders to define business needs or problems.Experience providing consulting services to governmental entities is a plus.",
        "source": "Email",
        "date_posted": "2024-10-29 09:23:13-05:00",
        "unique_id": "192d8c8ce47ad9a3",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]