[
    {
        "company": "Panzer Solutions LLC",
        "job_title": "Medicaid Business Analyst",
        "location": "Austin, TX, USA",
        "full_location": {
            "city": "Austin",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Minimum 12+ Years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Texas Medicaid Systems",
                "Business Analyst",
                "Information Technology projects",
                "Agile delivery approach"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Texas Medicaid Systems",
                "Business Analyst",
                "Information Technology projects",
                "Agile delivery approach"
            ],
            "with_experience": [
                "Texas Medicaid Systems (5+ years)",
                "Business Analyst (5+ years)"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Zaid Khan",
        "email": "zaid.khan@panzersolutions.com",
        "jd": "From: zaid, Panzer zaid.khan@panzersolutions.com Reply to: zaid.khan@panzersolutions.com Hi ,How are you doing well!My name is Zaid Khan, and I am a certified LinkedIn Recruiter currently working as a Talent Acquisition Specialist at Panzer Solutions LLC. We specialize in both IT and non-IT recruitment services across the U.S. I wanted to inform you about an exciting opportunity we have with one of your preferred clients. If you're available and interested, please let me know. You can also send me your updated resume and the best contact number for a quick follow-upHot RoleImmediate InterviewCandidates Must be Local to Texas OnlyMedicaid Business AnalystLocation: Austin TexasPosition Will be Remote in Texas Exp: Minimum 12+ Years Must How We Can Close the Position 1. Candidates Must Previously Worked with Texas Medicaid Systems : Minimum 5 Years -No Other State Client Experience is Workable 2. Candidates Must Previously Worked with Any of These Departments - MEDICAID Project - Texas Health and Human Services Commission (HHSC) , Texas Department of State Health Services (DSHS) , Texas Medicaid and Healthcare Partnership (TMHP) is Must for At least 5 Years Experience as a Business Analyst.Experience with Texas Medicaid systems.Experience working with Information Technology projects.Knowledge of software development processes and practices.Experience with and Agile delivery approach. Warm Regards,Zaid Khan| Talent AcquisitionPanzer Solutions LLC50 Washington Street, 9th Floor,SONO Corporate Center - Norwalk CT 06854Email: zaid.khan@panzersolutions.comNotice of Confidentiality:The information contained herein is intended only for the confidential use of the recipient. If the reader of this message is neither the intended recipient, nor the person responsible for delivering it to the intended recipient, you are hereby notified that you have received this communication in error, and that any review, dissemination, distribution, or copying of this communication is strictly prohibited. If you receive this in error, please notify the sender immediately by telephone, and destroy this e-mail message OR reply with the subject \"REMOVE\" or \"Unsubscribe\" such that your email would be taken out of our distribution list. You can also forward your \"REMOVE\" or \"Unsubscribe\" emails to mailto:info@panzersolutions.com",
        "source": "Email",
        "date_posted": "2024-10-29 12:50:33-05:00",
        "unique_id": "192d9a8587a7e8ec",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]