[
    {
        "company": "Vyze Inc.",
        "job_title": "Project Manager",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Bachelor's degree in IT or related field",
            "visa_sponsorship": "Must have existing work authorization",
            "notice_period": "Not specified",
            "duration": "6 Month Contract with extensions",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "IT Infrastructure",
                "Agile",
                "Lean Six Sigma"
            ],
            "primary": [
                "AWS",
                "Azure",
                "ServiceNow",
                "O365",
                "Clarity",
                "MS Project"
            ],
            "secondary": [
                "Communication Skills",
                "PowerPoint Presentations",
                "Team Collaboration"
            ],
            "all": [
                "Project Management",
                "IT Infrastructure",
                "Agile",
                "Lean Six Sigma",
                "AWS",
                "Azure",
                "ServiceNow",
                "O365",
                "Clarity",
                "MS Project",
                "Communication Skills",
                "PowerPoint Presentations",
                "Team Collaboration"
            ]
        },
        "job_type": [
            "remote",
            "onsite",
            "hybrid"
        ],
        "contact_person": "Rahul Mishra",
        "email": "rmishra@vyzeinc.com",
        "jd": "From: Rahul Mishra, Vyzeinc rmishra@vyzeinc.com Reply to: rmishra@vyzeinc.com Job Title: Project Manager Duration: 6 Month Contract with extensions Visa: USC and GCMOI: Skype Position: Project Manager Day-to-Day Responsibilities: The Information Technology Infrastructure Project Manager (PM) will be responsible for overseeing various projects within the Network, End User Experience, and Datacenter & Application Platform Service Lines at Michelin. Key responsibilities include: Delivering project scope on time and within budget. Leading project Steering Committee meetings involving IT and Business management. Ensuring effective communication with all stakeholders and teams. Managing project execution by identifying deliverables, coordinating work across multiple teams and IT suppliers (Kyndryl, BT, Computacenter, etc.). Developing budget and cost plans, identifying risks and issues, and monitoring project progress using appropriate methods and metrics. Applying project management policies, methods, and procedures as defined in PMBOK. Engaging with Architects and Subject Matter Experts to understand infrastructure technology. Demonstrating leadership, communication, organization, conflict management, and independent judgment in managing project activities. Technical Environment: AWS and Azure cloud platforms. On-premises Windows and Linux server-hosted applications. Network infrastructure. Internal/External Customers: Primarily internal users, with some potential impact on external customers. Team Size: Core project team of 5-10 people, including Stakeholders, SMEs, Business Analysts, and Functional Analysts. Must-Haves: Minimum 5 years of project management experience in IT, with at least 3 years focused on IT Infrastructure projects using standard Project Management principles (e.g., PMP, Agile, Lean Six Sigma). Experience working across multiple platforms, entities, cultures, and geographical zones. Bachelor's degree in IT or related field, with experience managing dispersed teams and large projects (>$500k). Preferred Qualifications: Experience with tools like ServiceNow, O365, Clarity, and MS Project. PMP or LEAN certification. Ability to thrive in a hybrid work environment and foster team collaboration. Strong communication skills for gathering and analyzing information, defining problems, and building consensus. Proficiency in creating PowerPoint presentations tailored to the intended audience. Self-motivated and driven to achieve results on time and within budget.",
        "source": "Email",
        "date_posted": "2024-10-29 09:14:18-05:00",
        "unique_id": "192d8f3ec3dc8567",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]