[
    {
        "company": "VKore Solutions",
        "job_title": "Project Manager with MES",
        "location": "Santa Clara, CA, USA",
        "full_location": {
            "city": "Santa Clara",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "1 year",
            "degree_required": "Bachelor's degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "MES",
                "Project Management",
                "Agile",
                "Business Analysis"
            ],
            "primary": [
                "Fluent in English",
                "Excellent communication skills",
                "Proactive",
                "Self-starter",
                "Technical knowledge"
            ],
            "secondary": [
                "FactoryWorks MES",
                "Semiconductor knowledge",
                "Stakeholder engagement",
                "Collaboration"
            ],
            "all": [
                "MES",
                "Project Management",
                "Agile",
                "Business Analysis",
                "Fluent in English",
                "Excellent communication skills",
                "Proactive",
                "Self-starter",
                "Technical knowledge",
                "FactoryWorks MES",
                "Semiconductor knowledge",
                "Stakeholder engagement",
                "Collaboration"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Clark Adam",
        "email": "clark@vkoresolutions.com",
        "jd": "Urgent position Project Manager with MES\nLocation- Santa Clara (Onsite) PM With MES- Key Responsibilities Responsible for developing end to end digital operational process flow to effectively run Semiconductor R & D Lab. Acts as a business Analyst for R & D Lab Operations teams, supporting mainly, but not limited to, MES (Manufacturing Execution System). Assess the business requirement and work with BPA/End users to review/streamline the requirement to deliver business value. Configure MES System to meet business needs. Document and maintain MES Modelling process. Collaborates with IT portfolio managers, PM & customers to co develop a MES roadmap and drive products and features from concept to launch in a fast paced environment. Works in an Agile environment and continuously reviews the business needs, refines priorities, outlines milestones and deliverables, and identifies opportunities and risks. Works with user focused groups to define the self service user experience, support, and monitoring for customers. Translates product roadmap features into well defined product requirements including features, user stories, and acceptance test criteria. Prioritizes and maintains the sprint backlog for assigned products, balancing the requirements of stakeholders. Leads the product functional design process based on an intimate knowledge of the users and technology. Define and write/review the Functional process document (FS) in line with the BPD/BRD. Present the FS to Technical architect for them to complete the design Review and approve the technical design working with Business Support the functional architecture for multiple processes in a semiconductor lab. To Support Global business per their time zones. Participate in QA checkpoints during delivery to provide guidance and ensure solution aligns with original scope Review the UAT test case and work with business and execution team closely to complete the UAT Qualification / Skills Fluent in English Writing, Listening. Balance of technical knowledge and business acumen Proactive, self starter with excellent project management skills and ability to manage multiple tasks effectively Excellent communication skills with the ability to engage, influence, and inspire partners and stakeholders to drive collaboration and alignment Proven experience in / Functional Knowledge of an MES system, FactoryWorks MES would be an advantage. Prior working experience in semiconductor industry or semiconductor knowledge will be preferred. Education & Experience: Bachelors degree and at least a year of product or project development experience Experience of working on a MES solution and /or Semiconductor space.",
        "source": "Email",
        "date_posted": "2024-10-29 12:07:20-05:00",
        "unique_id": "192d95f0c01cb22e",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]