[
    {
        "company": "DMS Vision, INC",
        "job_title": "100% Remote Healthcare IT Project Manager",
        "location": "Detroit, MI, USA",
        "full_location": {
            "city": "Detroit",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Bachelor's degree in science, Engineering, or a relevant technical/ management field",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6 Month",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "IT Project Management",
                "Healthcare experience",
                "PMP certified",
                "MS Project"
            ],
            "primary": [
                "Communication skills",
                "Project planning",
                "Budget preparation",
                "Team leadership"
            ],
            "secondary": [
                "Infrastructure",
                "Applications",
                "EPIC EMR System",
                "Security",
                "Process governance"
            ],
            "all": [
                "IT Project Management",
                "Healthcare experience",
                "PMP certified",
                "MS Project",
                "Communication skills",
                "Project planning",
                "Budget preparation",
                "Team leadership",
                "Infrastructure",
                "Applications",
                "EPIC EMR System",
                "Security",
                "Process governance"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Gaurav Gaur",
        "email": "gaurav@dmsvisions.com",
        "jd": "From: Gaurav Gaur, DMS VISIONS INC gaurav@dmsvisions.com Reply to: gaurav@dmsvisions.com Hi,Hope you are doing well,Please find the job description given below and let me know your interest.Position: 100% Remote Healthcare IT Project Manager || Need Local to Michigan || Only USC OR GC Location: Detroit, MIDuration: 6 Month Visa: Only USC AND GC Remote but must be local to MI if needed to go in Detroit, MI Job Description Communication skills need to be no less than a 9. Skill Matrix 10+ years of IT Project ManagementHealthcare experience requiredPMP certifiedMS Project REQUIRED: Bachelor's degree in science, Engineering, or a relevant technical/ management field,Minimum of 5 years IT Project Management experience.Strongly Preferred: PMP Certification, previous experience as a project manager in the healthcare space.Looking for Project Managers to assist with IT projects created through the joint venture between Ascension and Henry Ford.Projects include but are not limited to the areas of; Infrastructure, Applications, EPIC EMR System, Security, and Process governance. Job Summary: Under minimal supervision of an Executive Leader, performs and/or manages project work of a generally complex nature aimed at improving operating systems and functions, with increasing responsibility for project planning. Budgets and allocates analyst resources for projects within scope of responsibility. Prepares reports and recommendations for management and coordinates implementation whenever possible. May act as a consultant on projects outside of specific assignments. Supervises tasks of support staff relative to assigned projects. Principal Duties And Responsibilities: Works independently to manage complex projects involving coordination of multiple participants and teams aimed at improving operating systems and functions within.Maintains a high level of responsibility for completion of projects within a department, Hospital or Region with strategic implications.Conducts reviews of Hospital/Medical Group areas on a project basis; acts as a project lead for individual or multi-analyst projects.Prepares project plans including scheduling, costs, personnel matters and other operational concerns.Developing and refining project scope and objectivesDeveloping and refining project work planRecommend and provide input for budget preparationGuiding day-to-day activities of the project teamFacilitate and/or lead meetings and teamsSupplying periodic project updates to hospital administration. preparing project management reports, and coordinating written and verbal presentations of project findings, conclusions, and recommendations.Conceptualizes ideas, develops work plan, and plan execution into project format.Develops and determines priorities and monitors status of projects on an ongoing basis.Exercises independent judgment and makes difficult decisions.Works with all levels of the Hospital, Region and System.Conducts interviews with users and performs various data gathering techniques.Fosters teamwork with all involved parties to insure efficient project operations.Documents current systems and operations.Analyzes client systems, procedures, and operations and identifies opportunities for improvement.Identifies and tests alternative methods and procedures and identifies associated costs and benefits.Defines requirements to modify existing procedures or develops new system.Assists in the implementation of revised or new methods.Guides support staff in performing operations analysis and decision support activities.Establishes work schedules and priorities to ensure that work flow is controlled.Identifies internal staff development needs and opportunities for improvement or enhancement of staff skills. If you are interested, please share your updated resume and suggest the best number & time to connect with you Thanks & Regards,Gaurav GaurEmail: gaurav@dmsvisions.com | Phone : 972-645-9280LinkedIn: https://www.linkedin.com/in/gaurav-gaur-hr/DMS Vision ,INC4645 Avon Lane, Suite 210Frisco, TX 75033",
        "source": "Email",
        "date_posted": "2024-10-29 06:54:30-05:00",
        "unique_id": "192d840a6934fb0c",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]