[
    {
        "company": "Cyber-resources",
        "job_title": "Business Analyst II",
        "location": "Des Moines, IA, USA",
        "full_location": {
            "city": "Des Moines",
            "state": "IA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "8 years",
            "degree_required": "Bachelor’s degree in management information systems, Business, or related field, and/or relevant experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Requirements Gathering",
                "Agile Methodologies",
                "SDLC Procedures",
                "Microsoft Office Suite"
            ],
            "primary": [
                "Process Mapping",
                "Data Analysis",
                "User Stories",
                "Acceptance Criteria",
                "Stakeholder Management",
                "Azure DevOps",
                "Jira"
            ],
            "secondary": [
                "Project Management",
                "Quality Assurance",
                "Continuous Process Improvement",
                "Consulting Services",
                "Data Modeling"
            ],
            "all": [
                "Business Analysis",
                "Requirements Gathering",
                "Agile Methodologies",
                "SDLC Procedures",
                "Microsoft Office Suite",
                "Process Mapping",
                "Data Analysis",
                "User Stories",
                "Acceptance Criteria",
                "Stakeholder Management",
                "Azure DevOps",
                "Jira",
                "Project Management",
                "Quality Assurance",
                "Continuous Process Improvement",
                "Consulting Services",
                "Data Modeling"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Swapna J",
        "email": "swapnaj@cyber-resource.com",
        "jd": "From: Swapna, Cyber-resources swapnaj@cyber-resource.com Reply to: swapnaj@cyber-resource.com Role: IA-DOM-DOIT-BA6-Business Analyst (750197Location: 200 E. Grand Ave, Des Moines, IA 50319Work mode: HybridInterview: Either Web Cam or In Person InterviewExperience : 8+Client : -IA-DOM-DOITClient State: IowaThe Division of Information Technology (DoIT) provides adaptable, secure, and cost-effective technology services and solutions for the Department of Management [DOM] and its Partners. We manage all HHS IT assets, projects, and resources, as well as provide technology and expertise to support Iowa’s citizens and families. DOM DoIT does this by consistently delivering top tier performance and value to citizens as a trusted partner and service provider.DoIT is committed to the pursuit of creative and innovative solutions that enable our agency to help Iowans achieve healthy, safe, stable, and self-sufficient lives through the programs and services we provide. We strive for an IT culture that identifies the newest, most effective solutions through discovery, open discussion and collaboration. We have fun together, care about each other, and take pride in the solutions we provide. We believe in continuously optimizing our processes, refining our solutions, and improving ourselves for the benefit of the Iowans we serve.This request is for two (2) Business Analysts (BA6) roles to be involved with multiple projects, primarily for Health and Human Services, though that will expand to other departments as needed. The current need is for coverage in the HHS EDBI group [Data Warehouse] working with Elias reports, Iowa Medicaid Enterprise, and other areas with new projects currently in the pipeline. Responsibilities of the Business Analyst role include but are not limited to: · Working directly with business leaderships, SME’s, and technical partners on system-aligned teams, to gather and document requirements for various Iowa applications and systems. · Creating, presenting and maintaining user stories, acceptance criteria, and design documents in HHS defined systems to be used by team members at all levels.· Directly responsible for documenting, tracing, maintaining, prioritizing, and assessing changes to business practices, workflows, and associated system processes.· May act in the role of project manager / quality assurance analyst for smaller efforts.· Conducting research to query data, analyze problems, and determine solutions, such as the installation of alternate methods and procedures, implementing changes in processing methods, or the redesign of products or services.· Consistently updating project information, statuses, risks, issues, and timelines for reporting purposes.· Working within an agile methodology framework with a focus on delivering value while adjusting rapidly to produce the most effective outcome.· May be called upon to participate in database and forms analysisA successful candidate for this role is expected to possess the following skills and experience: · Excellent interpersonal, verbal and written communication skills and the ability to interact with a diverse group of team members, including executives, managers, IT professionals, and subject matter experts.· Experience in process mapping, group facilitation, data gathering and analysis, and all phases of a project life cycle (requirements, design, development, testing, deployment, documentation, training, and measuring effectiveness.)· Experience delivering software as part of an Agile delivery team.· Strong ability to work effectively and autonomously against deadlines and potential priority shifts.· Proficient in Microsoft Office Suite including Excel, Word, PowerPoint, Project, and Visio.· Experience with requirement gathering software such as Azure DevOps, TFS, Jira, or RTC· Ability to analyze business strategies and user needs, document specifications, and translate business objectives into proper system requirements and specifications.· Guide stakeholders through business case development for new applications/functionality, including cost benefit analysis, risks and issues, and impact analysis.· Ability to recognize value through benefit realization, avoidance of cost, new opportunities, and organizational modernization.· Experience with continuous process improvement via underlying technologies and system support.· Strong ability to break down complex concepts into smaller, simply defined tasks, while maintaining a focus on end-to-end business processes.· Work closely with other Business Units to identify and deliver Enterprise value.· Skilled at consulting with executive-level stakeholders to define business needs or problems.· Experience providing consulting services to governmental entities is a plus. REQUIRED SKILLS· Experience working on large, complex IT systems (8 years)· Experience eliciting requirements, writing user stories and design documents, defining acceptance criteria, testing outcomes, and facilitating communication between business stakeholders, developers, and project teams. (8 years)· Experience with SDLC procedures and system development methodologies. (8 years)· Experience managing stakeholder expectations and priorities. (8 years)· Experience working within a project governance structure (methodology, required templates, and reporting). (8 years)· Excellent task management skills. Ability to balance and manage multiple tasks, with changing priorities, in a cross-functional environment. (8 years)· Ability to prioritize and manage multiple projects, and project activities, simultaneously, while meeting established deadlines. (8 years)· Experience with Microsoft development platforms and software. (8 years)· Experience in an Agile environment. (6 years)· Experience with Application Lifecycle Management [ALM] tools; Microsoft’s Team Foundation Server (TFS), Visual Studio Team Services (VSTS), Azure DevOps (ADO), Atlassian’s Jira, IBM’s Rational Team Suite (RTC). (5 years)· Working experience with Microsoft SQL Server Management Studio or other relational database software. (5 years)· Familiarity with advanced information management practices, data modeling standards, and/or architecture design and analysis. (3 years)· Bachelor’s degree in management information systems, Business, or related field, and/or relevant experience (8 years) SkillRequired / DesiredAmountof ExperienceExperience working on large, complex IT systemsRequired8Years Experience eliciting requirements, writing user stories and design documents, defining acceptance criteria, testing outcomes, and facilitating communiRequired between business stakeholders, developers, and project teams.Required8Years Experience with SDLC procedures and system development methodologies.Required8YearsExperience managing stakeholder expectations and priorities.Required8Years Experience working within a project governance structure (methodology, required templates, and reporting).Required8YearsExcellent task management skills. Ability to balance and manage multiple tasks, with changing priorities, in a cross-functional environment.Required8Years Ability to prioritize and manage multiple projects, and project activities, simultaneously,while meeting established deadlines.Required8YearsExperience with Microsoft development platforms and software.Required8Years Experience in an Agile environment.Required6YearsExperience with Application Lifecycle Management [ALM] tools; Microsoft’s Team Foundation Server (TFS), Visual Studio Team Services (VSTS),Required5Years Azure DevOps (ADO), Atlassian’s Jira, IBM’s Rational Team Suite (RTC).Required5YearsWorking experience with Microsoft SQL Server Management Studio or other relational database software.Required5Years Familiarity with advanced information management practices, data modeling standards, and/or architecture design and analysis.Required3Years Bachelor’s degree in Management Information Systems, Business, or related field, and/or relevant experienceHighly desired8Years Description Question 1Absences greater than two weeks MUST be approved by CAI Management in advance, and contact information must be provided to CAI so that a resource can be reached during his or her absence. The Client has the right to dismiss the resource if she or he does not return to work by the agreed upon date. Do you agree to this requirement? Question 2The Contractor must report any disciplinary action, misdemeanor, or felony convictions to the State for any temporary IT staff provided. Do you agree to this requirement?Question 3What is your candidate's email address? Question 4Have you completed and submitted the Right to Represent form, making sure to do so exactly as instructed? The form is located at https://www.cai.io/media/documents/msp/ia/ia_e-rtr_template.doc. Question 6PROVIDE CANDIDIDATES CURRENT LOCATION (CITY/STATE) HERE:Question 7SHOW YOUR WORK - In the summary of qualifications field under the details tab of the candidate's profile, you should explain why your candidate is the best fit for this position. Please confirm that you have thoroughly validated and attested to the accuracy of the credentials listed throughout this candidate's VectorVMS profile and resume according to Section 5.2.5 of ITS-009440. Do you confirm? Candidates will get rejected if an agency cuts and pastes the candidates' resumes into this field [REQUIRED] Question 8Use of AI is Strictly Prohibited: Please be advised that the use of AI-generated responses during screenings and interviews is strictly prohibited. Confirm that your candidate has been informed of this policy and agrees to adhere to it. Non-compliance will result in disqualification from the interview process.Question 9Background Check Requirements: DOM contractor personnel are required to undergo additional background check investigations (run by DOM) before starting, requiring the completion of several waiver forms & fingerprint processes. The selected candidate will be responsible for completing all the necessary waiver forms, scheduling and completing the fingerprinting process, and returning all completed items to DOM for processing. This is in addition to the National Criminal and Sex Offender check that the vendor Question 10PROVIDE CANDIDATES FULL PHYSICAL ADDRESS where DOM DoIT Background Check form and Fingerprint cards are to be mailed [REQUIRED]Question 11INTERVIEW DATES: Interviews will be conducted on [November 5, 6, 7, 8] Only submit candidates available for interviews on the date(s) provided.Thanks & RegardsSwapna JOfficial Partner to State of Virginia / D.C. / Indiana / Georgia / Idaho / Florida / IowaEmail: Swapnaj@cyber-resource.com | 12240 Manor Crossing Dr, Glen Allen, Virginia 23059http://www.cyber-resource.com/",
        "source": "Email",
        "date_posted": "2024-10-29 13:32:39-05:00",
        "unique_id": "192d9ad296365b2a",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]