[
    {
        "company": "Adventa Tech",
        "job_title": "Business Analyst",
        "location": "Ocoee, FL, USA",
        "full_location": {
            "city": "Ocoee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "3 years",
            "degree_required": "Bachelor’s degree in Accounting, Finance, or related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "analytical skills",
                "problem-solving skills",
                "process mapping",
                "financial accounting",
                "data analysis"
            ],
            "primary": [
                "Oracle",
                "Power Query",
                "PowerPivot",
                "IBM Blueworks",
                "Visio",
                "Advanced Excel Skills"
            ],
            "secondary": [
                "communication skills",
                "interpersonal skills",
                "ability to manage multiple tasks",
                "teamwork"
            ],
            "all": [
                "analytical skills",
                "problem-solving skills",
                "process mapping",
                "financial accounting",
                "data analysis",
                "Oracle",
                "Power Query",
                "PowerPivot",
                "IBM Blueworks",
                "Visio",
                "Advanced Excel Skills",
                "communication skills",
                "interpersonal skills",
                "ability to manage multiple tasks",
                "teamwork"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Rudranarayana Dalei",
        "email": "rudranarayana@adventatech.com",
        "jd": "From: Rudranarayana Dalei, Adventa Tech rudranarayana@adventatech.com Reply to: rudranarayana@adventatech.com Position: Business Process Maps Business AnalystSite: Ocoee, FLWork Performed: OnsiteVisa Status: CITIZEN,GREEN CARD,GC EADMode : SkypeDuration : 6+ monthsJob term : ContractScope of ServicesFB&R Business Analyst (Entry) - This role requires a detail-oriented individual with strong analytical and problem-solving skills to lead the transformation of financial processes, books, and records to align with the new statewide accounting platform. Experience? Experience with Oracle or Transformation Implementations ? Power Query, PowerPivot is a plus ? Process modeling software such as IBM Blueworks or Visio Primary Job Duties/ TasksDevelop and maintain detailed current and future state process maps of financial operations, identifying opportunities for improvement and alignment with Florida PALM system requirements:? Lead the identification, documentation, and optimization of financial processes.? Conduct a comprehensive analysis and reconciliation of Chart of Accounts (COA) to align with Florida PALM.? Oversee the migration of financial data to the new system, ensuring data integrity and accuracy.? Develop and implement new Standard Operating Procedures (SOPs) for financial operations.? Develop and execute test plans to validate system functionality and data accuracy.? Collaborate with the Florida PALM Project Team and stakeholders to ensure successful transition. Job Specific Skills and Abilities (KSAs):? Bachelor’s degree in Accounting, Finance, or related field.? Minimum 3 years of experience in financial accounting and reporting.? Demonstrated Advanced Excel Skills? Demonstrated process mapping experience? Proven experience in process mapping and improvement.? Strong analytical and problem-solving skills.? Proficiency in financial systems and data analysis tools.? Excellent communication and interpersonal skills.? Ability to manage multiple tasks and meet deadlines.? Ability to work independently and as part of a team.RegardsRudranarayana Daleirudranarayana@adventatech.com",
        "source": "Email",
        "date_posted": "2024-10-29 09:37:25-05:00",
        "unique_id": "192d9006a7dd0b14",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]