[
    {
        "company": "Pure Imagination Labs",
        "job_title": "Producer/Project Manager",
        "location": "Salina, KS, USA",
        "full_location": {
            "city": "Salina",
            "state": "KS",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "7-10 years",
            "degree_required": "Bachelor’s degree in Project Management, Business, Engineering, and Digital Media or equivalent combination of education and experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Agile",
                "Waterfall",
                "resource management",
                "scheduling",
                "budgeting"
            ],
            "primary": [
                "PMP certification",
                "PMI-ACP certification",
                "Microsoft Office Suite",
                "Google Workspace",
                "project management software"
            ],
            "secondary": [
                "risk management",
                "problem-solving",
                "documentation systems",
                "technical specifications",
                "content development",
                "AI tools",
                "communication skills"
            ],
            "all": [
                "Project Management",
                "Agile",
                "Waterfall",
                "resource management",
                "scheduling",
                "budgeting",
                "PMP certification",
                "PMI-ACP certification",
                "Microsoft Office Suite",
                "Google Workspace",
                "project management software",
                "risk management",
                "problem-solving",
                "documentation systems",
                "technical specifications",
                "content development",
                "AI tools",
                "communication skills"
            ],
            "with_experience": [
                "Project Management (7-10 years)",
                "Agile",
                "Waterfall"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Devyani Kumari",
        "email": "devyani@absoluting.com",
        "jd": "From: Devyani Kumari, Absolute IT devyani@absoluting.com Reply to: devyani@absoluting.com Producer/Project Manager Job Location: Salina, Kansas Overview: Pure Imagination Labs' Producer provides high-level management and low-level production support for the company’s interactive and linear content development projects, helping to facilitate the company’s overall strategic, financial, and creative goals across various platforms. o Required On-Site: This position is required to be performed full-time o Required Residence: This candidate must live or reside in the state of Kansas; or relocate within six (6) months of offered employment. Basic Qualifications: • Bachelor’s degree in Project Management, Business, Engineering, and Digital Media is required or equivalent combination of education and experience. • Minimum 7-10 years of experience as a Producer or Project Manager in interactive development, with a track record from concept to delivery. • PMP (Project Management Professional), PMI-ACP, or equivalent certification preferred. • Solid expertise in resource management, scheduling, and budgeting using Agile, Waterfall, and rapid prototyping methodologies. • Proficiency in office software (e.g., Microsoft Office Suite, Google Workspace). Additional Qualifications: • Experience in managing comprehensive documentation systems, ensuring accuracy and version control. • Proven risk management and problem-solving skills, including producing risk assessments and contingency plans. • Familiarity with technical specifications for software integration and hardware setups. • Experience in content development for location-based projects. • Proficiency with project management software like Notion, Smart sheets, or similar tools. • Knowledge of AI tools and their application in workflow optimization. • Strong verbal and written communication skills, with the ability to interact effectively with internal teams, external vendors, and other stakeholders. • Ability to handle sensitive information with confidentiality and professionalism.",
        "source": "Email",
        "date_posted": "2024-10-29 11:03:23-05:00",
        "unique_id": "192d9247fba70bcc",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]