[
    {
        "company": "Stellar IT Solutions",
        "job_title": "Data/BI Engineer - BA",
        "location": "San Jose, CA, USA",
        "full_location": {
            "city": "San Jose",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "7+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SQL",
                "Data Analytics",
                "Data Profiling",
                "Data Modeling",
                "Business Intelligence"
            ],
            "primary": [
                "Python",
                "SAP S4HANA"
            ],
            "secondary": [
                "Product Management"
            ],
            "all": [
                "SQL",
                "Data Analytics",
                "Data Profiling",
                "Data Modeling",
                "Business Intelligence",
                "Python",
                "SAP S4HANA",
                "Product Management"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Rasitha Begum",
        "email": "rasithab@stellarit.com",
        "jd": "Hi, This is Rasitha from Stellar IT Solutions. I am reaching out to you on an exciting job opportunity with one of our clients. Position: Data /BI engineer (Adobe) Location: 345 Park Ave, San Jose, California, 95110-2704, United States Hybrid Duration: Long Term Job Title: Data/BI Engineer - BA Top Skills - Must Haves SQL Data Analytics Data Profiling Data Modeling Business Intelligence Top Skills' Details: - Must have strong Business Analysis skills (working with Product teams on translating analytics requirements to technical specs for Data Engineers) - Must have strong background building data models for data engineering - Must have strong SQL skills (for data profiling, querying, presenting outcome of profiling to business and engineering), good to have Python skills - Must be able to read code and understand business logic behind code - Must have data strong analytics experience - Good to have functional experience with SAP S4HANA - Good understanding of subscription business/ analytics for subscription business Secondary Skills - Nice to Haves Product Management Python Job Description • Lead, design and deploy business reporting and analytic solutions for Adobe's corporate teams. • Regularly interact with business partners to gather analytic requirements, discussing roadmap, and planning future objectives. • Bridge the gap between key business objectives and technical capabilities by providing fully coordinated solutions in partnership with the business. • Perform regular ad-hoc data querying and analysis to better understand areas such as bookings, billings, and revenue. • Partner with data engineering teams to implement business solutions and validate the product against requirements. • Perform impact analysis for business changes in collaboration with engineering. • Collaborate and partner on a day-to-day basis with business users, engineers, and managers to design, develop, deploy, operate, and support new business solutions. • Plan and establish post-delivery activities including ongoing application support. Additional Skills & Qualifications: What you need to succeed • 7+ years of experience working as a Business Analyst in the data analytics/BI space • Experience supporting analytics and data domains in Sales and finance processes, quarter-end and year-end financial close. • Good understanding of Subscription business models and the importance of customer journey touch points for delivering intelligent insights for measuring conversion and retention. • Experience working on data warehousing platforms (SQL, etc.) and business intelligence tools (Power BI, Tableau, etc.) • Experience in SAP SD and FICO modules highly desired • Functional experience on S/4 HANA (preferred) • Ability to understand strategy, goals and processes in Finance domain, translate them into business requirements, functional/system specifications. • Keeps commitments and completes assignments on time. Communicates clearly and shares information with teammates. Employee Value Proposition (EVP) Opportunity to work with large software subscription business/data associated Work Environment: Collaborative fast paced. Teams in San Jose and India. Positions are hybrid (2-3 days/week) in San Jose, CA Business Drivers/Customer Impact Why is the position open (provide details) S4 Hana data migration project and deadlines External Communities Job Description Our client in San Jose, CA is looking for experienced Business Analysts (BI/ Data Analytics) to join their team. Must sit onsite in San Jose, CA 2-3 times/week- Must have strong Business Analysis skills (working with Business, gathering requirements, translating to technical specs for Engineering) - Must have strong SQL skills (for data profiling, querying, presenting outcome of profiling to business and engineering) - Must be able to read code and understand business logic behind code",
        "source": "Email",
        "date_posted": "2024-10-29 13:15:00-05:00",
        "unique_id": "192d99d000e037fe",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]