[
    {
        "company": "Yempover",
        "job_title": "SAP Technical Project Manager",
        "location": "Omaha, NE, USA",
        "full_location": {
            "city": "Omaha",
            "state": "NE",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "15+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SAP ABAP",
                "SAP S/4 HANA",
                "SAP ERP",
                "Project Management"
            ],
            "primary": [
                "SAP implementation methodologies",
                "Microsoft Project",
                "JIRA",
                "Confluence",
                "Software Development Lifecycle"
            ],
            "secondary": [
                "Fiori",
                "Integration technologies",
                "SAP Basis infrastructure",
                "Security controls",
                "Organizational skills",
                "Communication skills",
                "Team collaboration",
                "Deadline management"
            ],
            "all": [
                "SAP ABAP",
                "SAP S/4 HANA",
                "SAP ERP",
                "Project Management",
                "SAP implementation methodologies",
                "Microsoft Project",
                "JIRA",
                "Confluence",
                "Software Development Lifecycle",
                "Fiori",
                "Integration technologies",
                "SAP Basis infrastructure",
                "Security controls",
                "Organizational skills",
                "Communication skills",
                "Team collaboration",
                "Deadline management"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "V. Patel",
        "email": "viqharpatel@yempover.com",
        "jd": "From: patel, yempover viqharpatel@yempover.com Reply to: viqharpatel@yempover.com SAP Technical Project ManagerLocation: Omaha, NE Job Description: Manages and implements SAP IT projects or programs with a defined start and end. Leads team members from various job families through a defined project life cycle. Plans, develops, coordinates, and assists with project activities through all project phases (e.g., project planning, execution, communication, financial management and issues/risk mitigation). Allocates, obtains, and manages resources and project management tools to achieve project objectives. Creates and implements assessment processes to enforce timely completion of projects in accordance with standards and requirements. Responsibilities: Develops detailed project plans and Schedules application/infrastructure projects, works closely with business analysts, developers and QA to execute the project.Manages the project lifecycle from initiation through to program closure.Manages and resolves risks, issues and dependencies.Leads and provides direction and guidance for a wide array of activities associated with project planning and management to ensure that projects are completed on time, within budget and to client specifications.Manages and oversees the end to end project management activities such as project reporting, project planning, issue / risk identification and tracking, scope management, estimation, client management, relationship management and other project documentation preparation for projects of high business complexity (involving multiple systems interfaces that are highly visible to the organization).Monitors project results for significant deviations and works collectively with Information Technology functions to address incidents and high priority defects.Maintains regular contact with clients and coordinates and reports on project progress and accomplishments.Requirements At least 15 years SAP Technical Project Manager preferably having SAP ABAP S/4 HANA background, and a proven track record of IT delivery across numerous large projectsHands on in SAP ERP or S/4HANA, 3-4 end to end implementation project experience is mustStrong SAP Knowledge, and has an SAP ERP Technical (SAP ABAP) background. Experience with SAP S/4HANA, ECC, and related technologies.Strong understanding of SAP implementation methodologies.10+ years of experience in SAP S/4HANA.In-depth knowledge and hands-on project experience with SAP software development/architecture and SAP base technology (ABAP, Fiori), Integration technologies , SAP Basis infrastructure, and security controlsExperience with project management tools such as Microsoft Project, JIRA, and Confluence.Strong technical background with an understanding of the software development lifecycle.Excellent organizational and communication skills.Ability to lead cross-functional teams and collaborate with business stakeholders.Ability to drive work, manage competing priorities and work under tight deadlines.Team player with a positive attitude and a willingness to help others.",
        "source": "Email",
        "date_posted": "2024-10-29 12:48:16-05:00",
        "unique_id": "192d98486408440a",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]