[
    {
        "company": "GVR INFO TEK",
        "job_title": "Senior Java Developer",
        "location": "Phoenix, AZ, USA",
        "full_location": {
            "city": "Phoenix",
            "state": "AZ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "3-5 years",
            "degree_required": "Bachelor's degree in Computer Science, Computer Engineering, Technology, Information Systems, Engineering, or a related technical field, or equivalent experience/training.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Angular",
                "JavaScript",
                "HTML",
                "CSS"
            ],
            "primary": [
                "Cloud development"
            ],
            "secondary": [
                "Analytical skills",
                "Problem-solving skills",
                "Team-oriented environment"
            ],
            "all": [
                "Java",
                "Angular",
                "JavaScript",
                "HTML",
                "CSS",
                "Cloud development",
                "Analytical skills",
                "Problem-solving skills",
                "Team-oriented environment"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Tarun Kumar",
        "email": "tarun.kumar@gvrinfotek.com",
        "jd": "From: Tarun Kumar, GVR INFO TEK tarun.kumar@gvrinfotek.com Reply to: tarun.kumar@gvrinfotek.com Senior Java DeveloperPhoenix, AZ – HybridUSC, GC, GCEAD & H4LinkedIn with profile photo 12+ Months F2F interview The ideal candidate will work collaboratively with leaders, IT architects, technical leads, and other developers to understand requirements and develop applications aligned with business needs. This role involves maintaining and enhancing existing enterprise services, applications, and platforms, with a focus on quality, performance, and security. Key Responsibilities:Collaborate with leaders, architects, technical leads, and internal customers to understand and define project requirements.Maintain and enhance enterprise services, applications, and platforms using domain-driven design and test-driven development.Troubleshoot and resolve complex technical issues; identify and implement effective solutions.Create detailed project specifications, requirements, and estimates.Research and integrate new technologies to improve current processes, security, and performance.Support the development and adherence to coding standards, best practices, and security guidelines.Work closely with software architects and technical leads to ensure alignment with long-term enterprise goals. Minimum Requirements:Education: Bachelor's degree in Computer Science, Computer Engineering, Technology, Information Systems, Engineering, or a related technical field, or equivalent experience/training.Experience: 3-5 years of experience in the Software Development Life Cycle (SDLC), with hands-on experience in designing, developing, and implementing large-scale applications in hosted production environments.Technical Skills: Proficient in Java, Angular, JavaScript, HTML, and CSS. Cloud development experience is a plus. Preferred Qualifications:Strong analytical and problem-solving skills.Ability to work effectively in a collaborative, team-oriented environment.",
        "source": "Email",
        "date_posted": "2024-10-29 13:14:56-05:00",
        "unique_id": "192d99cf0daebb50",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]