[
    {
        "company": "Adbakx",
        "job_title": "Oracle CPQ Project Manager",
        "location": "Irving, TX, USA",
        "full_location": {
            "city": "Irving",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "5+ years",
            "degree_required": "Bachelor of Technology, Bachelor of Engineering or Bachelor of Science",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle CPQ",
                "Project Management",
                "Agile methodologies",
                "Microsoft Visual Studio DevOps",
                "JIRA"
            ],
            "primary": [
                "Communication skills",
                "Analytical skills",
                "Organizational skills",
                "Leadership",
                "Consensus building"
            ],
            "secondary": [
                "Microsoft Project",
                "Smartsheet",
                "Manufacturing industry experience"
            ],
            "all": [
                "Oracle CPQ",
                "Project Management",
                "Agile methodologies",
                "Microsoft Visual Studio DevOps",
                "JIRA",
                "Communication skills",
                "Analytical skills",
                "Organizational skills",
                "Leadership",
                "Consensus building",
                "Microsoft Project",
                "Smartsheet",
                "Manufacturing industry experience"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Narender",
        "email": "narender@adbakx.com",
        "jd": "From: Narender, Adbakx narender@adbakx.com Reply to: narender@adbakx.com Job Title: Oracle CPQ Project ManagerLocation: Hybrid at Irving, TX (3 days a week)Position Type: ContractNote: Looking for a Technical Project Manager who extensively worked on Oracle Projects.Day to Day job Duties:The Project Manager will be responsible for a variety of project, program, and portfolio assignments within the Configure Price Quote (CPQ) Program Management Office (PMO). This individual is also responsible for business case development, planning, coordination/collaboration with various internal and vendor teams, project managing the end-to-end lifecycle of complex multi-application integration projects, and interface with business sponsors to provide periodic updates. The role will require working on multiple projects simultaneously.Responsibilities will include superior communication and interpersonal skills, the ability to work cross-functionally with other areas of the organization, strong analytical skills, a professional demeanor and the ability to participate in and lead teams are the keys to this position. Strong organizational skills are required to be able to effectively manage multiple projects and tasks simultaneously. The incumbent must be able to work in a highly visible, dynamic and fast paced environment. They must also have a curiosity, desire and strong enjoyment of diving into projects for the purpose of developing new insights.PRINCIPLE ACCOUNTABILITIESDevelops project scope, cost estimates, human resource requirements, work plans, time schedules, communication plans, and makes work assignments to meet project or program objectives.Establishes and monitors program priorities, objectives, and procedures, determining area objectives, targets of service, and resource needs allocation.Provides leadership and direction to the functional team so that tasks and activities are coordinated for project scope control, quality control, communication management, change control management, risk management and issue management.Develops and maintains records, prepares reports, and composes correspondence relative to the work.Coordinates work activities by scheduling staff assignments, setting the work priorities, and directing the work of assigned employees, (including contractual) in the development of new information technology systems and enhancements to existing systems.Resource will work out of Client site in Irving, Texas, office at minimum 3 days a week, preferably 4 days (skipping Friday).Basic Qualifications5+ years Working experience in Configure, Price and Quote (CPQ) applications, e.g. Oracle CPQMinimum of 5 years of experience as project manager in Enterprise setting.Bachelor of Technology, Bachelor of Engineering or Bachelor of Science is required.Industry standard Project Management Certifications (e.g. PMP, PMI-ACP)Experience in working and executing Projects using Agile methodologies.Ability to communicate effectively, build consensus, facilitate working sessions, and negotiate solutions and alternatives.Experience with Project Management principles, concepts and practices Experience with project life cycle management tools like Microsoft Visual Studio DevOps, JIRA.Experience in working with Project Management tools such as Microsoft Project, Smartsheet.Nice to Have:Working experience in a manufacturing industry will be an added advantage.ThanksNarendernarender@adbakx.com",
        "source": "Email",
        "date_posted": "2024-10-29 15:49:44-05:00",
        "unique_id": "192da2aa86e24e06",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]