[
    {
        "company": "RAPS Consulting, Inc",
        "job_title": "Sr. Data Engineer",
        "location": "Nashville, TN, USA",
        "full_location": {
            "city": "Nashville",
            "state": "TN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "12+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Snowflake",
                "AWS",
                "Python",
                "ETL"
            ],
            "primary": [
                "Cloud migrations",
                "Data pipelines",
                "Data warehousing",
                "CI/CD",
                "Automated testing",
                "Performance Engineering"
            ],
            "secondary": [
                "Git",
                "Bamboo",
                "Confluence",
                "Jira",
                "Problem solving",
                "Troubleshooting",
                "Communication",
                "Collaboration"
            ],
            "all": [
                "Snowflake",
                "AWS",
                "Python",
                "ETL",
                "Cloud migrations",
                "Data pipelines",
                "Data warehousing",
                "CI/CD",
                "Automated testing",
                "Performance Engineering",
                "Git",
                "Bamboo",
                "Confluence",
                "Jira",
                "Problem solving",
                "Troubleshooting",
                "Communication",
                "Collaboration"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Riyaz Mohd",
        "email": "riyaz@rapscorp.com",
        "jd": "Hello,This is Riyaz from RAPS Consulting Inc. I have a very urgent requirement with one of our esteemed clients. Please let me know if you are looking for new opportunities or if you have someone suitable for this role. Any references would be greatly appreciated!Please mention the locationa and linkedin URL of the cadidate while sharing the resume. Please share only local candidates with LinkedIn URL. Role: Sr. Data EngineerExp: 12+Location- Nashville, TNHybrid: 2-3 days WFO Experienced Data engineer responsible for developing, overseeing, organizing, storing, and analyzing data and data systems.Responsible for Cloud migrations for data pipelines using AWS and SnowflakeParticipate in all aspects of the software development lifecycle for AWS and Snowflake solutions, including planning, requirements, development, testing, and quality assurance.Work in tandem with our engineering team to identify and implement the most optimal cloud-based solutions.Troubleshoot incidents, identify root causes, fix and document problems, and implement preventive measures.Working experience on Snowflake PlatformWorking Cloud knowledge on AWS (Certification preferred)Working Snowflake knowledge with Designing data warehousesStrong hands-on experience in Python with ETL conceptsGood understanding on Metadata and data lineageAble to demonstrate experience with software engineering practices including CI/CD, Automated testing, and Performance Engineering.Good understanding and exposure on any Git, Bamboo, Confluence and Jira.Good problem solving and troubleshooting skills.Team player, collaborative approach, and excellent communication skills Candidate should be good in communication and articulation.",
        "source": "Email",
        "date_posted": "2024-10-29 09:33:03-05:00",
        "unique_id": "192d904d111f3aa2",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]