[
    {
        "company": "Conflux Systems INC",
        "job_title": "Java Developer",
        "location": "Berkeley Heights, NJ, USA",
        "full_location": {
            "city": "Berkeley Heights",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "1 year with possible extension",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Backend Development",
                "API Design",
                "Debugging"
            ],
            "primary": [
                "Payment Systems",
                "Collaboration",
                "Problem Solving"
            ],
            "secondary": [
                "Engineering Standards",
                "Security Best Practices",
                "System Design"
            ],
            "all": [
                "Java",
                "Backend Development",
                "API Design",
                "Debugging",
                "Payment Systems",
                "Collaboration",
                "Problem Solving",
                "Engineering Standards",
                "Security Best Practices",
                "System Design"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Uma Maheswari",
        "email": "uma@confluxsystems.com",
        "jd": "From: Uma Maheswari, Conflux Systems INC uma@confluxsystems.com Reply to: uma@confluxsystems.com Hi,Hope you are doing wellI am working on a position right now; If you are interested. Please let me knowHere are the job details for your reviewRole: Java Developer (Candidate’s should have Payment’s experience) Location: Berkeley Heights, NJ/ Pittsburgh, PA/ Alpharetta, GA/ Coral Springs, FL Duration: 1 year with possible extensionNote:Strong Experience on Backend Passport number mandatory.Relocation is fine.Role & ResponsibilitiesThe backend developer is responsible for developing and enhancing our payment platform and value-added tools. This is a complex payments system and has many features that our customers leverage every day to run their businesses. We are looking for candidates that aren’t afraid to dig into the system and become productive quickly. We value constructive feedback and want employees to feel comfortable proposing well thought out improvements and suggestions. · Work with a wide range of systems, processes, and technologies to own and solve problems from end-to-end. · Debug production issues across services and multiple levels of the stack. · Design, build, and maintain APIs, services, and systems. · Work with engineers across the company to build new features at scale. · The ability to thrive in a collaborative environment involving different stakeholders and subject matter experts. ·Pride in working on projects to successful completion involving a wide variety of technologies and systems. · Improve engineering standards, tooling, and processes. · Uphold best practices in engineering, security, and design. · Other duties, as assigned.",
        "source": "Email",
        "date_posted": "2024-10-29 10:44:27-05:00",
        "unique_id": "192d9132b4be147c",
        "emp_type": [
            "third party"
        ],
        "tag": "Java developer"
    }
]