[
    {
        "company": "State of Michigan",
        "job_title": "Project Manager 3",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "1 Year (with potential extension)",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Agile Leadership",
                "Microsoft DevOps"
            ],
            "primary": [
                "Change Management",
                "Stakeholder Communication",
                "Team Management",
                "Technical Support",
                "Performance Oversight"
            ],
            "secondary": [
                "Collaboration Skills",
                "Clear and Concise Communication"
            ],
            "all": [
                "Project Management",
                "Agile Leadership",
                "Microsoft DevOps",
                "Change Management",
                "Stakeholder Communication",
                "Team Management",
                "Technical Support",
                "Performance Oversight",
                "Collaboration Skills",
                "Clear and Concise Communication"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Shashank Bajpai",
        "email": "shashank@scstech.us",
        "jd": "From: Shashank Bajpai, Sita Consulting shashank@scstech.us Reply to: shashank@scstech.us 📢 State of Michigan – Project Manager 3 Opportunity🕒 Submission Deadline: 11/1 at 10 AM EST📍 Location: Lansing, MI – Hybrid (Onsite Tuesday & Wednesday)📅 Duration: 1 Year (with potential extension)💼 Interviews: MS Teams Video (Camera ON)🚗 Parking: $5/day; passes available through DTMB Role Overview:The State of Michigan is seeking a skilled Project Manager 3 to lead a complex $20 million modernization project. This hybrid role requires strong change and vendor management skills, along with proficiency in Microsoft DevOps.General Responsibilities:Project Leadership: Design, plan, and coordinate cross-functional teams; manage scope, budget, and schedule using PMI’s framework.Stakeholder Communication: Establish communication plans and risk mitigation strategies, effectively engaging with project sponsors and team members.Team Management: Assign responsibilities, foster collaboration, and evaluate outcomes to ensure productivity and quality.Change Management: Organize resources to monitor and adjust project plans as needed, ensuring alignment with business objectives.Technical Support: Offer guidance to team members on complex application features and systems integration.Performance Oversight: Track progress, take corrective actions, and prepare progress reports for leadership.Top Skills & Required Experience:5+ years managing projects with budgets over $5 million.5+ years Agile Leadership experience.10+ years in project management (recent position).2+ years Microsoft DevOps experience.Collaboration Skills: Experience coordinating with other project managers for seamless technology integration.Clear and Concise Communication: Strong communication skills for stakeholder interactions.Previous experience with the State of Michigan is a plus!This role offers a chance to make a significant impact on a high-stakes modernization initiative within the State of Michigan. Local candidates only, please. Apply today to be part of an innovative team driving change!",
        "source": "Email",
        "date_posted": "2024-10-29 10:10:22-05:00",
        "unique_id": "192d8f3f9d687ed5",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]