[
    {
        "company": "Dimiour",
        "job_title": "Technical Program Manager",
        "location": "St. Louis, MO, USA",
        "full_location": {
            "city": "St. Louis",
            "state": "MO",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Agile",
                "Scrum",
                "JIRA",
                "Scaled Agile Framework",
                "TDD"
            ],
            "primary": [
                "Data driven decision-making",
                "Continuous improvement methodologies",
                "Team delivery metrics",
                "Communication"
            ],
            "secondary": [
                "Mentoring",
                "Coaching",
                "Project management",
                "Software development"
            ],
            "all": [
                "Agile",
                "Scrum",
                "JIRA",
                "Scaled Agile Framework",
                "TDD",
                "Data driven decision-making",
                "Continuous improvement methodologies",
                "Team delivery metrics",
                "Communication",
                "Mentoring",
                "Coaching",
                "Project management",
                "Software development"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Dimiour Midunsathyaa",
        "email": "midunsathyaa.subramanian@dimiour.io",
        "jd": "From: Midunsathyaa, Dimiour midunsathyaa.subramanian@dimiour.io Reply to: midunsathyaa.subramanian@dimiour.io Role Title: Technical Program ManagerDuration: Long Term ContractLocation: St. Louis, MO [Onsite] Job description:The Role-Successfully deliver major projects and complex assignments with broad scope and long-term business implications. Our TPMs conceptualize, rationalize, and drive multiple simultaneous projects to deliver engineering work across the portfolio in our scrum execution model. You will contribute to the strategies and design choices to build comprehensive believable and achievable execution plans to deliver new features and capabilities for our customers. You may drive the execution of a feature through the full stack or may drive a project which spans multiple teams and integrations, reporting meaningful status along the way.All about you-Well versed in multiple Agile workflow tools, specifically with JIRAManages scrum team(s) that will build, operate and maintain software to meet business needsObsessed with results, and effectively communicate the objectives and how success will be measured to the team members.Develop and drive metrics for team delivery through in-house and vendor (SaaS) based tools.Act as Scrum Master / SAFe agilist and drive all ceremoniesImplement Scaled Agile Framework and / or other Agile methodologiesEnjoys diving deep to understand platform capabilities and underlying technologies. Proven track record of data driven decision-making and applying continuous improvement methodologies across teams Can debate the delivery strategy with business teams, architects, engineers, and designers Can communicate to executives, peers, and staff with impact, eloquence, and authenticityGuide, mentor & coach the team(s) on Agile Scrum, SaFe and TDD principles",
        "source": "Email",
        "date_posted": "2024-10-29 10:03:29-05:00",
        "unique_id": "192d91749c1964f0",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Scrum Master"
    }
]