[
    {
        "company": "GVR Infotek",
        "job_title": "Adabas Linux Database Administrator (DBA)",
        "location": "Quincy, MA, USA",
        "full_location": {
            "city": "Quincy",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Bachelor’s degree in Computer Science, Information Systems, Business Administration, or a related field.",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Long Term Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Adabas",
                "Linux",
                "AWS",
                "Database Administration",
                "Natural"
            ],
            "primary": [
                "RedHat",
                "SuSe",
                "CentOS",
                "Cloud Knowledge",
                "Performance Monitoring",
                "Backup and Recovery",
                "Optimization"
            ],
            "secondary": [
                "Microsoft 365",
                "Excel",
                "Word",
                "PowerPoint",
                "Access",
                "Visio",
                "Jira Software",
                "System Management Tools",
                "State Health Exchange Knowledge"
            ],
            "all": [
                "Adabas",
                "Linux",
                "AWS",
                "Database Administration",
                "Natural",
                "RedHat",
                "SuSe",
                "CentOS",
                "Cloud Knowledge",
                "Performance Monitoring",
                "Backup and Recovery",
                "Optimization",
                "Microsoft 365",
                "Excel",
                "Word",
                "PowerPoint",
                "Access",
                "Visio",
                "Jira Software",
                "System Management Tools",
                "State Health Exchange Knowledge"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Tarun Pratap",
        "email": "tarun.pratap@gvrinfotek.com",
        "jd": "From: Tarun Pratap, GVR Infotek tarun.pratap@gvrinfotek.com Reply to: tarun.pratap@gvrinfotek.com Job Title: Adabas Linux Database Administrator (DBA)Location: Quincy, MA - HybridDuration: Long Term ContractMOI: SkypeCandidates MUST be local from one of the following States: MA, RI, CT, or NHNeed: Visa/Linked IN/GC/DLAll submittals must include ID proof of residency of one of these States.Position OverviewMA21 is seeking a highly motivated Adabas Linux Database Administrator (DBA) to support the \"Lift and Shift\" of our on-premises legacy mainframe application to the AWS Cloud. This role will be integral to our cloud rehosting project, ensuring maintenance enhancements and defect fixes meet the business community's requirements.Key ResponsibilitiesSystem Monitoring and Maintenance: Ensure the stability of Adabas/Natural applications in a Cloud-based, distributed Linux server environment.Linux OS Support: Experience with RedHat (preferred), SuSe, and CentOS, along with a solid understanding of Linux architecture, commands, and utilities.Cloud Knowledge: Fundamental knowledge of AWS and Azure platforms.Product Support: Manage a range of Software AG (SAG) and third-party products to maintain a stable technical infrastructure.Database Design: Design and implement Adabas databases for optimal performance and scalability.Issue Resolution: Provide timely support for database-related issues.EntireX Knowledge: Understanding of EntireX Communicator (RPC & ACI Protocol).Performance Monitoring: Use tools like Adabas Manager and Adabas Performance Monitor to monitor and resolve performance issues.Backup and Recovery: Develop and implement backup and recovery procedures using Adabas tools.Optimization: Optimize database performance through query optimization, indexing, and buffer pool management.Natural Environment Administration: Manage the Natural development environment and utilize Adabas Utilities for database maintenance. QualificationsExperience:Minimum of 10 years in Information Technology.At least 5 years as an Adabas Database Administrator.Technical Skills:Proficiency in business modeling, process modeling, and data modeling.Knowledge of computer systems analysis, design, and relevant technical terminology.Familiarity with system management tools, both console and web-based.Vendor Collaboration: Ability to work with multiple vendors.Software Proficiency: Experience with Microsoft 365, Excel, Word, PowerPoint, Access, Visio, and Jira Software.State Health Exchange Knowledge: Understanding of MA HIX or other State Health Exchanges is a plus. Education and CertificationsBachelor’s degree in Computer Science, Information Systems, Business Administration, or a related field.",
        "source": "Email",
        "date_posted": "2024-10-29 11:28:08-05:00",
        "unique_id": "192d93b2aba37194",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "DB Admin"
    }
]