[
    {
        "company": "American Airlines",
        "job_title": "Java Developer",
        "location": "Tempe, AZ, USA",
        "full_location": {
            "city": "Tempe",
            "state": "AZ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "3-5 years",
            "degree_required": "Bachelor's degree in Computer Science, Computer Engineering, Technology, Information Systems, CIS/MIS, Engineering or related technical discipline or equivalent experience/training",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$65/hr"
        },
        "skills": {
            "core": [
                "Java",
                "Angular",
                "Javascript",
                "HTML",
                "CSS"
            ],
            "primary": [
                "Cloud Development"
            ],
            "secondary": [],
            "all": [
                "Java",
                "Angular",
                "Javascript",
                "HTML",
                "CSS",
                "Cloud Development"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Muskan Sharma",
        "email": "muskan.sharma@infotechspectrum.com",
        "jd": "From: Muskan, infotech muskan.sharma@infotechspectrum.com Reply to: muskan.sharma@infotechspectrum.com Hi,Java DeveloperHybrid Tempe, Arizona. American Airlines. Onsite interview required. $65/hr c2c. USC/GC ONLY Top 3-5 skills below: • Java • Angular • Javascript • HTML, CSS • Cloud Development This job description is for a position on the AA.com Search team part of the American Airlines Information Technology Team. The candidate will be responsible for leveraging cutting edge technology to solve complex business problems by participating in all phases of the development process from inception through transition. Also to be an advocate for using the agile process and test-driven development using object-oriented development tools to analyze model design construct and test reusable objects and making the codebase a better place to live and work. What you'll do - Collaborates with leaders IT architects technical leads and other developers along with internal customers to understand requirements and develop needs according to business requirements - Maintains and enhances existing enterprise services applications and platforms using domain driven design and test-driven development - Troubleshoots and debugs complex issues identify and implement solutions - Creates detailed project specifications requirements and estimates - Research and implement new technologies to enhance current processes security and performance - Support the development of coding standards and adheres to best practices and security guidelines - Work closely with software architects and technical leads to ensure decisions meet long-term enterprise growth needs - Qualifications: - Minimum Qualifications- Education Prior Job Experience - Bachelor's degree in Computer Science Computer Engineering Technology Information Systems CIS/MIS Engineering or related technical discipline or equivalent experience/training - 3-5 years of full Software Development Life Cycle SDLC experience designing developing and implementing large-scale applications in hosted production environments - Proficient in Java Angular Javascript HTML CSS - Cloud development experience a plus Thank YouBest RegardsMuskan SharmaInfoTech Spectrum Inc2060, Walsh Ave, #120, Santa Clara, CA 95050Email : muskan.sharma@infotechspectrum.com Web: www.infotechspectrum.com",
        "source": "Email",
        "date_posted": "2024-10-29 14:58:04-05:00",
        "unique_id": "192da35e6434f53f",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]