[
    {
        "company": "VBeyond Corporation",
        "job_title": "ServiceNow Project Manager",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "8+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "Long Term Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Customer Engagement",
                "ServiceNow"
            ],
            "primary": [
                "Cross-functional project management",
                "Data analytics",
                "Documentation",
                "Presentation",
                "Negotiation",
                "Facilitation"
            ],
            "secondary": [
                "Knowledge of ServiceNow ITAM",
                "Knowledge of ServiceNow CMP"
            ],
            "all": [
                "Project Management",
                "Customer Engagement",
                "ServiceNow",
                "Cross-functional project management",
                "Data analytics",
                "Documentation",
                "Presentation",
                "Negotiation",
                "Facilitation",
                "Knowledge of ServiceNow ITAM",
                "Knowledge of ServiceNow CMP"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Akash Raj Srivastava",
        "email": "akashr@vbeyond.com",
        "jd": "Dear Vendor Partner,My name is Akash Raj Srivastava, and I represent VBeyond Corporation, a global recruitment firm with 18+ years of industry experience. We specialize in sourcing and placing highly skilled talent to meet the unique needs of our clients.Our client is seeking a ServiceNow Project Manager for a Remote position. Please share if you have any suitable candidate for this role – PLEASE SHARE PROFILES WITH 10+ YEARS OF EXPERIENCE, LOCAL TO CALIFORNIA OR PST-TIME ZONE REQUIRED. CANDIDATES ON H1B VISAS ARE PREFERRED. Job Title: ServiceNow Project ManagerLocation: RemoteDuration: Long Term ContractExperience:Role Overview: Lead key internal and external initiatives, focusing on adding value to customers and driving organizational innovation.Project Management:Oversee cross-functional projects and manage senior executives and customer relationships.Provide regular updates to customers and internal teams.Guide each project phase, managing both internal and external cross-functional teams.Strategic Initiatives: Participate in initiatives that influence project direction and strategy.Develop and present value propositions to customers.Mentorship: Mentor team members to meet engagement goals and support customer objectives.Performance Management: Identify and address gaps in project performance.Experience Requirements:6+ years in the high-tech/SaaS industry.8+ years in Customer Engagement or Project Management.Experience implementing or supporting ServiceNow products.Technical & Soft Skills:Strong cross-functional project management, including planning, scheduling, and reporting.Excellent documentation, presentation, negotiation, and facilitation skills.Proficiency with data analytics, metrics, and KPIs for customer performance tracking.Desirable Skills: Knowledge of ServiceNow ITAM and ServiceNow CMP Please share your consultant’s updated resume along with their visa copy, photo ID, and I-94 details.",
        "source": "Email",
        "date_posted": "2024-10-29 12:36:08-05:00",
        "unique_id": "192d9796dca0834e",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]