[
    {
        "company": "NatWest Bank",
        "job_title": "Middle Office Business Analyst",
        "location": "Stamford, CT, USA",
        "full_location": {
            "city": "Stamford",
            "state": "CT",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "1 Year +",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Fixed Income products",
                "Repo Processing",
                "Triparty Processing",
                "Central Clearing",
                "Fixed Income settlements",
                "collateral management",
                "funding"
            ],
            "primary": [
                "detail oriented",
                "problem solving",
                "US regulatory requirements",
                "Broker Dealer Operations"
            ],
            "secondary": [],
            "all": [
                "Fixed Income products",
                "Repo Processing",
                "Triparty Processing",
                "Central Clearing",
                "Fixed Income settlements",
                "collateral management",
                "funding",
                "detail oriented",
                "problem solving",
                "US regulatory requirements",
                "Broker Dealer Operations"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Abhishek Saini",
        "email": "abhishek.s@infotechspectrum.com",
        "jd": "From: abhishek saini, infotechspectrum abhishek.s@infotechspectrum.com Reply to: abhishek.s@infotechspectrum.com Middle Office Business Analyst Stamford, Connecticut, (Hybrid) – onsite 2 days a week Client - NatWest Bank through GFT Consulting Any Visa except H4 and OPT or H1bVideo InterviewStart Date: ASAP need financial or banking business analyst candidate. Duration: 1 Year + : Client will execute Quarterly SOW’s Start Date: ASAP Role:• Operational lead owning and remediating front end & time sensitive issues ensuring trade lifecycle flow.• Collect, review, and challenge Broadridge Standard Operating Procedures and daily output, working with Broadridge and internal stakeholders to highlight concerns and remediate incidents.• Ensure Broadridge preparedness on any Industry, Change, and Regulatory initiatives.• Identify and own opportunities to re-engineer processes & controls from a simplification, cost saving, regulatory, and customer perspective.• Attendance at regular governance meetings with service providers – ensure issues are raised and actioned, meetings are well documented, required procedural changes are discussed and agreed, audit results are reviewed and addressed.• Maintaining an effective control environment through review and distribution of policy updates, SOX/RACA identification and creation of controls, adequacy reviews and testing, MI Review and Reporting, and maintenance of governance documentation• Effectively manage key relationships and work closely with regional and global teams across the organization including front office, operations, compliance, finance, and technology. • Perform and deliver project work in collaboration with other teams, regionally and globally, to align with the bank’s strategy.• Regular reporting to management on status of outsourced and offshored activities, with particular attention to any risks, issues, and remediation actions. Requirements:• Must have a strong front to back understanding of Fixed Income products, Repo / Triparty Processing, and Central Clearing. • Extremely detail oriented, hard-worker, positive attitude and enthusiasm for solving complex problems.• Strong knowledge of Fixed Income settlements, collateral management, and funding.• Direct understanding of US regulatory requirements specific to Broker Dealer Operations.",
        "source": "Email",
        "date_posted": "2024-10-29 13:48:08-05:00",
        "unique_id": "192d9f5511523122",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]