[
    {
        "company": "Yochana IT Solutions INC",
        "job_title": "Python Developer",
        "location": "Washington, DC, USA",
        "full_location": {
            "city": "Washington",
            "state": "DC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "More than 5 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long term contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Python Programming",
                "Angular",
                "Azure SQL"
            ],
            "primary": [
                "Object-Oriented Programming",
                "Relational Databases",
                "Pandas",
                "NumPy",
                "Scikit",
                "Beautiful Soup",
                "Matplotlib",
                "Azure Storage",
                "Key Vault"
            ],
            "secondary": [
                "Technical writing",
                "Effective communication",
                "Agile Development Methodology",
                "Troubleshooting",
                "Performance tuning",
                "Process modeling techniques"
            ],
            "all": [
                "Python Programming",
                "Angular",
                "Azure SQL",
                "Object-Oriented Programming",
                "Relational Databases",
                "Pandas",
                "NumPy",
                "Scikit",
                "Beautiful Soup",
                "Matplotlib",
                "Azure Storage",
                "Key Vault",
                "Technical writing",
                "Effective communication",
                "Agile Development Methodology",
                "Troubleshooting",
                "Performance tuning",
                "Process modeling techniques"
            ],
            "with_experience": [
                "Python Programming (5+ years)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Jayasurya",
        "email": "jayasurya@yochana.com",
        "jd": "Hello, Hope you are doing Well! I'm currently staffing for an Python Developer at Washington, DC (Onsite). Below you will find the job description, if you are qualified and interested please send me your Updated Word Document Resume to Jayasurya@yochana.com. My apologies if this position is not an ideal fit, we'll keep you in mind for other suitable positions and referrals would be appreciated. Thank you in advance. Title: Python Developer Location: Washington, DC (Onsite) Duration: Long term contract on W2 Preferred/Desired skills Python Programming, Azure SQL & Angular Job Description More than 5 years of experience in Design, Build and Development of Python based applications and programs. In-depth theoretical understanding and practical expertise regarding enterprise Information Management Systems The Python Developer will need to have very good development exposure in Python language with having individually developed, maintained Python programs, and be a go to person in Python programming. Good Knowledge in Angular is must Ability to work individually, given a task/ problem, without having to rely for guidance in Python programming. Strong technical writing/documentation skills. Effective written and oral communication skills. Ability to take technical concepts and explain them in widely understandable terms. Ability to operate under pressure and multi-task, must demonstrate strong bias for action, follow-through, and personal leadership. Ability to develop and drive integration and automation of systems using Python language. Strong Object-Oriented Program design and implementation skills Good understanding of design patterns and experience in implementing them in code Strong Knowledge of Relational Databases, preferably Azure SQL Extensive understanding and knowledge of various python libraries like Pandas, NumPy, Scikit, Beautiful Soup, Matplotlib etc. Hands on experience working with Azure Storage, Key Vault Troubleshooting & performance tuning of Python programs/ applications All phases of software development life cycle including analysis, design, implementation, testing and deployment Understanding of Parquet file format Exceptional communication skills in English both written and oral Agile Development Methodology Ability to troubleshoot and resolve complex production issues. Familiarity with various process modeling techniques (activity hierarchy diagrams, data flow diagrams, sequence diagrams, workflow diagrams, system interface diagrams)",
        "source": "Email",
        "date_posted": "2024-10-29 14:45:30-05:00",
        "unique_id": "192d9efd8ffdcd0c",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Python developer"
    }
]