[
    {
        "company": "ZealHire Inc",
        "job_title": "Sr. Data Engineer",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "9+ Years",
            "degree_required": "Bachelor of Science degree in Computer Science or equivalent",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$55-60/hr on C2H"
        },
        "skills": {
            "core": [
                "Teradata",
                "ETL Development",
                "Database Management",
                "Data Warehousing",
                "SQL"
            ],
            "primary": [
                "Python",
                "PLSQL",
                "Cloud Integration",
                "Data Modeling",
                "Data Security & Governance",
                "Cloud Infrastructure",
                "Automation and DevOps"
            ],
            "secondary": [
                "Vantage Master 2.0 certifications",
                "Vantage Data Science Master certifications",
                "Airline industry experience",
                "Mentoring",
                "Data Quality Assessment",
                "AWS services",
                "Shell scripting",
                "Query optimization techniques"
            ],
            "all": [
                "Teradata",
                "ETL Development",
                "Database Management",
                "Data Warehousing",
                "SQL",
                "Python",
                "PLSQL",
                "Cloud Integration",
                "Data Modeling",
                "Data Security & Governance",
                "Cloud Infrastructure",
                "Automation and DevOps",
                "Vantage Master 2.0 certifications",
                "Vantage Data Science Master certifications",
                "Airline industry experience",
                "Mentoring",
                "Data Quality Assessment",
                "AWS services",
                "Shell scripting",
                "Query optimization techniques"
            ],
            "with_experience": [
                "Teradata (9+ years)",
                "ETL Development (4+ years)",
                "Database technologies (3+ years)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Avinash Kumar",
        "email": "avinash@zealhire.com",
        "jd": "From: Avinash Kumar, ZealHire Inc avinash@zealhire.com Reply to: avinash@zealhire.com Position: Sr. Data Engineer with Airlines Domain (Very Strong Teradata)Location: Local to Atlanta, GA OnlyVisa required: USC/GCDesired years of experience: 9+ YearsRate: $55-60/hr on C2HUSC/GCneed LinkedIn, VISA DLLocal to ATL -- ***Due to client requirements this role is only open to USC or GC candidates*** Job Summary:Qualifications:The Opportunity: The Senior Data Engineer will play a leading role on the Enterprise Data Services team, responsible for transforming data from disparate systems to provide insights and analytics for business stakeholders. You’ll leverage cloud-based infrastructure to implement technology solutions that are scalable, resilient, and efficient. You will collaborate with Data Engineers, Data Analysts, DBAs, cross-functional teams, and business leaders. You will architect, design, implement and operate data engineering solutions, using Agile methodology, that empower users to make informed business decisions.Candidate: You are self-motivated, work independently, and have direct experience with all aspects of the software development lifecycle, from design to deployment. You have a deep understanding of the full life data lifecycle and the role that high-quality data plays across applications, machine learning, business analytics, and reporting. Strong candidates will exhibit solid critical thinking skills, the ability to synthesize complex problems, and a talent for transforming data to create solutions that add value to a myriad of business requirements.You have the demonstrated ability to lead and take ownership of assigned technical projects in a fast-paced environment. Excellent written and speaking communication skills are required as we work in a collaborative cross-functional environment and interact with the full spectrum of business divisions. You demonstrate unsatiated curiosity and outstanding interpersonal “soft” skills. Ideal candidates have more than just knowledge or skill set, as they also have a “can do” mindset to find solutions.You have demonstrated ability to serve as a liaison with business users and walk with them through their problems to identify the best path forward. You are also expected to provide technical counsel to other Data Engineers on the team and may be requested to review and guide their work to ensure all the work comes together successfully to meet the business need.Preferred Qualifications:· Bachelor of Science degree in Computer Science or equivalent· Vantage Master 2.0 certifications / Vantage Data Science Master certifications· At least 7 years of post-degree professional experience· Airline industry experience· 4+ years development experience building and maintaining ETL pipelines· 3+ years of experience working with database technologies and data development such as Python, PLSQL, etc.· Experience in mentoring junior team members through code reviews and recommend adherence to best practices· Deep understanding of writing test cases to ensure data quality, reliability and high level of confidence· Track record of advancing new technologies to improve data quality and reliability· Continuously improve quality, efficiency, and scalability of data pipelines· Expert skills working with queries/applications, including performance tuning, utilizing indexes, and materialized views to improve query performance· Identify necessary business rules for extracting data along with functional or technical risks related to data sources (e.g. data latency, frequency, etc.)· Develop initial queries for profiling data, validating analysis, testing assumptions, driving data quality assessment specifications, and define a path to deployment· Familiar with best practices for data ingestion and data designKey Responsibilities and Skillets:· Database Management, ETL Development, have used tools like Teradata Utilities (e.g., BTEQ, FastLoad, MultiLoad, TPT, etc.), Data Modeling, DB Performance Tuning, Data Security & Governance, Cloud Integration and Management, Cloud Infrastructure, Automation and DevOps, Data Warehousing and Analytics, Security and Compliance· In-depth knowledge of Teradata architecture and components (e.g., AMP, Nodes, Parsing Engines, etc.).· Proficiency in Teradata SQL and Teradata utilities.· Strong SQL skills for querying and managing relational databases.· Scripting experience (e.g., Shell, Python) for automating tasks.· Knowledge of query optimization techniques, indexing, partitioning, and workload management in Teradata.· Proficiency with core AWS services: EC2, S3, RDS, Lambda, CloudWatch, CloudFormation, etc.· Familiarity with AWS storage options, such as S3, EFS, and Glacier, in the context of large-scale data storage and retrieval.· Knowledge of AWS services that enhance Teradata performance, such as using S3 for staging data or integrating with Redshift for analytics.· Hands-on experience with AWS CloudFormation, Terraform, or similar tools for automating infrastructure deployment.· Proficiency in automating ETL pipelines and data processing workflows using AWS Lambda, Step Functions, or AWS Glue.",
        "source": "Email",
        "date_posted": "2024-10-29 07:55:27-05:00",
        "unique_id": "192d878722aee11c",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]