[
    {
        "company": "diasoftwaresolutions",
        "job_title": "Sr. Program Manager/ Change Manager",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "8 years",
            "degree_required": "Bachelor's degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "change management",
                "project analysis",
                "data management tools",
                "communication skills",
                "analytical skills"
            ],
            "primary": [
                "IBM Knowledge Catalog",
                "Data Stage",
                "Snowflake",
                "Collibra",
                "Safe FME",
                "ArcGIS Enterprise",
                "training plans",
                "project management tools"
            ],
            "secondary": [
                "government agencies experience",
                "large-scale organizations experience",
                "excellent verbal skills",
                "advanced presentation skills",
                "organizational skills",
                "time management skills",
                "matrixed organization navigation"
            ],
            "all": [
                "change management",
                "project analysis",
                "data management tools",
                "communication skills",
                "analytical skills",
                "IBM Knowledge Catalog",
                "Data Stage",
                "Snowflake",
                "Collibra",
                "Safe FME",
                "ArcGIS Enterprise",
                "training plans",
                "project management tools",
                "government agencies experience",
                "large-scale organizations experience",
                "excellent verbal skills",
                "advanced presentation skills",
                "organizational skills",
                "time management skills",
                "matrixed organization navigation"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Vineela",
        "email": "vineela@diasoftwaresolutions.com",
        "jd": "From: Vineela, diasoftwaresolutions vineela@diasoftwaresolutions.com Reply to: vineela@diasoftwaresolutions.com Subject Need Sr. Program Manager/ Change Manager Richmond, VA Hi, I am reaching out to you about an exciting job opportunity with one of our clients. Please review the requirements and let me know if you are interested in this position. Job Title: Sr. Program Manager/ Change Manager Richmond, VA Location: Richmond, VA Mode of Interview: Both Web Cam and In Person Interview Work Arrangement: Onsite Job Description:The Senior Program Analyst for Change Management will lead business-focused efforts to implement critical data management tools, including IBM Knowledge Catalog, Data Stage, Snowflake, Collibra, Safe FME, and ArcGIS Enterprise. This role will focus on managing change initiatives for data program impacting a very large group of end users. Analyst in this role will create strategic communications, engage with stakeholders within IT and business, support leadership, and develop a robust training plan to ensure effective adoption of these tools.Responsibilities:Design and implement a change management framework to support the introduction of new data management tools across the organization.Collaborate with project teams to ensure change management activities align with broader project timelines and objectives.Engage with stakeholders to understand their concerns and ensure smooth adoption of new technologies.Develop and execute change management and communication plans tailored to large-scale implementation.Analyze current processes, identifying barriers to successful change, and develop strategies to overcome them.Secure leadership support and commitment for successful implementation and user adoption.Develop a comprehensive training plan to educate and guide the 8,000+ end users in effectively using the new tools.Create and distribute communication materials, presentations, and training to guide end users through the changes.Establish feedback loops to gather insights from end users and adjust strategies to improve adoption.Track, evaluate, and report progress on change initiatives using established change management models and frameworks.Coach and provide guidance to the leadership in managing and supporting the transition.Knowledge, Skills and Abilities:Bachelor s degree with a minimum of 8 years of experience in change management, project analysis, or a related field.Certification in change management (e.g., Prosci or similar).Extensive experience managing large-scale projects impacting 5,000+ end users.In-depth knowledge and experience with data management tools such as IBM Knowledge Catalog, Data Stage, Snowflake, Collibra, Safe FME, and ArcGIS Enterprise.Strong understanding of change management principles, methodologies, and tools.Experience working with government agencies or large-scale organizations.Experience developing comprehensive training plans for end users.Knowledge of project management tools and methodologies.Excellent written and verbal communication skills, with the ability to simplify complex concepts for diverse audiences.Strong analytical and problem-solving skills, with the ability to address barriers to successful change implementation.Ability to work independently in a fast-paced and dynamic environment.Required Skills:8 Years - Extensive change management experience in a large organization5 Years - Program Management - Software Development5 Years - Enterprise Data Management5 Years - Excellent Verbal/Written skills5 Years - Advanced Presentation skills5 Years - Demonstrated organizational and time management skills5 Years - Ability to navigate and function in a matrixed organization.",
        "source": "Email",
        "date_posted": "2024-10-29 12:33:08-05:00",
        "unique_id": "192d976ace9f307c",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]