[
    {
        "company": "Yochana IT Solutions",
        "job_title": "Software Engineer",
        "location": "Austin, TX, USA",
        "full_location": {
            "city": "Austin",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Python"
            ],
            "primary": [
                "Machine Learning",
                "Artificial Intelligence",
                "Communication Skills"
            ],
            "secondary": [],
            "all": [
                "Python",
                "Machine Learning",
                "Artificial Intelligence",
                "Communication Skills"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Clara Kunigiri",
        "email": "clara@yochana.com",
        "jd": "From: clara, Yochana clara@yochana.com Reply to: clara@yochana.com Hi Hope you are doing good. I wanted to reach out to you today because we have an open position for a Software Engineer with one of our Clients. The client has a strong reputation in the industry for being a top company to work for. The management and staff provide a great work-life balance with many perks for their employeesRole: Software Engineer Location: Austin TX (Remote)Mandatory : Python coding , 5+ years of experience with 2-3 years of ML/AI experienceCandidate should be okay with the software development support workfor this role, we need someone strong in python codingVery good communication skills are required Job Description:Provide Development support to Software development community across the organization by managing, maintaining, and troubleshooting client’s internal software application and tooling.Communicate with co-workers to diagnose problems and resolve problems.Prioritize a workload to ensure the most critical issues are resolved first and document standard support procedures that co-workers may follow. Roles and responsibilities:- 1. Respond to and triage support questions and support requests from Client engineers 2. Follow internally developed support processes and workflows 3. Communicate and escalate issues to the proper engineering teams or owners for resolution as necessary4. Use Client’s tools to investigate problems and correlate them to release events or code rollouts 5. Extract relevant information from log files and other sources to debug, identify owners or root causes 6. Apply basic debugging techniques and relevant tools to clarify issues and add relevant information for owners 7. Write basic tools and test cases to improve the speed and quality of support 8. Work with technical writers to improve documentation in areas covered by support 9. Produce reports for leadership with data on performance of the program 10. Assist with scaling the program to new areas, onboarding new hires and measuring success 11. Champion user support issues and advocate for user experience and product support12. Provide insights and suggestions on product development and the product roadmap; contribute to product development Thanks & regards,Clara KunigiriResource SpecialistYochana IT Solutions23000 Commerce Dr., Farmington hills, MI-48335clara@yochana.com|| www.yochana.comJoin the Referral Revolution of Yochana by Sharing, Earning, and Empowering! Ask us about our rewarding referral program",
        "source": "Email",
        "date_posted": "2024-10-29 11:23:12-05:00",
        "unique_id": "192d99bba497164d",
        "emp_type": [
            "third party"
        ],
        "tag": "Python developer"
    }
]