[
    {
        "company": "Cloud Think Tech Inc.",
        "job_title": "Sr. Oracle ERP Business Analyst (Oracle Cloud)",
        "location": "Memphis, TN, USA",
        "full_location": {
            "city": "Memphis",
            "state": "TN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "3-5 years",
            "degree_required": "Bachelor’s degree in information systems, Engineering, or Mathematics",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "financial management systems",
                "analytical skills",
                "SQL",
                "Microsoft Office"
            ],
            "primary": [
                "Agile",
                "Scrum",
                "Oracle Certification(s)",
                "Oracle Fusion",
                "Workday",
                "Concur",
                "Jira",
                "Tableau",
                "Power BI",
                "Visio"
            ],
            "secondary": [
                "programming languages"
            ],
            "all": [
                "financial management systems",
                "analytical skills",
                "SQL",
                "Microsoft Office",
                "Agile",
                "Scrum",
                "Oracle Certification(s)",
                "Oracle Fusion",
                "Workday",
                "Concur",
                "Jira",
                "Tableau",
                "Power BI",
                "Visio",
                "programming languages"
            ]
        },
        "job_type": [],
        "contact_person": "Saurabh Rai",
        "email": "saurabh@cloudthinktech.com",
        "jd": "From: Saurabh Rai, Cloud Think Tech Inc. saurabh@cloudthinktech.com Reply to: saurabh@cloudthinktech.com Title- Sr. Oracle ERP Business Analyst (Oracle Cloud)Location- Memphis, TNOnly USC or GCJob Description Business Analyst for Oracle Cloud: The business analyst will analyze business needs, document requirements, and translate them into system specifications that IT teams can implement. This role is critical to ensuring technology initiatives align with business strategies and add value by enhancing performance and productivity. Responsible for cross-team collaboration. A strong work ethic, adaptability, great communication, and attention to detail will be essential for this role to be successful. Requirements:Working knowledge of financial management systems as a part of ERP, including accounts payable, accounts receivable, general ledger, and cash management. Outstanding analytical skills in identifying, documenting, and analyzing business solutions. Serve as the liaison between the business and technical team members. Advanced knowledge of SQL and Microsoft Office (Excel, Word, Teams, PowerPoint). Experience working in an Agile/Scrum environment. Bachelor’s degree in information systems, Engineering, or Mathematics with 3 – 5 years in business or technical analysis. Oracle Certification(s) in financial management modules of Oracle Fusion ERP. General knowledge using tools or systems such as Oracle Fusion, Workday, Concur, Jira, Tableau, Power BI, and Visio would be a plus. Some experience with programming languages would be advantageous.",
        "source": "Email",
        "date_posted": "2024-10-29 15:48:47-05:00",
        "unique_id": "192da9b3ed4eab01",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]