[
    {
        "company": "TEK Inspirations LLC",
        "job_title": "Adabas Linux Database Administrator",
        "location": "Quincy, MA, USA",
        "full_location": {
            "city": "Quincy",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Minimum of (10) years of Information Technology experience; Minimum of (5) years of experience as an Adabas Database Administrator",
            "degree_required": "Bachelor’s degree in computer science, Information Systems, Business Administration, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 + months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Adabas",
                "Linux",
                "AWS",
                "Database Administration",
                "Natural"
            ],
            "primary": [
                "RedHat",
                "SuSe",
                "CentOS",
                "Software AG products",
                "Database performance monitoring"
            ],
            "secondary": [
                "Linux shell scripting",
                "Microsoft 365",
                "Jira Software",
                "SDLC",
                "Business modeling"
            ],
            "all": [
                "Adabas",
                "Linux",
                "AWS",
                "Database Administration",
                "Natural",
                "RedHat",
                "SuSe",
                "CentOS",
                "Software AG products",
                "Database performance monitoring",
                "Linux shell scripting",
                "Microsoft 365",
                "Jira Software",
                "SDLC",
                "Business modeling",
                "Process modeling",
                "Data modeling",
                "Computer systems analysis",
                "Technical terminology",
                "MA HIX",
                "Strong relationship skills",
                "Organizational skills",
                "Problem-solving aptitude",
                "Attention to detail",
                "Ability to work with multiple vendors",
                "Strong initiative",
                "Ability to manage multiple projects",
                "Strong follow-through skills",
                "Deliver oral and written instructions",
                "Maintain accurate records",
                "Status reporting"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Nidhi Yadav",
        "email": "nidhi.yadav@tekinspirations.com",
        "jd": "Hello,Hope you are doing well.. I have positions for . Adabas Linux Database Administrator in Location::hybride with our client. Kindly review the job description below and see if it might be an option worth considering.Must be from either MA, RI, CT or NH. I can only submit with ID Proof of residency. Adabas Linux Database AdministratorWork Site: Quincy, MA - HybridDuration : 12 + months POSITION OVERVIEW: Seeking highly motivated Adabas Linux Database Administrator (DBA) who will support a “Lift and Shift” of the on-premises legacy mainframe application to AWS Cloud. Collaborate closely with development to be the liaison between the business community, the technical development team, and Cloud Rehosting Vendors. The DBA will play an integral role in supporting the cloud rehosting project, maintenance enhancements that may be implemented on the cloud platform, or defect fixes that need to be remediated on the cloud platform to meet the requirements of the business community. The first step in porting operations and systems to a new infrastructure will be to rehost the Natural/Adabas MA21 mainframe system in the AWS cloud. The successful candidate will support the MA21 AWS Cloud rehosting effort in support of the One Health Initiative. Coordinating these efforts of the MA21 cloud rehosting project will enable the successful migration of the MA21 legacy mainframe system as a key strategic step toward the future One Health Initiative.DETAILED LIST OF JOB DUTIES AND RESPONSIBILITIES:Monitor and maintain the stability of Adabas/Natural applications supporting services in the Cloud-based, distributed Linus server environmentExperience supporting Linux operating systems: RedHat (preferred), SuSe, and CentOS. Understanding of Linux operating systems architecture and use of commands and utilities.Fundamental Cloud knowledge, AWS, AzureResponsible for supporting a broad range of Software AG (SAG) and other third-party vendor products to provide a stable technical infrastructureDesign and implement Adabas databases to ensure optimal performance and scalabilityParticipate with database support and provide timely resolution of database-related issuesUnderstanding knowledge of EntireX Communicator (RPC & ACI Protocol)Monitor database performance using tools like Adabas ManagerDevelop and implement backup and recovery procedures using Adabas Backup and Recovery ToolsOptimize database performance through query optimization, indexing, and buffer pool managementMonitor database using Adabas Performance Monitor to identify and resolve performance bottlenecksCommunicate effectively with business users and managers. Ensure project documentation, plans, and scheduling comply with agency initiatives and prioritiesAdministering the Natural development environmentExperience with Adabas Utilities: Use of utilities like ADAREP, ADABAS, ADASAV, ADAORD, etc. for database maintenance and reportingSecurity certificate configuration with Software AG products Upgrades, Configuration, and Management Of Software AG Products on Linux, Including: Upgrades, Configuration, and Management Of Software AG Products on Linux, Including:Adabas Entire X Communicator? Adabas Encryption ? Natural Construct? ConnX ? Natural One? Entire Net-Work? Natural Security? Entire Connection? PredictLinux shell scriptingPerforming database startup and shutdownPerforming and restoring database backupsPerforming Adabas File ReorderUsing the Software AG Update Manager to apply updates/fixesUsing administration subsystems, including cron, to schedule system tasksMust Have Skills :Strong relationship skills and ability to interact with internal and external stakeholders and managementDemonstrated proficiency in business modeling, process modeling, and data modelingKnowledge of methods and techniques of computer systems analysis, design, technical terminology, codes, and standard abbreviationsUsing the available system management tools (both console and Web-based System Management)Knowledge of MA HIX or other State Health ExchangeAbility to work with multiple vendorsStrong organizational skills, problem-solving aptitude, and attention to detailAbility to work well with others in a fast-paced, dynamic environmentStrong initiative, ability to manage multiple projects, and strong follow-through skillsDeliver oral and written instructions in a precise, understandable mannerStrong organizational skills with the ability to maintain accurate records and status reportingProficiency in Microsoft 365, Excel, Word, PowerPoint, Access, and VisioExperience with Jira SoftwareExperience with the SDLC (Software Development Life Cycle)EDUCATION AND CERTIFICATIONS Bachelor’s degree in computer science, Information Systems, Business Administration, or a related field.Minimum of (10) years of Information Technology experienceMinimum of (5) years of experience as an Adabas Database Administrator",
        "source": "Email",
        "date_posted": "2024-10-29 08:33:21-05:00",
        "unique_id": "192d8b885221581a",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Oracle DBA"
    }
]