[
    {
        "company": "Yochana IT",
        "job_title": "Operations Manager",
        "location": "Irving, TX, USA",
        "full_location": {
            "city": "Irving",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Telecom Billing",
                "Leadership",
                "IT Operations Management",
                "Process Improvement",
                "Automation"
            ],
            "primary": [
                "Communication",
                "Strategic Roadmap Development",
                "Team Management",
                "Data Analysis",
                "ITIL"
            ],
            "secondary": [
                "Cloud Services (AWS, Azure, Google Cloud)",
                "Cybersecurity Best Practices",
                "Problem-Solving",
                "Decision-Making",
                "Cross-Functional Team Leadership"
            ],
            "all": [
                "Telecom Billing",
                "Leadership",
                "IT Operations Management",
                "Process Improvement",
                "Automation",
                "Communication",
                "Strategic Roadmap Development",
                "Team Management",
                "Data Analysis",
                "ITIL",
                "Cloud Services (AWS, Azure, Google Cloud)",
                "Cybersecurity Best Practices",
                "Problem-Solving",
                "Decision-Making",
                "Cross-Functional Team Leadership"
            ],
            "with_experience": [
                "Telecom Billing",
                "Leadership",
                "IT Operations Management"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Chandra Sekhar Prathipati",
        "email": "chandra@yochana.com",
        "jd": "From: Chandra Sekhar Prathipati, Yochana IT chandra@yochana.com Reply to: chandra@yochana.com Location: Irving, TX or Frisco, TX - Onsite Role Telecom billing experience is mandatory.This is 6 month C2H role This is an application support manager role.Need any manager who have exp handling 24/7 projects.This position is for Operations Manager in SOR in Dallas, TX: Leadership and Supervision: Experience in managing business critical 24x7 IT applications operations Experience in developing strategic roadmap that aligns with overall program goals and budgets. Effective communication to collaborate with stakeholders, executives, and cross-functional teams. Excellent leadership skills to manage teams and drive operational efficiencies Lead and manage the operations team, providing guidance, training, and support to ensure high performance and professional development. Experience in Telecom Billing Experience is mandatoryKey Responsibility Areas: Establishes business recovery strategies for disaster scenarios. Ensures secure information and data handling in compliance with regulations Oversee daily batch job executions to ensure accurate and timely completion of intended activities. Reporting and Analysis: Generate and analyze operations reports to identify trends, discrepancies, and opportunities for improvement. Identify Automation Opportunities: Continuously evaluate operational business processes to identify opportunities for automation and implement solutions that enhance efficiency and accuracy. Efficiency Improvements: Develop and execute strategies to reduce manual tasks, and improve overall operational efficiency, including process improvements Creates and implements processes and procedures for achieving sustainable and high quality results. Executing program as per the allocated budget.Technical Proficiency: Strong understanding of IT infrastructure, including servers, networks, databases, and applications. Familiarity with cloud services (e.g., AWS, Azure, Google Cloud) and virtualization technologies. Knowledge of ITIL (Information Technology Infrastructure Library) processes. Knowledge of cybersecurity best practices and compliance requirements (Problem-Solving and Decision-Making: Ability to analyze complex issues, troubleshoot problems, and make informed decisions. Strategic thinking to optimize processes and reduce operational costs. Explores new technologies and automation. (1.) To drive value creation in the engagement, proactively identify and implement process enhancements, optimizing program efficiency through streamlined workflows. (2.) To build strong relationships with key Program Partners or Stakeholders and manage their interests for smooth integration and implementation of the program and achievement of its objectives. (3.) To optimize engagement profitability, strategically managing diverse variables, pinpointing improvement opportunities, and implementing targeted strategies to elevate overall project profitability. (4.) To proactively engage with the client to understand the business engagements (5.) To lead and inspire cross-functional teams, offering guidance and fostering collaboration for high-performance outcomes. (6.) To proactively identify, assess, and address risks, issues, and escalations by developing robust mitigation and contingency plans, ensuring seamless program delivery.",
        "source": "Email",
        "date_posted": "2024-10-29 08:02:28-05:00",
        "unique_id": "192d894b4282410e",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]