[
    {
        "company": "Systray Technologies",
        "job_title": "Data Analyst (Python, SQL, data engineering)",
        "location": "Eden Prairie, MN, USA",
        "full_location": {
            "city": "Eden Prairie",
            "state": "MN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Python",
                "SQL",
                "Data Analysis"
            ],
            "primary": [
                "Data Engineering",
                "Excel",
                "PowerBI",
                "Snowflake"
            ],
            "secondary": [
                "Databricks",
                "Automation",
                "SDLP"
            ],
            "all": [
                "Python",
                "SQL",
                "Data Analysis",
                "Data Engineering",
                "Excel",
                "PowerBI",
                "Snowflake",
                "Databricks",
                "Automation",
                "SDLP"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Rupali Sahoo",
        "email": "rupali.a@systraytechnologies.com",
        "jd": "From: Rupali Sahoo, Systray Technologies.com rupali.a@systraytechnologies.com Reply to: rupali.a@systraytechnologies.com Job Description :End Client :UHG / Optum Shared Services (MN).Primary Skills : Data AnalysisWork Location: ONSITE - Eden Prairie, MN Travel : NoDescription: The team consists of 8 on-site Consumer Experience Analysts with a variety of backgrounds including experience in UHC contact centers, Medicare Product teams, data file management teams, external consumer experience retail teams, and long-term care delivery. We also are supported by 4 hybrid Reporting Analysts and 3 on-site Managers and 1 on-site Director. The contractors will fill 2/8 of the CE Analyst positions and 2/4 hybrid Reporting Analyst positions. We value learning, open communication, adaptability, humor, and collaboration and we’ve intentionally shaped our culture around these values.The team’s skill sets include coding automations in python, querying large databases in Snowflake, manipulating and analyzing large interaction datasets in Excel, designing engaging data visualizations in excel and PowerPoint to share with stakeholders, and communication skills in person and in writing to engage with leadership.Responsibilities: Analyze operational data to identify areas for process improvement, cost optimization, and provide insights rooted in enhancing the consumer experience. This data includes NPS trends, consumer verbatims, digital portal interactions, consumer metrics/critical ops metrics.Collaborate with cross-functional teams, including, but not limited to WFM, Consumer Resolution Center (CRC), Product, Claims, Call Ops, IT, Sales, Enrollment, Implementation, and Provider Ops, to identify, discuss, and implement enhancements and/or process improvements.Actively monitor live War Room efforts, CRC trends, thumb on current events, or tech outages that could impact the consumer experience that are displayed on the AV Wall.Monitor and interpret operational reports, dashboards, and performance metrics to track key impacts to the consumer experience and overall performance.Demonstrate readiness to interpret and understand the data in a manner that can be efficiently and effectively presented to senior level leaders.Skills:People in the CovepythonSQLengineering of data to drive content into the walls of command center. Then our analysts use the data/visuals, to see the abrasion so we can package it into immediate response. Desired skills:PowerBI (dashboard and reports)SnowflakeSQl.Nice to have PythonDatabricks.Lots of automation pipeline work.SDLP to store data. Excel sme, pulling the work in python.",
        "source": "Email",
        "date_posted": "2024-10-29 13:30:20-05:00",
        "unique_id": "192da09aca0bb700",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Python developer"
    }
]