[
    {
        "company": "TestingXperts",
        "job_title": "Senior Product Manager (Cum Scrum Master)",
        "location": "Raleigh, NC, USA",
        "full_location": {
            "city": "Raleigh",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "12+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Agile Methodologies",
                "Project Management",
                "Communication",
                "Leadership",
                "Analytical Thinking",
                "Technical Proficiency"
            ],
            "primary": [
                "Scrum",
                "Kanban",
                "Lean practices",
                "Jira",
                "Trello",
                "Confluence"
            ],
            "secondary": [
                "Strategic Thinking",
                "Stakeholder Management",
                "Team Collaboration",
                "Adaptability and Flexibility",
                "Analytical Skills",
                "Conflict Resolution"
            ],
            "all": [
                "Agile Methodologies",
                "Project Management",
                "Communication",
                "Leadership",
                "Analytical Thinking",
                "Technical Proficiency",
                "Scrum",
                "Kanban",
                "Lean practices",
                "Jira",
                "Trello",
                "Confluence",
                "Strategic Thinking",
                "Stakeholder Management",
                "Team Collaboration",
                "Adaptability and Flexibility",
                "Analytical Skills",
                "Conflict Resolution"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Rajiv Kumar",
        "email": "rajiv.kumar@testingxperts.com",
        "jd": "From: Rajiv, testingxperts rajiv.kumar@testingxperts.com Reply to: rajiv.kumar@testingxperts.com Position – Senior Product Manager (Cum Scrum Master)Experience: 12 + years# of positions: 2Location: Raleigh, NC Remote CST/EST time Remote can work- may need to visit client location if required Job Description: Job Summary:The Product Manager cum Scrum Master is a dual role combining the strategic oversight of a Product Manager with the operational efficiency of a Scrum Master. This position is essential in driving product vision, strategy, and execution while ensuring Agile methodologies are effectively implemented.The role requires balancing market demands with development realities, ensuring timely delivery of high-quality products that meet or exceed customer expectations. Key Responsibilities: Product Management: 1. Product Strategy and Vision: - Develop Product Vision: Formulate and communicate a clear product vision and strategy aligned with the company's overall business goals.- Market Analysis: Conduct thorough market research, competitor analysis, and customer feedback to identify market opportunities and gaps.- Roadmap Planning: Create and maintain a detailed product roadmap that outlines the development and release schedule, ensuring alignment with business objectives. 2. Stakeholder Management: - Requirement Gathering: Collaborate with internal and external stakeholders, including customers, sales, marketing, and development teams, to gather and define detailed product requirements.- Communication: Act as the primary liaison for product-related communications, ensuring all stakeholders are informed of product status, changes, and future plans.- Presentation: Prepare and deliver compelling presentations and updates on product strategies, progress, and performance to executive leadership and other key stakeholders. 3. Product Lifecycle Management: - Product Development: Oversee the product development process from ideation to launch, ensuring that products meet quality standards and deadlines.- User Feedback: Collect and analyze user feedback and product performance data to identify areas for improvement and future enhancements.- Continuous Improvement: Drive continuous improvement initiatives, incorporating new technologies and best practices to enhance product quality and user satisfaction. Scrum Master: 1. Facilitation: - Agile Ceremonies: Lead and facilitate key Agile ceremonies, including daily stand-ups, sprint planning, sprint reviews, and retrospectives, ensuring they are productive and focused.- Team Collaboration: Foster a collaborative environment where team members can openly discuss and resolve issues, share knowledge, and innovate. 2. Coaching and Mentoring: - Agile Practices: Coach the development team in Agile methodologies and best practices, promoting a culture of continuous improvement.- Impediment Removal: Identify and remove impediments or obstacles that hinder the team’s progress, ensuring the team remains productive and on track. 3. Process Improvement: - Performance Metrics: Develop and track key performance indicators (KPIs) to monitor team performance, project progress, and process effectiveness.- Feedback Loops: Implement and refine feedback loops to ensure timely and actionable insights are gathered from all stakeholders, driving process and product improvements.- Tool Optimization: Optimize the use of Agile tools (e.g., Jira, Trello, Confluence) to enhance workflow efficiency, transparency, and collaboration. Experience: - Minimum of 5+ years of experience in product management, demonstrating successful product development and lifecycle management.- At least 3+ years of experience as a Scrum Master or in a similar Agile role, with a proven track record of leading Agile teams to success. Skills: - Agile Methodologies: Deep understanding of Agile methodologies, including Scrum, Kanban, and Lean practices.- Project Management: Strong project management skills, with the ability to manage multiple priorities, projects, and deadlines.- Communication: Exceptional verbal and written communication skills, capable of articulating complex concepts clearly and concisely.- Leadership: Strong leadership and interpersonal skills, with the ability to inspire, motivate, and develop high-performing teams.- Analytical Thinking: Excellent analytical and problem-solving skills, with a data-driven approach to decision-making.- Technical Proficiency: Proficiency in using project management and Agile tools such as Jira, Trello, and Confluence. Key Competencies: - Strategic Thinking: Ability to think strategically and translate business goals into actionable product plans.- Stakeholder Management: Skilled in managing relationships with diverse stakeholders, balancing competing priorities, and ensuring alignment.- Team Collaboration: Strong collaborator with a team-oriented mindset, capable of fostering a positive and productive work environment.- Adaptability and Flexibility: Ability to adapt to changing circumstances, demonstrating flexibility in approach and readiness to pivot as needed.- Analytical Skills: Sharp analytical skills for assessing product performance, identifying trends, and making data-driven decisions.- Conflict Resolution: Proficient in conflict resolution, able to navigate and mediate disputes effectively to maintain team cohesion and productivity.",
        "source": "Email",
        "date_posted": "2024-10-29 10:05:32-05:00",
        "unique_id": "192d8ef88a8108f7",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]