[
    {
        "company": "PNC bank",
        "job_title": "Lead API Developer",
        "location": "Pittsburgh, PA, USA",
        "full_location": {
            "city": "Pittsburgh",
            "state": "PA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10 years",
            "degree_required": "Bachelor's degree in computer science/relevant field or equivalent work experience required",
            "visa_sponsorship": "Must have existing work authorization",
            "notice_period": "Not specified",
            "duration": "6+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Full Stack Java API Developer experience",
                "Financial Services experience",
                "REST API",
                "Java",
                "Springboot",
                "Agile experience",
                "Oracle"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Full Stack Java API Developer experience",
                "Financial Services experience",
                "REST API",
                "Java",
                "Springboot",
                "Agile experience",
                "Oracle",
                "SQL",
                "J2EE"
            ],
            "with_experience": [
                "Java (10+ years)",
                "Springboot",
                "Agile experience"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Astitva Chauhan",
        "email": "astitva.chauhan@tekinspirations.com",
        "jd": "Job Description -Need LinkedIn profile with submittal!Local consultants: Need F2F interviewNon – local consultants: Need Video InterviewsPlease don’t submit any consultant with Java developer need API developer title. Lead API Developer 6+ monthsLocation: Pittsburgh, PA (or) Dallas, TX (Hybrid) Client: PNC bankOnly USC/GC/GCEAD/H4EAD/H1B (if H1B, need only preferred third party) Need strong Banking Background experience Key responsibilities: Modify existing software to correct errors, to adapt it to new hardware or to upgrade interfaces and improve performance. Design and develop software systems, using scientific analysis and mathematical models to predict and measure outcome and consequences of design. Consult with engineering staff to evaluate interface between hardware and software, develop specifications and performance requirements and resolve customer problems. Advise customer about, or perform, maintenance of software system. Develop and direct software system testing and validation procedures. Must have (Min of 10years) of below skills:1. Full Stack Java API Developer experience 2. Financial Services experience 3. REST API 4. Java 5. Springboot 6. Agile experience 7. Oracle Minimum 12 years of more experience.Summary: Responsible for writing programs to maintain and control computer systems software for operating systems, networked systems, and database systems. Responsible for creating the software platform, and then fine-tuning the final program after it has been made. Job Responsibilities: Consult with engineering staff to evaluate interface between hardware and software, develop specifications and performance requirements and resolve customer problems. Advise customer about, or perform, maintenance of software system. Develop and direct software system testing and validation procedures. Inform customers or other departments on project status, proposals and technical issues such as software system design and maintenance. Direct software programming and development of documentation. skills. Ability to work independently and manage one’s time. Knowledge of the full software development lifecycle: from business/systems analysis, through requirements gathering and functional specification authoring, to development, testing and delivery. Ability to troubleshoot issues and make system changes as needed to resolve issue. Knowledge of computer development software, such as SQL, Java, J2EE, etc. Education/Experience:High School Degree and Bachelors degree in computer science/relevant field or equivalent work experience required.",
        "source": "Email",
        "date_posted": "2024-10-29 14:29:46-05:00",
        "unique_id": "192d9e17360c94ad",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]