[
    {
        "company": "Smart IT Frame",
        "job_title": "Database Administrator",
        "location": "Denver, CO, USA",
        "full_location": {
            "city": "Denver",
            "state": "CO",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "DB2 Database Administration",
                "MQ Replication",
                "DB2 upgrades"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "DB2 Database Administration",
                "MQ Replication",
                "DB2 upgrades"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Boopathy Rajan",
        "email": "boopathy@smartitframe.com",
        "jd": "From: Boopathy, Smart IT Frame boopathy@smartitframe.com Reply to: boopathy@smartitframe.com HiGreetings from Smart IT Frame, Hope you are doing well!!! Smart IT Frame specializes in enabling you with your most critical line of resources. Whether it’s for permanent staffing, contract staffing, contract-to-hire or executive search, we understand the importance of delivering the most suitable talent; on time and within budget. With our Core focus in emerging technologies, we have provided global technology workforce solutions in North America, Canada & India. We take pride in delivering specialized talent, superior performance, and seamless execution to meet the challenging business needs of customers worldwide. Role: Database AdministratorLocation: Denver, CO(Onsite)Experience: 10+Mode of Hiring – ContractShift timing: 9AM – 6PM What are the top 3 skills required for this role?1. DB2 Database Administration2. MQ Replication3. DB2 upgradesJob Description/ ResponsibilitiesWe are seeking a highly skilled Program Manager with 8 to 12 years of experience in DB2 System Administration to join our dynamic team. The ideal candidate will manage and oversee multiple projects, ensuring they align with our business goals and deliver value. Lead the planning and execution of multiple projects, ensuring they meet business objectives and deliver value. - Oversee the coordination and completion of projects on time, within budget, and within scope. - Provide technical expertise in DB2 System Administration to support project teams and ensure smooth operations. - Collaborate with stakeholders to define project scope, goals, and deliverables. - Develop detailed project plans, including timelines, resource allocation, and risk management strategies. - Monitor project progress and make adjustments as necessary to ensure successful completion. - Communicate project status, risks, and issues to stakeholders and senior management. - Ensure all projects adhere to company standards and best practices. - Facilitate project meetings and provide regular updates to team members and stakeholders. - Identify and resolve project issues and conflicts in a timely manner. - Mentor and guide project team members to enhance their skills and performance. - Ensure proper documentation and reporting of project activities and outcomes. - Utilize project management tools and techniques to optimize project efficiency and effectiveness. --Thanks and RegardsBoopathy Rajan STalent Acquisition GroupEmail: boopathy@smartitframe.comSmart IT Frame LLC.",
        "source": "Email",
        "date_posted": "2024-10-29 11:27:46-05:00",
        "unique_id": "192d99313621451f",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "DB Admin"
    }
]