[
    {
        "company": "Virtusa / Health First",
        "job_title": "Pega Lead Systems Architect",
        "location": "Austin, TX, USA",
        "full_location": {
            "city": "Austin",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "7-10 years",
            "degree_required": "Bachelor’s degree in Computer Science or related field; Pega Certified Senior System Architect (CSSA) required.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Pega PRPC",
                "production support",
                "troubleshooting"
            ],
            "primary": [
                "integration technologies",
                "strong communication skills",
                "analytical skills"
            ],
            "secondary": [
                "Pega CLSA",
                "Pega certifications"
            ],
            "all": [
                "Pega PRPC",
                "production support",
                "troubleshooting",
                "integration technologies",
                "strong communication skills",
                "analytical skills",
                "Pega CLSA",
                "Pega certifications"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Yuvaraj",
        "email": "yuvaraj@fwdatatech.com",
        "jd": "Dear All,Hope you are doing well,Please find the below requirement, let me your thoughts Role: Pega Lead Systems Architect with Production Support Experience – C2CLocation: Austin, TX (Onsite)Client : Virtusa / Health First Job Description :Description - ExternalPosition Overview:We are seeking an experienced Pega Senior System Architect (SSA) to design, develop, and maintain Pega applications, ensuring optimal performance and stability. The role includes managing production support, troubleshooting issues, and implementing enhancements.The ideal candidate should have at least 9 to 12 years of work experience and be willing to work in a Austin, TX locations. The candidate should have hands on coding experience and should be self-driven and motivated to work across teams and provide solutions. Key Responsibilities:Design & Development: Lead the design and development of Pega applications, creating solutions that align with business needs and IT strategies.Production Support: Provide 24/7 support for Pega applications, addressing performance issues and resolving incidents promptly.Stakeholder Collaboration: Work with business analysts and project managers to translate requirements into technical solutions.Quality Assurance: Develop test plans, execute tests, and ensure high-quality deliverables.Enhancements: Manage system upgrades and integrate new features to improve functionality.Documentation: Maintain technical documentation and provide status reports.Team Leadership: Mentor junior developers and ensure adherence to Pega best practices.Compliance: Ensure applications meet security and regulatory requirements.Qualifications:Education: Bachelor’s degree in Computer Science or related field; Pega Certified Senior System Architect (CSSA) required.Experience: 7-10 years in Pega development and support, with proven production support experience.Skills: Proficiency in Pega PRPC, integration technologies, and troubleshooting. Strong communication and analytical skillsCertifications: Pega CLSA required; additional Pega certifications are a plus.If you are interested please share update resume below mail idYUVARAJ Myuvaraj@fwdatatech.com",
        "source": "Email",
        "date_posted": "2024-10-29 13:35:29-05:00",
        "unique_id": "192d9afc0af39f80",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "PEGA Developer"
    }
]