[
    {
        "company": "Florida's Turnpike Enterprise",
        "job_title": "Jr. Finance Business Analyst",
        "location": "Ocoee, FL, USA",
        "full_location": {
            "city": "Ocoee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "4 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ months",
            "rate": "$45/hour"
        },
        "skills": {
            "core": [
                "financial accounting",
                "reporting",
                "Advanced Excel",
                "process mapping",
                "data analysis"
            ],
            "primary": [
                "analytical skills",
                "problem-solving skills",
                "communication skills",
                "interpersonal skills",
                "ability to manage multiple tasks"
            ],
            "secondary": [
                "financial systems",
                "teamwork",
                "independence"
            ],
            "all": [
                "financial accounting",
                "reporting",
                "Advanced Excel",
                "process mapping",
                "data analysis",
                "analytical skills",
                "problem-solving skills",
                "communication skills",
                "interpersonal skills",
                "ability to manage multiple tasks",
                "financial systems",
                "teamwork",
                "independence"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Pallavi Singh",
        "email": "pallavi.singh@tekinspirations.com",
        "jd": "From: Pallavi Singh, Tek Inspirations pallavi.singh@tekinspirations.com Reply to: pallavi.singh@tekinspirations.com Job Description -Attached on Job File \"Exhibit F\" Resume Self-Certification Form must be sent with resume!!!For Exhibit F, any government-issued ID is acceptable: driver’s license, passport, etc.For recruiter- you can take from me!Need Only local to Ocoee Florida or nearby 30 miles!Need LinkedIn profile and photo ID with submittal.Client can ask for F2F interview as well. Rate: 45/hr c2cJr. Finance Business AnalystThis RFQ is from the Tolls Data Center of Florida's Turnpike Enterprise.6+ monthsNo CPT/H1BWork location 5 days a week and onsite interview: SunWatch Operations Center at Turnpike Headquarters Milepost 263, Bldg. #5319 Ocoee Florida 34761 IMPORTANT:THIS RFQ IS A RE-ADVERTISEMENT. PLEASE DO NOT RESUBMIT ANY CANDIDATES THAT WERE SUBMITTED FOR RFQ PR609453. PLEASE REMEMBER, THIS POSITION IS FOR THE FINANCE DEPARTMENT AT FLORIDA'S TURNPIKE ENTERPRISE. Manager Must Haves:Minimum 4 years of experience in financial accounting and reporting.Demonstrated Advanced Excel SkillsDemonstrated process mapping experienceProven experience in process mapping and improvement.Strong analytical and problem-solving skills.Proficiency in financial systems and data analysis tools.Excellent communication and interpersonal skills.Ability to manage multiple tasks and meet deadlines.Ability to work independently and as part of a team. Summary:The Financial Books and Records Transformation Analyst will be instrumental in the successful transition of the Florida Turnpike Enterprise (FTE) to the Florida PALM (Planning, Accounting, and Ledger Management) system. This role requires a detail-oriented individual with strong analytical and problem-solving skills to lead the transformation of FTE’s financial processes, books, and records to align with the new statewide accounting platform. Responsibilities:Develop and maintain detailed current and future state process maps of FTE’s financial operations, identifying opportunities for improvement and alignment with Florida PALM system requirementsLead the identification, documentation, and optimization of FTE’s financial processes.Conduct a comprehensive analysis and reconciliation of FTE’s Chart of Accounts (COA) to align with Florida PALM.Oversee the migration of financial data to the new system, ensuring data integrity and accuracyDevelop and implement new Standard Operating Procedures (SOPs) for financial operations.Develop and execute test plans to validate system functionality and data accuracy.Collaborate with the Florida PALM Project Team and FTE stakeholders to ensure successful transition.Regards, Pallavi SinghTechnical RecruiterTEK Inspirations LLC : 13573 Tabasco Cat Trail, Frisco, TX 75035Email: Pallavi.singh@tekinspirations.comLinkedIn: linkedin.com/in/pallavi-singh-993483189 Disclaimer: If you are not interested in receiving our e-mails then please reply with a \"REMOVE\" in the subject line to remove@tekinspirations.com. And mention all the e-mail addresses to be removed with any e-mail addresses, which might be diverting the e-mails to you. We are sorry for the inconvenience.",
        "source": "Email",
        "date_posted": "2024-10-29 08:44:29-05:00",
        "unique_id": "192d8a5998c093c7",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]