[
    {
        "company": "TEK Inspirations",
        "job_title": "Power And Utility Project Manager",
        "location": "Los Angeles, CA, USA",
        "full_location": {
            "city": "Los Angeles",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Preferred degree in STEM",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Power and Utility Data Metrics"
            ],
            "primary": [
                "Data Analysis",
                "Lean Process Improvement",
                "Risk Management",
                "Budget Management",
                "Team Management"
            ],
            "secondary": [
                "Communication",
                "Quality Control",
                "Stakeholder Engagement",
                "Project Planning",
                "Task Assignment"
            ],
            "all": [
                "Project Management",
                "Power and Utility Data Metrics",
                "Data Analysis",
                "Lean Process Improvement",
                "Risk Management",
                "Budget Management",
                "Team Management",
                "Communication",
                "Quality Control",
                "Stakeholder Engagement",
                "Project Planning",
                "Task Assignment"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Vaibhav Raghuvanshi",
        "email": "vaibhav.raghuvanshi@tekinspirations.com",
        "jd": "Hi,Hope you are doing great!!!Please share suitable profile and mention JOB. Job Description -Power / Utility Project ManagerLocation: Los Angeles, CA -- HYBRID --- 50% onsite, 50% remote (LOCAL candidates only)MOI: SkypeLinkedin Is must. Overview - Responsibilities Support a 10+ person engagement team as we develop processes, perform data analysis, and partner with program stakeholders to support an operational wildfire mitigation program at an energy client.Resource will support lean process improvement activities and participate in data product development.Planning: Creating a detailed project plan, including defining project scope, goals, budget, timelines, and resources.Organizing: Identifying and assigning tasks to team members, coordinating and facilitating communication, and ensuring everyone is aware of their roles and responsibilities.Executing: Overseeing the implementation of the project plan, monitoring progress, and ensuring that tasks are completed on time and within budget.Monitoring and controlling: Continuously monitoring the project's progress, tracking key metrics, and addressing any issues or risks that arise. Also, making adjustments to the project plan as necessary.Communication: Regularly communicating with stakeholders, team members, and other relevant parties to provide updates on the project's progress, address concerns, and ensure everyone is on the same page.Risk management: Identifying potential risks and developing strategies to mitigate them. Taking proactive measures to minimize risk and resolve any issues that may impact the project's success.Quality control: Ensuring that the deliverables meet the required quality standards by conducting regular reviews, inspections, and tests.Team management: Providing guidance and support to the project team, fostering teamwork and collaboration, and resolving conflicts or issues that may arise.Budget management: Tracking project costs and expenses, ensuring that expenditures stay within the defined budget,Closing: Conducting project reviews and evaluations, documenting lessons learned, and ensuring all project tasks and deliverables are completed before closing the project.Qualifications:5+ years of experience as a Project Manager5+ years of experience in Power and Utility (specifically needs to understand power and utility data metrics)Preferred degree in STEM - (Degree program that falls under the umbrella of science, technology, engineering or mathematics) Regards,Vaibhav",
        "source": "Email",
        "date_posted": "2024-10-29 20:16:12-05:00",
        "unique_id": "192db1e9f02ec1e3",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]