[
    {
        "company": "W3Global",
        "job_title": "Project Manager",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Retail",
                "Project Management",
                "WMS",
                "WCSWES",
                "LMS"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Retail",
                "Project Management",
                "WMS",
                "WCSWES",
                "LMS"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Nora West",
        "email": "nora.west@w3global.com",
        "jd": "Dear Lara Olojo,Greetings from W3Global Inc!!I am not sure if you are looking for a new opportunity, but when I came across your resume, I felt that you might be the right fit for this new opportunity. Here is the job description.Job Title : Project Manager - Baltimore, Maryland (Remote) - Contract Mandatory Skills: Retail, Project Management , Experience in Distribution Applications WMS, WCSWES, LMS Job DescriptionWe are looking for a motivated Sr. Project Manager that is comfortable and capable managing or supporting technology initiatives from strategic projects to functional enhancements to operational maintenance and upgrades. You will work closely with and take direction from Tech PMO program managers and cross-functional teams across Distribution Applications (WMS, WCSWES, LMS), SAP Applications, Supply Chain Planning, Cyber Security, Legal, Ecommerce, QA, associated vendor partnerships and other business stakeholders to plan, organize, lead and control assigned projects andor tasks efficiently and effectively. This role will require someone who is flexible and comfortable with dynamic and evolving assignments and rolling up their sleeves at times to be plugged into efforts to ensure the team, project, business outcomes are successful. Responsibilities• You will support the Cross Channel Logistics Optimization (CCLO) program through project management of the Technology work streams• You will be aligned to prioritized waterfall and/or iterative and incremental technology initiatives for the CCLO program and are no stranger to hitting hard deadlines in an evolving environment. You may also need to help guide/facilitate the intake, prioritization and planning of tech initiatives in one or more business functional areas.• Direct activities across cross-functional global teams and proactively identify and manage dependencies across them.• Inspire teamwork without direct reporting authority and maximize the value created by your project team.• Conduct Waterfall and/or Agile ceremonies in alignment with our selected ways of working and defined frameworks.• Own and manage project plans, RAID (risk, action item, issue, decision) log, Communications plan and Stakeholder RACI, ensuring relevant project repositories are all created and effectively formatted for use.• Guide and coach teams in their applicable ways of working, within the constraints of existing UA Technology frameworks.• Work closely with Business Project Manager and Vendor Project Managers when applicable to support overall project management, communication, status reporting and stakeholder management. • Support Business PM and Initiative owner to prepare presentations for Executive Steering Committee meetings (scheduled by Transformation Mgt Office)• Prepare and facilitate functional stakeholder steering committee/project/initiative meetings.• Coordinate keeping all project artifacts up to date in UA business systems like Confluence, JIRA, Service Now, Smartsheet and Sharepoint and are also responsible for creating project monitoring tools like Dashboards and Risk logs to avoid project pitfalls.• Liaison to teammates outside the primary project or technology team in which you're engaged and help them interact with your project teams.• Lessons Learned - Recommend doing throughout the project - Identify reasonable increments to perform a retro-style lessons learn focused on how the project way of working is performing and if the project outcomes are looking good. That way we can improve or pivot asap to ensure their success.• Resource Plans - All resource plans maintained• Monitor and manage project budget• Vendor management• Manage enhancements and projects (projects could be small, medium, or large).",
        "source": "Email",
        "date_posted": "2024-10-29 15:50:19-05:00",
        "unique_id": "192da2b305a2568a",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]