[
    {
        "company": "Adventa Tech Inc.",
        "job_title": "Business Solution Analysts",
        "location": "California, USA",
        "full_location": {
            "city": "",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "At least 5 years",
            "degree_required": "Bachelor’s degree in business administration, Information Systems, or a related field",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "18+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business analysis",
                "Process reengineering",
                "Business process documentation",
                "Analytical skills",
                "Communication skills"
            ],
            "primary": [
                "Flowcharts",
                "Process maps",
                "Swim lane diagrams",
                "Requirements management"
            ],
            "secondary": [
                "Certified Business Analyst certificate",
                "Experience with California state agencies",
                "Knowledge of government operations best practices"
            ],
            "all": [
                "Business analysis",
                "Process reengineering",
                "Business process documentation",
                "Analytical skills",
                "Communication skills",
                "Flowcharts",
                "Process maps",
                "Swim lane diagrams",
                "Requirements management",
                "Certified Business Analyst certificate",
                "Experience with California state agencies",
                "Knowledge of government operations best practices"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Lipsa Mohanty",
        "email": "lipsa@adventatech.com",
        "jd": "From: Lipsa Mohanty, Adventa Tech Inc. lipsa@adventatech.com Reply to: lipsa@adventatech.com Job Title: Business Solution AnalystsLocation: California (Remote)Duration: 18+ monthsVisa: No H1b , CPTMOI: skypeJOB DESCRIPTIONLinkedIn is must. - Need 3 references.They must have the listed certification - Certified Business Analyst certificate through IIBA, PMI, or a similar accredited entity is preferred. The California State Controller’s Office (SCO) is seeking experienced Business Solution Analysts to support process reengineering initiatives across various departments. This role involves identifying, analyzing, and documenting business processes to drive efficiency improvements and ensure operational excellence. The Business Solution Analyst will work with stakeholders to understand and optimize current workflows, document requirements, and create strategies for process improvement.Key ResponsibilitiesDevelop and Document Business Processes: Work with departments to develop, assess, and document current business processes. Identify gaps, redundancies, and improvement opportunities to streamline operations.Create Templates and Manage Documentation: Develop branded templates and establish a document repository to store process documentation. Maintain a comprehensive inventory of business processes and procedures.Conduct Process Analysis and Provide Recommendations: Collaborate with stakeholders at all level to understand their needs, conduct analysis, and provide actionable recommendations to improve efficiency and accuracy in business processes.Create Deliverables: Produce high-quality deliverables such as process maps and workflow diagrams for current and future state, gap analysis report, process improvement report.Mandatory Qualifications: Experience: At least 5 years of experience within the past ten years in business analysis, process reengineering, or business process documentation, ideally with government or large organizations.Key Skills: Strong analytical skills to evaluate processes and develop innovative, strategic solutions to improve them. Ability to document, analyze, and visualize current processes through tools like flowcharts, process maps, and swim lane diagrams.Education: Bachelor’s degree in business administration, Information Systems, or a related field. A master’s in business administration (MBA) is a plus.Certification: Certified Business Analyst certificate through IIBA, PMI, or a similar accredited entity is preferred.Communication Skills: Strong written and verbal communication skills to collaborate effectively with team members, stakeholders, and management.Preferred QualificationsPrior experience working with California state agencies.Strong knowledge of requirements management, business process reengineering, and familiarity with best practices in government operations. send candidates resume on :- lipsa@adventatech.com",
        "source": "Email",
        "date_posted": "2024-10-29 17:07:46-05:00",
        "unique_id": "192da721b0887c5c",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]