[
    {
        "company": "Source Infotech Inc",
        "job_title": "Technical Business Analyst",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "4+ Months (Possibly extended)",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Texas Medicaid Systems",
                "Data Analysis",
                "Business Process Reengineering",
                "Business Process Mapping"
            ],
            "primary": [
                "IT SDLC Project Experience",
                "Excel",
                "Tableau",
                "Risk Identification",
                "Financial Analyses"
            ],
            "secondary": [
                "Agile Delivery Approach",
                "Software Development Processes"
            ],
            "all": [
                "Business Analysis",
                "Texas Medicaid Systems",
                "Data Analysis",
                "Business Process Reengineering",
                "Business Process Mapping",
                "IT SDLC Project Experience",
                "Excel",
                "Tableau",
                "Risk Identification",
                "Financial Analyses",
                "Agile Delivery Approach",
                "Software Development Processes"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Sunny",
        "email": "sunny@sourceinfotech.com",
        "jd": "From: sunny, Source Infotech Inc sunny@sourceinfotech.com Reply to: sunny@sourceinfotech.com Hi,Hope you are all doing well,Please find the details of Requirement,Title: Technical Business Analyst Location: This is a remote role from anywhere in Texas (Look for Texas candidates)Duration: 4+ Months (Possibly extended)Visa Status: All visas are workable except CPT, OPT, and H1BInterview: Through Microsoft teams Note:LinkedIn Needed.Resume: Send an updated resume in word format. Job Description:HHSC has issued a request for a Technical Business Analyst to support their Long Term Care (LTC) with the delivery of multiple ARPA-funded (American Rescue Plan Act) projects. This role will be reporting to the Direct of Medicaid IT-Contracted Systems and requires 5 years of Texas Medicaid experience and 2+ years of data analysis experience. Responsibilities include (but are not limited to):Reviews, analyzes, and evaluates business systems and user needs. Formulates systems to parallel overall business strategies. Experienced with business process reengineering and identifying new applications of technology to business problems to make business more effective. Familiar with industry standard business process mapping, and reengineering. Minimum Candidate Characteristics: 5 years of BA experience5 years of Texas Medicaid Systems experience Exceptional Candidate Characteristics: 8 years of IT SDLC project experience JOB DESCRIPTION 4-7 years of experience in the field or in a related area as a senior Business Analyst (Technical). Familiar with standard concepts, practices, and procedures within a particular field. Relies on limited experience and judgment to plan and accomplish goals. A certain degree of creativity and latitude is required. Works under limited supervision with considerable latitude for the use of initiative and independent judgment. 2+ years of experience as a data analyst analyzing raw data using Excel, Tableau, etc. Reviews, analyzes, and evaluates business systems and user needs. Formulates systems to parallel overall business strategies. Experienced with business process reengineering and identifying new applications of technology to business problems to make business more effective. Familiar with industry standard business process mapping, and reengineering. Prepares solution options, risk identification, and financial analyses such as cost/benefit, ROI, buy/build, etc. Writes detailed description of user needs, program functions, and steps required to develop or modify computer programs. Additional job details and special considerationsThe Worker will be a part of the team reporting to the Director of Medicaid IT-Contracted Systems and will assist with the delivery of multiple ARPA-funded system enhancements for applications that support Long Term Care and other ancillary applications. The Worker will be responsible for providing vendor oversight of the enhancement delivery and supporting the Product Owner to ensure that the delivery aligns with the customer's needs. II. CANDIDATE SKILLS AND QUALIFICATIONS Minimum Requirements:Candidates that do not meet or exceed the minimum stated requirements (skills/experience) will be displayed to customers but may not be chosen for this opportunity.Required/Preferred ExperienceRequired Experience as a Business Analyst.Required Experience with Texas Medicaid systems.Preferred Experience working with Information Technology projects.Preferred Knowledge of software development processes and practices.Preferred Experience with and Agile delivery approach.",
        "source": "Email",
        "date_posted": "2024-10-29 10:48:42-05:00",
        "unique_id": "192d917108e6099e",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]