[
    {
        "company": "RE Mason",
        "job_title": "Power BI Developer/Data Engineer",
        "location": "Charlotte, NC, USA",
        "full_location": {
            "city": "Charlotte",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "3-5 years",
            "degree_required": "Bachelor's degree in Computer Science, Information Technology, Engineering, or a related field.",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "2-3 month contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Seeq Analytics",
                "SQL",
                "data engineering",
                "data visualization",
                "ETL processes"
            ],
            "primary": [
                "big data technologies",
                "cloud platforms",
                "Python",
                "Java",
                "Scala"
            ],
            "secondary": [
                "Hadoop",
                "Spark",
                "AWS",
                "Azure",
                "GCP",
                "Tableau",
                "communication skills",
                "problem-solving skills",
                "customer service",
                "time management"
            ],
            "all": [
                "Seeq Analytics",
                "SQL",
                "data engineering",
                "data visualization",
                "ETL processes",
                "big data technologies",
                "cloud platforms",
                "Python",
                "Java",
                "Scala",
                "Hadoop",
                "Spark",
                "AWS",
                "Azure",
                "GCP",
                "Tableau",
                "communication skills",
                "problem-solving skills",
                "customer service",
                "time management"
            ],
            "with_experience": [
                "Seeq Analytics",
                "SQL",
                "data engineering"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Vinita Singh",
        "email": "vinita.singh@tekinspirations.com",
        "jd": "Job Description –Role: Power BI Developer/Data Engineer vendor will take video screening call.Only someone with Security Clearance and Local to Charlotte NC Need linked and Seeq Experience is a must have!!Client: RE Mason- Local to Charlotte NC/hybridVisa: Citizen Only :: USC Communication is the most important Duration: 2-3 month contract The Data Engineer will play a crucial role in leveraging data analytics platforms to transform raw data into actionable insights. This position requires a strong background in data engineering, experience with Seeq Analytics, and a passion for solving complex data problems. specific responsibilitiesDevelop, implement, and maintain data pipelines and ETL processes to ensure efficient data flow and transformation. Utilize Seeq Analytics to analyze time-series data, generate insights, and support decision-making processes. Experience in a data visualization tool such as PowerBI or related. Collaborate with data scientists, analysts, and other stakeholders to understand data requirements and deliver solutions. Optimize and tune data systems for performance and reliability. Ensure data quality and integrity across various data sources. Create and maintain documentation related to data engineering processes and workflows. Assist in the deployment and management of machine learning models and advanced analytics solutions. Troubleshoot and resolve data-related issues in a timely manner. Support internal customers by developing innovative solutions to meet their data needs. Enhance and support the CI/CD automation needs of the business. Previous experience as an active SCRUM team member. REQUIRED CompetenciesBachelor's degree in Computer Science, Information Technology, Engineering, or a related field. 3-5 years of experience in data engineering or a similar role. Proficiency in Seeq Analytics, including experience with its core functionalities and features. Strong SQL skills and experience with relational databases (e.g., MySQL, PostgreSQL). Experience with big data technologies (e.g., Hadoop, Spark) and cloud platforms (e.g., AWS, Azure, GCP). Proficient in at least one programming language (e.g., Python, Java, Scala). Familiarity with data visualization tools (e.g., Tableau, Power BI) is a plus. Strong problem-solving skills and the ability to work independently and in a team environment. Excellent communication skills, both written and verbal. Highly communicative, detail-oriented, and career-minded with the ability to multitask. Customer service-oriented with a positive attitude, always willing to tackle any task and go the extra mile. Excellent communication skills Resourcefulness and troubleshooting aptitude Attention to detail Ability to follow detailed instructions Verbal and written communication Skills Time Management Skills Teamwork REQUIRED education & experience BSc/BA in Computer Science, Engineering or a related field. Preferred EXPERIENCE/CompetenciesExperience with industrial data sources and IoT data such as SCADA/DCS, PLC, or process control. Knowledge of data warehousing concepts and technologies (e.g., Redshift, Snowflake).Understanding of machine learning concepts and experience with model deployment. Certifications in relevant technologies and platforms. Physical requirementsStandingWalkingSittingKneelingReaching Overhead ClimbingPushing and Pulling Lifting - 50 Pounds Using a Computer Using a Telephone Driving",
        "source": "Email",
        "date_posted": "2024-10-22 08:34:47-05:00",
        "unique_id": "192b495af37cbfab",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]