[
    {
        "company": "Cyber Resource",
        "job_title": "Project Manager 4 Scrum Master",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "12 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Scrum",
                "Kanban",
                "Agile project management",
                "Project Management Professional (PMP)",
                "Scrum Master Certification (CSM)"
            ],
            "primary": [
                "Microsoft Project",
                "Team Foundation Server",
                "JIRA",
                "Version One",
                "SAFe framework"
            ],
            "secondary": [
                "Mentoring",
                "Coaching",
                "Collaboration",
                "Team building",
                "Analytical skills",
                "Organizational skills",
                "Decision-making skills"
            ],
            "all": [
                "Scrum",
                "Kanban",
                "Agile project management",
                "Project Management Professional (PMP)",
                "Scrum Master Certification (CSM)",
                "Microsoft Project",
                "Team Foundation Server",
                "JIRA",
                "Version One",
                "SAFe framework",
                "Mentoring",
                "Coaching",
                "Collaboration",
                "Team building",
                "Analytical skills",
                "Organizational skills",
                "Decision-making skills"
            ],
            "with_experience": [
                "Scrum (10 years)",
                "Software development life cycle models (12 years)",
                "Customer management (12 years)",
                "Interpersonal skills (12 years)",
                "SAFe framework (6 years)",
                "Microsoft Project (5 years)"
            ]
        },
        "job_type": [
            "onsite",
            "hybrid"
        ],
        "contact_person": "Vikas",
        "email": "vikas@cyber-resource.com",
        "jd": "From: Vikas, Cyber Resource vikas@cyber-resource.com Reply to: vikas@cyber-resource.com local candidates required*candidate should be able to work onsite up to 3 days/week*please do not submit candidates who were submitted to previous VDOT PM Scrum Master reqs•Drives consistent project delivery through the entire project lifecycle, including project plans, release plans, resource allocation, and management of project risks, scope, schedule, and delivery of value.•Coordinates Agile Ceremonies such as Sprint Planning, Daily Standups, Retrospectives, Sprint Demos, Story Refinement, and Release Planning.•Tracks and communicates project's progress from a schedule, cost, and risk perspective to the project team, stakeholders, and management.•Establishes an environment where the teams can be effective and helps removing obstacles.•Protects the team from outside interruptions and distractions.•Ensures a good relationship between the team and product owner as well as others outside the team.•Tracks and reports team velocity and other project metrics.•Promotes continuous improvement and helps teams to increase productivity.•Helps Product Owner and team with Product backlog management.•Ensures the teams are practicing core Agile principles.•Adheres to VDOT and VITA project management practices as defined.•Additional responsibilities as assigned.Knowledge, Skills, and Abilities:•Solid understanding of software development life cycle models as well as expert knowledge of Agile project management principles and practices.•Ability to work with customers, understand their business practices and manage their expectations.•Ability to set clear performance standards and hold team members accountable, while keeping team engaged and on track.•Ability to help Product Owners to create and prioritize Product Backlog.•Strong interpersonal skills including mentoring, coaching, collaborating, and team building.•Strong analytical, organizational and decision-making skills.•Ability to analyze and document business and system processes.•Ability to balance the competing demands for quality, scope, schedule, and cost.•Well-versed with Scrum and Kanban Agile methodologies.•Expertise with Project Management tools such as Microsoft Project, Visio, and MS Office.•Experience with Agile collaboration tools such as Team Foundation Server, JIRA, Version One, etc.•PMP and CSM Certifications required.•Experience with SAFe framework required.•SAFe Certification preferred. SkillRequired / DesiredAmountof ExperienceSolid understanding of Scrum / Kanban Agile Methodology and working experience in this areaRequired10YearsSolid understanding of software development life cycle modelsRequired12YearsAbility to work with customers, understand their business practices and manage their expectations.Required12YearsStrong interpersonal skills including mentoring, coaching, collaborating, and team buildingRequired12YearsCurrent Project Management Professional (PMP) from the Project Management Institute (PMI)Required Scrum Master Certification (CSM)Required Experience using SAFe FrameworkRequired6YearsExperience using Microsoft ProjectRequired5Years DescriptionQuestion 1Absences greater than two weeks MUST be approved by CAI management in advance, and contact information must be provided to CAI so that the resource can be reached during his or her absence. The Client has the right to dismiss the resource if he or she does not return to work by the agreed upon date. Do you accept this requirement?Question 2Please list candidate's email address.Question 3Does your candidate have a current PMP certification from PMI OR a PM certification from VITA (no other certifications are accepted)? This is REQUIRED. Please upload a copy of the PMP certification.Question 4Does your candidate have a current CSM certification? This is REQUIRED. Please upload a copy of the CSM certification.Question 5Does your candidate have a current SAFe SFC or RTE certification? This is REQUIRED. Please upload a copy of the certification.Question 6Is candidate willing and able to work onsite up to 3 days every week at VDOT in Richmond, VA? NO exceptions.Question 7Has candidate been submitted to previous VDOT Release Train Engineer reqs? We need NEW candidates ONLY.Question 8How soon after offer can candidate start?",
        "source": "Email",
        "date_posted": "2024-10-22 08:23:06-05:00",
        "unique_id": "192b4859918d2a33",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Scrum Master"
    }
]