[
    {
        "company": "VYZE INC",
        "job_title": "Junior/Mid Data Engineer",
        "location": "Woonsocket, RI, USA",
        "full_location": {
            "city": "Woonsocket",
            "state": "RI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "2 years",
            "degree_required": "Bachelor’s Degree in Computer Science, Engineering, Statistics, Physics, Math, or related field or equivalent experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "1-3 Years",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Python",
                "SQL",
                "Cloud Experience"
            ],
            "primary": [
                "REST API",
                "Microservice development",
                "Data analysis",
                "Agile delivery",
                "Version control (Git)"
            ],
            "secondary": [
                "Java",
                "Spark",
                "Real-time technology",
                "Azure",
                "AWS",
                "Snowflake",
                "Databricks",
                "RDBMS",
                "NoSQL",
                "Airflow",
                "Kubernetes",
                "Bash shell scripts",
                "UNIX utilities",
                "DevOps best practices",
                "CICD"
            ],
            "all": [
                "Python",
                "SQL",
                "Cloud Experience",
                "REST API",
                "Microservice development",
                "Data analysis",
                "Agile delivery",
                "Version control (Git)",
                "Java",
                "Spark",
                "Real-time technology",
                "Azure",
                "AWS",
                "Snowflake",
                "Databricks",
                "RDBMS",
                "NoSQL",
                "Airflow",
                "Kubernetes",
                "Bash shell scripts",
                "UNIX utilities",
                "DevOps best practices",
                "CICD"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Manendra Das",
        "email": "mdas@vyzeinc.com",
        "jd": "HiHope you are doing great, Please go through the below job description and provide me your consultant updated resume. Position : Junior/Mid Data EngineerLocation : Woonsocket, RI 02895 Hybrid onsite 3 days LOCAL ONLY – PROVIDE PROOF OF RESIDENCY AT TIMEDuration : 1-3 YearsVisa : USC, GCInterview : Video Need only 2 qualified candidateMust Have:Cloud Experience – GCP is a plusPython – 2 years experienceSQL – 2 years experience Java – a big plus Spark - a plusHealthacre exp Required Qualifications:SQL and Python, with 2+ years hands-on coding experience with bothExperience with REST API/Microservice development using PythonExperience performing data analysis and data explorationExperience working in an agile delivery environmentStrong critical thinking, communication, and problem solving skills and a quick learnerExperience partnering cross-functionally with other technical teams (i.e. data ingestion, data science, operational systems) to align priorities and achieve deliverable outcomesExperience working in multi-developer environment, using version control (i.e. Git)Ability to understand complex systems and solve challenging analytical problemsAbility to learn from a Senior Data Engineer Preferred (Plus) Qualifications: Experience with real-time and streaming technology (i.e. Azure Event Hubs, Azure Functions Kafka, Spark Streaming)Experience with cloud-based platforms (i.e. Azure, GPC, AWS)Experience building automated big data pipelinesExperience with Snowflake, Databricks or any big data frameworks on SparkExperience with RDBMS and NoSQL Databases and hands-on query tuning/optimizationExperience with orchestrating pipelines using tools (i.e. Airflow, Azure Data Factory)Experience with data modeling and system architecture designExperience with deployment/scaling of apps on containerized environment (i.e. Kubernetes, AKS)Experience with bash shell scripts, UNIX utilities & UNIX CommandsPrevious healthcare experience and domain knowledgeExposure/understanding DevOps best practice and CICD (i.e. Jenkins)Education:Bachelor’s Degree in Computer Science, Engineering, Statistics, Physics, Math, or related field or equivalent experiencePreferred: Master’s Degree with coursework focused on advanced algorithms, mathematics in computing, data structures, etc Best Regards,Manendra DasTechnical Recruiter,VYZE INC. (An E-Verified Company),Phone: 1 571-370-488724718 Tribe Square #306, Dulles VA 20166 Email mdas@vyzeinc.com",
        "source": "Email",
        "date_posted": "2024-10-22 07:54:21-05:00",
        "unique_id": "192b46b39e25a9b2",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "GCP Data Engineer"
    }
]