[
    {
        "company": "Yochana IT Solutions",
        "job_title": "Angular Developer with .Net core",
        "location": "Cary, NC, USA",
        "full_location": {
            "city": "Cary",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Angular",
                ".Net",
                ".Net Core",
                "SQL",
                "C#",
                "ASP.Net"
            ],
            "primary": [
                "HTML",
                "XML",
                "JavaScript",
                "Waterfall",
                "Agile"
            ],
            "secondary": [
                "Technical guidance",
                "Code reviews",
                "Quality assurance",
                "Performance optimization",
                "Best practices",
                "Communication skills",
                "Critical thinking",
                "Problem analysis"
            ],
            "all": [
                "Angular",
                ".Net",
                ".Net Core",
                "SQL",
                "C#",
                "ASP.Net",
                "HTML",
                "XML",
                "JavaScript",
                "Waterfall",
                "Agile",
                "Technical guidance",
                "Code reviews",
                "Quality assurance",
                "Performance optimization",
                "Best practices",
                "Communication skills",
                "Critical thinking",
                "Problem analysis"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Chandra Sekhar Prathipati",
        "email": "chandra@yochana.com",
        "jd": "Hi, This is Chandra from Yochana IT Solutions, I Recently found your resume in one of our Job portal and We are looking for “Angular Developer with .Net core, Cary, NC(Onsite)” with one of our client, I have included the job information below, If you are interested, please share your updated resume.Job Description:10+ years of extensive experience in .Net, .Net Core, SQL, C#, ASP.Net.Strong SQL writing skills and SQL server knowledgeShould be able to lead the team wellStrong experience in Angular is added advantageExtensive experience in HTML, XML and JavaScriptShould have strong understanding of all the aspects of software development cycleExcellent verbal communication skillsExcellent critical thinking problem analysis to resolution skillsNeeds to have good experience in Waterfall Agile methodology (1.) To be responsible for providing technical guidance to a team of developers, enhancing their technical capabilities and increasing productivity. (2.) To conduct comprehensive code reviews, establish and oversee quality assurance processes, performance optimization , implementation of best practices and coding standards to ensure succeful delivery of complex projects. (3.) To ensure process compliance in the assigned module, and participate in technical discussionsorreview as a technical consultant for feasibility study (technical alternatives, best packages, supporting architecture best practices, technical risks, breakdown into components, estimations). (4.) To collaborate with stakeholders to define project scope, objectives, deliverables and accordingly prepare and submit status reports for minimizing exposure and closure of escalations.",
        "source": "Email",
        "date_posted": "2024-10-22 09:13:35-05:00",
        "unique_id": "192b4b8f33374ddb",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]