[
    {
        "company": "Insoursys",
        "job_title": "Java React Full Stack Lead",
        "location": "Princeton, NJ, USA",
        "full_location": {
            "city": "Princeton",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "13+ years",
            "degree_required": "Bachelor’s or higher degree in Computer Science, Engineering, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "React",
                "Spring Framework",
                "Microservices",
                "HTML",
                "CSS",
                "JavaScript"
            ],
            "primary": [
                "J2EE",
                "Hibernate",
                "Restful services",
                "Spring JDBC",
                "MVC",
                "Spring Boot",
                "JPA",
                "React.js",
                "Webpack",
                "Redux",
                "Flux",
                "Mocha",
                "Jest",
                "Oracle PL/SQL",
                "SQL",
                "Dev-Ops",
                "Git",
                "Jenkins",
                "CI/CD"
            ],
            "secondary": [
                "System architecture",
                "N-Tire",
                "Cloud-native",
                "API management",
                "AWS",
                "Google",
                "Test-Driven Development",
                "Automation",
                "Unit Testing",
                "Analytical Skills",
                "System observability",
                "Monitoring",
                "Alerting",
                "Agile"
            ],
            "all": [
                "Java",
                "React",
                "Spring Framework",
                "Microservices",
                "HTML",
                "CSS",
                "JavaScript",
                "J2EE",
                "Hibernate",
                "Restful services",
                "Spring JDBC",
                "MVC",
                "Spring Boot",
                "JPA",
                "React.js",
                "Webpack",
                "Redux",
                "Flux",
                "Mocha",
                "Jest",
                "Oracle PL/SQL",
                "SQL",
                "Dev-Ops",
                "Git",
                "Jenkins",
                "CI/CD",
                "System architecture",
                "N-Tire",
                "Cloud-native",
                "API management",
                "AWS",
                "Google",
                "Test-Driven Development",
                "Automation",
                "Unit Testing",
                "Analytical Skills",
                "System observability",
                "Monitoring",
                "Alerting",
                "Agile"
            ],
            "with_experience": [
                "Java (13+ years)",
                "React (2+ years)",
                "Spring Framework",
                "Microservices",
                "HTML",
                "CSS",
                "JavaScript"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Tejaswi Athili",
        "email": "tejaswi_athili@insoursysinc.com",
        "jd": "From: Teja, insoursysinc tejaswi_athili@insoursysinc.com Reply to: tejaswi_athili@insoursysinc.com This is a C2H Position and Employer have No Objection for having your consultant being directly hired by end client any time AFTER the initial 6monthsMust Be 13+ years with Lead Exp. and GC not with the Employers Only on W2 or Own Corporation.Lead React Java Full Stack Princeton, NJ or Water Street, NY (Hybrid day 1)Note: We need candidate who is equally competent with both Java and React (Hands on). Core Responsibilities (Team & Delivery Leadership):Technical Acumen:Deliver business value through application development and enhancements.Demonstrate a strong sense of ownership and responsibility with assignments. This includes gathering and understanding requirements, technical specifications, design, architecture, implementation, unit testing, builds/deployments, and code management.Evaluate, assess, plan, and guide technical direction and architecture decisions. Leading Team:Mentor, guide the development team through the process of design, estimation, development, and unit testing.Conduct code reviews, ensure coding standards are maintained, lead the best practices adoption, and drive continuous improvement in development processes.Lead to inspire a team of engineers, fostering a positive and productive work culture.Be a self-starter and an excellent team player.Stay abreast with industry trends and technological advancements and apply this knowledge to guide the team in selecting appropriate technologies and methodologies.Provide technical guidance, support professional development, and conduct regular performance reviews in conjunction to the delivery managers. Partnership:Interface, collaborate and communicate effectively with business and cross functional/technical partners.Active participation and contribution to PI, product & release planning etc.Collaborate with onsite and offsite team members effectively. Core Skills:9+ years in Java J2EE building web applications, spring technologies/frameworks (Spring Core, Spring MVC, Spring Cloud, Spring Boot) and tools.Java, JEE & spring technologies/frameworks (Spring Core, Spring MVC, Spring Cloud, Spring Boot) and tools.5+ years of experience with related frameworks and technologies (Hibernate, Restful services Spring JDBC, MVC etc.)Strong experience with Microservices, Spring Boot / Spring framework, Rest API, JPA.8+ years of experience in web development using HTML, CSS and JavaScript including ES2016+ Minimum 2 years of experience of REACT tools including React.js, Webpack, Redux and Flux Experience with user interface design Knowledge of unit testing frameworks like Mocha and Jest Experience with browser based debugging and excellent troubleshooting skills Knowledge on system architecture (N-Tire, Microservices, Cloud-native).Strong knowledge of system design principles for scalable, high-performance, and extensible solutions for enterprise grade distributed and services systems. Significant knowledge of Oracle PL/SQL and SQL.Experience with Oracle Web logic, Tomcat to include installation, configuration, troubleshooting.Working experience of Spring Boot application configuration, deployment and troubleshooting on server platforms Oracle Web logic/Tomcat/Cloud.Experience with API management and Cloud-based platforms and services (AWS, Google).Working knowledge of Dev-Ops: Git, Jenkins, CI/CD pipelines, etc.Understanding of Test-Driven Development practices as well as Automation and Unit Testing.Strong Analytical Skills.Working knowledge on system observability/monitoring and alerting.Experience Architecting and developing large scale Enterprise applications.Proficient with software development lifecycle (SDLC) methodologies like Agile, Test- driven development. Any experience in building applications for financial industry is a plus Education:Bachelor’s or higher degree in Computer Science, Engineering, or a related field.Proven experience (12+years) in Engineering role.3+ Years experience as Engineering/Technical lead role.Excellent communication skills and the ability to collaborate effectively with cross-functional teams.Demonstrated experience in delivering complex enterprise grade software solutions.",
        "source": "Email",
        "date_posted": "2024-10-22 08:15:56-05:00",
        "unique_id": "192b47efc422c1c3",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]