[
    {
        "company": "SSPEARHEAD INC",
        "job_title": "Software Architect",
        "location": "Schenectady, NY, USA",
        "full_location": {
            "city": "Schenectady",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "HBITS-06-13599",
            "experience_required": "84 months",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "30 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "BizTalk",
                "MS Dynamics CRM",
                "ASP.NET",
                "C#",
                "WCF",
                "Web API"
            ],
            "primary": [
                "SOAP",
                "REST",
                "JavaScript",
                "SSRS",
                "Responsive Design"
            ],
            "secondary": [
                "Troubleshooting",
                "Maintenance",
                "Bug Fixing",
                "Web Service Development",
                "Data Extracts"
            ],
            "all": [
                "BizTalk",
                "MS Dynamics CRM",
                "ASP.NET",
                "C#",
                "WCF",
                "Web API",
                "SOAP",
                "REST",
                "JavaScript",
                "SSRS",
                "Responsive Design",
                "Troubleshooting",
                "Maintenance",
                "Bug Fixing",
                "Web Service Development",
                "Data Extracts"
            ],
            "with_experience": [
                "BizTalk (84 months)",
                "MS Dynamics CRM (60 months)",
                "ASP.NET (84 months)",
                "C# (84 months)",
                "WCF (84 months)",
                "Web API (84 months)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Yogesh Dahiya",
        "email": "yogeshd@sspearhead.com",
        "jd": "From: Yogesh Dahiya, SSPEARHEAD INC yogeshd@sspearhead.com Reply to: yogeshd@sspearhead.com Hi, Hope you are doing good. Please have a look on below position and let me know if you are interested? Required Documentation: Make sure you if you are fine with this job then please share the below details at the time submission time.If you are not going to provide these details then please don’t apply for this job.1: Passport mandatory for these visa’s ( EAD, GC and H1B)2: Visa stamping copy required for H1 B3: Must be provide 3 references with full name, email id, client name and phone number. Job Description:Job Id: HBITS-06-13599Role: Software ArchitectClient: NYSDuration: 30 monthsLocation: Schenectady, NY – OnsiteThere is only 1 round interview direct client.CHOICES is currently running on a highly customized version of MS Dynamics 365 and utilizes a BizTalk application to receive a large volume of updates. This position involves monitoring/troubleshooting, developing bug fixes and enhancements, and upgrading or re-architecting various applications that include or interact with CHOICES.QualificationsSoftware Architect - Makes high-level design choices and dictates technical standards, including software coding standards, tools, and platforms. Designs multi-leveled architecture or component interactions of a large scale software system. Expert- 84+ months: Candidate is able to provide guidance to large teams and/or has extensive industry experience and is considered at the top of his/her field. 84 months of experience in analysis, design, development, deployment, and troubleshooting of BizTalk integration solutions for enterprise-level applications using WCF and web services (SOA). 84 months of experience designing and developing high performance enterprise-level web application systems using ASP.NET/C# and external web services in a .NET/IIS environment 84 months of experience designing/developing/securing (not just consuming) SOAP and REST external web services, including experience designing/developing external web services with Windows Communication Foundation (WCF) and Web API. 60 months of development experience creating and modifying heavily customized forms, entities, and views to work in multiple browser types and versions for Microsoft Dynamics CRM 2011, Microsoft Dynamics CRM 2013 and later versions. 60 months of development experience creating and modifying client-side JavaScript, C# plug-ins, and workflow activities for MS Dynamics CRM 2011, MS Dynamics CRM 2013, and later versions. Day-to-Day tasksMaintenance and bug fixing for the MS BizTalk application instances. Resolve production problems and business unit inquiries, including Help Desk tickets. Maintenance and bug fixing of .NET Web Applications. Troubleshoot and modify heavily customized forms created in MS Dynamics CRM 2013 and earlier versions to work in MS Dynamics 365 v9.x with multiple device types, browser types, and versions. Modernize forms and application functionality within CHOICES to utilize best practices and responsive design principles, while ensuring that existing functionality is preserved. This may include web service development, file uploads, electronic signatures, SSRS reports, and data extracts. E-mail is the best way to reach me, if I don’t pick your call. Thanks & RegardsYogesh DahiyaSspearhead Inc",
        "source": "Email",
        "date_posted": "2024-10-01 12:55:51-05:00",
        "unique_id": "19249398e8cc4f26",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]