[
    {
        "company": "Thoughtwave Software and Solutions Inc",
        "job_title": "Workday Finance Business Analyst",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "4+ years",
            "degree_required": "Bachelor’s degree in Accounting or Information Systems or equivalent",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "till 6/30/2025",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Workday Project",
                "Workday Grants",
                "Workday Billing",
                "Analytical skills",
                "Change management"
            ],
            "primary": [
                "Communication skills",
                "Problem-solving",
                "Documentation",
                "Testing",
                "Training development"
            ],
            "secondary": [
                "Public Sector experience",
                "State of GA Financials system",
                "Business requirements translation",
                "Application design",
                "Functional design"
            ],
            "all": [
                "Workday Project",
                "Workday Grants",
                "Workday Billing",
                "Analytical skills",
                "Change management",
                "Communication skills",
                "Problem-solving",
                "Documentation",
                "Testing",
                "Training development",
                "Public Sector experience",
                "State of GA Financials system",
                "Business requirements translation",
                "Application design",
                "Functional design"
            ],
            "with_experience": [
                "Workday Project (4+ years)",
                "Workday Grants (4+ years)",
                "Workday Billing (4+ years)"
            ]
        },
        "job_type": [
            "hybrid",
            "remote"
        ],
        "contact_person": "Priya",
        "email": "priya@thoughtwavesoft.com",
        "jd": "From: Priya-630-812-5138, Thoughtwave Software and Solutions Inc priya@thoughtwavesoft.com Reply to: priya@thoughtwavesoft.com HiGreetings from Team Thoughtwave Software and Solutions,Please find below the exciting Job opening with our esteem client with details Job description and if you are looking for a new Job opening here is the position and you respond with the latest/updated resume to email priya@thoughtwavesoft.com or feel free reach at 630-812-5138 Title: SAO Finance Business AnalystLocation: Atlanta, GA (Hybrid)Duration: till 6/30/2025 Local candidates strongly preferred. Out of state candidates that would work 100% remote is acceptable. Responsibilities • Implements Project, Grants & Billing modules. • Analyzes information to determine nature and extent of customer requirements and concerns.• Develops and/or executes change management plans for transition to new systems.• Consults with implementation partner and technical staff to ensure that functionality of automated systems is consistent with adherence to laws, regulations, and best practice standards by users.• Tests or coordinated testing of new installations or upgrades.• Participates in evaluation of new technologies, enhancements or solutions to improve service and efficiency of systems.• Researches and analyzes system/user problems by applying a variety of analytical and research techniques.• Participates in the establishment of standards and procedures to be used in the development of systems. Technical Competencies• Ability to research, analyze information and make recommendations. • Ability to determine functional needs and system requirements.• Ability to develop solutions based on analysis.• Ability to evaluate existing systems and understand their structure and component parts. • Ability to prepare models, diagrams and layouts.• Ability to document project standards and methodologies.• Ability to analyze system and data to determine extent of problem or error. • Ability to work with other IT units/staff to diagnose problem.• Ability to communicate information to stakeholders and customers.• Ability to develop effective and feasible business area solutions. • Ability to assist in developing communication plans.• Ability to review and interpret installation/upgrade notes. • Ability to create testing plans and scripts.• Ability to execute test scripts.• Ability to develop training courses for target audience. • Ability to conduct training sessions.• Ability to develop training manuals.• Ability to research and stay abreast of technological advances. • Ability to act as a liaison between groups.• Ability to coordinate between multiple workgroups.• Ability to assess/evaluate customer’s needs and business requirements. • Ability to conduct quality assessments.• Knowledge of naming conventions, encyclopedia management, transactions definitions, general specification definition, programming standards and testing procedures.• Knowledge of applications and inter-relationships with programs and/or systems. • Knowledge of quality assurance plans.• Knowledge of customer needs and business requirements. • Knowledge of data extraction methods.• Knowledge of current industry trends. Knowledge of operational procedures. • Knowledge of the change management process. Ability to adhere to deadlines. Preferred Qualifications: • 4+ years of hands-on experience with Workday Project, Grants & Billing modules• Bachelor’s degree in Accounting or Information Systems or equivalent• 4+ years of experience in Public Sector• Prior experience working with the State of GA Financials system• Translate business needs into business and functional requirements• Conduct application design and architecture component configuration for related modules/business processes• Write and interpret functional and business requirements as an input to application design• Develop and test detailed functional design for business solution components and prototypes• Complete tasks in an efficient and timely manner, and reporting progress at least weekly to the implementation Project Manager, Project Sponsor, or designated employee• Seek innovative approaches to improve the process of delivering Workday financial accounting and reporting solutions to customers• Willingness to share suggestions and knowledge capital to help optimize the Financial Systems Division’s implementation and project methodology• Ability to develop Workday reports• Demonstrate proficiency in relevant analytical abilities• Demonstrate ability to communicate clearly and effectively in both oral and written formats• Demonstrate ability to work effectively with functional and technical teams",
        "source": "Email",
        "date_posted": "2024-10-01 21:25:19-05:00",
        "unique_id": "1924b0b43d338c99",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]