[
    {
        "company": "Yochana IT Solutions",
        "job_title": "AWS Architect",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "AWS services",
                "Cloud architecture design",
                "Security and compliance",
                "Networking expertise",
                "Automation and scripting",
                "Monitoring and logging",
                "Migration and hybrid cloud",
                "Containerization and serverless",
                "Problem-solving and troubleshooting"
            ],
            "primary": [
                "Terraform",
                "AWS Lambda",
                "AWS Step Functions",
                "Docker",
                "AWS ECS",
                "AWS EKS"
            ],
            "secondary": [
                "Terraform enterprise",
                "Continuous learning",
                "AWS Certified Solutions Architect - Associate",
                "AWS Certified Solutions Architect - Professional"
            ],
            "all": [
                "AWS services",
                "Cloud architecture design",
                "Security and compliance",
                "Networking expertise",
                "Automation and scripting",
                "Monitoring and logging",
                "Migration and hybrid cloud",
                "Containerization and serverless",
                "Problem-solving and troubleshooting",
                "Terraform",
                "AWS Lambda",
                "AWS Step Functions",
                "Docker",
                "AWS ECS",
                "AWS EKS",
                "Terraform enterprise",
                "Continuous learning",
                "AWS Certified Solutions Architect - Associate",
                "AWS Certified Solutions Architect - Professional"
            ],
            "with_experience": []
        },
        "job_type": [],
        "contact_person": "Sai Supriya",
        "email": "supriya@yochana.com",
        "jd": "Hello ,Hope you are doing great!!!This is Sai Supriya from Yochana IT Solutions, we have an urgent requirement with one of our clients, please go through the requirement below and let me know your interest. You can forward this opportunity to your friends or colleagues; so that we can help someone who may be desperately looking for opportunities. I sincerely appreciate your time.JD - Role: AWS ArchitectAs an AWS Solutions Architect, you need a diverse set of skills to design, implement, and maintain robust and scalable cloud solutions on the AWS platform. Here are some of the top skills required for an AWS Solutions Architect role:Solid understanding of AWS services: You should have an in-depth knowledge of various AWS services such as EC2, VPC, IAM, and their use cases, configurations, and best practices.Cloud architecture design: You should be able to design highly available, fault-tolerant, and scalable cloud architectures that align with business requirements and follow AWS best practices.Security and compliance: Understanding AWS security services like IAM, VPC, Security Groups, and compliance requirements is essential.Networking expertise: Knowledge of networking concepts like VPCs, subnets, routing tables, gateways, cloudWAN is crucial for designing secure and efficient network architectures.Automation and scripting: Proficiency in using infrastructure as code tools like Terraform for automating infrastructure provisioning and management. Terraform enterprise and harness as nice to have.Monitoring and logging: Familiarity with AWS monitoring and logging services like CloudWatch, CloudTrail, and AWS Config for monitoring resources, analyzing logs, and maintaining compliance.Migration and hybrid cloud: Experience in migrating private cloud workloads to AWS and designing cloud architecturesContainerization and serverless: Knowledge of containerization technologies like Docker and AWS ECS/EKS, as well as serverless architectures using AWS Lambda and AWS Step Functions.Problem-solving and troubleshooting: Strong analytical and problem-solving skills to troubleshoot and resolve complex issues in a cloud environment.Continuous learning: Ability to stay updated with the latest AWS services, features, and best practices through continuous learning and professional development.Additionally, AWS certifications like AWS Certified Solutions Architect - Associate and AWS Certified Solutions Architect - Professional can validate your skills and knowledge in the AWS ecosystem. Thanks & Regards,Sai Supriya- Resource Specialist Yochana IT Solutions Inc.Email: Supriya@yochana.com",
        "source": "Email",
        "date_posted": "2024-09-30 11:57:53-05:00",
        "unique_id": "19243ddac96c3cbd",
        "emp_type": [],
        "tag": "AWS Data Engineer"
    }
]