[
    {
        "company": "Thoughtwave Software and Solutions Inc",
        "job_title": "Finance Business Analyst",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Workday Financials",
                "Project Management",
                "Grants Management"
            ],
            "primary": [
                "Budgeting Processes",
                "Software Development Life Cycle (SDLC)",
                "Functional Design",
                "System Configuration"
            ],
            "secondary": [
                "Change Management",
                "Customer Service",
                "Analytical Techniques",
                "Testing Coordination"
            ],
            "all": [
                "Workday Financials",
                "Project Management",
                "Grants Management",
                "Budgeting Processes",
                "Software Development Life Cycle (SDLC)",
                "Functional Design",
                "System Configuration",
                "Change Management",
                "Customer Service",
                "Analytical Techniques",
                "Testing Coordination"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Priya",
        "email": "priya@thoughtwavesoft.com",
        "jd": "From: Priya-630-812-5138, Thoughtwave Software and Solutions Inc priya@thoughtwavesoft.com Reply to: priya@thoughtwavesoft.com Hi Greetings from Team Thoughtwave Software and Solutions,Please find below the exciting Job opening with our esteem client with details Job description and if you are looking for a new Job opening here is the position and you respond with the latest/updated resume to email priya@thoughtwavesoft.com or feel free to reach at 630-812-5138 Title: Finance Business AnalystLocation: Atlanta, GA(Hybrid) Complete Description:Candidate will work closely with Functional and technical developer teams to implement Workday Financials Project & Grants modules. Experience in Project is a MUST have. Leveraging relevant knowledge of Workday Financials, reporting and budgeting processes as well as related accounting considerations including Software Development Live Cycle (SDLC), the qualified candidate will provide high quality support and leadership for the optimal design and configuration of the system to assure maximum benefit to our customers. This candidate will also be required to work in partnership and independently with the relevant Business Owner organizations and other functional SMEs (as required) to identify and refine business requirements and create the functional design and architecture necessary to support the requirements. It is also expected that this candidate will be familiar with full lifecycle implementation processes and perform all expected functional procedures as required. Finally, personal commitment to serve the customer with excellence, competence, proficiency and courtesy will be essential. Responsibilities • Implements Project, Grants & Billing modules. • Analyzes information to determine nature and extent of customer requirements and concerns.• Develops and/or executes change management plans for transition to new systems.• Consults with implementation partner and technical staff to ensure that functionality of automated system is consistent with adherence to laws, regulations, and best practice standards by users.• Tests or coordinates testing of new installations or upgrades.• Participates in evaluation of new technologies, enhancements or solutions to improve service and efficiency of systems.• Researches and analyzes system/user problems by applying a variety of analytical and research techniques.• Participates in the establishment of standards and procedures to be used in the development of systems.",
        "source": "Email",
        "date_posted": "2024-10-01 18:50:46-05:00",
        "unique_id": "1924a7dc80e3b6ee",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]