[
    {
        "company": "Yochana IT Solutions",
        "job_title": "Oracle DBA",
        "location": "Jacksonville, FL, USA",
        "full_location": {
            "city": "Jacksonville",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle DBA",
                "Exadata",
                "RAC",
                "ASM",
                "Dataguard",
                "SQL",
                "Database Level performance tuning",
                "Backup and recovery",
                "Shell scripting"
            ],
            "primary": [
                "Exadata health check",
                "Migration",
                "Resource management",
                "Patching/upgrade",
                "Database performance tuning",
                "Oracle Enterprise Manager Grid Control",
                "Solaris",
                "Linux",
                "AIX"
            ],
            "secondary": [
                "24*7 Global support model",
                "Troubleshooting",
                "Diagnostic skills",
                "Analytical skills",
                "Communication skills",
                "Coordination skills",
                "Change/Release Management",
                "ITIL Foundation Certified"
            ],
            "all": [
                "Oracle DBA",
                "Exadata",
                "RAC",
                "ASM",
                "Dataguard",
                "SQL",
                "Database Level performance tuning",
                "Backup and recovery",
                "Shell scripting",
                "Exadata health check",
                "Migration",
                "Resource management",
                "Patching/upgrade",
                "Database performance tuning",
                "Oracle Enterprise Manager Grid Control",
                "Solaris",
                "Linux",
                "AIX",
                "24*7 Global support model",
                "Troubleshooting",
                "Diagnostic skills",
                "Analytical skills",
                "Communication skills",
                "Coordination skills",
                "Change/Release Management",
                "ITIL Foundation Certified"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Sai Supriya",
        "email": "supriya@yochana.com",
        "jd": "Hello ,Hope you are doing great!!!This is Sai Supriya from Yochana IT Solutions, we have an urgent requirement with one of our clients, please go through the requirement below and let me know your interest. You can forward this opportunity to your friends or colleagues; so that we can help someone who may be desperately looking for opportunities. I sincerely appreciate your time.Role – Oracle DBALocation – Jacksonville, FL (Onsite from day -1)Top-notch Exadata specialist Experience in RAC, ASM, Dataguard, Infiniband switch, storage cell Experience in Exadata health check, migration, resource management and patching/upgrade Expertise in database performance tuning Expertise in Backup and recovery Basic Requirement10+ years of production support experience as Oracle DBA with at least 6 years of strong experience on Exadata platform Demonstrable experience of managing high-performance, high-capacity databases in a critical production environment. Solid Oracle 11gR1/R2 RAC experience including build, general administration, troubleshooting (Break/Fix) and performance tuning skills Experience in Clusterware (GRID Infrastructure) - CRS management and configuration Skilled in Oracle ASM and Dataguard administration Expertise in SQL & Database Level performance tuning skills Expertise in backup and recovery and migration using RMAN, datapump and export/import. Experience in maintenance and management of databases using Oracle Enterprise Manager Grid Control. Experience on Solaris, Linux and AIX OS including strong shell scripting skills. Willingness to work in 24*7 Global support model. Aid development teams for analyzing issues. Excellent troubleshooting, diagnostic & analytical skills. Excellent communication & coordination skills is required. Strong initiative and sense of ownership. Expert knowledge of database scripting and automation technology Excellent written and verbal communications Experience working with offshore vendors Builds positive working relationships, works collaboratively with other team members, and is a team player. Experience in a large corporate environment Competent in Change/Release Management ( ITIL based – preferably ITIL Foundation Certified)",
        "source": "Email",
        "date_posted": "2024-09-30 10:50:50-05:00",
        "unique_id": "19243c9315e8185f",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Oracle DBA"
    }
]