[
    {
        "company": "Source Infotech",
        "job_title": "Security Program Manager Infosec Patch Management",
        "location": "Wilmington, DE, USA",
        "full_location": {
            "city": "Wilmington",
            "state": "DE",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Senior-level, 10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ months contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Infrastructure security",
                "Cloud Security",
                "Vulnerability management"
            ],
            "primary": [
                "IT Security",
                "Network Security",
                "Amazon AWS",
                "Microsoft Azure",
                "Google Cloud Platform"
            ],
            "secondary": [
                "Agile methodologies",
                "Risk Management",
                "Operating Systems",
                "Vulnerability scanning",
                "Cybersecurity trends",
                "NIST",
                "CIS",
                "CISSP",
                "A+",
                "Security+",
                "CEH",
                "CISA",
                "CRISC"
            ],
            "all": [
                "Project Management",
                "Infrastructure security",
                "Cloud Security",
                "Vulnerability management",
                "IT Security",
                "Network Security",
                "Amazon AWS",
                "Microsoft Azure",
                "Google Cloud Platform",
                "Agile methodologies",
                "Risk Management",
                "Operating Systems",
                "Vulnerability scanning",
                "Cybersecurity trends",
                "NIST",
                "CIS",
                "CISSP",
                "A+",
                "Security+",
                "CEH",
                "CISA",
                "CRISC"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Khushank Chauhan",
        "email": "khushank@sourceinfotech.com",
        "jd": "From: KhushankChauhan, Source Infotech khushank@sourceinfotech.com Reply to: khushank@sourceinfotech.com Program Manager /Infosec/Patch Management\nLocation: Wilmington, DE (Hybrid Onsite)(Local only with local ID)\nDuration: 6+ months contract\nIV: Phone and Video\nVisa: No H1b/CPT/OPT\nNeed LinkedIn:\nVendor’s Note:THIS CANDIDATE MUST BE A COMITTED SECURITY PROGRAM/PROGRAM MANAGER, NOT A PROGRAM MANAGER WITH SOME SECURITY EXPERIENCE. WE NEED A SME. WE NOW NEED A PROJECT AND PROGRAM MANAGER FOR THIS ROLE.\nNeed High level Program Manager of Security, Vulnerability management. *** We need: A senior (10+ years) Program/Project Manager with experience leading IT Security INFRASTRUCTURE PROJECTS FROM A NETWORK AND CLOUD SECURITY PERSPECTIVE, NOT GOVERNANCE. Candidate will oversee the enterprise-class information technology and security vulnerability management experience with the capabilities in elevating a vulnerability program with proper reporting in place and ability to identify enhancements. They also need Strong hands-on experience and knowledge with Cloud Technologies: (e.g., related to Fundamentals, Security, Amazon AWS, Microsoft Azure, Google Cloud Platform).*** Candidate Must Have’s on a resume and for submittal:1. How many years working with: Project Management\n2. How many years working with: Infrastructure security\n3. How many years working with: Certifications\n4. How many years working with: Infrastructure\n5. How many years working with: Cloud Security\nPlease send candidates who meet or exceed the Below experience:\nManagers Notes:Our client is looking for positive, self-motivated professionals with expertise in agile project to drive alignment, collaboration, and communication within our organization. The Program Manager will work with IT and Security teams to execute strategic projects within the Vulnerability & Patch Management Program. The ideal candidate is an expert at managing large, complex projects with many cross-functional teams, effectively driving processes to keep teams productive.\nResponsibilities\nLead and manage IT and security-related programs and initiatives, ensuring alignment with cross-functional stakeholders, organizational goals, industry best practices, and regulatory requirements.\n• Collaborate with cross-functional teams, including IT, engineering, product, legal, and compliance, to integrate security requirements into business processes and the product development lifecycle.\n• Manage the planning, execution, and delivery of IT and security projects, ensuring adherence to timelines, budgets, and quality standards.\n• Define and track key security metrics and performance indicators to measure the effectiveness of security programs and initiatives, such as vulnerability management, incident management, change management and others.\n• Quantitatively manage the completion of security objectives based on the analysis of data and indicators.\n• Partner with Sales, Customer Success, Engineering and Product teams to manage customer-driven IT and Security requirements, including the coordination of requirements identification and intake, work assignment and scheduling, and integration and delivery.\nPreferred Knowledge, Skills, and Abilities:\n• Three (3) years of enterprise-class information technology and security vulnerability management experience with the capabilities in elevating a vulnerability program with proper reporting in place and ability to identify enhancements.\n• Three (3) years of relevant experience in a supervisory capacity managing small to medium sized teams in a large IT enterprise environment.\n• Strong hands-on experience and knowledge with Cloud Technologies: (e.g., related to Fundamentals, Security, Amazon AWS, Microsoft Azure, Google Cloud Platform).\n• Strong knowledge and experience evaluating, designing, testing, and supporting hardware and software-based security.\n• Strong knowledge and experience with information security and network communications practices and principles, technologies, and systems.\n• Proficient knowledge and experience with vulnerability scanning plus risk and mitigation best practices.\n• Ability to stay knowledgeable of cybersecurity trends and emerging threats.\n• Proficient knowledge and proven experience with the following skillsets: • Networking/Data Communications• Risk Management• Operating Systems (e.g., Windows/Linux)• Vulnerability management tools such as Tenable and Palo Alto Xpanse• Other Security Tool sets/categories (e.g., Firewalls, Routers/switches, Database, Web Servers, Applications); Common vulnerabilities, CVEs, and CWEs; Encryption and cipher technologies\n• Experience with security frameworks such as NIST (e.g., NIST 800-53) and CIS.\n• Demonstrated experience and success with development and promulgation of enterprise-class security policy and standards.\n• Demonstrated experience and success with completion of risk assessments and vulnerability assessments.\n• LAN/WAN operational experience, including networking, OS, web/application/Database servers, storage, hardware, firewalls, and monitoring and detection tools.\n• Excellent people management, communication, and customer interaction skills.\n• Ability to work independently, manage projects, and exercise judgement in reaching solutions.\n• Ability to quickly grasp how new technologies work and how they might be applied to achieve business goals.\n• Demonstrated ability to communicate effectively, both orally and in writing.\n• Experience in scrum, kanban and SAFe.\nCertification(s):· CISSP, A+, Security+, CEH, CISA, CRISC, or other IT security operations/vulnerability management certifications is a plus, but not required.",
        "source": "Email",
        "date_posted": "2024-10-01 09:41:59-05:00",
        "unique_id": "192488818c7181d4",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]