[
    {
        "company": "Yochana Solutions Inc.",
        "job_title": "Supply Chain Business Analyst (Oracle ERP exp)",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "$70/HR on C2C"
        },
        "skills": {
            "core": [
                "Oracle ERP",
                "AS400",
                "Excel",
                "SQL",
                "Data Migration"
            ],
            "primary": [
                "Data Extraction",
                "Analytical Skills",
                "Critical Thinking",
                "Decision-Making Skills",
                "Communication Skills",
                "Interpersonal Skills"
            ],
            "secondary": [
                "Legacy Systems",
                "Data Transformation",
                "Technical Documentation",
                "Quality Assurance",
                "Performance Optimization"
            ],
            "all": [
                "Oracle ERP",
                "AS400",
                "Excel",
                "SQL",
                "Data Migration",
                "Data Extraction",
                "Analytical Skills",
                "Critical Thinking",
                "Decision-Making Skills",
                "Communication Skills",
                "Interpersonal Skills",
                "Legacy Systems",
                "Data Transformation",
                "Technical Documentation",
                "Quality Assurance",
                "Performance Optimization"
            ],
            "with_experience": [
                "Oracle ERP (10+ years)",
                "Data Migration (10+ years)"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Madhulatha",
        "email": "madhulatha@yochana.com",
        "jd": "Hello,I’m a Madhulatha Technical Recruiter with Yochana Solutions Inc., a national IT staffing solutions provider with 14 plus years of experience delivering value to leading companies across the U.S and Canada. I'm currently staffing for Title: Supply Chain Business Analyst (Oracle ERP exp) Location: Remote Below you will find the job description, if you are qualified and interested, please send me your Updated Word Document Resume. My apologies if this position is not an ideal fit, we'll keep you in mind for other suitable positions and referrals would be appreciated. Thank you in advance. Title: Supply Chain Business Analyst (Oracle ERP exp)Location: RemoteDuration: ContractJOB Description:$70/HR on C2CSupply chain BA with good skill. Minimum Experience of 10 years To play the role of Business Analyst who can be cross functional across systems to device data conversion approach. Should have knowledge on AS400, Excel, Other RDBS and File based systems so he can understand the Legacy systems and can do the expected data extraction from the same. Good understanding of Oracle ERP cloud architecture and should have On-Prem to Cloud data migration exposure. Knowledge on databases and SQL. Possess strong analytical critical thinking and have strong decision-making Skills Communication and Interpersonal Skills Roles and Responsibilities: Participate in Conversion strategy and criteria for extraction. Liaise with Business teams to identify legacy system tables (modules, objects and data elements) required to support the migration strategy.Liaise with peer teams for solution for conversion. Liaise with Client and third party vendors to reconcile extracted data. Liaise with Client and third party vendors for data transformation rules for target data Review Technical Design and Build extraction logics for the required business requirements. Deploy data extraction routines from the legacy system testing environment(s) to support testing of data being extracted and Transformed as per the expectations. Resolve extract defects uncovered in Testing.Prepare relevant documentation.Leadership Communication: Ability to work well with different staff levels within and out of core competency. Ability to translate high technical solutions problems to audiences at varying technical levels. Strong ability to prepare and present technical documentation. Communicates in a professional manner when interacting across staff levels and internal/external customers. Understands the importance of communicating risk assessment. To be responsible for providing technical guidance to a team of developers, enhancing their technical capabilities and increasing productivity. To conduct comprehensive code reviews, establish and oversee quality assurance processes, performance optimization , implementation of best practices and coding standards to ensure succeful delivery of complex projects. To ensure process compliance in the assigned module, and participate in technical discussions over review as a technical consultant for feasibility study (technical alternatives, best packages, supporting architecture best practices, technical risks, breakdown into components, estimations). To collaborate with stakeholders to define project scope, objectives, deliverables and accordingly prepare and submit status reports for minimizing exposure and closure of escalations.",
        "source": "Email",
        "date_posted": "2024-09-30 12:21:48-05:00",
        "unique_id": "1924451c79ba18d7",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]