[
    {
        "company": "Goli Technologies",
        "job_title": "Senior Business Analyst",
        "location": "Harrisburg, PA, USA",
        "full_location": {
            "city": "Harrisburg",
            "state": "PA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ Month",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Requirements Elicitation",
                "Documentation",
                "User Acceptance Testing (UAT)",
                "Agile Development"
            ],
            "primary": [
                "Testing Support",
                "Process Improvement",
                "Stakeholder Liaison",
                "Project Documentation",
                "Digital Accessibility Standards"
            ],
            "secondary": [
                "AWS",
                "Ruby on Rails",
                "Mentoring",
                "Communication",
                "Problem Solving"
            ],
            "all": [
                "Business Analysis",
                "Requirements Elicitation",
                "Documentation",
                "User Acceptance Testing (UAT)",
                "Agile Development",
                "Testing Support",
                "Process Improvement",
                "Stakeholder Liaison",
                "Project Documentation",
                "Digital Accessibility Standards",
                "AWS",
                "Ruby on Rails",
                "Mentoring",
                "Communication",
                "Problem Solving"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Aravind",
        "email": "aravind@golitech.com",
        "jd": "From: Aravind, Goli Technologies aravind@golitech.com Reply to: aravind@golitech.com Hi,Hope you are doing great!!!Please revert me resume and details ASAP.Title : Senior Business AnalystLocation : Harrisburg, PA, Remote , As of now but in future onsite (Only locals)Duration : 6+ MonthSenior BA will (but not limited to): · Provide a comprehensive, independent evaluation of existing efforts. · Support requirements elicitation, prioritization, validation, and documentation.· Document process changes as needed for improved business processes:· Participate in the planning, conducting, and evaluation of testing activities.· Provide guidance and serve as a liaison between the development team, vendor, and project stakeholders to report and resolve issues.· Provide meeting agendas and meeting minutes for specified meetings.· Support the creation and submission of project documentation and coordinate approval of all documentation.· Assist with implementation support and outcome documentation. · Be knowledgeable of, adhere to, and contribute to established digital accessibility regulations and standards.The Senior BA will perform various testing and validation activities surrounding the Find My Ride (FMR) iterative releases as agreed upon by the project’s governance team. The Senior BA will perform the following testing support activities: · Create test scripts.· Prepare test data.· Execute and support user acceptance testing (UAT).· Coordinates and tests accessibility conformance.· Document testing outcomes, identify gaps, and report system defects and issues.· Collaborate and triage found issues and track to ensure timely resolution.The Senior BA will compile testing documentation into reports that include various documents such as: · Test Scripts and Outcomes Reports. The Senior BA will provide design and implementation support services surrounding the implementation of Find My Ride (FMR) releases. Sample services include: · Supporting Go-Live activities.· Capturing and communicating implementation schedule changes. · Updating project documentation based on implementation outcomes. · Maintain work products and track modifications through the BA Services documentation change management processes.The Senior BA will compile implementation documentation into Implementation Outcome Reports that include various documents such as: · Session Notes. · Requirements Change Management Reports.· Recommendations for subsequent Go-Live planning. Senior Business Analyst level is defined as: · Five or more years of business analysis experience.· Capable of applying the listed knowledge, skill, competency, or performing the activity independent of supervision.· Able to instruct and mentor others in the exercise or performance of the business analysis responsibilities.· Mastery of industry standards and best practices for the business analysis responsibilities with the ability to contribute improvements to the practice.· Experience and/or familiarity with agile development methodologies is preferred, but not required.Experience and/or familiarity with AWS and/or Ruby on Rails is preferred, but not required.Thanks & Regards, AravindGoli Technologiesaravind@golitech.com",
        "source": "Email",
        "date_posted": "2024-09-30 07:48:18-05:00",
        "unique_id": "19243230969dd92c",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]