[
    {
        "company": "GVR Infotek",
        "job_title": "Full-Stack Developer",
        "location": "Minneapolis, MN, USA",
        "full_location": {
            "city": "Minneapolis",
            "state": "MN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Bachelor’s degree in Computer Science, Information Technology, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "C#",
                "VB",
                "SQL Server",
                "SSIS"
            ],
            "primary": [
                "Visual Studio",
                "SQL Server Management Studio (SSMS)",
                "TFS",
                "Git",
                "GitLab"
            ],
            "secondary": [
                "MS Access",
                "Agile/Scrum",
                "cloud-based development"
            ],
            "all": [
                "C#",
                "VB",
                "SQL Server",
                "SSIS",
                "Visual Studio",
                "SQL Server Management Studio (SSMS)",
                "TFS",
                "Git",
                "GitLab",
                "MS Access",
                "Agile/Scrum",
                "cloud-based development"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Kartik Mahajan",
        "email": "kartik.mahajan@gvrinfotek.com",
        "jd": "From: Kartik Mahajan, GVR Infotek kartik.mahajan@gvrinfotek.com Reply to: kartik.mahajan@gvrinfotek.com Role: Full-Stack Developer (C#, VB, SQL Server, SSIS) Location: Minneapolis, Minnesota Day 1 Hybrid Onsite LinkedIn id is must (Should not been created recently, at least 6 Years old in case of senior candidates) VISA: Asylum, CITIZEN, GC EAD, GREEN CARD, H4 EAD, J2 EAD, L2 EAD, TN Permit ONLY GENUINE CANDIDATES Job Summary: We are seeking a talented Software Developer with a strong background in C# and VB development for desktop and web applications. The ideal candidate will also have experience in SQL Server Management Studio (SSMS), SQL Server Integration Services (SSIS), and version control systems such as TFS and Git/GitLab. This role involves collaboration with cross-functional teams to design, develop, and implement software solutions that meet our business needs. Qualifications: Bachelor’s degree in Computer Science, Information Technology, or a related field. Proven experience in Visual Studio development using C# and VB for both desktop and web applications. Strong proficiency in SQL Server Management Studio (SSMS) and experience with SQL Server Integration Services (SSIS). Familiarity with version control systems, particularly TFS and Git/GitLab. Experience with MS Access development, specifically with .accdb file types and SQL data connections. Solid understanding of software development methodologies and best practices. Excellent problem-solving skills and attention to detail. Strong communication and collaboration skills, with the ability to work effectively in a hybrid team environment. Key Responsibilities: Develop and maintain desktop applications in C# using Visual Studio, ensuring efficient performance and user experience. Write and optimize SQL queries in SQL Server Management Studio (SSMS) for views, stored procedures, and other database objects. Create new automation packages using SQL Server Integration Services (SSIS) to streamline processes. Manage code repositories using TFS and transition projects to Git/GitLab for version control. Develop and maintain web applications in C# and VB using Visual Studio, ensuring adherence to best practices. Utilize MS Access for development related to .accdb file types, incorporating SQL data connections as needed. Collaborate with team members to gather requirements and translate them into technical specifications. Participate in code reviews, testing, and debugging to ensure high-quality software delivery. Stay updated with emerging technologies and industry trends to implement best practices in software development. Preferred Qualifications: Experience with Agile/Scrum methodologies. Knowledge of cloud-based development and deployment. Familiarity with additional programming languages and frameworks.",
        "source": "Email",
        "date_posted": "2024-10-01 13:56:39-05:00",
        "unique_id": "1924970887133bc8",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]