[
    {
        "company": "Cygnus Professionals",
        "job_title": "Technical Program Manager",
        "location": "San Jose, CA, USA",
        "full_location": {
            "city": "San Jose",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "3-5 years",
            "degree_required": "Bachelor degree in business or technical software program management related field of study",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Strong program manager skills",
                "Scrum Master skills",
                "Strong communication skills",
                "Familiarity with SQL",
                "Knowledge in project management methodologies"
            ],
            "primary": [
                "Project management",
                "UAT",
                "Project deployment",
                "Statistical analysis",
                "SmartSheets",
                "G-Suite applications"
            ],
            "secondary": [
                "Python",
                "Java",
                "PMP certification",
                "CSM certification",
                "Ability to work on tight deadlines",
                "Client-focused",
                "Collaborative",
                "Team player"
            ],
            "all": [
                "Strong program manager skills",
                "Scrum Master skills",
                "Strong communication skills",
                "Familiarity with SQL",
                "Knowledge in project management methodologies",
                "Project management",
                "UAT",
                "Project deployment",
                "Statistical analysis",
                "SmartSheets",
                "G-Suite applications",
                "Python",
                "Java",
                "PMP certification",
                "CSM certification",
                "Ability to work on tight deadlines",
                "Client-focused",
                "Collaborative",
                "Team player"
            ]
        },
        "job_type": [
            "onsite",
            "hybrid"
        ],
        "contact_person": "Ayushi Kaushik",
        "email": "ayushi@cygnuspro.com",
        "jd": "From: Ayushi, Cygnuspro ayushi@cygnuspro.com Reply to: ayushi@cygnuspro.com HIThis Ayushi Kaushik from Cygnus Professionals. I have an urgent job requirement matching your profile. If You are Interested, Please reply with updated resume at ayushi@cygnuspro.com or directly reach me Role: Technical Program ManagerLocation :San Jose, CA OR Austin, TXDuration: CONTRACT ROLE JDPrimary ObjectivesThis primary role is to support the Program Manager /Technical Program Manager on a variety of end to end projects management and execution including project intake, project artifacts creation , project implementation and activities tracking, UAT and project deployment. This person will work with program managers across the team as well as the stakeholders to ensure the projects achieve our planned goals.Some Key Responsibilities: Organizing content with content editors for monthly project status and business value updates. Documenting and following up on important actions and decisions from meetings.Preparing necessary presentation materials for meetings.Ensuring project artifacts are completed and approved between project phases. Develop procedure and template material for project mgmt. methodology.Ensuring projects adhere to frameworks and all documentation is maintained appropriately for each project.Chair and facilitate meetings where appropriate and distribute minutes to all project team members.Prepare Reports/Basic Dashboards using SQl and Scripts Qualifications: Bachelor degree in business or technical software program management related field of study, Strong program manager and scrum master skills is a plus. Strong communication skills3 to 5 years experience in a related field.Exposure to Quality processes and Operations in electronic, construction/industrial, telecom, automotive, or oil/gas industry Familiarity to SQL, plx, codelab, appscript development, statistical analysis.Good To Have - python, java knowledge Exceptional verbal, written and presentation skills.Competency in SmartSheets (Project mgmt. tool) or similar project management software and dashboard tools.Ability to work effectively both independently and as part of a team.Advanced competency in G-Suite applications, primarily Slides & Sheets.Knowledge in project management methodologies and SDLC management.Ability to work on tight deadlines.Ability to work cross functionally with other departments to achieve goals.Client-focused, collaborative and a team playerProven track record managing multiple tasks in a fast-paced environment. PMP and/or CSM certification preferred.",
        "source": "Email",
        "date_posted": "2024-10-01 15:32:14-05:00",
        "unique_id": "19249c83ae2ba500",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]