[
    {
        "company": "Sligo Software Solutions, Inc.",
        "job_title": "Mid-Level Project Manager",
        "location": "Delmar, NY, USA",
        "full_location": {
            "city": "Delmar",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "SLG - 19 - 9857",
            "experience_required": "8+ years",
            "degree_required": "Bachelor’s degree in liberal arts, Humanities, Social Sciences, or Education",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "30 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Stakeholder Management",
                "Change Management",
                "Risk Management",
                "Agile Methodologies"
            ],
            "primary": [
                "Waterfall",
                "Scrum",
                "Kanban",
                "Communication",
                "Budget Estimation"
            ],
            "secondary": [
                "SDLC",
                "Objectives and Key Results (OKR)",
                "Case Management",
                "Human Services",
                "Law Enforcement"
            ],
            "all": [
                "Project Management",
                "Stakeholder Management",
                "Change Management",
                "Risk Management",
                "Agile Methodologies",
                "Waterfall",
                "Scrum",
                "Kanban",
                "Communication",
                "Budget Estimation",
                "SDLC",
                "Objectives and Key Results (OKR)",
                "Case Management",
                "Human Services",
                "Law Enforcement"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Srikanth Vanam",
        "email": "srikanth.vanam@sligosoft.com",
        "jd": "Greetings from Sligo Software Solutions, Inc. !!SLIGO is a Software Development & IT Consulting company. We have around 100+ IT associates working with our esteemed clients across several domains such as IT, Banking, Healthcare, and Government. We have an urgent requirement for Mid-Level Project Manager position with our client. Role: Mid-Level Project Manager\nLocation: Delmar, New York\nDuration: 30 months\nJob ID: SLG - 19 - 9857\nClient: NY State\nRespond by Date: 09/25/24 5:00 PM\n\nDescription\nProject Manager works with Justice Center Business Units and external stakeholders from State Oversight Agencies to plan, organize, and implement Vulnerable Persons Central Registry (VPCR) initiatives, including enterprise change management, to ensure desired project outcomes are achieved. The Vulnerable Persons Central Registry (VPCR) is a case management system which was developed for the Justice Center using Siebel CRM technology to track intake of incidents and allegations of abuse and neglect as well as the investigations, prosecution, adjudication, and oversight and monitoring resulting from these incidents.\n\nDuties\n- Developing project artifacts\n- Facilitating stakeholder meetings to elicit feedback\n- Eliciting requirements from stakeholders\n- Facilitating/Participating in JAD sessions\n- Tracking and reporting project status\n- Communication and reporting\n- Risk and issue management\n- Scope management\n- Enterprise change management\n- Developing project business cases\n- Performing other project management tasks as needed\n\nMandatory Requirements\n- Experience (8+ Years)\n- Plans, organizes and integrates cross-functional information technology projects that are significant in scope and impact.\n\nRequirements\n- This is an 100% Onsite\n- 60 Months of experience leading projects from initiation through closeout, creating schedules, scope, resource management, budget estimations, including risk mitigation.\n- Experience should include multiple methodologies including waterfall, agile, scrum, and/or kanban\n- 48 Months of experience facilitating meetings with internal and external stakeholders including executives, business users, and technical resources\n- 48 Months of experience working on Enterprise Change Management strategies, plans, and activities designed to prepare and support people to adopt to changes in business processes, systems and technology, and organization structures including experience with change capacity\n- 36 Months of experience facilitating Project/Release retrospectives, and evaluation of project outcomes and criteria for success to deliver continuous improvement\n- 36 Months of experience contributing to the establishment of PMO standards, processes, and internal controls including establishing SDLC and using Outcomes based metrics such as Objectives and Key Results (OKR)\n- 36 Months of experience leading elicitation sessions with executives, managers, developers and subject matter experts using variety of information gathering methods such as interviews, documentation analysis, surveys, site visits, business models\n- 36 Months of experience involving a Case Management application that supports workflow, case lifecycle, activities and tasks, storing related documentation, and managing stakeholder communication in one of the following domains: Human Services, Law Enforcement (Investigations), Justice (Legal, Courts)\n- 30 Months of experience working in State Government\n- Bachelor’s degree in liberal arts, Humanities, Social Sciences, or Education\n- Communication-focused Certification (i.e., counseling, mediation, education)\n- Résumé\n- Copy of Candidate Identification (i.e., Driver’s License/Green Card/Visa and Passport if applicable)\n- Any documents referenced in the above Requested Qualifications (i.e., professional certifications, degrees, etc.)",
        "source": "Email",
        "date_posted": "2024-09-30 09:50:23-05:00",
        "unique_id": "1924369df7faf743",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]