[
    {
        "company": "Vyze Inc",
        "job_title": "IT Infrastructure Project Manager",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Proven experience as an Infrastructure Project Manager or in a similar role.",
            "degree_required": "Bachelor’s degree in Information Technology, Computer Science, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project management",
                "Technical expertise in infrastructure",
                "Vendor management",
                "Budget management",
                "Risk management"
            ],
            "primary": [
                "Excellent communication",
                "Problem-solving"
            ],
            "secondary": [],
            "all": [
                "Project management",
                "Technical expertise in infrastructure",
                "Vendor management",
                "Budget management",
                "Risk management",
                "Excellent communication",
                "Problem-solving"
            ],
            "with_experience": [
                "Project management",
                "Technical expertise in infrastructure",
                "Vendor management"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "ashutosh parashar",
        "email": "ashutosh.parashar@vyzeinc.com",
        "jd": "From: ashutosh parashar, vyzeinc ashutosh.parashar@vyzeinc.com Reply to: ashutosh.parashar@vyzeinc.com Job Title: IT Infrastructure Project ManagerLocation: Remote (Chicago, Illinois is a plus) Job Summary: We are seeking a highly skilled and experienced Infrastructure Project Manager to lead and oversee technical projects involving cabling, networking, servers, AV, phones, and installations. This role includes managing renovations and updates to existing sites as well as the construction of new sites. The ideal candidate will have a robust background in infrastructure projects and experience working with various vendors across multiple locations. As this is a remote position, the ability to manage projects effectively without being on-site is crucial.Key Responsibilities:Plan, execute, and finalize infrastructure projects according to strict deadlines and within budget.Coordinate and manage all aspects of technical projects, including cabling, networking, servers, AV, phones, and installations.Oversee renovations and updates to existing sites and the construction of new sites.Collaborate closely with vendors and contractors to ensure project deliverables are met.Monitor and report on project progress, resolving any issues that arise.Ensure all projects comply with industry standards and regulations.Manage project budgets, timelines, and resources effectively.Communicate project expectations to team members and stakeholders.Conduct risk management to minimize project risks.Provide regular project updates to senior management and stakeholders.Qualifications:Bachelor’s degree in Information Technology, Computer Science, or a related field.Proven experience as an Infrastructure Project Manager or in a similar role.Strong technical background with hands-on experience in cabling, networking, servers, AV, phones, and installations.Experience managing projects remotely and keeping tabs on progress without being on-site.Excellent vendor management skills with experience working with vendors across the US and the Caribbean.Strong organizational and multitasking skills.Excellent communication and interpersonal skills.PMP certification is a plus.Skills:Project managementTechnical expertise in infrastructureVendor managementBudget managementRisk managementExcellent communicationProblem-solving",
        "source": "Email",
        "date_posted": "2024-09-30 08:58:50-05:00",
        "unique_id": "1924339ac483e9c3",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]