[
    {
        "company": "Blink Technology Partners, Inc",
        "job_title": "Healthcare Senior Data Bricks developer with knowledge of Informatica",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Bachelor's degree in a technical field such as computer science, computer engineering or related field required",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Data Bricks",
                "Informatica"
            ],
            "primary": [
                "Azure",
                "Data Extraction",
                "Software Development",
                "Agile SDLC"
            ],
            "secondary": [
                "Modeling",
                "Simulation",
                "Technical Specifications",
                "Quality Assurance",
                "Compliance"
            ],
            "all": [
                "Data Bricks",
                "Informatica",
                "Azure",
                "Data Extraction",
                "Software Development",
                "Agile SDLC",
                "Modeling",
                "Simulation",
                "Technical Specifications",
                "Quality Assurance",
                "Compliance"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Anand Verma",
        "email": "anand@blinktp.com",
        "jd": "From: Anand Verma, Blink Technology Partners, Inc anand@blinktp.com Reply to: anand@blinktp.com Hi My Name is Anand verma and I am a Sr. Recruiter with Blink Technology Partners, Inc. We have a position Healthcare Senior Data Bricks developer with knowledge of Informatica with one of our clients and you seem to be a good fit for this role. I’ll appreciate if you can please call me back to discuss further. Thanks and looking forward to speak with you! Position : Healthcare Senior Data Bricks developer with knowledge of InformaticaLocation: Remote Duration : Long TermMode of Interview : Telephonic/Video Job Description: Need At least 10 Plus Years candidates Only. Summary: This is a Senior Data Bricks Developer (mandatory) with knowledge of Informatica for Data Extraction from an existing EDW. Azure environment. Healthcare is highly preferred. Job Responsibilities: Analyze highly complex business requirements; generate technical specifications to design or redesign complex software components and applications Act as an expert technical resource for modeling, simulation and analysis efforts Leverage industry best practices to design, test, implement and support a solution Assure quality, security and compliance requirements are met for supported area Be flexible and thrive in an evolving environment Adapt to change quickly and adjust work accordingly in a positive manner Qualifications: Bachelor's degree in a technical field such as computer science, computer engineering or related field requiredDevelopment experience in needed language or technology (e.g. - Websphere, Informatica etc.)Hands on experience in designing, developing and successful deployment of large-scale projects from end-to-end Hands on experience in following the iterative and agile SDLC. Thanks & RegardsAnand VermaSr. RecruiterPhone : 817-767-4858Anand@blinktp.comBlink Technology Partners, Inc.",
        "source": "Email",
        "date_posted": "2024-10-01 11:01:12-05:00",
        "unique_id": "19248d52fee63c98",
        "emp_type": [
            "third party"
        ],
        "tag": "Azure Data Engineer"
    }
]