[
    {
        "company": "Rwaltz",
        "job_title": "Technical Project Manager – Data Engineering",
        "location": "Beverly Hills, CA, USA",
        "full_location": {
            "city": "Beverly Hills",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10-17 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long-Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Data Engineering",
                "Project Management",
                "AWS",
                "Scrum"
            ],
            "primary": [
                "Data Warehousing",
                "Redshift",
                "Glue",
                "Databricks",
                "dbt"
            ],
            "secondary": [
                "Retail",
                "E-commerce",
                "Analytics",
                "Stakeholder Management",
                "Communication"
            ],
            "all": [
                "Data Engineering",
                "Project Management",
                "AWS",
                "Scrum",
                "Data Warehousing",
                "Redshift",
                "Glue",
                "Databricks",
                "dbt",
                "Retail",
                "E-commerce",
                "Analytics",
                "Stakeholder Management",
                "Communication"
            ]
        },
        "job_type": [
            "onsite",
            "hybrid"
        ],
        "contact_person": "Hannah Rwaltz",
        "email": "hannah@rwaltz.com",
        "jd": "From: Hannah, Rwaltz hannah@rwaltz.com Reply to: hannah@rwaltz.com Job Title: Technical Project Manager – Data Engineering Location: Beverly Hills, CA (Onsite 4 days per week, Hybrid Model) Job Type: Long-Term Contract Total Experience Range- 10 to 17 years max (with recent 4 years experience in Data Engineering) Key Expectations: We are seeking an experienced Data Engineering Project Manager with a strong background in retail e-commerce, data engineering, and analytics. The ideal candidate will be a Certified Scrum Master and proficient in data warehousing concepts, data engineering tools, and technologies on the AWS platform (e.g., Redshift, Glue), as well as having experience with dbt and Databricks. Key Responsibilities: • Manage and lead end-to-end data engineering projects with a focus on AWS technologies (Redshift, Glue) and Databricks. • Collaborate with stakeholders to understand data requirements, prioritize the roadmap, and make trade-off decisions. • Drive the delivery of data engineering solutions, ensuring efficient execution and high-quality output. • Facilitate Scrum processes and coach team members on development and implementation skills. • Foster a collaborative environment across multiple stakeholder groups, including product management and business teams. Key Qualifications: • 4+ years of Data Project Management experience focused on data engineering and analytics. • Expertise in AWS data and analytics services (including but not limited to Redshift, Glue, S3), Databricks, and experience with dbt for transformation projects. • Strong knowledge of retail and e-commerce environments. • Certified Scrum Master preferred. • Proven track record in stakeholder management and successful project delivery. • Excellent communication skills, both written and verbal.",
        "source": "Email",
        "date_posted": "2024-10-01 07:53:10-05:00",
        "unique_id": "1924823c8eae1bf6",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]