[
    {
        "company": "Convextech inc.",
        "job_title": "Programmer Analyst 3 (AWS Developer)",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "8 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6-12 Month Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "JavaScript",
                "Python",
                "AWS IAM",
                "AWS S3"
            ],
            "primary": [
                "Cloud Solution Architect",
                "AWS Glue",
                "AWS Amplify",
                "AWS MQ",
                "SQ"
            ],
            "secondary": [
                "Experience with Windows and Linux OS"
            ],
            "all": [
                "Java",
                "JavaScript",
                "Python",
                "AWS IAM",
                "AWS S3",
                "Cloud Solution Architect",
                "AWS Glue",
                "AWS Amplify",
                "AWS MQ",
                "SQ",
                "Experience with Windows and Linux OS"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "MD. Raj Khan",
        "email": "raj@convextech.com",
        "jd": "From: Raj Khan, Convextech inc. raj@convextech.com Reply to: raj@convextech.com Hi,Hope you are doing good.!!Please let me know if you are interested in the below position.!! Position: Developer/Programmer Analyst 3 (AWS Developer)Location: Remote for Candidates Located in Texas OnlyDuration: 6-12 Month Contract Visa: Only USC/GC/EADInterview: Video Job Description:java, AWS IAM, cloud solution architect, AWS Glue, JavaScript/Python, AWS S3,AWS Amplify, AWS MQ,SQPlans, develops, tests, and documents computer programs, applying knowledge of programming techniques and computer systems. Evaluates user request for new or modified program, such as data ETL pipelines (using Python/AWS Glue) or front-end data submission app development (using Javascript/AWS Amplify). Consults with user to identify current operating procedures and clarify program objectives. Formulates plan outlining steps required to develop program, using methodologies such as structured analysis and design or object-oriented development. Participate the implementation of AWS Data Lake instance by translating program needs into technical requirements, supporting program leads in defining the long-term vision for the project, defining and implementing data governance / identity and access management policies, tracking project expenses, testing and validating new functionality, enabling program staff to use new tools, and regularly interfacing with both internal and external stakeholders. Role includes programming to implement new data feeds via API, maintaining AWS Amplify data upload platform, and implementing and maintaining crawlers and jobs in AWS Glue. II. CANDIDATE SKILLS AND QUALIFICATIONSMinimum Requirements:Candidates that do not meet or exceed the minimum stated requirements (skills/experience) will be displayed to customers but may not be chosen for this opportunity. YearsRequired/PreferredExperience8RequiredJava, JavaScript or Python programming8RequiredAWS IAM8RequiredAWS S34RequiredCloud Solution Architect4PreferredAWS Glue4PreferredAWS Amplify4PreferredAWS MQ, SQ4PreferredExperience with Windows and Linux OS Thanks and Regards MD. Raj KhanTechnical RecruiterConvexTech Inc.Email id- raj@convextech.comLinkedin - linkedin.com/in/md-raj-khan-9b1498204",
        "source": "Email",
        "date_posted": "2024-09-30 17:25:16-05:00",
        "unique_id": "192450949698008e",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]