[
    {
        "company": "UST",
        "job_title": "Product Owner",
        "location": "Sunnyvale, CA, USA",
        "full_location": {
            "city": "Sunnyvale",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time"
            ],
            "job_code": "",
            "experience_required": "8+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Product Ownership",
                "Agile Methodologies",
                "Requirements Gathering",
                "Business Analysis"
            ],
            "primary": [
                "Scrum",
                "Kanban",
                "Stakeholder Management",
                "User Story Prioritization",
                "Market Research"
            ],
            "secondary": [
                "Technical Knowledge",
                "Analytical Skills",
                "Problem-Solving Skills",
                "Leadership Qualities",
                "Communication Skills"
            ],
            "all": [
                "Product Ownership",
                "Agile Methodologies",
                "Requirements Gathering",
                "Business Analysis",
                "Scrum",
                "Kanban",
                "Stakeholder Management",
                "User Story Prioritization",
                "Market Research",
                "Technical Knowledge",
                "Analytical Skills",
                "Problem-Solving Skills",
                "Leadership Qualities",
                "Communication Skills"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Lokesh Kumar",
        "email": "lokeshk@sparinfosys.com",
        "jd": "Hello,Greetings for the day.Please go through the requirement and share me some suitable resume with contact details. Email is the best way to reach me. I may missed your call (due to high volume of call flow). Product Owner- Onsite from Day1Location: Sunnyvale, CA (Onsite)Duration: Long Term Client is a leading provider of platforms, digital innovation, artificial Intelligence and end-to-end IT & Business services and solutions for Global 1000 companies. We are transforming corporations through deep domain expertise, knowledge-based ML platforms, as well as profound anthropological efforts to understand the end customer and design products and interactions that create delight. We are deeply committed to developing a comprehensive understanding of our clients’ problems and to develop platforms to address them. UST is looking for a Product owner to join our team. The ideal candidate must have a strong background in requirements gathering, business analysis, and product ownership in software applications, particularly within an Agile environment.• Looking for someone who has technology affinity and have more than 8 years of experience.• Proven experience as a Product Owner /Sr Business Analyst in a complex, fast-paced environment with strong understanding of agile methodologies (Scrum, Kanban)• Collaborate with the business stakeholders (including leadership) to define and refine the product vision, roadmap, and key performance indicators (KPIs) to drive strategic decision making• Act as the primary point of contact for the business and other senior stakeholders, communicating product progress, addressing concerns, and gathering feedback.• Own and manage the product backlog, prioritizing user stories based on business value, customer needs, and technical feasibility, presenting them to the product stakeholder for approval.• Conduct market research, gather user feedback, and translate customer needs into clear and concise user stories, collaborating with the stakeholders to ensure alignment with business goals• Work closely with design, engineering, marketing, and other teams to ensure smooth product development and timely delivery• Track product performance metrics, identify areas for improvement, and present insights to the business to inform future product decisions• Proactively identify and mitigate potential risks associated with product development, communicating these risks to the business stakeholders and proposing mitigation strategies.• Excellent communication and stakeholder management skills• Deep understanding of customer needs and market dynamics• Technical knowledge to effectively collaborate and with development teams• Strong analytical and problem-solving skills• Leadership qualities to guide and influence cross-functional teams• Perform other duties as required Thanks & Regards, Lokesh Kumar",
        "source": "Email",
        "date_posted": "2024-10-01 08:27:19-05:00",
        "unique_id": "19248430dfb77260",
        "emp_type": [
            "full-time"
        ],
        "tag": "BA/Scrum Master/PM"
    }
]