[
    {
        "company": "Winorbit Technology LLC",
        "job_title": "Project Manager (Govt. Client Exp.)",
        "location": "USA",
        "full_location": {
            "city": "Denver",
            "state": "CO",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "7818601",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6 + Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "project management",
                "customer relationship management",
                "infrastructure",
                "network security",
                "network and voice services"
            ],
            "primary": [
                "risk management",
                "quality management",
                "change management",
                "communication"
            ],
            "secondary": [
                "stakeholder analysis",
                "mentoring",
                "training",
                "coaching"
            ],
            "all": [
                "project management",
                "customer relationship management",
                "infrastructure",
                "network security",
                "network and voice services",
                "risk management",
                "quality management",
                "change management",
                "communication",
                "stakeholder analysis",
                "mentoring",
                "training",
                "coaching"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Mayank Bijlwan",
        "email": "mayank.b@winorbittech.com",
        "jd": "Dear Partners,\nHope you are doing great.\nPlease find below job requirement and share the details and resumes if you have any matching resources.\n\nTitle: Project Manager (7818601)\nLocation: 80203, Denver, CO, Remote\nDuration : 6 + Months\nVisa: No H1B/CPT/OPT\n\nDescription : Job Summary\nThe ideal candidate will have a strong background in customer relationship management, project management, and experience with infrastructure, network security, and network and voice services.\nPrevious govt. client exp is mandatory- The Technical Project Manager will be responsible for planning, executing, and finalizing projects within defined timelines and allocated budgets. The Project Manager will also ensure that business and end users are consulted and their input is incorporated into the project.\n\nKey responsibilities include:\nTrack and report on security audit findings and remediation progress to stakeholders and project teams.\nResponsible for assisting agency executive management, division directors, and information technology (IT) staff and leading project tasks, and resources, including State personnel and deliverables. Use appropriate project management tools, reports, templates, mentoring, training, and coaching to IT project teams. Work directly with agency staff, as well as vendors in fulfilling and carrying out the requirements of assigned IT projects. Utilize project management best practices, including risk management, quality management, change management, change control, and communication.\nProactively manage changes in project scope, schedule, and cost. Manage by providing leadership, collaboration, supervision, training, guidance, and support to project team members on assigned projects. Lead the effort to ensure agency compliance with the State’s project management policies and standards.\nCoordinates all related activities for cross-functional teams\nCollaborates to develop and appropriately execute a change strategy, including stakeholder analysis, communication plans, and adoption plans.\nManages relationships across OIT, customers, and vendors to develop a thorough understanding of core business functions and align projects with overall business objectives. Manages issues and proactively escalates critical issues for immediate resolution, effectively demonstrating decision-making.",
        "source": "Email",
        "date_posted": "2024-09-30 14:55:27-05:00",
        "unique_id": "192448022a762bcb",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]