[
    {
        "company": "Flexon Technologies Inc",
        "job_title": "Python Automation Engineer",
        "location": "Sunnyvale, CA, USA",
        "full_location": {
            "city": "Sunnyvale",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Python",
                "Automation Development",
                "Unix",
                "Shell Scripting"
            ],
            "primary": [
                "Ruby",
                "Swift",
                "JavaScript",
                "Tableau",
                "MySQL",
                "PHP",
                "jQuery",
                "HTML5",
                "CSS"
            ],
            "secondary": [
                "Communication Skills",
                "Interpersonal Skills",
                "Root-Cause Analysis",
                "Web-Based Automation Frameworks",
                "Database Design",
                "OS X Applications",
                "iOS Applications",
                "Testing HW",
                "Data Visualization"
            ],
            "all": [
                "Python",
                "Automation Development",
                "Unix",
                "Shell Scripting",
                "Ruby",
                "Swift",
                "JavaScript",
                "Tableau",
                "MySQL",
                "PHP",
                "jQuery",
                "HTML5",
                "CSS",
                "Communication Skills",
                "Interpersonal Skills",
                "Root-Cause Analysis",
                "Web-Based Automation Frameworks",
                "Database Design",
                "OS X Applications",
                "iOS Applications",
                "Testing HW",
                "Data Visualization"
            ],
            "with_experience": [
                "Python (5+ years)",
                "Automation Development",
                "Unix",
                "Shell Scripting"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Nishanth",
        "email": "nishanth@flexontechnologies.com",
        "jd": "From: Nishanth, Flexon Technologies Inc nishanth@flexontechnologies.com Reply to: nishanth@flexontechnologies.com Python Automation EngineerSunnyvale, CA, San Diego, CA, Boulder, CO (5 days work from office) Note: Need strong python programming experience. ObjectiveCreate new command line, OS and web software tools for restore, kickoff, status, triage and reporting purposes.Designing and writing on-the-fly automated stress and stability hardware-centric software tests for embedded systemsMaintaining existing test and reporting software that scales to support 1000’s of devices daily with minimal lab downtimeIdentify, reproduce, and isolate bugs found via debugging and performance analysis toolsReport issues in accordance with Apple bug reporting methods and testing guidelines SkillsMust-haves for Automation EngineerMinimum 5 years of experience in automation development in HW/SW test engineeringExperience developing software automation of low-level and user-level UI in scripting languages such as Python, Ruby, Swift or JavaScriptExperience with web and database technologies such as Tableau, MySQL, PHP, jQuery, HTML5, CSSStrong knowledge of Unix and Unix shell scripting. Strong communication, written skills, and interpersonal skills (required to establish and maintain inter-departmental relationships) Preferred for Automation EngineerAbility to solve hardware systems to component level and perform root-cause analysisExperience with developing web-based automation frameworks as well as database designExperience writing OS X or iOS applicationsExperience in testing HWExperience in building data visualization Success Criteria/Definition of DoneAll assigned software tasks are completed and validated by our internal and independent QA process.All assigned radars in the queue are performed in a timely manner.All assigned software work follows a common software development process including but not limited to pull requests, unit tests, radar updates, etc. All updates are timely, clear, concise and accurate.Communication with the team is clear, effective and timely.",
        "source": "Email",
        "date_posted": "2024-09-30 12:18:05-05:00",
        "unique_id": "192445649e966c94",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Python developer"
    }
]