[
    {
        "company": "Tek Inspirations",
        "job_title": "Senior Project Manager Dynamics 365 F&O",
        "location": "Tucson, AZ, USA",
        "full_location": {
            "city": "Tucson",
            "state": "AZ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "8 years",
            "degree_required": "Bachelor's degree in Business, Information Technology, or related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Microsoft Dynamics 365 F&O",
                "Project Management",
                "Stakeholder Management",
                "Leadership",
                "Communication"
            ],
            "primary": [
                "ERP Systems",
                "Project Planning",
                "Risk Management",
                "Resource Allocation",
                "Quality Control"
            ],
            "secondary": [
                "PMP Certification",
                "Agile Methodologies",
                "Analytical Skills",
                "Interpersonal Skills",
                "Problem-Solving"
            ],
            "all": [
                "Microsoft Dynamics 365 F&O",
                "Project Management",
                "Stakeholder Management",
                "Leadership",
                "Communication",
                "ERP Systems",
                "Project Planning",
                "Risk Management",
                "Resource Allocation",
                "Quality Control",
                "PMP Certification",
                "Agile Methodologies",
                "Analytical Skills",
                "Interpersonal Skills",
                "Problem-Solving"
            ],
            "with_experience": [
                "Microsoft Dynamics 365 F&O (8+ years)",
                "Project Management (8+ years)"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Mohit Kumar",
        "email": "kumar.mohit@tekinspirations.com",
        "jd": "Job Description -Senior Project Manager – Microsoft Dynamics 365 F&O\nHybrid\nLocation: Tucson, AZ -Based in Tucson, AZ or nearby\nDuration: 6+ months\nRole Overview:\nWe are seeking an experienced Senior Project Manager specializing in Microsoft Dynamics 365 F&O to join our team in Tucson, AZ or nearby. The ideal candidate will have successfully led 3-5 large-scale implementations, demonstrating strong leadership, excellent communication, and exceptional stakeholder management skills. You will be responsible for overseeing the entire lifecycle of the project, from planning to execution and delivery, while managing timelines, budgets, and resources effectively.\n\nKey Responsibilities:\nLead and manage end-to-end Microsoft Dynamics 365 F&O implementations, ensuring alignment with client objectives, timelines, and budgets.\nCollaborate with cross-functional teams, including functional and technical consultants, to define project scope, objectives, and deliverables.\nDevelop detailed project plans, manage schedules, and track progress using project management tools.\nAct as the main point of contact for stakeholders, facilitating regular communication, progress updates, and resolving any issues or concerns.\nOversee resource allocation and management, ensuring optimal team performance and efficiency.\nEnsure quality control and compliance with project methodologies, standards, and governance.\nMitigate risks through proactive identification, analysis, and problem-solving strategies.\nDrive stakeholder engagement and foster strong relationships to support project success and customer satisfaction.\nEnsure projects are delivered on time, within scope, and budget.\n\nQualifications and Skills:\nBachelor's degree in Business, Information Technology, or related field.\nMinimum of 8 years of experience in project management with a focus on ERP systems, particularly Microsoft Dynamics 365 F&O.\nProven experience in managing 3-5 large-scale Dynamics 365 F&O implementations.\nStrong understanding of Dynamics 365 F&O architecture, functionalities, and modules.\nPMP, Agile, or other relevant project management certifications are preferred.\nExcellent leadership, communication, and interpersonal skills.\nAbility to manage multiple priorities, stakeholders, and deadlines.\nStrong analytical and problem-solving skills with a results-oriented mindset.\nAbility to work effectively under pressure and in a fast-paced environment.\nExperience working with global or distributed teams.\nKnowledge of finance and operations within the Dynamics 365 ecosystem.\nExperience managing projects in manufacturing, retail, or distribution sectors.",
        "source": "Email",
        "date_posted": "2024-09-30 08:57:40-05:00",
        "unique_id": "19243389c9bb9f4d",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]