[
    {
        "company": "Tekinspirations",
        "job_title": "Senior Systems Analyst",
        "location": "New York, NY, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "1 year",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Energy Management Systems (EMS)",
                "Linux",
                "Power system modeling",
                "Contingency analysis",
                "Power flow analysis"
            ],
            "primary": [
                "Excellent oral and written communication skills",
                "Documentation development",
                "Multitasking",
                "Meeting organization",
                "Presentation skills"
            ],
            "secondary": [
                "PSS / E suite",
                "OSI Plant Information System",
                "Real-time support of critical systems",
                "Regulated cybersecurity environment",
                "Microsoft Office Suite",
                "Software design",
                "Programming",
                "Relational databases management",
                "Real-time operators display support",
                "Scripting",
                "Project management",
                "Team Lead",
                "Supervisory Control And Data Acquisition (SCADA) systems"
            ],
            "all": [
                "Energy Management Systems (EMS)",
                "Linux",
                "Power system modeling",
                "Contingency analysis",
                "Power flow analysis",
                "Excellent oral and written communication skills",
                "Documentation development",
                "Multitasking",
                "Meeting organization",
                "Presentation skills",
                "PSS / E suite",
                "OSI Plant Information System",
                "Real-time support of critical systems",
                "Regulated cybersecurity environment",
                "Microsoft Office Suite",
                "Software design",
                "Programming",
                "Relational databases management",
                "Real-time operators display support",
                "Scripting",
                "Project management",
                "Team Lead",
                "Supervisory Control And Data Acquisition (SCADA) systems"
            ],
            "with_experience": [
                "Energy Management Systems (EMS)",
                "Linux",
                "Power system modeling",
                "Contingency analysis",
                "Power flow analysis"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Virat Singh",
        "email": "virat.singh@tekinspirations.com",
        "jd": "From: virat, Tekinspirations virat.singh@tekinspirations.com Reply to: virat.singh@tekinspirations.com Hi,I Hope you are doing great. Please find below position if you have any matching candidate as per requirement.Please send me updated resume with candidate information. Job Description -Role : Senior Systems AnalystContract: 1 yearLocation: New York, New York (Hybrid)Experience: 10+ yearsNOTE: Candidate must be LOCAL to NY/NJPlease see attached file for Assessment/Skills MatrixNo visa restrictionsHybrid set up (3 days onsite)Gas/Energy/Electric/Utilities/Oil industry experience is highly preferred by the clientPosition Overview:Specializes in analyzing, designing and implementing information systems. Assesses the suitability of information systems in terms of their intended outcomes and liaises with end users, software vendors and programmers in order to achieve these outcomes. Uses analysis and design techniques to solve business problems using information technology. Serves as change agent, who identifies the organizational improvements needed, designs systems to implement those changes and trains and motivates others to use the systems.Support and maintenance of the 24x7 Energy Management Systems (EMS) at two control centers. Duties will involve the timely update of the state estimator, contingency analysis, power flow and the correct modeling of applicable electric system changes.Duties will also involve supporting various displays, database environments and providing operations support, troubleshooting, integration testing and user training. Responsibilities:Update, monitor and maintain the reliability of the Energy Management System (EMS) application.Update, monitor and maintain power system modeling, state estimator, contingency analysis and power flow analysis supporting real-time operations.Troubleshoot and resolve EMS system issues.Intermediate Linux experience (using commands on Linux OS).Lead technical evaluations of contractor software application proposal.Configure and test custom EMS enhancements.Support the testing and implementation of new EMS releases. Required Skills:Ability to multitask and switch priorities as business warrants.Have excellent oral and written communication skills.Able to plan, organize, run meetings and give presentations to all levels of management.Able to develop documentation that will be consumed by users if diverse backgrounds and skills. Preferred Experience:Experience with the following: PSS / E suite, OSI Plant Information System, real-time support of critical systems, working in a regulated cybersecurity environment, Microsoft Office SuiteSoftware design, programming, relational databases management, real-time operators display support, and scripting and project management / Team Lead, Supervisory Control And Data Acquisition (SCADA) systems - specifically Client XA21 / Reliance",
        "source": "Email",
        "date_posted": "2024-09-30 16:15:32-05:00",
        "unique_id": "19244c972b1b94ff",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]