[
    {
        "company": "Vyze Inc",
        "job_title": ".Net Platform Architect",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Multiple years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".NET development",
                "C#",
                "SQL databases",
                "Git"
            ],
            "primary": [
                "Linux systems",
                "PowerShell",
                "Bash",
                "Network protocols",
                "Container images",
                "Virtualization technologies",
                "Cryptography",
                "Communication skills"
            ],
            "secondary": [
                "Coding style guidelines",
                "Secure coding",
                "Mission critical systems"
            ],
            "all": [
                ".NET development",
                "C#",
                "SQL databases",
                "Git",
                "Linux systems",
                "PowerShell",
                "Bash",
                "Network protocols",
                "Container images",
                "Virtualization technologies",
                "Cryptography",
                "Communication skills",
                "Coding style guidelines",
                "Secure coding",
                "Mission critical systems"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Karan Gupta",
        "email": "kgupta@vyzeinc.com",
        "jd": "From: Karan gupta, vyzeinc kgupta@vyzeinc.com Reply to: kgupta@vyzeinc.com Hi,Hope you are doing great.Please have a look at the below position and do let me know if you have any candidate for the role J. Job Description -Need local candidates with LinkedIn .Net Platform Architect6 months +Locations: - RemoteSkype We are looking for a highly talented Software Architect to join our platform engineering team. To qualify, candidates must possess the following skills.• Multiple years of demonstrated experience with modern .NET development (including recent experience with .NET 5.0 or higher).• Strong knowledge and demonstrated use of modern C# language features (C# 8 and above).• In-depth knowledge of modern Linux systems.• Design, development, and test new software products, features, bug fixes, and products for mission critical systems with a strong focus on reliability, maintainability, extensibility, and reusability• Strong knowledge and use of modern C# language features.• Ability to work largely from the command line leveraging basic PowerShell and bash.• Comply with team coding style guidelines, leveraging modern techniques including linting and editorconfig support.• Write secure code that complies with standards and policies of the agency and overall State of Delaware.• Multiple years of demonstrated experience with SQL databases.• Strong understanding of network protocols.• Experience creating and managing container images and their deployments.• Strong understanding of virtualization technologies and ability to work with complex topologies.• At least a basic understanding of cryptography and key management.• Ability to create and maintain the basic foundational elements of systems supporting tens of thousands of users in a mission critical environment.• Multiple years of demonstrated experience with Git, including an understanding of branching and merge/pull requests.• Excellent oral and written communication and critical thinking abilities. Regards, Karan GuptaTechnical Recruiter VYZE INC : 25179 Methley Plum Place, Aldie, VA 20105Direct: 469-7785-366Email: kgupta@vyzeinc.com Disclaimer: This communication, along with any documents, files or attachments, is intended only for the use of the addressee and may contain confidential information. If you are not the intended recipient, you are hereby notified that any dissemination, distribution or copying of any information contained in or attached to this communication is strictly prohibited, To remove your email address permanently from future mailings, please send REMOVE to remove@vyzeinc.com.",
        "source": "Email",
        "date_posted": "2024-09-30 13:43:30-05:00",
        "unique_id": "192443e427c20ff2",
        "emp_type": [
            "third party"
        ],
        "tag": ".net developer"
    }
]