[
    {
        "company": "Pivotal Technologies",
        "job_title": "Azure Data Engineer",
        "location": "Grand Rapids, MI, USA",
        "full_location": {
            "city": "Grand Rapids",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Azure Data Factory",
                "Log Analytics",
                "Databricks",
                "Synapse",
                "Power BI",
                "ADLS Gen2",
                "GCP Cloud storage",
                "Big Query"
            ],
            "primary": [
                "Data ingestion",
                "Configuration and administration of marketing platforms",
                "Agile methodologies"
            ],
            "secondary": [
                "Google Marketing platform",
                "Salesforce MCI",
                "The Trade Desk",
                "ADvendio",
                "Performance monitoring",
                "Alerting",
                "Code management"
            ],
            "all": [
                "Azure Data Factory",
                "Log Analytics",
                "Databricks",
                "Synapse",
                "Power BI",
                "ADLS Gen2",
                "GCP Cloud storage",
                "Big Query",
                "Data ingestion",
                "Configuration and administration of marketing platforms",
                "Agile methodologies",
                "Google Marketing platform",
                "Salesforce MCI",
                "The Trade Desk",
                "ADvendio",
                "Performance monitoring",
                "Alerting",
                "Code management"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Suraj Prashar",
        "email": "suraj.prashar@pivotal-technologies.com",
        "jd": "Hi, Hope you are doing great!!Please find the requirement below, If you find yourself comfortable with the requirement please reply back with your updated resume andI will get back to you or I would really appreciate if you can give me a call back at my contact number (703) 570-8775 * (Ext. 232).\n\nJob Title: Azure Data Engineer\nLocation: Grand Rapids, MI (Hybrid)\nDuration: 6+ Months\nInterview: Video\nVisa Type: No H1/OPT/CPT Note: Need Local or Nearby Only\n\nAzure Data Engineering and experience with data ingestion within Marketing platforms.\n\nJob Description\nThis is a great opportunity with a large retail employer.\nData Engineer job responsibilities include:\nDesigns, codes, tests, and implements data movement pipelines, dashboarding and analytical assets; develops system documentation according to SAFe Agile principles and industry standards.\nDesign and hands-on development on either vendor or internal applications and interfaces including Azure - Data Factory, Log Analytics, Databricks, Synapse, Power BI, ADLS Gen2, GCP Cloud storage and Big Query.\nAssist in configuration and administration of marketing platforms (Google Marketing platform, Salesforce MCI, The Trade Desk ADvendio, etc.) that the team supports.\nBuild data ingestion into and out of the above listed marketing platforms.\nGathers and implements functional and non-functional requirements including performance monitoring, alerting and code management and ensuring alignment with technology best practices and SLAs.\nPartnering with all areas of the business to gather requirements for Data and Analytics and designing solutions.\nParticipate in agile ceremonies and follow agile cadence to build, test and deliver solutions.\nDriving engagement with ITS Security and Infrastructure teams to ensure secure development and deployment of solutions.\nInterfaces with the Product Manager and IT partners at the Program level and within other Release Trains to define and estimate features for agile teams.\n\nQUALIFICATIONS:\n5+ years of Azure Data Engineering experience including some of the following: Data Factory, Log Analytics, Databricks, Synapse, Power BI, ADLS Gen2, GCP Cloud storage and Big Query\nConfiguration and administration of marketing platforms such as Google Marketing platform, Salesforce MCI, The Trade Desk, ADvendio, etc.\nData ingestion experience with Marketing Platforms is required\nMust be able to work onsite in Grand Rapids MI 3 days a week for 6-12 months",
        "source": "Email",
        "date_posted": "2024-10-01 14:51:26-05:00",
        "unique_id": "1924a5d3e21eba89",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Azure Data Engineer"
    }
]