[
    {
        "company": "DMS VISIONS INC",
        "job_title": "Sr Data Engineer with Marketing platform experience",
        "location": "Grand Rapids, MI, USA",
        "full_location": {
            "city": "Grand Rapids",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "1 OR 2 Year Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "ETL",
                "Data warehousing",
                "mapping",
                "modeling",
                "Databricks",
                "Azure - Data Factory",
                "Log Analytics",
                "Databricks",
                "Synapse",
                "Power BI",
                "ADLS Gen2",
                "GCP Cloud storage",
                "Big Query",
                "Pyspark",
                "Python",
                "API"
            ],
            "primary": [
                "Google Marketing platform",
                "Salesforce MCI",
                "The Trade Desk",
                "ADvendio"
            ],
            "secondary": [
                "Power BI",
                "Synapse"
            ],
            "all": [
                "ETL",
                "Data warehousing",
                "mapping",
                "modeling",
                "Databricks",
                "Azure - Data Factory",
                "Log Analytics",
                "Databricks",
                "Synapse",
                "Power BI",
                "ADLS Gen2",
                "GCP Cloud storage",
                "Big Query",
                "Pyspark",
                "Python",
                "API",
                "Google Marketing platform",
                "Salesforce MCI",
                "The Trade Desk",
                "ADvendio",
                "Power BI",
                "Synapse"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Gaurav Gaur",
        "email": "gaurav@dmsvisions.com",
        "jd": "From: Gaurav Gaur, DMS VISIONS INC gaurav@dmsvisions.com Reply to: gaurav@dmsvisions.com Hi,Hope you are doing well,Please find the job description given below and let me know your interest.ITS a Vey URGENT ROLE PLEASE SHARE BEST PROFILES ON THIS Position: Sr Data Engineer with Marketing platform experience Location: Grand Rapids, MI (hybrid 3 days on site – Relocation will workDuration: 1 OR 2 Year ContractVisa: AnyOne And Done Interview Job Description:·Contract Duration: 1 OR 2 Year Contract·Work Environment: Grand Rapids, MI (hybrid 3 days on site – Relocation will workResponsibilities:About the jobst Haves:·5+ years of Experience as a data engineer (ok with mid or sr level)·ETL Experience, Data warehousing, mapping, and modeling·Strong Databricks experience ·Design and hands-on development on either vendor or internal applications and interfaces·Experience with Azure - Data Factory, Log Analytics, Databricks, Synapse, Power BI, ADLS Gen2, GCP Cloud storage and Big Query·Marketing platform experience - Google Marketing platform, Salesforce MCI, The Trade Desk etc., ADvendio·Pyspark, Python·API Experience Plusses:·Power BI·Synapse Day to Day: This candidate will join our large retail client based out of Grand Rapids to help on a large marketing platform initiative. They will be responsible for hands on development on both their vendor and internal applications. The role is 80% data engineering focused. In addition to this, they will be responsible for data ingestion into and out of their marketing platforms. This person will be focused on campaign targeting, building out features, pipelines, etc. On a day to day basis, they will Interface with the Product Manager and IT partners at the Program level and within other Release Trains to define and estimate features for agile teams. They will work with architects on the team to push into production. ThanksGaurav Gaurgaurav@dmsvisions.com972-645-9280",
        "source": "Email",
        "date_posted": "2024-10-01 17:40:01-05:00",
        "unique_id": "1924a3d05a353b23",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "GCP Data Engineer"
    }
]