[
    {
        "company": "iTech US Inc.",
        "job_title": "Project Manager",
        "location": "Dallas, TX, USA",
        "full_location": {
            "city": "Dallas",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Bachelor’s degree, Masters preferred",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long term Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management Professional (PMP) Certification",
                "financial services experience",
                "agile methodologies",
                "waterfall methodologies",
                "cross-functional project management"
            ],
            "primary": [
                "coaching and mentoring",
                "critical thinking",
                "communication skills",
                "Microsoft Office Suite",
                "Jira",
                "Confluence"
            ],
            "secondary": [
                "life insurance experience",
                "annuity experience",
                "LOMA",
                "ALMI",
                "FLMI",
                "self-starter",
                "organizational skills",
                "results oriented",
                "verbal communication skills",
                "written communication skills"
            ],
            "all": [
                "Project Management Professional (PMP) Certification",
                "financial services experience",
                "agile methodologies",
                "waterfall methodologies",
                "cross-functional project management",
                "coaching and mentoring",
                "critical thinking",
                "communication skills",
                "Microsoft Office Suite",
                "Jira",
                "Confluence",
                "life insurance experience",
                "annuity experience",
                "LOMA",
                "ALMI",
                "FLMI",
                "self-starter",
                "organizational skills",
                "results oriented",
                "verbal communication skills",
                "written communication skills"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Ajay Reddy",
        "email": "ajay.r@itechus.net",
        "jd": "Hello, Hope you are doing well today! My name is Ajay Reddy, and I am a senior recruiter working with ITech US Inc. If you are currently looking for new opportunities. I have an exciting opportunity with one of our clients in Dallas TX (Onsite). Please let me know if you are interested. Below are the job details for your review. Note: Need only local Dallas, TX local Candidates Role: Project Manager with Commission with Life Annuity Exp (PMP certified required)Location: Dallas TX (Onsite)Duration: Long term ContractDescription:The Senior Project Manager is responsible for leading, supporting, and coaching teams to deliver large and complex project(s) and/or program(s) that span across one or more business units. Responsible for leading teams in driving overall delivery execution; manage resources, schedules, financials and adhere to quality and control guidelines throughout the full systems development life cycle. The ideal candidate will have financial services experience, preferably life insurance and annuity. Responsibilities Manage strategic, continuous improvement, and transformation initiatives; effective in leading all aspects of a project and/or program to ensure timely and effective execution.Work with multiple development methodologies such as waterfall, iterative and agile (scrum, kanban) to support project teams. Have awareness of agile techniques such as automated testing, user stories, test driven development, continuous integration, agile games, etc. Business partner who possesses critical thinking skills to define practical solutions that align with strategic objectives. Understands the business needs of the project and its interaction with other projects/programs to make decisions that are in the best interest of the organization. Ability to think creatively to drive innovation, perform situational analysis which leads to well thought out decisions. Must establish strong working relationships with executive sponsors, business owners and stakeholders across the organization to manage expectations and project delivery. Monitors performance and recommends schedule changes, cost or resource adjustments. Establishes and provide timely updates to the management team for each project for escalating issues, reporting and managing risks, issues and status reporting. Management of project change requests that impact scope, schedule, budget. Lead or coordinate project planning, including resource, staff, supply and subcontract management, progress reporting, troubleshooting and team management. Ensure that project resources are following established processes as well as participate in strengthening internal tools, artifacts and other governance aspects. Directly or indirectly manage/mentor team members and colleagues in techniques such as leadership, methodology, tools, and people and communication skills. Able to teach many of the skills—both hard and soft—that are required for the successful planning, execution, delivery and support of projects and their products or services. Lead and support in the facilitation of improvement methodology to diverse audiences and tailor communication style and information. Requirements: Bachelor’s degree, Masters preferred Project Management Professional (PMP) Certification required 10+ years financial services desired (preferably life insurance and annuity), LOMA ALMI or FLMI a plus 10+ years’ experience managing cross-functional projects in a matrixed environment desired Experience in coaching and mentoring Skilled in multiple project management methodologies (e.g. agile/scrum, waterfall) desired Must be a self-starter and be able to work independently as well as being a team player Ability to understand, interpret and communicate complex subject matter. Ability to work in a fast-paced environment; strong organizational skills a must Results oriented, excellent verbal and written communication skills Able to interact and communicate with C-Level executives and senior leadership Must be proficient in Microsoft Office Suite (Word, Excel, Outlook, PowerPoint, Project, SharePoint) and tools like Jira/Confluence Must be able to pass a background check",
        "source": "Email",
        "date_posted": "2024-10-01 10:19:26-05:00",
        "unique_id": "19248ad9eb9a1e21",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]