[
    {
        "company": "Vyze Inc",
        "job_title": "General Database Engineer (this is for a DBA not developer)",
        "location": "Alpharetta, GA, USA",
        "full_location": {
            "city": "Alpharetta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Installation",
                "Upgrade",
                "Patching",
                "Replication",
                "Monitoring",
                "Data Cleansing",
                "Schema Creation",
                "Disaster Recovery",
                "Automation",
                "Performance Tuning"
            ],
            "primary": [
                "SAP ASE",
                "Sybase",
                "Redis",
                "Postgres",
                "MS SQL Server",
                "Scripting",
                "Linux"
            ],
            "secondary": [
                "Ansible",
                "Python",
                "Shell"
            ],
            "all": [
                "Installation",
                "Upgrade",
                "Patching",
                "Replication",
                "Monitoring",
                "Data Cleansing",
                "Schema Creation",
                "Disaster Recovery",
                "Automation",
                "Performance Tuning",
                "SAP ASE",
                "Sybase",
                "Redis",
                "Postgres",
                "MS SQL Server",
                "Scripting",
                "Linux",
                "Ansible",
                "Python",
                "Shell"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Rohit Singh",
        "email": "srohit@vyzeinc.com",
        "jd": "From: Rohit Singh, Vyze Inc srohit@vyzeinc.com Reply to: srohit@vyzeinc.com Hi,Hope you are doing well today! My name is Rohit Singh and I am a Technical Recruiter working with Vyze Inc. I have an exciting opportunity with one of our client. Below are the job details for your review. If interested send me your updated resume with contact details, expected pay rate along with below information.Job Description -JOB TITLE: General Database Engineer (this is for a DBA not developer)Location: Alpharetta, GA - Hybrid 3 days a week onsite Duration: 12 months Visa: USC/GCMOI: SkypeLinkedIn, DL, and Visa is Must MSUT have experience with few different databases Requirements:Expertise in Installation, Upgrade & Patching of different components in Sybase, MS SQL Server, Postgres and experience with the other platforms we manage listed in the Duties and Responsibilities.Experience with Replication including setup, troubleshooting issues and failoversMonitor all systems (work processes, users, system logs, short dumps, locks, developer traces, system traces, disk space, etc.).Ensure production uptime service levels are maintained and made available per requirements that include backup, recovery, refresh, performance tuning, and securityProvide data cleansing services, verify data integrity, and implement access controlsProvide routine maintenance including problem defect analysis and resolution, space, storage, object management, physical database layout, rollback segment management, and temporary space managementExperience with Schema creation, deployment and maintenanceExperience with Setting up and configuration of Auditing, audit trailsCarry out recovery of databases in an event of log full, system crash Troubleshoot issues related to the installation for our supported platformsShould have knowledge of Disaster Recovery setup and maintenanceAutomation using shell-script, python, Ansible, go, etc. Performance & Tuning Related ExpertiseExperience with Performance analysis, monitoring of SQL queries and platform specific tuning.General Database Engineer Duties and Responsibilities:Provide guidance and support to Application teamInstall, tune, implement and upgrade DBMS installationsWrite and deploy SQL patchesProcess work accurately and in a timely mannerAlways paying attention to the detailUrgencyProactively and regularly make recommendations for system improvementsCollate, prepare, and present statistical information for internal and external useLooking for: SAP ASE / Sybase, Redis, Postgres, MS SQL Server, Scripting (Ansible, Python, Shell), Linux (must)Note: NO developers Please, Looking for DBA (Database Admins)Write and Maintain Database Programs:Database engineers write new database programs and maintain existing programs to ensure they can handle the flow of traffic and the amount of data being stored in the database.Design New Databases:Database engineers help design new databases based on company needs, data storage needs, and the number of users accessing the database.Monitor Databases and Programs:Database engineers continuously monitor databases and related systems to ensure high functionality.Write Programs and Scripts:Database engineers write new support programs and scripts for databases to deploy, operate, increase data storage capacity and fix existing database problems.Troubleshooting:Database engineers troubleshoot platform specific performance, checking for potential problems that affect database functionality and related database programs.Debugging:Database engineers look through coding language to debug existing database scripts and programs.Review Database Reports:Database engineers review daily, weekly, and monthly database reports, including user reports and systems information, to spot problems and ensure that all databases and support systems are working at peak levels.",
        "source": "Email",
        "date_posted": "2024-09-30 21:14:49-05:00",
        "unique_id": "19245db6baafc6fe",
        "emp_type": [],
        "tag": "DB Admin"
    }
]