[
    {
        "company": "Sydata Inc",
        "job_title": "Sr. Business Analyst (SBA)",
        "location": "Commonwealth on MA, USA",
        "full_location": {
            "city": "Commonwealth",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "3 years",
            "degree_required": "Bachelor’s degree in computer science, Information Systems, Business Administration, or a related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term Contract",
            "rate": "$50/hr on W2"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Project Management",
                "Software Development Life Cycle (SDLC)",
                "Jira",
                "Microsoft 365"
            ],
            "primary": [
                "Cloud Vendors",
                "Use Cases",
                "Functional Requirements",
                "Unified Process",
                "Data Structures"
            ],
            "secondary": [
                "Long Term Care Population",
                "Complex eligibility systems",
                "Flow charts",
                "Diagrams",
                "Relational database theory"
            ],
            "all": [
                "Business Analysis",
                "Project Management",
                "Software Development Life Cycle (SDLC)",
                "Jira",
                "Microsoft 365",
                "Cloud Vendors",
                "Use Cases",
                "Functional Requirements",
                "Unified Process",
                "Data Structures",
                "Long Term Care Population",
                "Complex eligibility systems",
                "Flow charts",
                "Diagrams",
                "Relational database theory"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Shobhana Kulhade",
        "email": "shobhana@sydatainc.com",
        "jd": "Immediate need Sr. Business Analyst (SBA) Onsite Role in Commonwealth on MA,\nRate: $50/hr on W2\n\nSr. Business Analyst (SBA) - Onsite Role\nCommonwealth on MA\nLong Term Contract\nRate: $50/hr on W2, No C2C\n\nResponsibilities:\nAct as liaison between business users, the MA21 development group, and Cloud Vendors to gather and document Scope, Use Cases, and Functional Requirements. Prepare, manage and communicate project plans and coordinate project activities with team members as required. Create and maintain required Unified Process artifacts for the approved SDLC process. Submit the artifacts for review, distribution, and business approvals. Participate in the preparation/execution of test plans and/or test criteria. Prepare or administer the preparation of implementation plans, user guides, and/or documentation as required. Facilitate interactions with other IT areas and business units, both internal and external. Serve as liaison between EHS development groups and Infrastructure Teams. Serve as Project Manager, as required, for simple projects and report projects and task status to senior management. Diagnose and resolve system performance problems identified by Production Control, users, or management. Communicate effectively with business users and managers. Ensure project documentation, plans, and scheduling comply with agency initiatives and priorities. Identify, communicate, and facilitate a resolution to any production support, user requests, or triaged Helpdesk tickets. Monitor and measure the success of implemented solutions in the Production environment. Participate in release meetings for maintenance and development projects, ensuring all platform requirements are met. Work closely with QA to resolve any issues prior to the release date. Identify risks, potential scope creeps and escalating issues to the client and management. Create Unit test results in accordance with process Scope and Business requirements. Ensure testing validates the quality, reliability, and completeness of business services deployed on the new platform.\n\nPreferred Qualifications:\nKnowledge of the principles of software development using the approved SDLC. Proficient knowledge of Jira, Long Term Care Population, Complex eligibility systems, and Unified processes. Proficiency in Microsoft 365, Excel, Word, PowerPoint, Access, and Visio. Knowledge of methods and techniques of computer systems analysis, design, technical terminology, codes, and standard abbreviations. Experience with one or more of the following: data structures, application programming, database development, or relational database theory and technology. Ability to prepare flow charts, diagrams, and Use Cases. Deliver oral and written instructions in a precise, understandable manner. Prepare required deliverables in accordance with established procedures. Strong organizational skills with the ability to maintain accurate records and status reporting. Ability to understand and apply the policies, procedures, specifications, standards, and guidelines governing assigned unit activities. Knowledge of MA HIX or other State Health Exchange. Ability to work with multiple vendors. Strong organizational skills, problem-solving aptitude, and attention to detail. Ability to work well with others in a fast fast-paced, dynamic environment. Strong initiative and ability to manage multiple projects, as well as strong follow-through skills. Must be able to work collaboratively, collegially, and cooperatively with others in an environment where deliverables are potentially dependent on the output of others.",
        "source": "Email",
        "date_posted": "2024-09-30 11:14:29-05:00",
        "unique_id": "19243ba0925b09cb",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]