[
    {
        "company": "Infosys",
        "job_title": "Oracle DBA",
        "location": "Maryland Heights, MO, USA",
        "full_location": {
            "city": "Maryland Heights",
            "state": "MO",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle",
                "MongoDB",
                "Application database support"
            ],
            "primary": [
                "Technical database Architect",
                "CICD",
                "Performance improvements",
                "Query Tuning",
                "Automations",
                "Golden Gate"
            ],
            "secondary": [],
            "all": [
                "Oracle",
                "MongoDB",
                "Application database support",
                "Technical database Architect",
                "CICD",
                "Performance improvements",
                "Query Tuning",
                "Automations",
                "Golden Gate"
            ],
            "with_experience": [
                "Oracle",
                "MongoDB"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Azhar Mohammad",
        "email": "azhar@softcomsystems.com",
        "jd": "Hello Professionals,This Azhar Mohammad from Softcom Systems INC.I have a below Job Opportunity if you have any Consultants Please let me know…!!Job Title: Oracle DBALocation: Maryland Heights, MO 63043 –DAY1 OnsiteDuration: 6 Months Job Details:Must Have Skills (Top 3 technical skills only) *1. Proficient in Oracle and Mongo databases with hands-on technical experience.2. Practical exposure in doing application database support activities3. Strong in leading and enforcing new processes and best practices in day to day operationsNice to have skills (Top 2 only)1. Technical database Architect and Solution Specialist with ability to lead on database innovations and continuous improvements2. Strong experience in CICD, Performance improvements, Query Tuning, Automations, Golden Gate etcDetailed Job Description:Proficient in Oracle and Mongo databases with handson technical experience. Practical exposure in doing application database support activities. Strong in leading and enforcing new processes and best practices in day to day operations. Technical database Architect and Solution Specialist with ability to lead on database innovations and continuous improvements. Strong experience in CICD, Performance improvements, Query Tuning, Automations, Golden Gate etc. Strong review capabilities and should be ableTop 3 responsibilities you would expect the Subcon to shoulder and execute*:1. Ability to understand business logic and should be able to understand E2E picture in program2. Ability to do coordination with offshore database support and application development teams.3. Excellent communication skills with the ability to explain technical concept and ability to collaboratewell with technical and nontechnical staff.",
        "source": "Email",
        "date_posted": "2024-10-01 15:15:52-05:00",
        "unique_id": "19249b981602cb4d",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Oracle DBA"
    }
]