[
    {
        "company": "STM Consulting",
        "job_title": "Programmer 4/ PR 4",
        "location": "Ohio, USA",
        "full_location": {
            "city": "Ohio",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "9 years",
            "degree_required": "4-year college degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "8 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Azure",
                "Microsoft C#",
                ".NET Framework 1.1 to current",
                "ASP.NET",
                "MS SQL Developer"
            ],
            "primary": [
                "Enterprise Data Modeling",
                "Solutions design",
                "Project technical planning",
                "Analysis and design",
                "Communication",
                "Testing and implementation",
                "GIT",
                "Java Script",
                "knockout",
                "json",
                "API",
                "Active X controls"
            ],
            "secondary": [
                "Manual QA testing processes",
                "Diagramming Tools: MS Visio",
                "Version Control",
                "Create Technical documentation",
                "Willing to use new tools",
                "Positive suggestions"
            ],
            "all": [
                "Azure",
                "Microsoft C#",
                ".NET Framework 1.1 to current",
                "ASP.NET",
                "MS SQL Developer",
                "Enterprise Data Modeling",
                "Solutions design",
                "Project technical planning",
                "Analysis and design",
                "Communication",
                "Testing and implementation",
                "GIT",
                "Java Script",
                "knockout",
                "json",
                "API",
                "Active X controls",
                "Manual QA testing processes",
                "Diagramming Tools: MS Visio",
                "Version Control",
                "Create Technical documentation",
                "Willing to use new tools",
                "Positive suggestions"
            ]
        },
        "job_type": [],
        "contact_person": "Prashant Singh",
        "email": "prashant.singh@consultstm.com",
        "jd": "Hello\nTrust you are doing well\nI have this excellent job opportunity. Please find the detailed job description below for insight and help me with your latest resume to take it further for interview\nPosition: Programmer 4/ PR 4\nReplacements\nLocation: Ohio\nDuration: 8 Months\nMinimum Experience: 9 Years.\nSkill Matrix:\n· Experience programming languages with the main knowledge skills in Azure, Microsoft C#, .NET Framework 1.1 to current version, ASP.NET languages\n· MS SQL Developer\n· Experience in Enterprise Data Modeling\n· Senior developer responsible for planning, processing and performing all jobs in efficient manner with no supervision\n· College degree\n· Solutions design; Project technical planning; Analysis and design; Communication; Testing and implementation\n· Recommends software reusability guidelines\n· Plans, conducts formal mentorship activities for peers and/or lower-level staff via verbal instruction or technical documentation\n· GIT, Azure, C#, .NET 1.1 to current, ASP, Java Script, knockout, json, API, Active X controls, familiar with other language tools\n· Database: Microsoft SQL Server\n· Azure, CORE Framework, C#, ASP.NET Web application development, .NET 1.1 to current, SQL2000 to SQL2018, SQL Procedures, Functions, Tables, Views, etc\n· Manual QA testing processes\n· Diagramming Tools: MS Visio or any flow diagram tools\n· Version Control: ODRC uses GIT for version control for source code and documents. Any products ok.\n· Testing: Perform System Test and Create Test Documentation\n· Microsoft Certified: Azure Developer Associate or Azure Fundamentals (AZ-900) \n· MCSA/MCSD or MCSEA more senior developer is responsible for planning, processing and performing all jobs in an efficient manner with little or no supervision to complete all tasks.\nProgrammer ODRC expects the more senior developer to be extremely well rounded in programming languages with the main knowledge skills in Azure, Microsoft C#, .NET Framework1.1 to current version, ASP.NET languages, WIN-Forms development, MS SQL Developer and experience in Enterprise Data Modeling. A more senior developer is responsible for planning, processing and performing all jobs in an efficient manner with little or no supervision to complete all tasks.\nEducation: Preferred Education: 4-year college degree\nYears of Relevant Experience: Overall 9 plus years\nKey Skills:\n· Development Skills: Solutions design; Project technical planning; Analysis and design; Communication; Testing and implementation; Recommends software reusability guidelines; Plans and conducts formal mentorship activities for peers and/or lower-level staff via verbal instruction or technical documentation.\n· Development Tools: GIT, AZURE, C#, .NET 1.1 to current, ASP, Java Script, knockout, json, api, and Active X controls, familiar with other language tools.\n· Database: Microsoft SQL Server\n· Diagramming Tools: MS Visio or any flow diagram tools (optional)\n· Version Control: ODRC uses GIT for version control for source code and Documents, any products ok.\n· Testing: Perform System Test and Create Test Documentation\n· Documentation: Create Technical documentation with application functionality and test methods, various flow diagrams (Business/Functional)\n· Skills needed for this project: AZURE, CORE Framework, C#, ASP.NET Web application development, .Net 1.1 to Current, Sql2000 to sql2018, SQL Procedures, Functions, Tables, Views, etc., Willing to use new tools and provide positive suggestions. Familiar with manual QA testing processes.\n· The project tasks would be as directed by the Application Manager; expect to perform lower level tasks such as develop simple reports in HTML. Unit testing and technical document creation is also expected. This position is not limited to one project area but can be worked across multiple projects as needed.",
        "source": "Email",
        "date_posted": "2024-09-30 18:08:43-05:00",
        "unique_id": "19245310ead2e83d",
        "emp_type": [
            "third party"
        ],
        "tag": ".net developer"
    }
]