[
    {
        "company": "Dia Software Solutions",
        "job_title": "Network - Business Analyst",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "15+ years",
            "degree_required": "Bachelor's Degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "1 year with extension possible",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Communication skills",
                "Organizational skills",
                "Prioritization skills",
                "Experience with multiple network platforms",
                "Experience in a large Enterprise setting"
            ],
            "primary": [
                "Microsoft Project",
                "Microsoft Excel",
                "DevOps",
                "Remedy/Helix",
                "Telecommunications experience"
            ],
            "secondary": [
                "Clarity",
                "Customer service skills",
                "Interpersonal skills"
            ],
            "all": [
                "Communication skills",
                "Organizational skills",
                "Prioritization skills",
                "Experience with multiple network platforms",
                "Experience in a large Enterprise setting",
                "Microsoft Project",
                "Microsoft Excel",
                "DevOps",
                "Remedy/Helix",
                "Telecommunications experience",
                "Clarity",
                "Customer service skills",
                "Interpersonal skills"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Sayyad Akif Husain",
        "email": "sayyad.husain@diasoftwaresolutions.com",
        "jd": "From: Sayyad Akif Husain, Dia Software Solutions sayyad.husain@diasoftwaresolutions.com Reply to: sayyad.husain@diasoftwaresolutions.com Hi,I hope this message finds you well! I am reaching out to you on an exciting Direct client opportunity with one of our clients. Can you please go through the requirements and let me know if you are interested in this position?Job Title: Network - Business Analyst Location: Lansing, MIHybridExperience: 15+ yearsDuration: 1 year with extension possibleInterviews: 1st round interviews will be held via MS Teams. There is potential a 2nd round interview could be held in-person, so please make sure your candidate is available to come onsite for an interview if requested.- Position location: Lansing, MI. Resource will be working a hybrid schedule. NO REMOTE ONLY OPTION. Will need to be onsite from day 1, two days a week.- Local candidates (strongly preferred) or non-local (must be willing to relocate at their own expense from acceptance with no delays & follow the onsite/hybrid schedule) Clear and concise communication skills required. Job Description:Short Description: Receive, process, present data, and information regarding our weekly Service Requests (Infrastructure Service Requests). Responsible for gathering business and technical requirements during the client kick off meetings. Consult SMEs (Subject Matter Experts) on tasks required to complete integrated projects for all Telecommunication services, such as, WAN, WLAN, MLAN, Security, Contact/Call Centers, Telephony, and Video. Manage multiple projects based on Agency assignments.Complete Description:Facilitate meetings with clients to gather requirements for all IT solutions and to identify impacted business processes and determine best process and IT solution integration.Ability to obtain and report business and technical requirementsFacilitate review sessions to discuss projectsExcellent customer and communication service skillsWork with multiple network platforms, such as, WAN, MLAN, WLAN, Security, Voice, and VideoconferencingDisseminate information effectively to all technical teams, customers, and technical managersUnderstand a large (enterprise) and complex network environmentSkills, Experience and Education: Bachelors Degree, RequiredOrganization and Prioritization skills are MandatoryCommunication and Interpersonal skills are MandatoryPrevious experience working with multiple agencies and/or vendors and/or departments in an enterprise environment are RequiredMinimum 1-3 years experience with Clarity is PreferredMinimum 3-5 years experience with Microsoft Project and Excel is RequiredMinimum 2-3 years experience with DevOPs is PreferredMinimum 3-5 years experience with Remedy/Helix is RequiredMinimum 3-5 years working within a Telecommunications environment is RequiredMinimum 3-5 years experience in a large Enterprise setting is RequiredMinimum 3-5 years work experience with multiple network platforms is RequiredMinimum 3-5 years working with multiple network lines of service is RequiredMinimum 5+ years dealing with customers is Required Thanks & Regards, Sayyad Akif Husain______________________ DIA Software Solutions LLC, Contact: 228-280-4778 | Email: sayyad.husain@diasoftwaresolutions.comAddress: Austin, TX | Website: Diasoftwaresolutions.com",
        "source": "Email",
        "date_posted": "2024-10-01 10:08:59-05:00",
        "unique_id": "19248a3e76bd864c",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]