[
    {
        "company": "ActiveSoft Inc.",
        "job_title": "Senior SQL Server DBA Architect with Azure cloud Architecture",
        "location": "Reading, PA, USA",
        "full_location": {
            "city": "Reading",
            "state": "PA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract"
            ],
            "experience_required": "15+ years",
            "degree_required": "Bachelor’s degree in computer science, Information Technology, or a related field (or equivalent experience)",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 to 36 months contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Microsoft SQL Server",
                "Azure SQL Database",
                "SQL Managed Instance",
                "Azure Synapse Analytics",
                "T-SQL",
                "PowerShell scripting"
            ],
            "primary": [
                "Database performance tuning",
                "Optimization strategies",
                "Instance consolidation strategies",
                "Azure cloud architecture",
                "SQL Server Always On Availability Groups",
                "Data warehousing concepts",
                "ETL processes",
                "SSIS",
                "Azure Data Factory"
            ],
            "secondary": [
                "Certifications such as Microsoft Certified: Azure Database Administrator Associate",
                "Azure Solutions Architect Expert",
                "Oracle",
                "MySQL",
                "PostgreSQL",
                "NoSQL databases",
                "Cosmos DB",
                "MongoDB",
                "DevOps practices",
                "CI/CD pipelines",
                "Power BI",
                "SSRS"
            ],
            "all": [
                "Microsoft SQL Server",
                "Azure SQL Database",
                "SQL Managed Instance",
                "Azure Synapse Analytics",
                "T-SQL",
                "PowerShell scripting",
                "Database performance tuning",
                "Optimization strategies",
                "Instance consolidation strategies",
                "Azure cloud architecture",
                "SQL Server Always On Availability Groups",
                "Data warehousing concepts",
                "ETL processes",
                "SSIS",
                "Azure Data Factory",
                "Certifications such as Microsoft Certified: Azure Database Administrator Associate",
                "Azure Solutions Architect Expert",
                "Oracle",
                "MySQL",
                "PostgreSQL",
                "NoSQL databases",
                "Cosmos DB",
                "MongoDB",
                "DevOps practices",
                "CI/CD pipelines",
                "Power BI",
                "SSRS"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Devender Gandham",
        "email": "devender@activesoftinc.com",
        "jd": "From: Devender, ActiveSoft Inc. devender@activesoftinc.com Reply to: devender@activesoftinc.com Hi Professionals, I am Devender Gandham, an IT Recruiter from ActiveSoft Inc. We have the requirement for SQL Server DBA Architect with Azure cloud Architecture – Reading, PA (Hybrid Onsite) – 6 to 36 months contract, Please review the requirement below and let me know your thoughts. Kindly, share the resume if you are interested along with the following details… Senior SQL Server DBA Architect with Azure cloud ArchitectureReading, PA (Hybrid Onsite - Only locals)6 to 36 months contract Looking for a highly skilled Microsoft SQL Server DBA/Architect/SME Consultant who can provide both hands-on expertise in managing, optimizing, and scaling SQL Server environments, as well as strategic guidance in assessing current database systems and recommending future-state architectures. The ideal candidate will have deep experience with both on-premises SQL Server environments and Azure cloud-based solutions. This role will involve working closely with technical teams, business stakeholders, and clients to design, implement, and maintain robust database solutions that meet business needs and support digital transformation initiatives. Education: Bachelor’s degree in computer science, Information Technology, or a related field (or equivalent experience). Experience: 15+ years of experience as an MS SQL Server DBA/Architect/Consultant, with a focus on both on-premises and cloud (Azure) environments. Technical Skills:Expertise in Microsoft SQL Server (versions 2012 to 2019) and Azure SQL Database, SQL Managed Instance, Azure Synapse Analytics, and other Azure data services.Strong experience with database performance tuning, optimization, and indexing strategies.Proficiency in instance consolidation strategies and practices to optimize resources and reduce costs.Knowledge of Azure cloud architecture, including PaaS, IaaS, and hybrid solutions.Proficiency in T-SQL, PowerShell scripting, and automation tools.Experience with SQL Server Always On Availability Groups, clustering, log shipping, and other HA/DR strategies.Experience with data warehousing concepts, ETL processes, and tools like SSIS and Azure Data Factory. Soft Skills:Excellent communication and presentation skills, with the ability to effectively convey technical information to non-technical stakeholders.Strong problem-solving skills and a proactive approach to identifying and addressing potential issues.Ability to work independently and collaboratively with cross-functional teams.Strong analytical and organizational skills with attention to detail. Preferred Qualifications:Certifications such as Microsoft Certified: Azure Database Administrator Associate, Azure Solutions Architect Expert, or equivalent.Experience with other database platforms (e.g., Oracle, MySQL, PostgreSQL) and NoSQL databases (e.g., Cosmos DB, MongoDB).Familiarity with DevOps practices, CI/CD pipelines, and tools such as Jenkins, Azure DevOps, and Git.Experience with Power BI, SSRS, and other data visualization and reporting tools. Key Responsibilities:Database Architecture and Design: Assess existing database environments (as-is state) and provide expert recommendations for designing optimal future-state (to-be) architecture, including cloud migration strategies, scalability, performance, and high availability.Database Administration: Perform hands-on installation, configuration, patching, and upgrading of Microsoft SQL Server databases in both on-premises and Azure environments.Azure Expertise: Designed and implement Azure-based data solutions, including Azure SQL Database, SQL Managed Instances, Azure Synapse Analytics, Data Factory, and other Azure data services.Performance Tuning and Optimization: Analyze, troubleshoot, and resolve performance issues at the database and query levels. Recommend and implement indexing strategies, query optimization, and other performance-enhancing techniques.Advisory Role: Act as a trusted advisor to clients and stakeholders by providing insights and recommendations on database best practices, modernization, and digital transformation strategies.Data Security and Compliance: Ensure database systems meet security and compliance requirements, including role-based access control, encryption, auditing, and GDPR or HIPAA regulations.Disaster Recovery and High Availability: Design, implement, and manage disaster recovery (DR) and high availability (HA) solutions, including Always On Availability Groups, replication, and geo-redundancy.Automation and Scripting: Develop and implement scripts and tools for automating routine database administration tasks, deployments, and monitoring.Collaboration: Work closely with development, infrastructure, and DevOps teams to support the application lifecycle, including database development, release management, and continuous integration/continuous deployment (CI/CD) pipelines.Documentation and Reporting: Maintain comprehensive documentation of database architecture, configurations, policies, and procedures. Provide regular reports and insights on system performance, usage, and optimization opportunities. Training and Mentorship: Provide training, mentorship, and knowledge transfer to internal teams and clients to build their capabilities in database management and architecture Thanks & Regards, Devender GandhamCelebrating 14 Years of Excellence!devender@activesoftinc.com www.activesoftinc.com Serving clients and consultants nationwide with offices in Georgia and North CarolinaWe respect your online privacy. This is not an unsolicited mail. Under Bills.1618 Title III passed by the 105th US Congress this mail cannot be considered Spam as long as we include contact information and a method to be removed from our mailing list. If you are not interested in receiving our e-mails, then please reply with: “REMOVE\" in the subject line and your ID will be removed from our mailing list. We are sorry for the inconvenience caused to you.",
        "source": "Email",
        "date_posted": "2024-10-01 10:43:57-05:00",
        "unique_id": "19248c6dc0c6b767",
        "emp_type": [
            "contract"
        ],
        "tag": "Oracle DBA"
    }
]