[
    {
        "company": "First United Bank",
        "job_title": ".NET Full Stack Developer with Angular (Strong C# API Engineer)",
        "location": "McKinney, TX, USA",
        "full_location": {
            "city": "McKinney",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "12-20+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6-Months Contract to Hire",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "C# Development",
                ".NET Core",
                "ASP.NET",
                "RESTful API Development",
                "API Security (OAuth2, JWT, etc.)",
                "Microservices Architecture",
                "Angular Front-End Development"
            ],
            "primary": [
                "Blazor Front-End Development",
                "API Integration (Third-Party Services)",
                "API Versioning & Lifecycle Management",
                "DataDog (Monitoring & Performance)",
                "Azure Okta Integrations",
                "Azure DevOps CI/CD",
                "Cloud Environments (Azure)",
                "API Testing & Debugging",
                "API Performance Optimization"
            ],
            "secondary": [
                "Strong communication and interpersonal skills",
                "Ability to work independently",
                "Problem-solving",
                "Continuous learning",
                "Delivering high-quality solutions"
            ],
            "all": [
                "C# Development",
                ".NET Core",
                "ASP.NET",
                "RESTful API Development",
                "API Security (OAuth2, JWT, etc.)",
                "Microservices Architecture",
                "Angular Front-End Development",
                "Blazor Front-End Development",
                "API Integration (Third-Party Services)",
                "API Versioning & Lifecycle Management",
                "DataDog (Monitoring & Performance)",
                "Azure Okta Integrations",
                "Azure DevOps CI/CD",
                "Cloud Environments (Azure)",
                "API Testing & Debugging",
                "API Performance Optimization",
                "Strong communication and interpersonal skills",
                "Ability to work independently",
                "Problem-solving",
                "Continuous learning",
                "Delivering high-quality solutions"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Prashant Jha",
        "email": "prashant.jha@tekinspirations.com",
        "jd": "Job Description - Job Title: .NET Full Stack Developer with Angular (Strong C# API Engineer)\nLocation: McKinney, TX\nWork Status : Hybrid – 3 days a Week Onsite\nJob Type: 6-Months Contract to Hire eligibility: Must be GC OR US Citizen ONLY - (Due to previous issues, eligibility will be verified) Urgent Request: Only Submit Strong, Authentic Candidates for First United Bank\n\nHi All,\nAfter reviewing multiple profiles, I still haven’t found anyone who truly fits the bill for this position. We are looking for a genuine candidate—someone who is a go-getter, a heavy hitter in technology, and 100% confident in explaining their project experience when asked. We’ve seen too many candidates who seem impressive on paper but can’t provide substance when screened.\n\nPlease do not submit candidates unless they meet the following criteria:\n- Extensive experience in the required technologies and can articulate their hands-on experience with confidence and detail.\n- Passionate about technology and ready to be a fit with the team.\n- Excited to attend an on-site interview if requested, demonstrating commitment and readiness.\n- Able to thoroughly walk us through a project they've worked on—something they enjoyed, were proud of, and where they made a clear impact.\n- Comfortable creating brand-new APIs or projects and quick to learn new technologies like Blazor. If a candidate has listed Blazor on their resume, they should be able to speak to their experience with it.\n\nLastly, ensure that your candidates have done their homework. First United Bank values candidates who understand their culture and the company’s mission, so they must have researched the organization.\n\nAdditionally, when I screen candidates, I will require them to connect with me on FaceTime immediately, without prior notice. I will not be sending a link beforehand; this process is to ensure the authenticity and readiness of the candidate. By submitting candidates, you confirm that they are aware of and agree to this screening process.\n\nInterview Process: 2 WebEx interviews\nNote: Candidates must have a financial background.\n\nThe ideal candidate should be located in Texas and willing to attend a mandatory face-to-face interview and work onsite (hybrid 3 days per week).\n\nJob Overview: We are seeking a highly experienced and passionate .NET FullStack Developer with over 10+ years of hands-on experience in C# development, focusing on building robust API solutions. The ideal candidate will have deep expertise in designing, developing, and maintaining scalable, high-performance C# APIs using .NET technologies, alongside strong front-end development experience using Angular. Blazor experience is also highly desirable. This role requires someone who is both technically proficient and passionate about delivering impactful solutions while collaborating closely with cross-functional teams.\n\nKey Responsibilities:\n- Design, develop, and maintain scalable and secure C# APIs to support various business applications.\n- Architect APIs using RESTful principles and ensure smooth integration with internal and external systems.\n- Collaborate with front-end developers to build responsive and dynamic UI components using Angular and Blazor.\n- Take full ownership of API development, including coding, testing, debugging, and deployment.\n- Implement advanced API security practices, optimize performance, and ensure high availability of services.\n- Work closely with stakeholders to gather requirements, translating them into efficient API designs.\n- Use best practices for API lifecycle management, versioning, and monitoring.\n- Mentor junior developers and contribute to building a strong engineering culture within the team.\n\nRequired Skills & Experience:\n- 12-20+ years of experience in C# development with deep expertise in the .NET ecosystem, including .NET Core and ASP.NET.\n- Proven track record of developing and managing RESTful APIs in complex, scalable systems.\n- Expertise in API best practices, including design, performance optimization, security, and versioning.\n- Strong experience in Angular for front-end development; experience with Blazor is highly desirable.\n- Experience with microservices architecture and distributed systems.\n- Experience in API integration with third-party services, including managing dependencies and API gateways.\n- Demonstrated ability to communicate technical solutions and bring value to the organization.\n- Passionate about API-driven development and staying updated on evolving software development trends.\n\nAdditional Experience:\n- Hands-on experience with DataDog for monitoring and performance analysis of APIs and infrastructure.\n- Knowledge of Azure Okta Integrations for secure authentication and identity management.\n- Familiarity with Azure DevOps CI/CD pipelines for automating builds, testing, and deployment.\n- Experience working in Azure cloud environments, including leveraging PaaS and IaaS for API hosting and scaling.\n\nSoft Skills:\n- Strong communication and interpersonal skills, with the ability to explain complex technical concepts to non-technical stakeholders.\n- Ability to work independently, take ownership of tasks, and collaborate proactively with team members and stakeholders.\n- A passion for problem-solving, continuous learning, and delivering high-quality solutions.",
        "source": "Email",
        "date_posted": "2024-10-01 17:03:34-05:00",
        "unique_id": "1924a94947ed87e1",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]