[
    {
        "company": "Thothit LLC",
        "job_title": "Frontend and Backend developer",
        "location": "Princeton, NJ, USA",
        "full_location": {
            "city": "Princeton",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Python 3.7+",
                "Docker",
                "AWS",
                "JavaScript",
                "Neo4J"
            ],
            "primary": [
                "Linux"
            ],
            "secondary": [],
            "all": [
                "Python 3.7+",
                "Docker",
                "AWS",
                "JavaScript",
                "Neo4J",
                "Linux"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Ishika",
        "email": "ishika@thothit.net",
        "jd": "From: Ishika, Thothit LLC ishika@thothit.net Reply to: ishika@thothit.net Job Role : Frontend and Backend developerLocation : Position is 3 days a week hybrid to Princeton, NJ(Need local with DL)Visa : All visa workable except h1b Face to Face interview Needs:- Python 3.7+ backend;Docker and docker compose for local development;AWS hosted;JavaScript frontend (JavaScript experience is more of a nice-to-have);Neo4J database;- nice to haveKnowledgeable about Linux would help.Good UniversityShort ResumeYears don’t really matter as long as sharp Position ResponsibilitiesWe are looking for a Senior Python Developer to build functional and efficient server-side applications. Senior Python Developer responsibilities include participating in all phases of the software development lifecycle and coaching junior developers. If you’re a seasoned developer with a love for back-end technologies, we would like to meet you.Your ultimate goal is to create high-quality products that meet customer needs.Please be advised that this role is also a hands-on development position where the proper candidate will be involved with architecting, implementing, deploying, and supporting custom internally developed software. Help design and implement functional requirementsBuild efficient back-end features in PythonIntegrate front-end components into applicationsManage testing and bug fixesPrepare technical documentationCollaborate with UX/UI designers to implement design into the codeCoach junior team membersImplement software enhancements and suggest improvements Provide technical domain leadership:Develops the Domain Model: Works with business users as well enterprise technology members to architect, implement and own the Domain Driven model capable of modeling all pharmaceutical data sources internal/external to BMS.Owns the IT strategy: Drives the development of realistic and actionable multi-year strategic digital capability roadmaps, informed and prioritized by business and IT in an enterprise context. Prioritizes the portfolio appropriately and is accountable for the overall portfolio budget management.Develops compelling business cases: Leads the prioritization and development of strong and clear business cases for digital capability investments in support of the roadmap and aligned with the platform strategy. Defines, measures, & achieves business outcomes for highest value (at the lowest cost) digital capabilities. Brings an external view: Actively maintains awareness of external drivers in the business domain and relevant technology trends, and brings new ideas.Knows what value looks like: Understands where BMS should be competitively differentiated through technology, translates business needs into specific business requirements, sees realistic opportunities for IT to add more value, and balances this with a pragmatic understanding of “fitness for purpose”.Provide technical and strategic leadership:Builds high performance applications and platforms: Knows how to architect, implement, and deliver high performance applications as well as CI/CD systems to ensure the consistency of changes to the system.Builds strong partnerships with senior leaders: Is viewed by senior business leaders as an effective partner who plans and delivers digital capabilities, safeguards their digital assets and supports their strategic goals. Recognized as a thought leader and trusted advisor: Influences the strategic thinking of senior business leaders, and helps business leaders to include future digital capabilities into their planning.Owns the relationship: Has effective working relationships with all relevant business leaders, is deeply involved with key business activities and forums, is responsible for building and managing effective business partnership at all levels during project execution, and takes full accountability for delivering the value proposition of IT. Drives change: Ensures effective planning, execution and communication of business change management to support digital capability investments, including business process changes to achieve maximum value from investments. Accountable for ensuring an effective change management plan is in place for their individual projects.Leverages the matrix to drive portfolio execution:Demonstrates Matrix leadership by ensuring that all IT functions are successful in their delivery of services to the US Immunology business. Shows good judgement in communication: Communicates successes and issues accurately, urgently, and to the right audience, and takes accountability for ensuring effective management of expectations with business leaders.Boldly acts with urgency: Shows courage, tenacity and respect to provoke uncomfortable conversations in order to remove roadblocks to value delivery --Thank You and RegardsIshikaDesk: 352-614-4461Email: Ishika@thothit.net",
        "source": "Email",
        "date_posted": "2024-09-30 15:06:59-05:00",
        "unique_id": "192448ab37416c82",
        "emp_type": [
            "full-time",
            "contract",
            "third party"
        ],
        "tag": "Python developer"
    }
]