[
    {
        "company": "Predica Inc.",
        "job_title": "Program Manager",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time"
            ],
            "job_code": "135468",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management"
            ],
            "primary": [
                "IT Data Governance",
                "Data Warehouse Implementation",
                "Procurement",
                "Vendor Management",
                "Multi-projects Management"
            ],
            "secondary": [],
            "all": [
                "Project Management",
                "IT Data Governance",
                "Data Warehouse Implementation",
                "Procurement",
                "Vendor Management",
                "Multi-projects Management"
            ]
        },
        "job_type": [
            "onsite",
            "hybrid"
        ],
        "contact_person": "Bhargav",
        "email": "bhargav@predicaz.com",
        "jd": "From: Bhargav, Predicaz bhargav@predicaz.com Reply to: bhargav@predicaz.com Posting Title : Lansing, MI - IT - DTMB - CSS - EPMO - Program Manager - 135468 Location: Lansing, MI Hybrid Role with 2 days onsite from day 1 - Tuesday & WednesdayNeed LocalsIn-person REQUIRED, second round through Teams.High-Level Job DutiesEstablish and monitor project controlling methods to insure timely knowledge and awareness of changes to project and/or program cost, quality, or schedule. Provide planning and reporting to insure the successful completion of assigned projects according to the sponsor’s goals and objectives. Planning should adhere to the State of Michigan’s Methodology (SUITE) and the Agency’s project prioritization process. Planning and reporting span the entire lifecycle of the project from initiation to close. Direct and coordinate day to day activities, tasks, and deliverables required from the project team according to the project plan. Perform miscellaneous functions as needed to contribute to the overall operation and objectives of the Department of Technology, Management, and Budget (DTMB). Project DetailsMDOT – DIWD P3 System Integrator Solicitation (SI)Document requirements and develop a Statement of Work (SOW) to procure a vendor contract for SI servicesMDOT – DIWD P3 Independent Verification and Validation (IV&V)Document requirements and develop a Statement of Work (SOW) to procure a vendor contract for IV&V services High Priorities for Experience/Skills:10+ years of Project Management experienceBeneficial experience, ranked by priority:IT Data Governance – 2 years Data Warehouse Implementation/Solicitation – 2 years Procurement (RFP/SOW) – 1 year Vendor Management – 1 year Multi-projects and/or Program Management (will be multiple DIWD projects rolled into a DIWD program) – 1 year BhargavSr. IT RecruiterEmail: bhargav@predicaz.comPredica Inc.",
        "source": "Email",
        "date_posted": "2024-09-30 21:31:23-05:00",
        "unique_id": "192465a21c16b52f",
        "emp_type": [
            "full-time"
        ],
        "tag": "BA/Scrum Master/PM"
    }
]