[
    {
        "company": "Thoughtwave Software Solutions",
        "job_title": "Project Manager",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "VSP - Sr Project Manager 2 - IN PERSON IVS ONLY (748185)",
            "experience_required": "10 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "PMP Certification",
                "High-Risk Project Management",
                "Microsoft Word",
                "Microsoft Excel"
            ],
            "primary": [
                "Process Optimization",
                "Change Management",
                "Interpersonal Skills",
                "Oral Communication",
                "Written Communication",
                "Presentation Skills",
                "Applications Development"
            ],
            "secondary": [
                "Best Practices",
                "Internal Consulting",
                "External Consulting"
            ],
            "all": [
                "Project Management",
                "PMP Certification",
                "High-Risk Project Management",
                "Microsoft Word",
                "Microsoft Excel",
                "Process Optimization",
                "Change Management",
                "Interpersonal Skills",
                "Oral Communication",
                "Written Communication",
                "Presentation Skills",
                "Applications Development",
                "Best Practices",
                "Internal Consulting",
                "External Consulting"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Srujan",
        "email": "srujan@thoughtwavesoft.com",
        "jd": "From: srujan, Thoughtwave software solutions srujan@thoughtwavesoft.com Reply to: srujan@thoughtwavesoft.com Hi, This is Srujan from Thoughtwave Software and Solutions.I hope you are doing Well, Job title: Project Manager Location: Richmond, VA (Onsite)JOB ID: VSP - Sr Project Manager 2 - IN PERSON IVS ONLY (748185)Interview: In Person OnlyComplete Description:candidates with the sr level experience in managing HIGH-COMPLEXITY, HIGH-RISK projects ($10M +) ABOUT THE ROLEThe Virginia State Police is looking for a Project Manager with 10+ years of experience in the field. A PM is needed to address and coordinate the replacement of the existing criminal history systems utilized by the Virginia State Police. The Project Manager will work with Business Analysts, program manager and serve as the liaison between the business community/end users and the IT organization. The project manager is responsible for managing the project scope, schedule and budget and reporting to VSP IT management and the business stakeholders/owners on a weekly basis or as agreed upon.The successful candidate must have the following qualifications:* Active Project Management Institute (PMI) Project Management Professional (PMP)certification REQUIRED* Documented high-risk project management experience* Completion of a Category 1 or 2 Commonwealth project of $5M or more, OR completion of non-COV project with a value greater than $10M as PM of record.Duties may include managing/coordinating a Request for Proposal (RFP) process composed of RFP related tasks such the review and assistance with drafting of the evaluation criteria, contract terms, RFP format, and other procurement-related documentation in coordination with the VSP procurement staff. The project manager will assist the VSP IT Division staff in responding to vendor queries, performing the vendor evaluation process and contract negotiations as necessary. The PM will direct the Business Analyst throughout the project to ensure the objectives and requirements for a new system are fully defined. The PM will oversee the vendor efforts on the design, development and implementation of the solution and will coordinate with the vendor PM and VSP IT Division and business stakeholders/owners as needed. SkillRequired / DesiredAmountof ExperienceReview, analyze and evaluate user/system needsRequired10Years Project management experience with a PMP Certification.Required10YearsProficient with Microsoft Word and XLRequired10Years Demonstrated ability to manage multiple projects lasting 6 to 12 months, with teams of 3 to 4 people.Required10YearsProcess optimization, best practices, change management, facilitation and internal/external consulting is highly preferred.Required10Years Should have excellent interpersonal, oral/written communication and presentation skills.Required10YearsExtensive knowledge of applications developmentRequired10Years Documented high risk management experienceRequired10YearsCompletion of a Category 1 or 2 Commonwealth project of $5M or more, or completion of non-COV project with a value greater than $10M as PM of record.Required10Years",
        "source": "Email",
        "date_posted": "2024-10-01 15:43:53-05:00",
        "unique_id": "1924a3ffd771ca7b",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]