[
    {
        "company": "Visionet",
        "job_title": "RPA Business Analyst",
        "location": "Camden, NJ, USA",
        "full_location": {
            "city": "Camden",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Analytical Thinking",
                "Communication Skills",
                "Technical Understanding"
            ],
            "primary": [
                "Project Management"
            ],
            "secondary": [
                "UiPath",
                "Automation Anywhere",
                "Blue Prism"
            ],
            "all": [
                "Analytical Thinking",
                "Communication Skills",
                "Technical Understanding",
                "Project Management",
                "UiPath",
                "Automation Anywhere",
                "Blue Prism"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Rishabh Singh",
        "email": "rishabhs1@vbeyond.com",
        "jd": "From: Rishabh Singh, Vbeyond Corp rishabhs1@vbeyond.com Reply to: rishabhs1@vbeyond.com RPA BA Role at Visionet 2 days Hybrid to Camden NJ Key Responsibilities: Process Identification: Analyze business processes to identify automation opportunities. Requirements Gathering: Work with stakeholders to gather and document business requirements. Feasibility Analysis: Assess the feasibility of automating specific processes. Collaboration: Work with RPA developers to translate business needs into technical specifications. Testing and Validation: Ensure that the automated solutions meet business requirements through thorough testing. Skills Needed: Analytical Thinking: Ability to analyze processes critically and identify inefficiencies. Communication Skills: Strong verbal and written communication skills to interact with stakeholders. Technical Understanding: Basic knowledge of RPA tools (like UiPath, Automation Anywhere, or Blue Prism) can be beneficial. Project Management: Familiarity with project management methodologies to help guide RPA projects. Getting Started: Learn RPA Tools: Familiarize yourself with popular RPA platforms. Understand Business Processes: Gain a solid understanding of how different business processes work. Certifications: Consider certifications in RPA or business analysis to enhance your credentials.",
        "source": "Email",
        "date_posted": "2024-09-30 17:46:49-05:00",
        "unique_id": "192451d00f8c2507",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]