[
    {
        "company": "SPAR Information Systems",
        "job_title": "Azure .Net Full Stack Lead with React exp",
        "location": "Issaquah, WA, USA",
        "full_location": {
            "city": "Issaquah",
            "state": "WA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "C#",
                "API microservices development",
                "Azure",
                "JavaScript",
                "React"
            ],
            "primary": [
                "CI/CD",
                "DevSecOps",
                "Relational databases",
                "NoSQL",
                "Object-oriented concepts"
            ],
            "secondary": [
                "Strong verbal and written communication skills",
                "Problem-solving skills",
                "Time management skills",
                "Ability to work under pressure",
                "Detail-oriented"
            ],
            "all": [
                "C#",
                "API microservices development",
                "Azure",
                "JavaScript",
                "React",
                "CI/CD",
                "DevSecOps",
                "Relational databases",
                "NoSQL",
                "Object-oriented concepts",
                "Strong verbal and written communication skills",
                "Problem-solving skills",
                "Time management skills",
                "Ability to work under pressure",
                "Detail-oriented"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Rahul Kumar",
        "email": "rahul.k@sparinfosys.com",
        "jd": "Hello Folks, (Prefer local to WA - PST who can share WA state ID, DL copy) or else non-locals who recently came to USA - Note it / Need 10+ yrs profiles onlyHope you all are doing good.\n\nPlease go through the Job description and let me know your interest.\n\nTitle: Azure .Net Full Stack Lead with React exp\nWork Location: Issaquah, WA (Onsite)\nDuration: Long Term Contract\n\nRequirements:\n• Minimum 7 years’ experience in performing API microservices development using C#.\n• Experience with developing and running applications in a public cloud environment (Azure preferred).\n• Hands-on working knowledge of a major relational database (DB2, SQL Server etc.) and/or NoSql.\n• Experience working in CI/CD, and designing and delivering DevSecOps automation for app deployment and testing.\n• Strong knowledge and experience working with Web Technologies using JavaScript, React.\n• Experience describing solutions and generating the architecture (Logical, Physical) artifacts.\n• Must be extremely responsive, able to work under pressure in crisis with a strong sense of urgency.\n• Responsible, conscientious, organized, self-motivated and able to work with limited supervision.\n• Application development in C#.\n• Experience programming in major databases such as Microsoft SQL Server.\n• Must possess a strong understanding of the software development process.\n• Strong knowledge of object-oriented concepts.\n• Strong knowledge and experience working with databases.\n• Strong verbal and written communication skills and be able to communicate to both technical and Business audiences.\n• Demonstrated ability to execute against iteration plans and deliver assignments within scope, schedule, and budget.\n• Ability to work with all management levels.\n• Strong organizational and time management skills with ability to multitask and prioritize work effectively in a fast-paced working environment.\n• Must be detail-oriented and possess strong problem-solving skills and ability to analyze potential future issues.\n\nResponsibilities:\n• Supports Systems Architects with the design of the overall architecture of a specific product/application, applying principles that promote availability, reusability, interoperability and security into the design framework.\n• Performs development, optimization, and automation activities to support the implementation of a product/application.\n• Increases proficiency and understanding of relational and non-relational databases, distributed application architectures, user interfaces and user experience, quality assurance, security concerns, and business value creation.\n• Adopts engineering best practices to deliver higher quality and scalable solutions.\n• Provides the team with the development strategy, solution recommendations, and estimates for a given product/application.\n• Works with team members to move user stories from the development backlog into testing and provides clarification when needed.\n• Estimates, plans, and manages all implementation tasks and reports on development progress.\n• Demonstrates a strong understanding of emerging technologies to support the development of new solutions.\n• Conducts peer code reviews for the software changes made by other engineers within a team.\n• Designs, builds, debugs, optimizes, and implements solutions in C#, NoSql, and RDBMS. Developments high quality, efficient, and fault tolerant solutions.\n• Delivers automation scripts and unit test automation under DevSecOps.\n• Works with and supports Systems Architects with the design of the overall architecture of a specific product/application, applying principles that promote availability, reusability, interoperability, and security into the design framework.\n• Performs development, debugging, optimization, and automation activities to support the implementation of a product/application.\n• Uses APM/monitoring tools such as Dynatrace/Splunk and browser tools to perform request purepath/waterfall analysis to identify bottlenecks and suggest improvements.\n• Understands the full technology stack and underlying applications, services, and databases in order to ensure optimal performance.",
        "source": "Email",
        "date_posted": "2024-10-01 09:36:49-05:00",
        "unique_id": "192489d9f6594752",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]