[
    {
        "company": "Tekgence Inc",
        "job_title": "Business System Analyst - Procure to Pay",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Bachelor's degree in Business, Accounting, IT or experience in Source to Pay operations.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Procure to Pay (P2P)",
                "NetSuite",
                "Coupa"
            ],
            "primary": [
                "System administration",
                "Troubleshooting",
                "Complex configuration",
                "Develop integrations",
                "Project management"
            ],
            "secondary": [
                "Supplier Enablement",
                "Cloud-based ERP Applications",
                "Agile methodologies",
                "Scrum process",
                "JIRA"
            ],
            "all": [
                "Procure to Pay (P2P)",
                "NetSuite",
                "Coupa",
                "System administration",
                "Troubleshooting",
                "Complex configuration",
                "Develop integrations",
                "Project management",
                "Supplier Enablement",
                "Cloud-based ERP Applications",
                "Agile methodologies",
                "Scrum process",
                "JIRA"
            ],
            "with_experience": [
                "Procure to Pay (P2P)",
                "NetSuite",
                "Coupa"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Pranith",
        "email": "pranith.t@tekgence.com",
        "jd": "From: Pranith, Tekgence Inc pranith.t@tekgence.com Reply to: pranith.t@tekgence.com Role: Business System Analyst - Procure to Pay\nYears of Experience: 10+ years\nLocation: Remote (Preferred in PST Time Zone) \nMain Skills: Procure to Pay (P2P), NetSuite with Coupa \nJob Description:\nIn this role as an individual contributor, you will assume the crucial responsibility of overseeing the day-to-day operations of the P2P system. This entails managing user accounts, executing intricate configuration modifications, coordinating release processes, and conducting thorough system testing and issue resolution, all while upholding our rigorous internal control standards.\nWhat you’ll be doing\nCollaborate closely with Business Stakeholders to comprehensively capture and document business needs, forming the foundation for procedural enhancements through the effective utilization of Coupa, NetSuite, and additional relevant business applications.\nPlay a vital role in cross-functional initiatives and projects within the Procure to Pay domain, encompassing activities such as system implementations, operational refinements, and the seamless introduction of new products.\nSystem administration including user on and offboarding, user access updates, and other administrative tasks as needed.\nTroubleshooting of system and integration errors, and building processes using the Process Automator functionality.\nComplex configuration including building and maintaining user roles, workflows, process forms, and reports, maintaining master data, and other similar tasks.\nDemonstrate proactive initiative by identifying potential areas for enhancement and proposing projects aimed at optimizing business operations, whenever applicable.\nDevelop integrations and automations through systems like Workato\nApply your knowledge of P2P system best practices and financial processes to propose solutions and specific requirements\nWhat you bring to the role\nBasic Qualifications:\nBachelor's degree in Business, Accounting, IT or experience in Source to Pay operations.\n3+ years of experience with Procure-To-Pay, Supplier Enablement and related procurement areas\nHave experience with relevant cloud-based ERP Applications (Coupa and Netsuite preferred).\nExperience gathering requirements, creating functional design, and providing solutions to the Business.\nProven experience in organizational, project, and planning management\nPrevious experience working on teams consisting of business and IT resources\nPreferred Qualifications:\nAbility to work closely with stakeholders to consult, train & improve knowledge of existing NetSuite features.\nAbility to work with a fast-paced and agile team focused on strong execution.\nKnowledge of Scrum process and tools such as JIRA is a plus\nProven experience ensuring quality deliverables.\nLeading test preparation, execution and Provide post Go-Live support\nStrong verbal and written communication skills, along with strong presentation skills.",
        "source": "Email",
        "date_posted": "2024-10-01 09:35:54-05:00",
        "unique_id": "1924882cb755325c",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]