[
    {
        "company": "",
        "job_title": "Sr. Infrastructure Consulting Systems Engineer (Project Manager)",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "3-4 years",
            "degree_required": "Bachelor's degree in computer science, engineering, or a related field, or equivalent work experience.",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "project management methodologies",
                "IT infrastructure technologies",
                "troubleshooting",
                "problem-solving",
                "communication"
            ],
            "primary": [
                "Windows",
                "Linux",
                "VMware",
                "Cisco",
                "AWS",
                "Azure",
                "Active Directory",
                "DNS",
                "DHCP",
                "TCP/IP",
                "Citrix",
                "M365 products",
                "Secure Access Anywhere",
                "unstructured data migrations",
                "security risk remediation"
            ],
            "secondary": [
                "Microsoft Project",
                "Visio",
                "Excel",
                "PowerPoint"
            ],
            "all": [
                "project management methodologies",
                "IT infrastructure technologies",
                "troubleshooting",
                "problem-solving",
                "communication",
                "Windows",
                "Linux",
                "VMware",
                "Cisco",
                "AWS",
                "Azure",
                "Active Directory",
                "DNS",
                "DHCP",
                "TCP/IP",
                "Citrix",
                "M365 products",
                "Secure Access Anywhere",
                "unstructured data migrations",
                "security risk remediation",
                "Microsoft Project",
                "Visio",
                "Excel",
                "PowerPoint"
            ],
            "with_experience": [
                "IT infrastructure technologies",
                "project management methodologies"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Pankaj",
        "email": "ps@kpgtech.com",
        "jd": "From: Pankaj, kpg99 ps@kpgtech.com Reply to: ps@kpgtech.com Hi,Hope you are doing well.Please find the job description below and let me know your interest.Position: Sr. Infrastructure Consulting Systems Engineer (Project Manager)Lcation: Remote role -PSTDuration: 6+ MonthsMode of Interview: Phone and VideoJob Description:Infrastructure Consulting Systems EngineerJob DescriptionSummaryHighly technical infrastructure consulting systems engineer who can lead complex and high-risk projects involving the design, implementation, and transition to operations of IT infrastructure systems. Responsible for managing the project scope, schedule, quality, and risks, and coordinating with internal and external stakeholders, vendors, and contractors.Responsibilities• Plan, execute, monitor, control, and transition infrastructure projects according to the established standards and methodologies• Define and document the project objectives, scope, deliverables, assumptions, constraints, and dependencies• Develop infrastructure conceptual solution approach for complex infrastructure problem leveraging across domain expertise and experience• Identify, analyze, prioritize, and mitigate project risks and issues• Manage and communicate project status, progress, changes, and expectations to all stakeholders• Coordinate and collaborate with project team members, sponsors, customers, vendors, and contractors• Ensure that the project deliverables meet the quality standards and specifications• Manage the procurement, installation, configuration, testing, and integration of IT infrastructure components and systems, such as network, end-point, platform, hosting, and database• Provide technical guidance and support to the project team and customers on the infrastructure solutions and best practices• Conduct project reviews, lessons learned, and post-implementation auditsRequired Skills and Experience• Knowledge of project management methodologies, tools, and best practices• Strong knowledge and experience with various IT infrastructure technologies, such as network, end-point, platform, hosting, and database infrastructure, Windows, Linux, VMware, Cisco, AWS, Azure, Active Directory, DNS, DHCP, TCP/IP, Citrix, M365 products, Secure Access Anywhere, unstructured data migrations, outlook, and security risk remediation, etc.• Strong troubleshooting and problem-solving skills, as well as the ability to work under pressure and meet deadlines.• Excellent communication and interpersonal skills, as well as the ability to work independently and as part of a team.• Proficient in Microsoft Project, Visio, Excel, and PowerPoint• Ability to handle multiple tasks and prioritize effectively• Bachelor's degree in computer science, engineering, or a related field, or equivalent work experience.• At least 3-4 years of experience in managing IT infrastructure projects• At least 3-4 years of experience in IT infrastructure engineering, administration, or support.",
        "source": "Email",
        "date_posted": "2024-09-30 10:04:33-05:00",
        "unique_id": "1924376e5844542d",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]