[
    {
        "company": "Stellent IT",
        "job_title": "Business Analyst (BA) – Life Insurance Industry",
        "location": "Golden Valley, MN, USA",
        "full_location": {
            "city": "Golden Valley",
            "state": "MN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "8+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Requirement Gathering",
                "User Acceptance Testing (UAT)",
                "Stakeholder Engagement",
                "Process Mapping"
            ],
            "primary": [
                "Agile Framework",
                "Gherkin Syntax",
                "Communication Skills",
                "Project Management",
                "Analytical Skills"
            ],
            "secondary": [
                "Six Sigma",
                "CBAP",
                "BABOK",
                "Jira",
                "Polarion"
            ],
            "all": [
                "Business Analysis",
                "Requirement Gathering",
                "User Acceptance Testing (UAT)",
                "Stakeholder Engagement",
                "Process Mapping",
                "Agile Framework",
                "Gherkin Syntax",
                "Communication Skills",
                "Project Management",
                "Analytical Skills",
                "Six Sigma",
                "CBAP",
                "BABOK",
                "Jira",
                "Polarion"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Priyanka",
        "email": "priyanka@stellentit.com",
        "jd": "From: priyanka, Stellent IT priyanka@stellentit.com Reply to: priyanka@stellentit.com Title : Business Analyst with LOCAL PROJECT EXP. is MUSTLocation: Golden Valley - MN (Hybrid )Visa : USC & GCDuration : 6 MonthsMoi : Skype Must have : LinkedIn and Local project are must.Note:Retirement Solutions Platform (RSP) BUSINESS ANALYSTJob Title: Business Analyst (BA) – Life Insurance IndustryRole Overview:As a Business Analyst, you will be the critical liaison between Business Stakeholders and IT, facilitating the analysis and delivery of system enhancements, projects, and products. You will translate business needs into precise, concise, actionable requirements while developing robust acceptance and validation criteria. The role will focus on Fixed and Variable Annuities, ensuring the delivery of solutions that meet business objectives and provide business readiness for project deployment.Job Description:This role involves end-to-end business analysis, from eliciting and documenting business and technical requirements to leading User Acceptance Testing (UAT) and supporting business readiness. You will assess and document business risks, create cases, develop communication plans, and facilitate gap analysis and JAR sessions. A key part of the role will be writing and maintaining clear user stories with detailed acceptance criteria, ensuring traceability between business and technical requirements. You will also oversee the development and execution of UAT and ensure the successful transition of projects into production.Key Responsibilities:Requirement Gathering & Documentation:Elicit, analyze, and document detailed business and technical requirements through user stories and acceptance criteria.Facilitate requirements gathering sessions, ensuring all stakeholder inputs are captured and translated into actionable business requirements.Perform gap analysis, create process flows (As Is/To Be), and ensure traceability from business requirements to technical solutions.User Acceptance Testing (UAT) & Validation:Develop user acceptance and validation test plans, ensuring thorough testing of solutions against business needs.Familiarity with Gherkin Syntax (Given, When, Then) ensures step organization and behavior-driven development for requirements.Lead the planning, coordination, and execution of UAT, tracking defects and validating resolutions.Ensure production validation, providing oversight for business readiness plans, including training and communication.Stakeholder Engagement & Communication:Serve as a liaison between business stakeholders and IT, facilitating the clear communication of business needs and project progress.Build strong relationships with key stakeholders, ensuring project scope and business impacts are well understood and communicated.Provide regular status updates and ensure issues are identified, tracked, and resolved promptly.Business Readiness & Project Transition:Contribute to transition plans, ensuring the business is fully prepared for system changes, including training and SOP documentation.Oversee post-implementation support, including production validation and stakeholder communication.Continuous Improvement & Self-Leadership:Proactively draft user stories ahead of refinement sessions and ensure readiness for sprints.Anticipate project needs and take ownership of delivering high-quality requirements with minimal oversight.Qualifications:Experience : 8+ years as a Business Analyst.Strong analytical and project management skills.In-depth knowledge of the financial services industry, with specific long-term care experience preferred.Excellent process mapping and creation skills.Self-starter who can work independently.Excellent written, verbal, communication, and presentation skills.Ability to work across delivery teams to coordinate delivery and implementation.Experience working with external vendors. Preferred 8-10 years of Business Analyst experience.Strong leadership ability, with experience coaching other analysts.Six Sigma or Business Analyst training or certification (CBAP, BABOK) is a plus.Experience with the Agile framework (SAFe, Scrum, Kanban).Knowledge of Jira or Polarion (features, user stories, tasks, subtasks).",
        "source": "Email",
        "date_posted": "2024-09-30 14:29:58-05:00",
        "unique_id": "1924468cc4c0baab",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]