[
    {
        "company": "Sligo Software Solutions, Inc.",
        "job_title": "BizTalk.NET Architect with Dynamics CRM",
        "location": "Schenectady, NY, USA",
        "full_location": {
            "city": "Schenectady",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "14+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "30 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "BizTalk",
                "Dynamics CRM",
                "ASP.NET",
                "C#",
                "WCF",
                "REST",
                "SOAP"
            ],
            "primary": [
                "Web API",
                "JavaScript",
                "SSRS",
                "Responsive Design",
                "Troubleshooting"
            ],
            "secondary": [
                "Help Desk Support",
                "Software Coding Standards",
                "Multi-leveled Architecture",
                "Data Extracts",
                "Electronic Signatures"
            ],
            "all": [
                "BizTalk",
                "Dynamics CRM",
                "ASP.NET",
                "C#",
                "WCF",
                "REST",
                "SOAP",
                "Web API",
                "JavaScript",
                "SSRS",
                "Responsive Design",
                "Troubleshooting",
                "Help Desk Support",
                "Software Coding Standards",
                "Multi-leveled Architecture",
                "Data Extracts",
                "Electronic Signatures"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Praveen Pasumarthi",
        "email": "praveen.pasumarthi@sligosoft.com",
        "jd": "Greetings from Sligo Software Solutions, Inc. !!SLIGO is a Software Development & IT Consulting company. We have around 100+ IT associates working with our esteemed clients across several domains such as IT, Banking, Healthcare, and Government. We have an urgent requirement for BizTalk/.NET Architect with Dynamics CRM position with our client. Role: BizTalk/.NET Architect with Dynamics CRMLocation: Schenectady, New YorkDuration: 30 MonthsClient: NY StateRespond by Date: 10/01/24 12:00 PM Description CHOICES is currently running on a highly customized version of MS Dynamics 365 and utilizes a BizTalk application to receive a large volume of updates. This position involves monitoring/troubleshooting, developing bug fixes and enhancements, and upgrading or re-architecting various applications that include or interact with CHOICES.Duties Maintenance and bug fixing for the MS BizTalk application instances.Resolve production problems and business unit inquiries, including Help Desk tickets.Maintenance and bug fixing of .NET Web Applications.Troubleshoot and modify heavily customized forms created in MS Dynamics CRM 2013 and earlier versions to work in MS Dynamics 365 v9.x with multiple device types, browser types, and versions.Modernize forms and application functionality within CHOICES to utilize best practices and responsive design principles, while ensuring that existing functionality is preserved. This may include web service development, file uploads, electronic signatures, SSRS reports, and data extracts.Mandatory Requirements Experience (14+ Years)Makes high-level design choices and dictates technical standards, including software coding standards, tools, and platforms. Designs multi-leveled architecture or component interactions of a large scale software system.Requirements This is an 100% Onsite84 months of experience in analysis, design, development, deployment, and troubleshooting of BizTalk integration solutions for enterprise-level applications using WCF and web services (SOA).84 months of experience designing and developing high performance enterprise-level web application systems using ASP.NET/C# and external web services in a .NET/IIS environment84 months of experience designing/developing/securing (not just consuming) SOAP and REST external web services, including experience designing/developing external web services with Windows Communication Foundation (WCF) and Web API.60 months of development experience creating and modifying heavily customized forms, entities, and views to work in multiple browser types and versions for Microsoft Dynamics CRM 2011, Microsoft Dynamics CRM 2013 and later versions. 60 months of development experience creating and modifying client-side JavaScript, C# plug-ins, and workflow activities for MS Dynamics CRM 2011, MS Dynamics CRM 2013, and later versions.RésuméCopy of Candidate Identification (i.e., Driver’s License/Green Card/Visa and Passport if applicable)Any documents referenced in the above Requested Qualifications (i.e., professional certifications, degrees, etc.)",
        "source": "Email",
        "date_posted": "2024-09-30 13:44:15-05:00",
        "unique_id": "192446cd51b99424",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]