[
    {
        "company": "ValiantIQ Inc",
        "job_title": "Senior Infrastructure Project Manager",
        "location": "San Ramon, CA, USA",
        "full_location": {
            "city": "San Ramon",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "7-10 years",
            "degree_required": "B.S. in Business or Engineering discipline preferred",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Month Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Infrastructure Management",
                "Communication Skills",
                "Agile Methodologies",
                "Waterfall Methodologies"
            ],
            "primary": [
                "Enterprise Program Management",
                "SaaS Applications",
                "Data Center Operations",
                "Public Cloud",
                "Networking",
                "Information Security"
            ],
            "secondary": [
                "Negotiation Skills",
                "Conflict Resolution",
                "Analytical Skills",
                "Problem Solving",
                "Leadership"
            ],
            "all": [
                "Project Management",
                "Infrastructure Management",
                "Communication Skills",
                "Agile Methodologies",
                "Waterfall Methodologies",
                "Enterprise Program Management",
                "SaaS Applications",
                "Data Center Operations",
                "Public Cloud",
                "Networking",
                "Information Security",
                "Negotiation Skills",
                "Conflict Resolution",
                "Analytical Skills",
                "Problem Solving",
                "Leadership"
            ],
            "with_experience": [
                "Project Management",
                "Infrastructure Management",
                "Enterprise Program Management",
                "SaaS Applications"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Shubham Mishra",
        "email": "smishra@valiantiq.com",
        "jd": "From: Shubham Mishra, ValiantIQ Inc smishra@valiantiq.com Reply to: smishra@valiantiq.com Position Details: Senior Infrastructure Project ManagerLocation: San Ramon, CA (Hybrid)Type: 12 Month Contract Must HaveLINKEDIN PROFILE with PICTURELooking for someone who has more experience in building out office infrastructure as this will be a major part of the infrastructure PM role. At least 4 projects dealing with in mergers/acquisitions (Recent experience is a must!)Infrastructure Projects10/10 communication skills! Need a Project Manager who has been working recently on Infrastructure projects due to Merger & Acquisitions (M&A). Must work for an enterprise company and not a consulting company. Responsibilities Manage end-to-end delivery of multiple, enterprise-wide strategic projects evolving our business application and infrastructure platformsLead and work with organizational cross-functional teams to ensure on time, on budget, quality initiatives that support Five9’s business & technology strategies Ensure solutions meet agreed quality criteria, address project issues and risks, and build trusted relationships between delivery teams and business partnersCollaborate closely with project stakeholders, to understand their requirements, provide expert advice on effort estimates and overall project feasibility, secure appropriate resourcing from business and IT teams, ensuring alignment of project with organizational objectives Provide timely project updates and visibility into any factors impacting scope, schedule, or cost to sponsors and stakeholdersCreate and maintain project artifacts including stakeholder presentations, project charters & plans, status reports, risk management reports, retrospectives, etc.Provide guidance to project team members while adhering to PMO standards and processesDevelop strong working relationships with the business and technology teams to ensure overall program successProactively and aggressively manage expectations with stakeholders by aligning team members and management on project goals, scope and issues resolutionBring knowledge of both Waterfall and Agile Project Management methodologies, processes and tools, including scope management, schedule management, cost management, quality management, resource management, procurement, change management, risks management, issues managementWork with the PMO team and contribute to process improvements to enhance quality and execution of initiativesApply business domain and technical acumen to ramp up quickly on Five9’s products, technologies, infrastructure, change management, development and release management processes Requirements7-10 years of enterprise program or project management experience Experience presenting to C-level executivesExperience managing initiatives involving design and implementation of strategic IT Saas and in-house applicationsFamiliarity with data center operations and public cloud, including infrastructure, database, networking, telephony, voice, and information securitySelf-motivated, energetic, excellent interpersonal, organizational, negotiation and conflict-resolution skillsProven leadership and decision-making skillsExcellent verbal and written communication skills with ability to present information, status, and issues in a clear and concise manner at all levels of the organizationAble to understand and be involved in the technical details in order to successfully gather and understand complex requirements and drive projects to completionStrong problem-solving and analytical skillsHigh degree of flexibility, independence, initiative, and detail orientationB.S. in Business or Engineering discipline preferredPMP and/or Scrum master certification a plus Thanks & Regards,Shubham MishraTechnical Recruiter- ValiantIQ Inc.",
        "source": "Email",
        "date_posted": "2024-10-01 14:56:26-05:00",
        "unique_id": "19249a7dd16c9bcb",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]