[
    {
        "company": "Stellent IT",
        "job_title": ".NET Application Architect",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "WI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "6 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "12 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".Net (MS)",
                "C#.net",
                "MVC (Model View Controller)",
                "VB Net / ASP Net",
                "Oracle",
                "Oracle SQL Tuning"
            ],
            "primary": [
                "Web and client server application development",
                "Agile",
                "MVVM (Model View View Model)",
                "Stored procedures and triggers",
                "Team Foundation Server",
                "Documenting Requirements"
            ],
            "secondary": [
                "MS Word",
                "Excel",
                "Outlook",
                "Change management",
                "Project management methodologies",
                "User test",
                "System Test",
                "User Acceptance Test Plans"
            ],
            "all": [
                ".Net (MS)",
                "C#.net",
                "MVC (Model View Controller)",
                "VB Net / ASP Net",
                "Oracle",
                "Oracle SQL Tuning",
                "Web and client server application development",
                "Agile",
                "MVVM (Model View View Model)",
                "Stored procedures and triggers",
                "Team Foundation Server",
                "Documenting Requirements",
                "MS Word",
                "Excel",
                "Outlook",
                "Change management",
                "Project management methodologies",
                "User test",
                "System Test",
                "User Acceptance Test Plans"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Avinash Kumar",
        "email": "avinashk@stellentit.com",
        "jd": "From: Avinash Kumar, stellentit avinashk@stellentit.com Reply to: avinashk@stellentit.com Position : .NET Application ArchitectLocation : Remote (from within the State of Wisconsin)Duration 12 months Interview Method : In-Person ONLY LOCAL And NO H1B Description:Our client is seeking a .NET Application Architect. This position will be responsible for the development and support of critical priority applications.Will play an integral role on self-directed work teams in support of high priority development projects.Application architecture design and development.Integration with 3rd party software.Data conversion.New development and modifications to existing code.Designing, creating, and maintaining web services, system integration, web development, and Agile Scrum development methodology. Knowledge, Skills and Abilities RequiredHighly technically competent.Consistently high producer.Excellent oral and written communication skills.Solutions-oriented.Enthusiastic to mentor junior developers.Technical thought leader.Overall team player.Excellent analytical skills.Skills Required6 years - Previous work experience in government, insurance, accounting, or case management6 years - Previous work experience in online transaction processing (OLTP) web application development and batch processing6 years - Experience leading teams, planning and estimating projects, guiding underlying application architecture, establishing governance of process and best practices6 years - Experience with implementation and ongoing support of multi-platform applications. Specifically Microsoft Webforms and MVC Web browser user interfaces, as well as services6 years - Keeping a strong pulse on technological trends, making recommendations on emerging technologies, and identifying problems that can be solved with emerging tools6 years - Web and client server application development experience, including requirements gathering, design, coding, testing, implementation and support6 years - Evaluate and recommend programming languages, design tools and applicationsMS Word, Excel, Outlook experience6 years - Change management experience6 years - Understanding of project management methodologies and experience with Agile4 years - MVVM (Model View View Model) experience6 years - Structured Analysis and Design of Web and Client-Server applications for both transactional and batch applications3 years - Stored procedures and triggers experience3 years - Oracle experience3 years - Oracle SQL Tuning experience5 years - .Net (MS) experience3 years - VB Net / ASP Net experience5 years - C#.net experience3 years - MVC (Model View Controller) experience3 years - Team Foundation Server experience3 years - Experience with Oracle PL/SQL6 years - Documenting Requirements experience6 years - Experience as a developer in a large, very complex organization6 years - In-Depth knowledge of System Development Lifecycle Deliverables (SDLC) for each phase of development6 years - Experience in Requirements Gathering / Analysis3 years - User test, System Test, and User Acceptance Test Plans Avinash Kumar –Sr. IT Recruiter Email- avinashk@stellentit.com Phone Number : +1 321 7856 062STELLENT IT – A Nationally Recognized Minority Certified Enterprise \"Happiness can be found, even in the darkest of times, if one only remembers to turn on the light.\" - JK Rowling",
        "source": "Email",
        "date_posted": "2024-09-30 13:14:48-05:00",
        "unique_id": "1924424016a19af0",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]