[
    {
        "company": "Georgia Dept. of Corrections",
        "job_title": "Angular Java Full-Stack Developer",
        "location": "Decatur, GA, USA",
        "full_location": {
            "city": "Decatur",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "747890",
            "experience_required": "8+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "8+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Angular",
                "Java",
                "UI/UX",
                "Java 11+",
                "Spring Boot",
                "RESTful APIs"
            ],
            "primary": [
                "JavaScript",
                "Typescript",
                "CSS 3",
                "SCSS",
                "HTML 5",
                "ES6+",
                "Responsive web design",
                "Git",
                "Agile methodologies",
                "Azure DevOps",
                "Jira"
            ],
            "secondary": [
                "Cloud platforms (AWS or Azure)",
                "CI/CD"
            ],
            "all": [
                "Angular",
                "Java",
                "UI/UX",
                "Java 11+",
                "Spring Boot",
                "RESTful APIs",
                "JavaScript",
                "Typescript",
                "CSS 3",
                "SCSS",
                "HTML 5",
                "ES6+",
                "Responsive web design",
                "Git",
                "Agile methodologies",
                "Azure DevOps",
                "Jira",
                "Cloud platforms (AWS or Azure)",
                "CI/CD"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Vineela",
        "email": "vineela@diasoftwaresolutions.com",
        "jd": "From: Vineela, diasoftwaresolutions vineela@diasoftwaresolutions.com Reply to: vineela@diasoftwaresolutions.com Subject: State of GA - GDC Angular Java Full-Stack Developer Job Id: 747890 Hi, Job ID# 747890 Agency”: State of GA- GDC Angular Java Full-Stack Developer Work Arrangement: Hybrid Work Location: 2984 Clifton Springs Rd, Decatur, GA 30034 Agency Interview Type: Either Web Cam or In Person Duration of the Project: 8+ Months Notes: Please look for candidates who have more than 8+ years of experience and with prior State govt exp is huge plus! Ideally Geogia candidate is highly preferred Complete Description: The Georgia Dept. of Corrections is seeking a highly skilled Java Angular Full-Stack Developer with 8+ years of professional experience to join our dynamic team. The ideal candidate should possess strong expertise in Angular, UI/UX design, Java and modern web development technologies. In this role, you will be responsible for developing and maintaining robust, scalable applications, ensuring seamless integration between front-end and back-end components, and delivering high-quality solutions that meet our business needs. Local candidates only. The selected candidate will be expected to work onsite 2 days week in Decatur, Georgia. Key Responsibilities:Develop and maintain web applications using Angular, Bootstrap, Java, Spring Boot, and RESTful APIs.Collaborate with cross-functional teams to design, develop, and deploy end-to-end solutions with a focus on UI/UX.Implement responsive designs and ensure applications are mobile-friendly and optimized for performance.Integrate third-party services and APIs into applications.Write clean, efficient, and maintainable code following best practices and industry standards.Collaborate with project managers, designers, and other developers to ensure seamless user experiences.Troubleshoot, debug, and optimize existing applications to improve performance and scalability.Participate in the entire software development lifecycle, including analysis, design, implementation, testing, and deployment.Contribute to documentation, including technical specifications, and user guides for the applications developed. Required Qualifications:8+ years of professional experience as a Full-Stack Developer with a focus on Angular, UI/UX and Java 11+.Proficient in Angular (latest versions), JavaScript, Typescript, CSS 3, SCSS, HTML 5, ES6+, Responsive web design, Java, Spring Boot, and RESTful APIs.Strong experience in front-end development, focusing on building responsive and user-friendly web applications.Familiarity with Git and version control systems.Excellent communication and interpersonal skills, with the ability to work effectively in a team environment.Ability to work independently and deliver high-quality results under tight deadlines.Experience with relational databases (SQL).Knowledge of cloud platforms such as AWS or Azure Cloud.Familiarity with Agile methodologies and tools like Azure DevOps or Jira.Collaborate with DevOps teams to streamline the CI/CD pipeline and improve deployment efficiency. SKILLS MATRIXSkillRequiredAmount of ExperienceExperienceExperience as a Full-Stack Developer with a focus on Angular, UI/UX and Java 11+. Required 8 Years Angular (latest versions), JavaScript, Typescript, CSS 3, SCSS, HTML 5, ES6+, Responsive web design, Java, Spring Boot, and RESTful API'sRequired8 Years Familiarity with Git and version control systems. Required 5 Years Familiarity with Agile methodologies and tools like Azure DevOps or Jira.Required5 Years",
        "source": "Email",
        "date_posted": "2024-09-30 09:47:22-05:00",
        "unique_id": "1924366a030d7f42",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]