[
    {
        "company": "SUS Infotech",
        "job_title": "MuleSoft Business System Analyst",
        "location": "Wilmington, MA, USA",
        "full_location": {
            "city": "Wilmington",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "MuleSoft",
                "Business System Analyst",
                "Financials",
                "Supply Chain",
                "Integration"
            ],
            "primary": [
                "Oracle ERP Cloud",
                "OIC",
                "Data Mapping",
                "Financial Data Integrations",
                "Functional Specification Documents"
            ],
            "secondary": [
                "Excellent communication",
                "Presentation skills",
                "Analytical skills",
                "Financial modeling",
                "Process improvement"
            ],
            "all": [
                "MuleSoft",
                "Business System Analyst",
                "Financials",
                "Supply Chain",
                "Integration",
                "Oracle ERP Cloud",
                "OIC",
                "Data Mapping",
                "Financial Data Integrations",
                "Functional Specification Documents",
                "Excellent communication",
                "Presentation skills",
                "Analytical skills",
                "Financial modeling",
                "Process improvement",
                "Attention to detail",
                "Teamwork",
                "Flexibility"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Shambhu",
        "email": "shambhu@susinfotek.com",
        "jd": "From: Shambhu, SUS Infotech shambhu@susinfotek.com Reply to: shambhu@susinfotek.com Title: MuleSoft Business System AnalystLocation: Wilmington MA (Hybrid- 2 days onsite a week-Tuesday and Wednesday) Need Local CandidatesVISA: No SponsorshipDuration: 6 months/contractMust have MuleSoft experiencePeople with prior experience working as BSA in Financials and Supply Chain INTEGRATION Projects (such as working with MuleSoft, OIC, Oracle ERP Cloud) as they will be gathering requirements pertaining to MDM Integrations. Job Description:Assist in the development of annual budgets, monthly forecast updates, and long-term financial plans.People with prior Work experience working as BSA in Financials and Supply Chain INTEGRATION Projects (such as MuleSoft, OIC, Oracle ERP Cloud) Support the UNF MDM and Release-2 implementation and ongoing management of Oracle ERP Cloud.Collaborate with stakeholders across the organization to gather relevant requirements and assumptions pertaining to MDM Integrations (CUSTOMER, PRODUCT and SUPPLIER) (MDM)Financial Data Integrations (such as GL, AP, AR, Inventory etc.)Analyze RICE objects and produce Data Mapping spreadsheets between field attributes pertaining to Legacy systems vs. Oracle ERP CloudProduce detailed Functional Specification Documents for Integration Team to help build the interfaces between Legacy Systems and Oracle ERP Cloud.Ability to analyze relationship between Financial and SCM attributes between our Legacy systems and Oracle ERP and clearly devise the same on a mapping spreadsheetSupport the preparation of materials for presentations and key stakeholder communications. Requirements:People with prior Work experience working as BSA in Financials and Supply Chain INTEGRATION Projects (such as MuleSoft, OIC, Oracle ERP Cloud) Excellent communication and presentation skills, with the ability to convey complex financial concepts to non-financial stakeholders.Strong analytical skills and proficiency in financial modeling and data analysis.Support the preparation of materials for presentations and key stakeholder communications.Strong attention to detail and a high level of accuracy in work.Ability to work independently and as part of a team in a fast-paced, dynamic environment.A passion for process improvement and willingness to learn and implement new software and tools.Flexibility to manage changing priorities and tight deadlines.",
        "source": "Email",
        "date_posted": "2024-09-30 10:53:33-05:00",
        "unique_id": "19243c6be5d66141",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]