[
    {
        "company": "SPAR INFORMATION SYSTEMS",
        "job_title": "IT Program Manager – SAP S4/HANA",
        "location": "Pittsburgh, PA, USA",
        "full_location": {
            "city": "Pittsburgh",
            "state": "PA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management Expertise",
                "SAP Knowledge",
                "Business Analysis",
                "Technical Acumen",
                "Risk Management"
            ],
            "primary": [
                "Financial Acumen",
                "Stakeholder Management",
                "Leadership",
                "Change Management",
                "Analytical Skills"
            ],
            "secondary": [],
            "all": [
                "Project Management Expertise",
                "SAP Knowledge",
                "Business Analysis",
                "Technical Acumen",
                "Risk Management",
                "Financial Acumen",
                "Stakeholder Management",
                "Leadership",
                "Change Management",
                "Analytical Skills"
            ],
            "with_experience": []
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Abhi",
        "email": "abhi@sparinfosys.com",
        "jd": "From: Abhi, SPAR INFORMATION SYSTEMS abhi@sparinfosys.com Reply to: abhi@sparinfosys.com Hi, Please find the job description below and let me know your interest.LOCALS TO PITTSBURG ONLY.Title: IT Program Manager – SAP S4/HANADuration: Contract Work Location: Pittsburgh, PA (Day 1 Onsite- Candidate needs to work 3 Days at the Client Office) Project Overview: Project - SAP S4/Hana migration Discovery PhaseThis will be the PSG IT Program Manager role for the Technical Workstream coordinating the SAP assessment work to determine the transformation project approach for SAP ECC6 to SAP S4/Hana.The PM will work alongside as Business PM and an SAP Vendor Partner PM to complete the Task. Role Scope / Deliverables: Project CharterCurrent State AssessmentBusiness Requirements Document (BRD)Gap AnalysisHigh-Level Solution DesignImplementation RoadmapRisk Assessment and Mitigation PlanCost-Benefit AnalysisResource PlanChange Management StrategyExecutive Summary and RecommendationsDecision-Making Framework These deliverables will help ensure a thorough and well-organized assessment, paving the way for a successful SAP implementation. Key Skills: Project Management Expertise: - Proficiency in project management methodologies and tools.SAP Knowledge: - Understanding of SAP systems, modules, and implementation best practices. Preferably with ECC6 to S4 Hana experience 3.Business Analysis: - Ability to support the business requirements, and conduct gap analysis.Technical Acumen: - Knowledge of IT infrastructure, system integration, and data migration.Risk Management: - Expertise in identifying and mitigating project risks.Financial Acumen: - Skills in cost estimation, budget management, and cost-benefit analysis.Stakeholder Management: - Strong interpersonal and communication skills to manage stakeholder expectations.Leadership: - Ability to lead and motivate cross-functional teams effectively.Change Management: - Experience in developing and implementing change management strategies.Analytical Skills: - Strong problem-solving abilities and capability to analyse complex data.",
        "source": "Email",
        "date_posted": "2024-10-01 10:30:16-05:00",
        "unique_id": "19248e2f09b9e969",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]