[
    {
        "company": "Samson Software Solutions Inc.",
        "job_title": "Senior Java developer",
        "location": "Phoenix, AZ, USA",
        "full_location": {
            "city": "Phoenix",
            "state": "AZ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Spring Boot",
                "Microservices",
                "Kafka",
                "MongoDB",
                "API"
            ],
            "primary": [
                "Service-Oriented Architecture",
                "REST",
                "XML",
                "XSD",
                "XPath",
                "XSLT",
                "Web Services",
                "IT Security Framework",
                "Synchronous / Asynchronous communication",
                "Data Base Technologies",
                "Agile methodologies"
            ],
            "secondary": [
                "BPEL",
                "SOAP",
                "Web Service Security",
                "Redis",
                "Oracle Coherence Cache",
                "Building Relationships with stakeholders",
                "Wholesale Payments",
                "Design Patterns",
                "Domain Driven Design",
                "Event-based integration"
            ],
            "all": [
                "Java",
                "Spring Boot",
                "Microservices",
                "Kafka",
                "MongoDB",
                "API",
                "Service-Oriented Architecture",
                "REST",
                "XML",
                "XSD",
                "XPath",
                "XSLT",
                "Web Services",
                "IT Security Framework",
                "Synchronous / Asynchronous communication",
                "Data Base Technologies",
                "Agile methodologies",
                "BPEL",
                "SOAP",
                "Web Service Security",
                "Redis",
                "Oracle Coherence Cache",
                "Building Relationships with stakeholders",
                "Wholesale Payments",
                "Design Patterns",
                "Domain Driven Design",
                "Event-based integration"
            ],
            "with_experience": [
                "Java (8+ years)",
                "Spring Boot (5+ years)",
                "Microservices (2+ years)",
                "Kafka (2 years)",
                "REST API (2+ years)",
                "Data Base Technologies (3+ years)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Maan Singh Choudhary",
        "email": "maan.singh@samsonsoft.com",
        "jd": "Hello ﻿﻿ , I hope you are doing well! This is Maan from Samson Software Solution Inc. We provide high-quality IT resources to meet talent needs through Staff Augmentation and Permanent Placement Services. I came across your resume on one of the job boards and you are a fit for the position we have. Please review the job and share the details below with your profile, if you are interested. Role: Senior Java developerLocation: Phoenix, AZ or San Leandro, CA(Onsite) Must have: Java spring boot, Microservices, Kafka, MongoDB, APIIn this role, you will:Design, code, test, debug, and document for projects and programs.Leverage API design patterns to build robust microservices.Review and analyze complex, large-scale technology solutions for tactical and strategic business objectives, enterprise technological environment, and technical challenges that require in-depth evaluation of multiple factors, including intangibles or unprecedented technical factors.Key participant in developing standard and program-wide best practices for engineering and technology solutions requiring an understanding of industry best practices and new technologies, influencing and leading the technology team to meet deliverables and deliver new initiatives.Collaborate and consult with key technical experts, senior technology team, and external industry groups to resolve complex technical issues and achieve goals.Lead projects, and teams, or serve as a peer mentor.Required Qualifications:10+ years of Software Engineering experience or equivalent demonstrated through one or a combination of the following: work experience, training, military experience, education.8+ years of experience in Application Development in Java.5+ years of experience in Spring Boot.Experience in Service-Oriented Architecture and related technologies like BPEL, Web Services, WSDL, SOAP, REST, XML, XSD, XPath, XSLT and Web Service Security is a plusExperience in implementing SOA Suite technology adapters (DB, JMS, MQ, and File) to integrate with external systems.Experience with the REST architectural pattern and experience building consumable RESTful services.Good understanding of IT Security Framework Authentication, Authorization, Access Control etc.Good understanding of Synchronous / Asynchronous communication patterns and Problem-solving abilities2+ years’ experience in designing and implementing enterprise applications for large scale data processing both real-time and batch mode.2+ years’ experience in production support for web applications including troubleshooting and fixing production defects.Experience in the development and implementation in Banking or Financial ServicesExperience with Redis or Oracle Coherence Cache is a plus.3+ years of experience in Data Base Technologies such as Oracle or Mongo DB.2+ years of experience in Agile working environments such as Scrum or Kanban.2 years of experience in Kafka.2+ years of experience in Rest API.2+ years of experience in Microservices or SOA.Ability to learn and adapt to new technologies and products.Desired Qualifications:Experience in Building Relationships with stakeholders and Senior Management.Experience working with Wholesale Payments is a plus.Strong Design experience in Design Patterns, Domain Driven Design, and Event-based integration.Job Expectations:Be willing to work non-standard business hours on an on-call basis in a 24x7 environment",
        "source": "Email",
        "date_posted": "2024-09-30 12:26:52-05:00",
        "unique_id": "19243f9ac42d17da",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]