[
    {
        "company": "Five9",
        "job_title": "Senior Project Manager (Infrastructure)",
        "location": "San Ramon, CA, USA",
        "full_location": {
            "city": "San Ramon",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "7-10 years",
            "degree_required": "B.S. in Business or Engineering discipline preferred",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Month Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Infrastructure Management",
                "Communication Skills",
                "Agile Methodologies",
                "Waterfall Methodologies"
            ],
            "primary": [
                "Enterprise Program Management",
                "SaaS Applications",
                "Data Center Operations",
                "Public Cloud",
                "Negotiation Skills",
                "Analytical Skills"
            ],
            "secondary": [
                "C-level Presentation",
                "Conflict Resolution",
                "Leadership",
                "Decision Making",
                "Problem Solving"
            ],
            "all": [
                "Project Management",
                "Infrastructure Management",
                "Communication Skills",
                "Agile Methodologies",
                "Waterfall Methodologies",
                "Enterprise Program Management",
                "SaaS Applications",
                "Data Center Operations",
                "Public Cloud",
                "Negotiation Skills",
                "Analytical Skills",
                "C-level Presentation",
                "Conflict Resolution",
                "Leadership",
                "Decision Making",
                "Problem Solving"
            ],
            "with_experience": [
                "Project Management",
                "Infrastructure Management",
                "Enterprise Program Management",
                "SaaS Applications"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Kunal Bhatt",
        "email": "kunal.bhatt@rconsultinginc.com",
        "jd": "From: Kunal Bhatt, Resource Consultings kunal.bhatt@rconsultinginc.com Reply to: kunal.bhatt@rconsultinginc.com Job Title : Senior Project Manager (Infrastructure ) looking for someone who has more experience in building out office infrastructureLocation: San Ramon, CA (Onsite 1-2 days a week only) Locals Only Type: 12 Month Contract US Citizen, Green Card, H4, H1B, TN Visa, are acceptable (NO EAD/OPT) 2 Zooms Must HaveLINKEDIN PROFILE with PICTURELooking for someone who has more experience in building out office infrastructure as this will be a major part of the infrastructure PM role. At least 4 projects dealing with in mergers/acquisitions (Recent experience is a must!)Infrastructure Projects10/10 communication skills! Five9 is a leading provider of cloud software for the enterprise contact center market. Five9 offers our partners a solution that is reliable, secure, compliant and scalable, while creating exceptional customer experiences, increasing agent productivity and delivering tangible business results. We are currently looking for a self-starter to join our Architecture & Portfolio Management Team who is a quick study and versatile enough to drive complex technical projects. This team provides program and project management excellence to prioritize, plan, and execute across SaaS, public cloud, and IT infrastructure projects, including 3rd party applications platforms. This role is focused on Five9’s business systems and infrastructure. The successful candidate will report to the Senior Director of Architecture & Portfolio Management and will lead projects focused around business processes such as quote to cash and procure to pay, compliance and governance, improving customer experience, cost management, improving operational efficiency, and growth. This role will also help develop program and portfolio management best practices standards and processes. You will need to be a team player with the right combination of project management, technical, and interpersonal skills. You will also leverage your superior negotiation skills and influence to work with all levels of management and their teams to keep projects on track from initiation to closing. Responsibilities Manage end-to-end delivery of multiple, enterprise-wide strategic projects evolving our business application and infrastructure platformsLead and work with organizational cross-functional teams to ensure on time, on budget, quality initiatives that support Five9’s business & technology strategies Ensure solutions meet agreed quality criteria, address project issues and risks, and build trusted relationships between delivery teams and business partnersCollaborate closely with project stakeholders, to understand their requirements, provide expert advice on effort estimates and overall project feasibility, secure appropriate resourcing from business and IT teams, ensuring alignment of project with organizational objectives Provide timely project updates and visibility into any factors impacting scope, schedule, or cost to sponsors and stakeholdersCreate and maintain project artifacts including stakeholder presentations, project charters & plans, status reports, risk management reports, retrospectives, etc.Provide guidance to project team members while adhering to PMO standards and processesDevelop strong working relationships with the business and technology teams to ensure overall program successProactively and aggressively manage expectations with stakeholders by aligning team members and management on project goals, scope and issues resolutionBring knowledge of both Waterfall and Agile Project Management methodologies, processes and tools, including scope management, schedule management, cost management, quality management, resource management, procurement, change management, risks management, issues managementWork with the PMO team and contribute to process improvements to enhance quality and execution of initiativesApply business domain and technical acumen to ramp up quickly on Five9’s products, technologies, infrastructure, change management, development and release management processes Requirements7-10 years of enterprise program or project management experience Experience presenting to C-level executivesExperience managing initiatives involving design and implementation of strategic IT Saas and in-house applicationsFamiliarity with data center operations and public cloud, including infrastructure, database, networking, telephony, voice, and information securitySelf-motivated, energetic, excellent interpersonal, organizational, negotiation and conflict-resolution skillsProven leadership and decision-making skillsExcellent verbal and written communication skills with ability to present information, status, and issues in a clear and concise manner at all levels of the organizationAble to understand and be involved in the technical details in order to successfully gather and understand complex requirements and drive projects to completionStrong problem-solving and analytical skillsHigh degree of flexibility, independence, initiative, and detail orientationB.S. in Business or Engineering discipline preferredPMP and/or Scrum master certification a plus",
        "source": "Email",
        "date_posted": "2024-10-01 14:28:57-05:00",
        "unique_id": "192498e1eac5fe16",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]