[
    {
        "company": "PiplNow LLC",
        "job_title": "Project Manager",
        "location": "Des Moines, IA, USA",
        "full_location": {
            "city": "Des Moines",
            "state": "IA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "747735",
            "experience_required": "8+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Direct management of system integration and/or technology projects",
                "Experience managing stakeholder expectations and priorities",
                "Experience working within a project governance structure",
                "Extensive experience with planning, managing, and tracking projects",
                "Strong process development skills",
                "Strong process and gap analysis skills",
                "Excellent project management skills",
                "Experience with business users to gather and document requirements",
                "Ability to prioritize and manage multiple projects simultaneously",
                "Working experience with Agile projects",
                "Experience with client expectations and change management"
            ],
            "primary": [
                "Strong organizational skills",
                "Interpersonal skills",
                "Presentation skills",
                "Team-building skills",
                "Strong verbal communication skills",
                "Strong written communication skills",
                "Experience in service improvement initiatives",
                "Ability to break down complex tasks into actionable items"
            ],
            "secondary": [],
            "all": [
                "Direct management of system integration and/or technology projects",
                "Experience managing stakeholder expectations and priorities",
                "Experience working within a project governance structure",
                "Extensive experience with planning, managing, and tracking projects",
                "Strong process development skills",
                "Strong process and gap analysis skills",
                "Excellent project management skills",
                "Experience with business users to gather and document requirements",
                "Ability to prioritize and manage multiple projects simultaneously",
                "Working experience with Agile projects",
                "Experience with client expectations and change management",
                "Strong organizational skills",
                "Interpersonal skills",
                "Presentation skills",
                "Team-building skills",
                "Strong verbal communication skills",
                "Strong written communication skills",
                "Experience in service improvement initiatives",
                "Ability to break down complex tasks into actionable items"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Gobi",
        "email": "gobi@piplnow.com",
        "jd": "Hi, We have an urgent C2C opening for Project Manager (747735) – Day 01 Onsite at Des Moines, IA Our client is looking to fill this role immediately. If you are interested in this role, Please share the updated resume, filled skill matrix, consultant details, visa and dl copy ASAP. Skill Matrix: SkillsYears of experienceOver all experience Total years of work exp in US As Project Manager Direct management of system integration and/or technology projects Experience managing stakeholder expectations and priorities Experience working within a project governance structure Extensive experience with planning, managing, and tracking projects Strong process development skills Strong process and gap analysis skills Excellent project management skills Experience with business users to gather and document requirements Ability to prioritize and manage multiple projects simultaneously Working experience with Agile projects Experience with client expectations and change management Consultant Details: Full Name Phone Email Rate/salary Month & Date of Birth Last 4 Digits of SSN Passport Number Available time Slots to take an Interview FTE/Contract/C2H contractCurrent Location (City, State & ZIP) Willing to work Onsite/Remote/Hybrid If non-local - Open to relocate? Availability from Date of Offer Last date of the project Any offers in the pipeline Linked In Profile Highest Education Details Are you a Citizen? If no, answer below Current Work Authorization/Date of Expiry Month/Year For 1st Visa and Year of Entry into the US? Proof of Work Authorization attached? Driver's License Attached? Total Years of Experience. Name of the company who holds the H1B Name of the company submitting the resume Name of the contact person (Recruiter) Phone Number Project Manager (747735)Job Description: Project Manager (3 Positions)Location: Des Moines, IA (Local/Regional Candidates Only)Work Schedule: Onsite as needed with noticeKey Responsibilities:Manage the delivery of multiple projects, including schedule, budget, and scope.Adhere to established project governance structures, including methodologies, templates, and reporting requirements.Work closely with stakeholders, including business units, analysts, architects, and upper-level state government committees.Ensure adherence to quality standards and project deliverables through rigorous tracking and analysis.Develop and maintain project schedules, resource plans, and budget tracking.Manage vendor procurement and implementation services.Conduct project meetings and provide status updates to project sponsors and the PMO Director.Mitigate risks, handle scope creep, and ensure timely delivery of a minimum viable product (MVP).Provide insights to improve processes related to portfolio, project, and program management.Multitask across multiple priorities as per leadership direction and department objectives.Collaborate effectively with cross-functional teams in a fast-paced, challenging environment.Required Qualifications:8+ years of direct management of system integration and/or technology projects.Proven experience managing stakeholder expectations and priorities.Experience working within a formal project governance structure, utilizing templates and reports.Demonstrated experience in planning, managing, and tracking multiple high-impact projects.Strong process development skills, including the ability to learn, interpret, document, and formalize new procedures.Strong process and gap analysis skills, with the ability to identify areas for improvement.Excellent project management skills, with the ability to multitask and manage multiple tasks in a cross-functional environment.Experience gathering and documenting business requirements from business users.Proven ability to prioritize and manage multiple projects simultaneously while meeting established deadlines.3+ years of experience working with Agile projects.Experience in managing client expectations and implementing change management initiatives.Preferred Skills:Strong organizational, interpersonal, presentation, and team-building skills.Strong verbal and written communication skills, with the ability to communicate across all levels of stakeholders.Experience in service improvement initiatives and managing change.Ability to break down complex tasks into actionable items and sequence work appropriately.",
        "source": "Email",
        "date_posted": "2024-09-30 17:36:06-05:00",
        "unique_id": "19245385af17091e",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]