[
    {
        "company": "3K Technologies",
        "job_title": "D365 CRM Technical Project Manager",
        "location": "Redmond, WA, USA",
        "full_location": {
            "city": "Redmond",
            "state": "WA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "9-11 Years",
            "degree_required": "B-Tech",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Microsoft Dynamics",
                "D365",
                "Power Platform",
                "Project Management"
            ],
            "primary": [
                "D365 CE",
                "Power Apps",
                "Agile best practices",
                "Scrum",
                "Azure Dev Ops"
            ],
            "secondary": [
                "User Acceptance Testing",
                "Communication",
                "Change Management",
                "Compliance",
                "UI/UX",
                "Security"
            ],
            "all": [
                "Microsoft Dynamics",
                "D365",
                "Power Platform",
                "Project Management",
                "D365 CE",
                "Power Apps",
                "Agile best practices",
                "Scrum",
                "Azure Dev Ops",
                "User Acceptance Testing",
                "Communication",
                "Change Management",
                "Compliance",
                "UI/UX",
                "Security"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Naveen",
        "email": "naveen.p@3ktechnologies.com",
        "jd": "From: Naveen, 3ktechnologies naveen.p@3ktechnologies.com Reply to: naveen.p@3ktechnologies.com Role: D365 CRM Technical Project ManagerLocation: Redmond, WA (Onsite)Experience: 9-11 YearsQualification: B-TechJob Family: Program/Delivery/Capability ManagementSkill (Primary): Microsoft Dynamics (APPS)-Finance & Operations-Technical-MsD-Dynamics 365 Application Sec & HardeninJob Description:Should have both technical (D365, Power Platform) and Project Management experienceWorked on at least two large end-to-end D365 CE or Power Apps - Model Driven implementationGood understanding of D365 CE business processes and configurations.Lead functional workshops with customers, document requirements, and design appropriate solutionsHelp customers define and document processes when there are no processes in placeAssist technical consultants with architecting D365 CRM or xRM system, related customizations, and reports to model the client’s organizational processesCreate and lead on functional and solution design and specification documentsCreate detailed project scope documents for the customer, which includes both estimates for the tasks that will be completed and the project schedule in Microsoft ProjectLead and deliver internal sessions on best practices and new functionality and featuresAdvise customers on best practices for CRM processes and user interface componentsBuild project timelines, estimate of level of effort, manage milestones, and course correct projects to maintain scheduleWorking experience in using Agile best practices/Scrum/Azure Dev Ops.Define acceptance criteria and partner with engineering to ensure that features align with requirementsDrive User Acceptance Testing with key stakeholdersProvide regular updates to stakeholders on projectsPartner with business teams to ensure that appropriate change management plans exist for the release of larger featuresOrchestrate planning, communications, testing, and stakeholder management across multiple teams.Verify that solutions implemented capture the benefits identified during planning.Provide guidance to tier 1 tool support personnel, and assist in the management of internal vendor support teamServe as an escalation point during outages or investigationsWork with leadership to understand broader strategies for technology and ensure that solutions implemented follow best practices and contribute to long term vision for organization.Good knowledge in compliances - data, accessibility, UI/UX, SecurityExperience working with Offshore teamMinimum Six years' experience in D365 CE or Power platform technologiesExcellent communication skills. Other Requirement: This is a Functional Consultant for D365 role. Must have technical knowledge - does not need to code or develop. Will manage projects. Good communication please. PST candidates preferred.",
        "source": "Email",
        "date_posted": "2024-09-30 08:49:59-05:00",
        "unique_id": "192433192dcc06ee",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]