[
    {
        "company": "STM Consulting, Inc.",
        "job_title": "Project Manager",
        "location": "Denver, CO, USA",
        "full_location": {
            "city": "Denver",
            "state": "CO",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 to 7 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "customer relationship management",
                "project management",
                "infrastructure",
                "network security",
                "network services",
                "voice services"
            ],
            "primary": [
                "risk management",
                "quality management",
                "change management",
                "communication"
            ],
            "secondary": [
                "mentoring",
                "training",
                "coaching",
                "stakeholder analysis",
                "communication plans",
                "adoption plans"
            ],
            "all": [
                "customer relationship management",
                "project management",
                "infrastructure",
                "network security",
                "network services",
                "voice services",
                "risk management",
                "quality management",
                "change management",
                "communication",
                "mentoring",
                "training",
                "coaching",
                "stakeholder analysis",
                "communication plans",
                "adoption plans"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Prashant Singh",
        "email": "prashant.singh@consultstm.com",
        "jd": "Hello\nTrust you are doing well\nI have this excellent job opportunity. Please find the detailed job description below for insight and help me with your latest resume to take it further for interview\nPosition: Project Manager\nLocation: Denver, CO 80203\nDuration: 6 to 7 Months\nThe ideal candidate will have a strong background in customer relationship management, project management, and experience with infrastructure, network security, and network and voice services.\nThe Technical Project Manager will be responsible for planning, executing, and finalizing projects within defined timelines and allocated budgets. The Project Manager will also ensure that business and end users are consulted and their input is incorporated into the project. Key responsibilities include:\n· Track and report on security audit findings and remediation progress to stakeholders and project teams.\n· Responsible for assisting agency executive management, division directors, and information technology (IT) staff and leading project tasks, and resources, including State personnel and deliverables.\n· Use appropriate project management tools, reports, templates, mentoring, training, and coaching to IT project teams.\n· Work directly with agency staff, as well as vendors in fulfilling and carrying out the requirements of assigned IT projects.\n· Utilize project management best practices, including risk management, quality management, change management, change control, and communication.\n· Proactively manage changes in project scope, schedule, and cost.\n· Manage by providing leadership, collaboration, supervision, training, guidance, and support to project team members on assigned projects.\n· Lead the effort to ensure agency compliance with the State’s project management policies and standards.\n· Coordinates all related activities for cross-functional teams\n· Collaborates to develop and appropriately execute a change strategy, including stakeholder analysis, communication plans, and adoption plans.\n· Manages relationships across OIT, customers, and vendors to develop a thorough understanding of core business functions and align projects with overall business objectives.\n· Manages issues and proactively escalates critical issues for immediate resolution, effectively demonstrating decision-making\nThanks & Best Regards,\nPrashant Singh| STM Consulting, Inc. |Phone: +1 408-430-5069 |",
        "source": "Email",
        "date_posted": "2024-09-30 11:31:49-05:00",
        "unique_id": "19243dbc77b44b84",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]