[
    {
        "company": "Talent Group Inc.",
        "job_title": "Business Analyst",
        "location": "Quincy, MA, USA",
        "full_location": {
            "city": "Quincy",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Bachelor’s degree in computer science, Information Systems, Business Administration or other related field, or equivalent work experience.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "1+ Year with possible extension",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "business analysis",
                "data integration",
                "Jira",
                "SQL Queries",
                "Rational Quality Manager (RQM)"
            ],
            "primary": [
                "Java",
                ".NET",
                "Oracle",
                "SQL Server",
                "SaaS Cloud",
                "NIST security standards",
                "PII and PHI data",
                "software development life cycle (SDLC)",
                "epics",
                "use cases",
                "stories",
                "features",
                "testing methodologies",
                "Microsoft Office suite",
                "Visio",
                "MS Project"
            ],
            "secondary": [
                "IIBA certification",
                "Six Sigma",
                "TOGAF",
                "data analysis",
                "visualization tools",
                "excellent writing and communication skills",
                "excellent presentation skills"
            ],
            "all": [
                "business analysis",
                "data integration",
                "Jira",
                "SQL Queries",
                "Rational Quality Manager (RQM)",
                "Java",
                ".NET",
                "Oracle",
                "SQL Server",
                "SaaS Cloud",
                "NIST security standards",
                "PII and PHI data",
                "software development life cycle (SDLC)",
                "epics",
                "use cases",
                "stories",
                "features",
                "testing methodologies",
                "Microsoft Office suite",
                "Visio",
                "MS Project",
                "IIBA certification",
                "Six Sigma",
                "TOGAF",
                "data analysis",
                "visualization tools",
                "excellent writing and communication skills",
                "excellent presentation skills"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Yash Chandewar",
        "email": "yash.c@talentgroups.com",
        "jd": "Greetings, My name is Yash and I represent Talent Group Inc., a staff augmentation firm providing a wide-range of talent on-demand and total workforce solutions. We have excellent domain expertise in all verticals. Repositioning professionals is what we do, and we do it very well. I am reaching out to you today as your profile matches an immediate job opportunity we have with our premier client. Please take a look at the job description below and let me know your interest. Job Role: Business Analyst Location: Quincy Massachusetts 02171 (Onsite or Hybrid or Remote): Hybrid (Relocation Allowed or Relocation not Allowed): Relocation not Allowed Contract Duration: 1+ Year with possible extension Full JD under those details Broad knowledge of business and system analysis with strong experience in creating requirements and design documents Broad technical knowledge and experience supporting a wide range of applications, data processes, and technologies (e.g. Java, .NET, Oracle, SQL Server, and SaaS Cloud). Prior experience with Jira, SQL Queries, Rational Quality Manager (RQM) and ADA compliance. Strong familiarity with NIST security standards and working with PII and PHI data. Proven understanding and knowledge of software development life cycle (SDLC). 5+ years of experience in business analysis and data integration. Experience managing and or working with 3rd party vendors. Experienced in epics, use cases, stories, features, and testing methodologies including functional, system, integration, performance, and UAT. Ability to develop and maintain effective relationships with management, end users, project team members, and vendors. Excellent customer service skills. Proficient in using Microsoft Office suite, Visio, MS Project, other project management and collaboration tools. Qualifications Bachelor’s degree in computer science, Information Systems, Business Administration or other related field, or equivalent work experience. Professional certification in IIBA, or Six Sigma, or TOGAF preferred or a minimum of 5 years of extensive hands-on experience in IT application implementations or systems support. At least 5 years of experience working in a Business, System, and Data Analysis, or other related experience in an IT healthcare environment. At least 5 years of business analysis and data analysis or related experience within Business application implementations or IT software development project(s). Excellent technical skills, including experience with data analysis and visualization tools. Excellent writing and communication skills. Excellent presentation skills. Ability to work independently and as part of a team. P.S: Due to high in flow of enquiry calls, I might miss a call. Kindly share resumes, am just a email away :) Regards, Yash Talent Groups - Technical Recruiter Yash.c@talentgroups.com",
        "source": "Email",
        "date_posted": "2024-09-30 09:23:07-05:00",
        "unique_id": "192434fe73c198be",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]