[
    {
        "company": "Department of Health and Human Services",
        "job_title": "Salesforce BA with PSS",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Salesforce",
                "Agile",
                "Scrum",
                "Project Management",
                "Customer Relationship Management"
            ],
            "primary": [
                "Public Sector Solutions",
                "User Story Construction",
                "Continuous Integration",
                "Test Driven Development",
                "Mentorship"
            ],
            "secondary": [
                "Communication Skills",
                "Backlog Management",
                "Sprint Planning",
                "Daily Stand Ups",
                "Retrospectives"
            ],
            "all": [
                "Salesforce",
                "Agile",
                "Scrum",
                "Project Management",
                "Customer Relationship Management",
                "Public Sector Solutions",
                "User Story Construction",
                "Continuous Integration",
                "Test Driven Development",
                "Mentorship",
                "Communication Skills",
                "Backlog Management",
                "Sprint Planning",
                "Daily Stand Ups",
                "Retrospectives"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Manoj Kumar Akkapelly",
        "email": "resume@msysinc.com",
        "jd": "From: Manoj Kumar Akkapelly, Msysinc resume@msysinc.com Reply to: resume@msysinc.com Title: Salesforce BA with PSSLocation: RemoteLength: Long termRestriction: W2 or C2CSend resume to: manojk@msysinc.com Description:Interview Type: Skype*** *** Remote ***37.5 hours per week *** 3 references requiredDepartment of Health and Human Services is currently licensed for the use of the Salesforce Platform. Within this licensing there are several communities that have prebuilt resources that allow for the rapid development of services available to the Division using a low code, no code maxim. This rapid development will allow the division to provide multiple solutions at no additional licensing cost to individual business units. However, the current lack of skilled salesforce resources prevents the agency from fully utilizing the salesforce platform.Augmenting the current staff with skilled resources in this role will enable the division to fully utilize the salesforce platform and provide services to state users and the public that currently use resource and/or manually intensive antiquated applications and/or processes for day to day business.DHHS is working to develop and deploy an Incident Management System (IMS) for the tracking of incidents such as helpdesk tickets, sentinel events, seclusions & restraints, etc. Program staff and external community users need to be able to input their required information and then the state staff can route the input as needed to provide resolution in a secure, HIPAA compliant reportable database. Responsibilities in this role will relate to the overall development of the Incident Management System in the enterprise Salesforce org according to the requirements and development of data feeds to the DHHS Enterprise Business Solution (EBI) to ensure the data flow captured appropriately to support DHHS EBI where further analysis can occur. Responsibilities include: Work with Product Support Specialists, Technical Leads, Development Team and Stakeholders to deliver low code, no code, out of the box solutions.Participates in planning sessions with Business Partners, Developers, and Stakeholders to identify dependencies, craft delivery strategies, and involve customers in early, incremental delivery of Saleforces dedicated data model Public Sector Solutions.Heavily involvement in planning stages: identify goals and vision, remove impediments and block distractions in order to keep the agile team focused on committed objectives.A deep agile toolbox including awareness of various agile techniques, alternate project management approaches and the wisdom to understand when to apply which process to the problem at hand.Facilitates scrum and agile ceremonies such as sprint planning, daily stand ups, sprint reviews, and retrospectives.Proficient with Agile methods such as story sizing, backlog management, story mapping, etc.Demonstrated experience managing multiple time sensitive, complex projects, involving multiple stakeholders and/or external vendors.Responsible for supporting complex projects/products and programs using pre existing knowledge, skills, templates, and expertise in various organizational and implementation methodologies.Responsible for concurrently managing multiple projects/products with multiple teams across multiple business areas in a matrixed reporting structure.Assists with removing roadblocks and manages the process and culture to ensure team progress and continuous improvement.Assists Product Owners enact effective backlog grooming techniques facilitate sprint planning, daily scrum, and sprint retrospectives.Proactively address issues, conflicts, and bottlenecks, ensuring a smooth and efficient workflowDrive continuous improvement within the team by identifying opportunities for process enhancement and efficiency.Provide training, mentorship, and support to team members on Agile principles and Scrum practices.Required Skills:Experience as a Salesforce BA working with a software development project team 5 YearsExperience with Salesforces dedicated data model: Public Sector Solutions 2 YearsExperience with customer relationship management platforms including Salesforce. 5 YearsExperience applying Agile Scrum to projects with multiple Scrum teams utilizing a Scrum of Scrums approach. 5 YearsPrevious experience in Project Management or using Agile methodology 3 YearsExperience with user story construction, user story estimation, sprint health indicators (burn down/burn up), velocity, continuous improvement 3 YearsExperience coaching and influencing multi disciplined and cross functional teams 4 YearsModern software engineering techniques Continuous integration, build, deliver, test driven development & other automated acceptance testing technique 3 YearsScrum Master certification required 3 YearsEXCEPTIONAL written and oral communication skills are required as candidate will work with various teams and stakeholders in role",
        "source": "Email",
        "date_posted": "2024-10-01 15:22:59-05:00",
        "unique_id": "19249bfce6b21735",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Scrum Master"
    }
]