[
    {
        "company": "Techgene Solutions LLC",
        "job_title": "Release Train Engineer PM",
        "location": "VA, USA",
        "full_location": {
            "city": "",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "5 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "PMP Certification",
                "Scrum Master Certification",
                "SAFe SPC Certification",
                "RTE experience",
                "Agile software development"
            ],
            "primary": [
                "Power Platform management",
                "Project Management tools",
                "Agile collaboration tools",
                "Interpersonal skills",
                "Analytical skills"
            ],
            "secondary": [
                "Coaching",
                "Mentoring",
                "Team building",
                "Communication skills",
                "Decision-making skills"
            ],
            "all": [
                "PMP Certification",
                "Scrum Master Certification",
                "SAFe SPC Certification",
                "RTE experience",
                "Agile software development",
                "Power Platform management",
                "Project Management tools",
                "Agile collaboration tools",
                "Interpersonal skills",
                "Analytical skills",
                "Coaching",
                "Mentoring",
                "Team building",
                "Communication skills",
                "Decision-making skills"
            ],
            "with_experience": [
                "SAFe Agile Release Train Engineer (5 years)",
                "SAFe Agile Release Train Engineer managing Power Platform teams (3 years)",
                "Ability to work with customers (12 years)",
                "Strong verbal/written communication skills (12 years)",
                "Hands-on experience with MS Project (3 years)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Raj",
        "email": "raj.s@techgene.com",
        "jd": "From: Raj, Techgene raj.s@techgene.com Reply to: raj.s@techgene.com I tried to reach you for the below position Release Train Engineer PM and VA I hope you are well. I am (Raj) with Techgene Solutions LLC. We’re Release Train Engineer PM and I think your experience is a great fit for this role. If you’re interested in learning more, I’d love to connect with you. Please review the Job description below and let me know if you are comfortable. I look forward to hearing from you soon. Thank you! Please share your profiles to raj.s@techgene.com or you can reach me at 972-580-0247 Ext 253 CHECKPOINT Full Legal Name Contact Number Email ID Date of Birth (MM/DD) Last 4 Digit SSN Current Location with Zip Code Two LinkedIn references from their recent two projects Work Authorization/Visa Status Passport Number Corporation Name Open to relocate OR Travel LinkedIn Total Years of IT Experience Education DetailsUniversity, year: US Experience LOCAL candidates required*Candidate should be able to work onsite up to 3 days/week Role : Release Train Engineer PMLocation : VA Duration : 12+ MonthsVisa : USC, GC, H1, GC, H4 EAD,Responsibilities:•Plan, lead, organize, and motivate agile and traditional project teams to achieve a high level of performance and quality in delivering projects that provide exceptional business value to the internal and external stakeholders.•Drive consistent project delivery through the entire project lifecycle, including Project plans, Release plans, Resource allocation, and management of project risks, schedule, budget, and delivery of value.•Provide leadership in the establishment and development of project base line budgets, resource allocation, and schedules.•Track and communicate project's progress from a schedule, cost, and risk perspective to the project team, stakeholders, and management.•Manage and optimize the flow of value through the ART using various tools, such as the Program Kanban and other information radiators.•Establish and communicate the annual calendars for Iterations and Program Increments (PIs).•Facilitate PI Planning readiness, PI Planning event, and PI execution e.g. Roadmap, Backlogs, Risks, Dependencies, and PI Objectives, etc.•Assist feature prioritization, tracking the execution of features e.g. Train level metrics.•Facilitate synchronization meetings e.g. Scrum of Scrums and Program Committee Meetings.•Coach Managers, Teams, and Scrum Masters in Lean-Agile practices and mindsets.•Escalate and track impediments, help identify and address critical bottlenecks.•Encourage collaboration between teams, Engineering, and Enterprise Architects.•Help ensure strategy and execution alignment (Product Management and Stakeholders).•Assess practices with DevOps, etc. and help improve Continuous Delivery Pipeline.•Conduct Inspect and Adapt workshops, facilitate System Demos, assess the agility level of the ART and help them improve.•Ability to take on additional responsibilities such as Scrum Master, Community of Practice, etc.Knowledge, Skills, and Abilities:•PMP and Scrum Master Certification is required.•SAFe SPC or RTE Certification is required.•5 years of RTE experience is required.•3 years of RTE experience managing Power Platform teams is required.•An understanding of creating and maintaining Program Increment Backlogs.•Ability to lead and direct the software development teams through program increment and program iteration planning.•Experience with agile software development for complex Information Technology systems.•Strong interpersonal skills including mentoring, coaching, collaborating, and team building.•Strong analytical, organizational and decision-making skills.•Strong verbal/written communication skills with the ability to simplify and communicate complex issues to multiple audiences.•Ability to work with customers, understand their business practices and manage their expectations.•Expertise with Project Management tools such as Microsoft Project, Visio, and MS Office.•Experience with Agile collaboration tools such as Team Foundation Server, JIRA, Version One, etc. Required / Desired Skills SkillRequired / DesiredAmountof ExperienceSAFe Agile Release Train Engineer Hands-on Experience.Required5Years SAFe Agile Release Train Engineer Experience managing Power Platform teams.Required3YearsBalance business/technical background to provide highly credible leadership to technology teams.Required5Years Ability to work with customers, understand their business practices and manage their expectations.Required12YearsStrong verbal/written communication skills with the ability to simplify and communicate complex issues to multiple audiences.Required12Years Hands-on experience with MS ProjectRequired3YearsPMP CertificationRequired Scrum Master CertificationRequired SAFe SPC or RTE CertificationRequired",
        "source": "Email",
        "date_posted": "2024-10-19 12:39:22-05:00",
        "unique_id": "192a5fd32e4ea722",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Scrum Master"
    }
]