[
    {
        "company": "DMS Vision, INC",
        "job_title": "100% Remote Java Solution Architect with Strong Java/Spring Boot and Camunda (business logic)",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Spring Boot",
                "Camunda"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Java",
                "Spring Boot",
                "Camunda"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Gaurav Gaur",
        "email": "gaurav@dmsvisions.com",
        "jd": "From: Gaurav Gaur, DMS VISIONS INC gaurav@dmsvisions.com Reply to: gaurav@dmsvisions.com Hi,Hope you are doing well,Please find the job description given below and let me know your interest.Position: 100% Remote Java Solution Architect with Strong Java/Spring Boot and Camunda (business logic)Location: 100% RemoteDuration: 6+ MonthsVisa: Open Job Description:Contract Duration: 6 + Months Work Environment: Remote Responsibilities:Are you a Java guru with a passion for crafting robust, scalable, and high-performing enterprise applications? Join our Clients cutting-edge organisation and take the lead in designing and developing mission-critical software solutions that drive business growth. In this role, you'll have the opportunity to turn user stories into elegant system designs and architecting applications using Java and Spring Boot. You will collaborate closely with their development team, reviewing code, ensuring adherence to industry best practices, and fostering a culture of continuous improvement. Key Responsibilities: Design and develop high-quality, scalable software solutions using Java and Spring Boot.Turn user stories into elegant system designs and architect applications.Review code and ensure adherence to best practices within the development team.Collaborate with stakeholders to communicate complex technical concepts effectively.Provide leadership and mentorship to team members, fostering a culture of continuous improvement. Software Stack: Java/Spring BootCamunda (business logic) To excel in this role, you'll need extensive hands-on experience in building enterprise-grade software applications, a deep understanding of Java and Spring Boot, and a knack for effectively communicating complex technical concepts. While not essential, experience with mainframe modernisation projects or familiarity with our proprietary business logic application, Commander, would be a significant plus. If you're a seasoned software architect with a proven track record of delivering high-quality, scalable solutions, we want to hear from you. Apply now and join our Clients team of innovators in shaping the future of enterprise software development! If you are interested, please share your updated resume and suggest the best number & time to connect with you Thanks & Regards,Gaurav GaurEmail: gaurav@dmsvisions.com | Phone : 972-645-9280LinkedIn: https://www.linkedin.com/in/gaurav-gaur-hr/DMS Vision ,INC4645 Avon Lane, Suite 210Frisco, TX 75033",
        "source": "Email",
        "date_posted": "2024-10-02 11:37:13-05:00",
        "unique_id": "1924e1c37686ba26",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]