[
    {
        "company": "GTECH",
        "job_title": "Automation Developer - Java",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5-10 years",
            "degree_required": "Bachelor's Degree in Computer Science related discipline or equivalent work experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "CI/CD",
                "Automation",
                "Generative AI",
                "Agile"
            ],
            "primary": [
                "Kotlin",
                "Cloud Technologies",
                "Docker",
                "Python",
                "Groovy",
                "Bash",
                "PowerShell",
                "REST",
                "SQL",
                "Jenkins",
                "Puppet",
                "Chef",
                "Ansible"
            ],
            "secondary": [
                "Unit Testing",
                "Mocking",
                "TDD",
                "Version Control Concepts"
            ],
            "all": [
                "Java",
                "CI/CD",
                "Automation",
                "Generative AI",
                "Agile",
                "Kotlin",
                "Cloud Technologies",
                "Docker",
                "Python",
                "Groovy",
                "Bash",
                "PowerShell",
                "REST",
                "SQL",
                "Jenkins",
                "Puppet",
                "Chef",
                "Ansible",
                "Unit Testing",
                "Mocking",
                "TDD",
                "Version Control Concepts"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Prakhar Sharma",
        "email": "psharma@greattechglobal.com",
        "jd": "From: Prakhar Sharma, GTECH psharma@greattechglobal.com Reply to: psharma@greattechglobal.com Job TitleAutomation Developer - JavaProject LocationFully Remote [EST working hours]Duration6+ monthsVideo Call InterviewJob Description:- SELLING POINTS: Great opportunity to solve technical challenges with automating the CI/CD pipeline activities and incorporating AI into the solutions. Must have Gen AI experience- please note this is a Automation position with development experience not just a DevOps. GLIDER TEST . ADDITIONAL INFO: Interested in DevOps, Continuous Delivery, Automation in the SDLC, and having fun at work?Development Services is looking for a highly motivated, self-starting individual that can apply software development techniques and modern programming to help drive integration and automation in the SDLC. Our objective is to enable our customers to deliver their changes to market faster with quality through our build and deployment platform. We work closely with Dev/Sec/Ops teams to streamline delivery through our software factory by evangelizing and consulting on best practices to drive higher maturity in Continuous Delivery practices. This an ideal position for a Software Engineer, who is passionate about CI/CD best practices, automation, and making tools that make Software Engineers’ lives easier. Individual will join an exciting, fast paced work environment where we leverage agile practices to manage our work. What you can expect to do in this role? 1. Research AI solutions for the SDLC 2. Implement integration points between critical SDLC applications and phases 3. Support our automated build and deploy platform across several environments and hundreds of servers 4. Work in an Agile (Scrum and Kanban) environment 5. Frequent features releases, multiple times per week 6. Help drive innovative approaches for tackling complex needs 7. Open, fun culture embracing innovation and improvement 8. We hold ourselves to the same high standards of software development that we expect and enforce on our customers PREFERRED QUALIFICATIONS / TECHNOLOGIES 1. Generative AI models used to enhance workflows and data insights 2. Previous experience with Cloud/Container Technologies (OpenShift, Docker) 3. Programming Languages: Java and/or Kotlin 4. Unit Testing, Mocking, TDD 5. Scripting Languages: Python, Groovy, Bash, PowerShell 6. Web Services (REST) 7. SQL 8. Continuous Integration Environment (Jenkins or other) 9. Configuration Management (Puppet, Chef, Ansible or other) 10. Version Control Concepts 11. Agile principles (Scrum, Kanban) POSITION REQUIREMENTS 1. Bachelor's Degree in Computer Science related discipline or equivalent work experience 2. Demonstrated project leadership experience. 3. Experience using one or more programming language(s). 4. 5-10 years of experience in Related field.",
        "source": "Email",
        "date_posted": "2024-10-02 11:04:35-05:00",
        "unique_id": "1924dfdb6c363f81",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]