[
    {
        "company": "CVS",
        "job_title": "MS SQL Server DBA",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Minimum of 7 years",
            "degree_required": "BS Degree in Computer Engineering, Computer Science, or related field/technical experience",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "MS SQL Server DBA",
                "Performance optimization",
                "Root cause analysis",
                "SQL",
                "T-SQL"
            ],
            "primary": [
                "Windows OS technologies",
                "Active Directory",
                "DNS",
                "DHCP",
                "Group policies",
                "PowerShell",
                "ActiveBatch",
                "SCCM",
                "MDT"
            ],
            "secondary": [
                "MongoDB",
                "Customer service orientation"
            ],
            "all": [
                "MS SQL Server DBA",
                "Performance optimization",
                "Root cause analysis",
                "SQL",
                "T-SQL",
                "Windows OS technologies",
                "Active Directory",
                "DNS",
                "DHCP",
                "Group policies",
                "PowerShell",
                "ActiveBatch",
                "SCCM",
                "MDT",
                "MongoDB",
                "Customer service orientation"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Balram Kumar Singh",
        "email": "balram@spearstaffing.com",
        "jd": "From: Balram Kumar Singh, Spear Staffing LLC balram@spearstaffing.com Reply to: balram@spearstaffing.com Position: MS SQL Server DBAClient: CVSLocation- RemoteVisa: No H1Bs/CPTCandidate must be open to contract to hire options after 6 or more monthsInterview process: 2 rounds The Database Administrator (MS SQL Server DBA) will provide services for all support issues submitted by Company Employees. Duties will include proactively monitoring performance and capacity, performance tuning, query optimization, evaluating and integrating new products, resolving computing issues, and supporting database replication. Also, you will support on-premise and cloud-based databases. Core Responsibilities:• As the Database Administrator (DBA), you will be responsible for:• Optimizing and tuning database systems• Ensuring adherence to storage, archiving, and back-up recovery procedures• Backup recovery testing of recovery procedures and archiving databases• Disaster recovery testing• Troubleshooting database issues and performing database impact analysis for proposed changes• Controlling access permissions and privileges• Altering tables and schema structure as required• Working with the application development teams to develop stored procedures, triggers, and code to support enterprise applications, as well as to enforce coding standards• Executing database release management processes and coordinating maintenance of development, testing, and production environments• Physical database design• Other duties as assigned What are we looking for? We’re looking for motivated professionals with:• BS Degree in Computer Engineering, Computer Science, or related field/technical experience• Expert administration/engineering skills in Windows OS technologies• Expert MS SQL Server DBA• Minimum of 5 years supporting Windows operating systems and technologies, including Active Directory, DNS, DHCP, and group policies• Advanced knowledge in automating for Windows platforms leveraging PowerShell, ActiveBatch, and SCCM or MDT• Minimum of 7 years of experience in administering multi-terabyte MS SQL Server databases• Proficiency with SQL, T-SQL, PowerShell• Must be expert at performance optimization and root cause analysis• Experience in administering a multi-terabyte data warehouse is preferred• Strong technical ability and outstanding troubleshooting skills• Ability to research emerging technologies and make recommendations that benefit our business• MongoDB skills are a big plus• Strong customer service orientation Thanks and regardsBalram Kumar SinghSr Technical Recruiter Phone:- 240-261-2375Email:- balram@spearstaffing.com Website:- www.spearstaffing.com This message and any attachments are intended only for the use of the addressee and may contain information that is privileged and confidential. If the reader of the message is not the intended recipient or an authorized representative of the intended recipient, you are hereby notified that any dissemination of this communication is strictly prohibited. If you have received this communication in error, notify the sender immediately by return email and delete the message and any attachments from your system.",
        "source": "Email",
        "date_posted": "2024-10-02 11:46:54-05:00",
        "unique_id": "1924e24dd1251105",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "DB Admin"
    }
]