[
    {
        "company": "Stellent IT",
        "job_title": "Developer, IT Applications",
        "location": "Fort Worth, TX, USA",
        "full_location": {
            "city": "Fort Worth",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "2 years",
            "degree_required": "Bachelor's degree in Computer Science, Computer Engineering, Technology, Information Systems (CIS/MIS), Engineering or related technical discipline, or equivalent experience/training",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ months with possible extensions",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "JSP",
                "JMS",
                "XML",
                "HTML",
                "JavaScript",
                "CSS",
                "GIT",
                "JQuery",
                "Angular",
                "SOAP",
                "REST"
            ],
            "primary": [
                "object-oriented programming",
                "common data structures",
                "algorithms",
                "design patterns",
                "web development technologies",
                "relational databases",
                "networking knowledge"
            ],
            "secondary": [
                "Airline Industry experience",
                "GitHUB",
                "excellent prioritization and time management skills",
                "excellent analytical thinking and problem-solving abilities",
                "personal commitment to Agile principles",
                "knowledge of TDD and automated testing",
                "knowledge of PCI Compliance / OWASP standards",
                "knowledge of diagnostics tools"
            ],
            "all": [
                "Java",
                "JSP",
                "JMS",
                "XML",
                "HTML",
                "JavaScript",
                "CSS",
                "GIT",
                "JQuery",
                "Angular",
                "SOAP",
                "REST",
                "object-oriented programming",
                "common data structures",
                "algorithms",
                "design patterns",
                "web development technologies",
                "relational databases",
                "networking knowledge",
                "Airline Industry experience",
                "GitHUB",
                "excellent prioritization and time management skills",
                "excellent analytical thinking and problem-solving abilities",
                "personal commitment to Agile principles",
                "knowledge of TDD and automated testing",
                "knowledge of PCI Compliance / OWASP standards",
                "knowledge of diagnostics tools"
            ],
            "with_experience": [
                "Java (2+ years)",
                "web application experience (2+ years)"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Akshit Sisonia",
        "email": "akshit@stellentit.com",
        "jd": "From: Akshit, Stellentit akshit@stellentit.com Reply to: akshit@stellentit.com Hi Hope you are doing well Title : Developer, IT ApplicationsLocation : Fort Worth, Texas (Hybrid – Local Preferred)Duration : 6+ months with possible extensions Proper LinkedIn Visas: GC, USC OnlyOnly W2 Job Description :-IMPORTANT INFORMATION: 1-2 rounds of interview with coding assessment. Virtual and onsite. Candidate should be willing to work 3x a week onsite. Not open to H1B candidates for now. Contract is possible to extend to 2025 Why you'll love this jobThis job is a member of the Information Technology Team within the Information Technology Division.Responsible for developing and supporting web based, mobile-aware, Java applications and web services. As a member of an agile team, the successful candidate will have the opportunity to work in a collaborative environment with internal customers, management, business analysts, project managers, IT architects and other developers to understand requirements and development needs while gaining valuable experience and skills. What you'll doWith guidance of senior developers, creates new and maintains current applications, including, but not limited to, bug fixes, feature enhancements, and performance tuning in the Corporate Security, Emergency Planning & Response, Environmental and Safety IT portfolios.Researches and implements new technology to enhance current processes, security, and performanceTroubleshoots and debugs complex issues; identifies and implements solutionsWorks with a team to create detailed project specifications, requirements, and estimates, and ensures tasks/projects are completed on time and within scopeWorks with production operations department to ensure deployments roll out smoothly and customer groups receive appropriate supportDocuments validation of design decisionsSupports the enforcement of policy and procedural changes within the development groupSupports the development of coding standards and adhere to best practices and security guidelines set forth by the development teamParticipates in code reviewsProvides on-call production support (24 x 7 x 365), as required All you'll need for success Minimum Qualifications- Education & Prior Job ExperienceBachelor's degree in Computer Science, Computer Engineering, Technology, Information Systems (CIS/MIS), Engineering or related technical discipline, or equivalent experience/training2 years total development experience1 year web application or services experience Preferred Qualifications- Education & Prior Job Experience2+ years of total development experience2+ years of web application experienceAirline Industry experience Skills, Licenses & CertificationsBasic to intermediate knowledge of object-oriented programming, common data structures and algorithms, design patterns and best practicesBasic to intermediate development skills with, Java, JSP, JMS, XML, HTML, JavaScript, CSS, GIT, JQuery, Angular, SOAP/REST and other web development technologiesExperience with GitHUBKnowledge of relational databases (PostgreSQL, Cloudant, MySQL)Ability to scrutinize applications and services to ensure they adhere to security standards.Networking knowledge (Sockets, TCP/IP, UDP)Excellent prioritization and time management skillsExcellent analytical thinking and problem-solving abilities.Personal commitment to Agile principles and a continuous improvement mindsetKnowledge of TDD and automated testingKnowledge of PCI Compliance / OWASP standardsKnowledge of diagnostics tools (Postman, SOAPUI, HTTP Analyzer, Dynatrace) Thanks & RegardsAkshit Sisonia - Sr. Technical RecruiterEmail- akshit@stellentit.com | Contact No : (732)-795-6262 || EXT :130STELLENT IT – A Nationally Recognized Minority Certified Enterprise\"Happiness can be found, even in the darkest of times, if one only remembers to turn on the light.\" - JK Rowling",
        "source": "Email",
        "date_posted": "2024-10-02 11:05:56-05:00",
        "unique_id": "1924dfe5c62637a6",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]