[
    {
        "company": "USG, Inc.",
        "job_title": "Sr. IT Project Manager - SAP ERP",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "15+ years",
            "degree_required": "Bachelor’s degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$60/hr"
        },
        "skills": {
            "core": [
                "SAP ERP",
                "Project Management",
                "SAP S4 Hana",
                "Agile methodologies",
                "Communication"
            ],
            "primary": [
                "Business transformation assessments",
                "Presentation skills",
                "Vendor management",
                "Stakeholder management",
                "Risk management"
            ],
            "secondary": [
                "PMP certification",
                "SAFe",
                "Lean budget",
                "Process improvements",
                "Team training"
            ],
            "all": [
                "SAP ERP",
                "Project Management",
                "SAP S4 Hana",
                "Agile methodologies",
                "Communication",
                "Business transformation assessments",
                "Presentation skills",
                "Vendor management",
                "Stakeholder management",
                "Risk management",
                "PMP certification",
                "SAFe",
                "Lean budget",
                "Process improvements",
                "Team training"
            ],
            "with_experience": [
                "SAP S4 Hana (large scale implementations)",
                "Project management methodologies"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Rudra Mishra",
        "email": "rmishra@usgrpinc.com",
        "jd": "From: Rudra, USG rmishra@usgrpinc.com Reply to: rmishra@usgrpinc.com HiHope you are doing well!I would like to consider you for the below mentioned role as “Sr. IT Project Manager - SAP ERP” with one of our client in “Remote”Please find below the job description and have me your interest on this role.Looking forward to your response. Max Rate i have $60/hr. on C2CResponsibilities and Duties: Our Project Management practice group is currently seeking an IT Sr. Project Manager who has strong experience in SAP ERP. This role will be supporting one of our global Healthcare devices/Life Science clients, based out of Raleigh, NC. This Senior Project Manager is a solution-oriented leader that can apply program management techniques to facilitate, coordinate with excellent communication skills to collaborate to implement SAP for improving the customer service experience across the business division from vision to realization. The Project Manager will be adept at building and maintaining relationships at technical and business levels; is highly analytical, customer obsessed, adaptable, and enjoys bringing structure and discipline to ambiguous spaces to realize measurable value for the business.Technical PM with strong understanding of SAP transformations Manage Technical SAP Workstream coordinating the SAP assessment work to determine the transformation project approach for SAP ECC6 to SAP S4Hana Oversee SAP project to provide metrics for reporting to executive team on business case An excellent communicator Oversee all aspects of assigned projects including scope, schedule, budget, resources, quality and risk to ensure successful delivery in a very dynamic environment. Proactively manage assigned projects/programs to ensure milestones are achieved within plan including proactively managing execution progress, managing communications, reporting status, managing resources, managing change, removing roadblocks and resolving conflicts. Manage internal and external stakeholders at various levels, customer relationships and third-party vendors as needed. Maintain extensive knowledge and expertise in the discipline of program management as well as multiple business processes and/or technical areas. Participate with management and other PMs in establishing best practices in program management methods and tools. Be detail-oriented and proactive in identifying and closing gaps in the product development lifecycle. Present updates to senior-level stakeholders, welcoming feedback and implementing/driving changes quickly. Lead team to resolve all program/project issues and impediments on a timely manner, effectively communicate, manage expectations and resolve conflicts working closely with team and leadership. Demonstrate high adaptability and flexibility to take responsibility to support new projects that has priority and as communicated.Basic QualificationsBachelor’s degree 15+ years of relevant work experience as a Project Manager with SAP Transformation experience Project Management Professional (PMP) and Agile/SAFe is a plusMust Have Experience and Skills:Experience with large scale SAP S4 Hana Implementations. Experience with Business transformation assessments going from SAP ECC6 to SAP S4Hana or similar experience Experience working with Senior level, Group leadership, Vendor Partners, Business PM Excellent Presentation skills Experience as Project Manager utilizing Project management methodologies managing SAP Strong communicator with effective presentation skills delivering formal presentations & facilitate Demo to various levels of management articulating project/Sprint status, risk mitigations, benefits & financial realizations. Self-motivated and independent critical thinker who can visualize and guide team during conflicting situations to stay focused on business goals & priorities Has strong experience in iterative and Agile methodologies, lean budget, managing solution deployments, process improvements, provide training to team Thanks & RegardsRudra Mishra | Associate Manager USG, Inc.End-to-End IT Systems | Services | Solutions ProviderA Minority Business Enterprise6000 Venture Dr, Suite C & D, Dublin, Ohio 43017Phone: Fax: 866-764-1148Email: 2016 - 2017 - 2018 To unsubscribe from this mailing, please reply to this email with the word UNSUBSCRIBE in the subject line, or click here UNSUBSCRIBE.USG is an Equal Opportunity Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, gender, age, disability, military status, national origin or any other characteristic protected under federal, state, or applicable local law",
        "source": "Email",
        "date_posted": "2024-10-02 13:56:59-05:00",
        "unique_id": "1924e97124502f36",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]