[
    {
        "company": "DMS Visions INC",
        "job_title": "Oracle Cloud ERP Finance PM",
        "location": "Jersey City, NJ, USA",
        "full_location": {
            "city": "Jersey City",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle Cloud ERP",
                "Finance PM"
            ],
            "primary": [
                "Healthcare specific Oracle Cloud ERP/Finance exp"
            ],
            "secondary": [],
            "all": [
                "Oracle Cloud ERP",
                "Finance PM",
                "Healthcare specific Oracle Cloud ERP/Finance exp"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Abhishek Yadav",
        "email": "abhishek@dmsvisions.com",
        "jd": "From: Abhishek Yadav, DMS Visions INC abhishek@dmsvisions.com Reply to: abhishek@dmsvisions.com Hi,Hope you are doing well !!I have an urgent position. Kindly go through the Job description and let me know if this would be of interest to you. Job Title: Oracle Cloud ERP Finance PM Location: Jersey City, NJ (4 days/week onsite)Duration: 6+ Months Contract ****While sharing resume mention consultant location and visa status*** Job Description: Project Description: The client has gone live on the full Oracle Cloud Finance/SCM/HCM suite. They are looking for a PM to lead the Finance team through the best practices of Oracle Cloud, leveraging the technology to best optimize the business.Day to Day: This resource must be a true Oracle Cloud ERP project manager who has extensive experience with the Oracle Cloud Finance suite. The ideal resource is a PM who has worked at a healthcare client through an Oracle Cloud ERP implementation and provided long term post go live support to optimize the business. This PM candidate should have extensive knowledge on how to leverage the new technology to optimize the finance pillar of a healthcare client.The PM will be working closely with the pillar leads of the finance and IT teams to manage quarterly releases, upgrades, and manage key meetings regarding Best practices. They will be working closely with the full-time team in an onsite capacity, so the resource must have clear communications skills and experience working with C-suite stakeholders. Required Skills:Extensive Oracle Cloud ERP/Finance PM expHealthcare specific Oracle Cloud ERP/Finance exp If you are interested, please share your updated resume and suggest the best number & time to connect with you. Thanks & Regards, Abhishek YadavDMS Vision Inc. | http://dmsvisions.com/4645 Avon Lane, Suite 210, Frisco, TX 75033Email: abhishek@dmsvisions.com | Phone : 972-645-5314 | EXT - 103",
        "source": "Email",
        "date_posted": "2024-10-02 12:07:41-05:00",
        "unique_id": "1924e362a33616ef",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]