[
    {
        "company": "Inteletech Global Inc",
        "job_title": "Senior Business Analyst",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "8 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Analytical skills",
                "Communication skills",
                "Interpersonal skills",
                "Business acumen",
                "Organizational and time management skills",
                "Adaptability and continuous learning",
                "Customer service orientation",
                "SQL querying skills"
            ],
            "primary": [
                "Experience serving as a business analyst on data management projects",
                "Familiarity with healthcare data"
            ],
            "secondary": [],
            "all": [
                "Analytical skills",
                "Communication skills",
                "Interpersonal skills",
                "Business acumen",
                "Organizational and time management skills",
                "Adaptability and continuous learning",
                "Customer service orientation",
                "Experience serving as a business analyst on data management projects",
                "Technical skills: retrieve, manipulate, and combine data from multiple sources using SQL in order to derive insights",
                "Familiarity with healthcare data",
                "SQL querying skills"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "celine",
        "email": "celine@inteletechglobal.com",
        "jd": "From: celine, Inteletech Global Inc celine@inteletechglobal.com Reply to: celine@inteletechglobal.com Role: Senior Business Analyst (Enterprise Data Warehouse (EDW) and data exchange)Location: Richmond, VA 23219 2 Days ON SITE Required each week No Exceptions). Local candidates preferred. Parking is not provided for contractorsShort Description: Sr Business Analyst is needed to work with stakeholders and the vendor team to ensure that business and technical requirements are gathered and delivered for the Data Exchange and Modernization Program. This project will replace the existing data warehouse with a new cloud architecture, integrate with a variety of source systems, and implement a Master Person Identifier (MPI) to link individuals across data sources. Report requirements will also need to be documented.FULL JOB DESCRIPTION This role will coordinate extensively with internal and external stakeholders to gather and document business and technical requirements, analyze business needs, and analyze and document the data to be ingested into the new data platform.Activities include:Creating data dictionaries with input from data stewards; meeting with stakeholders to document report requirements; working with the business and IT to understand and document current business processes and identifying opportunities to streamline processes and reporting. This position will also oversee quality assurance processes to ensure that the delivered solutions meet business requirements and adhere to data governance and security standards. This role requires an experienced analyst who is skilled in listening, understanding, and communicating with business and technical stakeholders. SQL querying skills and experience with data analysis, reporting and business intelligence is required. Excellent communication skills and the ability to take initiative and ownership over their work is a must. Required/Desired Skills:SkillRequired /DesiredAmountCandidate ExperienceAnalytical skills - analyze complex systems and processes in order to evaluate alternatives and make recommendationsRequired8 Years Communication skills - translate technical information into layman's terms and actively listen to understand stakeholder needs; create documentationRequired8 Years Interpersonal skills - collaborate with diverse teams and negotiate between different stakeholders' requirementsRequired8 Years Business acumen - understand business processes and objectives in order to align technical solutions with business goals.Required8 Years Organizational and time management skills - prioritize tasks and meet deadlines; manage multiple tasks simultaneously; identify and mitigate risksRequired8 Years Adaptability and continuous learning - adapt to changes in the project; take the initiative to learn the business and technical environment and toolsRequired8 Years Customer service orientation - focus on delivering value to stakeholders and end users; empathy towards user challenges; responsiveness to feedbackRequired8 Years Experience serving as a business analyst on data management projectsRequired4 Years Technical skills: retrieve, manipulate, and combine data from multiple sources using SQL in order to derive insightsRequired4 Years Familiarity with healthcare dataHighly desired2 Years",
        "source": "Email",
        "date_posted": "2024-10-02 14:58:30-05:00",
        "unique_id": "1924f2c56424d765",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]