[
    {
        "company": "Resource Consulting Services Inc",
        "job_title": "Business Analyst",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "135545",
            "experience_required": "3-5 years",
            "degree_required": "Associate Degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "1 year with possible extension",
            "rate": "$45-50/hr."
        },
        "skills": {
            "core": [
                "Azure DevOps",
                "Business Analysis",
                "Software Development Lifecycle",
                "Communication"
            ],
            "primary": [
                "MS Office",
                "Liaison between development team and business client",
                "Project Management"
            ],
            "secondary": [
                "Microsoft SharePoint",
                "Project management methodologies"
            ],
            "all": [
                "Azure DevOps",
                "Business Analysis",
                "Software Development Lifecycle",
                "Communication",
                "MS Office",
                "Liaison between development team and business client",
                "Project Management",
                "Microsoft SharePoint",
                "Project management methodologies"
            ],
            "with_experience": [
                "Azure DevOps (6 months)",
                "Business Analysis (3 years)",
                "Communication (3 years)"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Ansar Alam",
        "email": "ansar@rconsultinginc.com",
        "jd": "From: Ansar Alam, Resource Consulting Services Inc ansar@rconsultinginc.com Reply to: ansar@rconsultinginc.com Job ID: 135545Role: Business AnalystDuration: 1 year with possible extension.Location: Lansing, MI 48933 – Hybrid – Tuesdays and Wednesdays Visa: AnyPay Rate: $45-50/hr. on c2c (No Negotiations) Local candidates only with local DL or State ID of Michigan state.In-person Interview (Face to Face interview)Prior state experience is preferred Must Have: - Experience with Azure DevOps (minimum of 6 months)- Experience in a role, as a business analyst, supporting a software development project, in the past 5 years (minimum of 3 years)- Ability to conduct meetings, communicate at a level appropriate to the audience, make oral and written reports and presentations (minimum of 3 years)- Associate Degree Job Description:We are looking for someone who understands and has experience with the software development lifecycle as they will be managing work requests to support operational support needs for web applications and gather requirements for project initiatives. This role is the liaison between the technical team and the business client. This will be about 90% of the time for this resource. Tasks:Facilitates meetings with the technical team and business client. Gathers requirements and project specifications by leading requirement sessions independentlyMaintain backlog of work items in Azure DevOpsManage project tasks, timelines, and communication between business product owner and development team associated with the Change Management lifecycleTrack sprints and ticket progress in Azure DevOpsEnsures the team is adhering to the department change management policies Acts as a liaison with State of Michigan auditorsMaintains documentation on the project SharePoint Site.Must be detail oriented and a critical thinkerProvide management with information such as project status reports and resource demand projections. SkillRequired / DesiredRequired Years of experienceExposure to Complex IT web Applications, within the past 5 yearsRequired5 Years Experience in a professional office environmentRequired5 YearsExperience in a role, as a business analyst, supporting a software development project, in the past 5 yearsRequired3 YearsAbility to conduct meetings, communicate at a level appropriate to the audience, make oral and written reports and presentationsRequired3 YearsProficiency with MS OfficeRequired3 YearsExperience working as a liaison between the development team and project manager or business client in a software development project Required2 Years Experience with Azure DevOpsRequired6 MonthsKnowledge and understanding of the Software Development LifecycleHighly Desired2 YearsProject management skills and knowledge in project management and related methodologies Highly Desired 6 MonthsExperience with Microsoft SharePoint Highly Desired6 Months",
        "source": "Email",
        "date_posted": "2024-10-02 11:05:29-05:00",
        "unique_id": "1924dfe2f79add54",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]