[
    {
        "company": "Stellent It",
        "job_title": "ALFA PROJECT FINANANCIAL ANALYST",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "3-5 years",
            "degree_required": "BA/BS in Accounting, Finance, is preferred",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "LONG TERM",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Alfa Systems",
                "Accounting",
                "General Ledger",
                "Financial Reporting",
                "Project Management"
            ],
            "primary": [
                "Microsoft Office",
                "User Acceptance Testing",
                "Configuration Management",
                "Communication",
                "Problem-solving"
            ],
            "secondary": [
                "Attention to detail",
                "Presentation skills",
                "Team collaboration",
                "Fast-paced environment management"
            ],
            "all": [
                "Alfa Systems",
                "Accounting",
                "General Ledger",
                "Financial Reporting",
                "Project Management",
                "Microsoft Office",
                "User Acceptance Testing",
                "Configuration Management",
                "Communication",
                "Problem-solving",
                "Attention to detail",
                "Presentation skills",
                "Team collaboration",
                "Fast-paced environment management"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Aditya Kumar",
        "email": "aditya@stellentit.com",
        "jd": "From: Aditya Kumar, Stellent It aditya@stellentit.com Reply to: aditya@stellentit.com Job Title:- ALFA PROJECT FINANANCIAL ANALYSTLocation:- RemoteDuration:- LONG TERM Job DescriptionALFA PROJECT FINANANCIAL ANALYST. MUST COME FROM THE AUTOMOTIVE INDUSTRY AND HAVE HANDS ON EXPERIENCE DOING CONFIGURATIONS WITH ALFA SYSTEMS.REMOTE WITH TRAVEL EVERY 4 MONTHS AND AS NEEDED MUST HAVE project experience, accounting knowledge. We want candidates that are very strong with writing stories, features, and test cases.We also need candidates with ALFA implementation experience and strong accounting knowledge. Need to be using alfa systems as a client of the platform not a user. financial side.Map the GLOrg structureStatic configuration related to financialUser stories, features, requirements writingSOMEONE WHO HAS DONE AN ALFA Implementation and configuration, NOT JUST A USER – this is criticalSET UP A PRODUCTSET UP ORG STRUCTURELead meetingsLiaison with technical folksSTRONG PRESENATION AND ANALYTICAL SKILLSLOT OF INTERVIEWS. CUT ON COMM SKILLS.We are seeking a project financial analyst and hope you and your team can find us a highly qualified contractor with general ledger expertise and Alfa Systems financial experience. Support, Analysis, and Solution Definition1. Builds relationships to effectively partner with other departments in the development and implementation of the project.2. Demonstrate significant and increasing knowledge about the automotive finance business and related systems.3. Pushes creative thinking beyond the boundaries of existing practices to identify solutions to enhance current state efficiently and effectively.4. Understand the financial aspect of the system application, workflows, system capabilities, parameters, rules, etc.5. Create opportunities to automate financial processes where possible.6. Helps set direction and strategy for system replacement and enhancements. Project Execution1. Participate in developing stories for requirements and design, following the project framework, ensuring that the accounting group's interests and concerns are properly addressed.2. Perform related systems integration and user acceptance testing with the appropriate level of detail, ensuring the system is functioning properly in the test environment before being formally implemented in the live system. This includes f unctional segment testing, smoke testing, SIT , UAT , etc.3. Works with configuration team on behalf of end users to ensure business requirements are understood and met.4. Collaboration with team members, operations, project managers, consultants, and contractors to ensure project expectations align.5. Communicate updates to stakeholders and engage for review and design decision throughout the project lifecycle.Communication1. Acts as an interface between technology teams, support teams, vendors and various Departments on systems projects and initiatives.2. Communicates, applies, and is an advocate for project standards.3. Able to balance a complex working environment and manage competing priorities effectively based on business needs.4. Stays current on the data, reporting, and systems used or that can be utilized by Accounting and Finance Department to be able to advocate for the needs of business users. Qualifications:1. BA/BS in Accounting, Finance, is preferred2. 3-5 years of experience in Accounting or Finance3. Demonstrated high proficiency with Microsoft Office4. Project experience required5. Alfa Systems / Alfa Financial Software experience required Required Skills and Expertise1. Strong problem-solving skills: ability to define problems, collect data, establish facts, and draw valid conclusions2. Strong accounting background, understanding of general ledger and accounting functions and processes, which includes General Ledger Maintenance, Financial Reporting, Account Reconciliation, and Internal Controls.3. Proven effective verbal & written communication/follow up skills4. Possess solid presentation skills and the ability to lead and manage meetings and working sessions comprised of stakeholders with competing interests5. Attention to detail and self-starter6. Ability to work both independently and as part of a team7. Must be able to manage multiple tasks in a fast-paced, dynamic work environment",
        "source": "Email",
        "date_posted": "2024-10-02 12:33:06-05:00",
        "unique_id": "1924e4b667e256b3",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]