[
    {
        "company": "Mojang Studios",
        "job_title": "Business Analyst 4",
        "location": "Redmond, WA, USA",
        "full_location": {
            "city": "Redmond",
            "state": "WA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "12+ years",
            "degree_required": "No degree required",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Adobe Analytics",
                "Python",
                "SQL",
                "Power BI"
            ],
            "primary": [
                "Databricks",
                "SparkSQL",
                "PySpark",
                "Azure Data Explorer"
            ],
            "secondary": [
                "Web analytics",
                "Dashboarding tools",
                "Analytical skills",
                "Problem-solving skills",
                "Communication skills",
                "Interest in games"
            ],
            "all": [
                "Adobe Analytics",
                "Python",
                "SQL",
                "Power BI",
                "Databricks",
                "SparkSQL",
                "PySpark",
                "Azure Data Explorer",
                "Web analytics",
                "Dashboarding tools",
                "Analytical skills",
                "Problem-solving skills",
                "Communication skills",
                "Interest in games"
            ],
            "with_experience": [
                "Adobe Analytics (3-5 years)",
                "Python (3-5 years)",
                "SQL (3-5 years)",
                "Power BI (3 years)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Chandra",
        "email": "responseph@resourcehuntgroup.com",
        "jd": "From: Chandra, RHG responseph@resourcehuntgroup.com Reply to: responseph@resourcehuntgroup.com Hi All,Hope you are all doing great!Role: Business Analyst 4Location: Redmond WADuration: ContractNeed 12+ years experience candidatesNeed only Local Candidates from Seattle, WA.Job Description:\"Candidate Requirements• Years of Experience Required: 3-5 overall years of experience in the field.• Degrees or certifications required: No degree is required to be eligible for this role.• Disqualifiers: N/A• Best vs. Average: The ideal resume would contain analytics experience in Adobe Analytics as well as a database environment such as Databricks, and familiarity with machine learning tools such as recommenders and clustering algorithms.• Performance Indicators: Performance will be assessed based on quality of work. Top 3 Hard Skills Required + Years of Experience1. Minimum 3-5 years experience with web analytics tools, Adobe Analytics preferred.2. Minimum 3-5 years experience with analytics leveraging Python and SQL.3. Minimum 3-5 years experience with dashboarding tools, Power BI preferred.\"At Mojang Studios, the creators of Minecraft, we are on a mission to build a better world through the power of play. Why play? Well, play is at the heart of everything we do. It’s the blocky backbone of our games, the core of our development philosophy, and even the origin of our name. From the relentless experimentation of our endlessly inspiring community to the classrooms where Minecraft has become an essential teaching tool, play is the bedrock of our existence. We enable millions to create and play together, connect people across the globe, and foster a community that is among the most active and passionate in the world. Our community is global and incredibly diverse. When we are developing anything within our franchise, we keep this in mind. We want everyone to not only feel included in Minecraft, but also to see themselves in what we make. Our goal is for the Mojang Studios team to be as diverse as our community. As a Web Analyst, you will be responsible for synthesizing insights into recommendations for Minecraft’s web strategy. You will join a high-visibility team impacting strategic studio decisions, so speed, storytelling, and attention to detail are essential. To optimize how we interact with our player community you will benchmark the success of web initiatives and provide recommendations for future improvements that will drive the most impact. Leveraging findings from a team of data scientists, a successful candidate will integrate game insights with web analytics to create a holistic view. You will partner with our web design team to incorporate insights that drive impact to player engagement, revenue, and player acquisition across the Minecraft franchise.Partner with the web team to integrate insights and research into our strategy for Minecraft.netMaintain and improve Power BI dashboards that enable stakeholders to understand trends and impact from strategic initiativesAnalyze web traffic and funnels and the correlation to engagement and revenueMake recommendations to optimize clickthrough, page views, user experience, and salesCollaborate with your teammates to improve personalization on Minecraft.netRequired Qualifications (as pulled from the Role Library):3-5 years of experience in web analyticsProficient in Adobe Analytics3-5 years of experience with Python and SQL, bonus if familiar with Databricks, SparkSQL, PySpark, or Azure Data Explorer3 years experience with dashboarding tools, Power BI preferredLocal to Seattle areaPreferred Qualifications:Excellent verbal, visual and written communication skillsAble to work in a collaborative, diverse and fast-paced teamExcellent analytical, and problem-solving skills and autonomy when faced with solving data problemsExcellent verbal, visual and written communication skillsInterest in games, bonus if experience in gaming industry\"Typical Day in the Role• Purpose of the Team: The purpose of this team is a data science team supporting Mojang Studios, known for making Minecraft. They focus on video game data science, particularly in marketing analytics, aiming to improve player retention, engagement, and highlight additional content for purchase.• Key projects: This role will contribute to web analytics for Minecraft.net.• Typical task breakdown and operating rhythm: The role will consist of PBI dashboard maintenance and improvement, web traffic and funnel analysis, recommendations for site optimization and personalization.",
        "source": "Email",
        "date_posted": "2024-10-02 13:23:25-05:00",
        "unique_id": "1924eebf8607b861",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]