[
    {
        "company": "Smart Folks",
        "job_title": "Lead Database Specialist",
        "location": "Maryland Heights, MO, USA",
        "full_location": {
            "city": "Maryland Heights",
            "state": "MO",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "106956-1",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle",
                "Mongo databases",
                "application database support"
            ],
            "primary": [
                "database innovations",
                "CICD",
                "Performance improvements",
                "Query Tuning",
                "Automations",
                "Golden Gate"
            ],
            "secondary": [],
            "all": [
                "Oracle",
                "Mongo databases",
                "application database support",
                "database innovations",
                "CICD",
                "Performance improvements",
                "Query Tuning",
                "Automations",
                "Golden Gate"
            ],
            "with_experience": [
                "Oracle",
                "Mongo databases"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Yashwanth",
        "email": "yashwanth@smartfolksinc.com",
        "jd": "From: Yashwanth, SmartfolksInc yashwanth@smartfolksinc.com Reply to: yashwanth@smartfolksinc.com Hi Greetings from Smart Folks…!!!My name is Yashwanth we have a job opportunity for Lead Database Specialist for one of our clients. Please find the Job description below, if you are available and interested, please send us your word copy of your resume with following detail to yashwanth@smartfolksinc.com or reach me at 469-425- 3346 Request ID: 106956-1Job Title: Lead Database SpecialistWork Location: Maryland Heights, MO 63043 Contract duration: 6 Months Job Details:Must Have Skills (Top 3 technical skills only) 1. Proficient in Oracle and Mongo databases with hands on technical experience. 2. Practical exposure in doing application database support activities 3. Strong in leading and enforcing new processes and best practices in day to day operations Nice to have skills (Top 2 only)1. Technical database Architect and Solution Specialist with ability to lead on database innovations and continuous improvements 2. Strong experience in CICD, Performance improvements, Query Tuning, Automations, Golden Gate etc Detailed Job Description:Proficient in Oracle and Mongo databases with hands on technical experience. Practical exposure in doing application database support activities. Strong in leading and enforcing new processes and best practices in day to day operations. Technical database Architect and Solution Specialist with ability to lead on database innovations and continuous improvements. Strong experience in CICD, Performance improvements, Query Tuning, Automations, Golden Gate etc. Strong review capabilities and should be able",
        "source": "Email",
        "date_posted": "2024-10-02 11:37:25-05:00",
        "unique_id": "1924e4290c8f4e32",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Oracle DBA"
    }
]