[
    {
        "company": "UST/Safeway",
        "job_title": "ServiceNow ITSM Business Analyst",
        "location": "Plano, TX, USA",
        "full_location": {
            "city": "Plano",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "3+ years",
            "degree_required": "Bachelor's degree in Computer Science or related technical field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "ServiceNow",
                "Business Analysis",
                "ITIL",
                "Data Management",
                "Problem-Solving"
            ],
            "primary": [
                "Collaboration",
                "Interpersonal Skills",
                "Microsoft Excel",
                "Microsoft PowerPoint",
                "Microsoft Word",
                "Microsoft Teams",
                "Microsoft SharePoint",
                "Agile Methodologies"
            ],
            "secondary": [
                "DevOps",
                "ITIL® Foundation Certifications",
                "ServiceNow Vulnerability Response",
                "ServiceNow Multi-Source CMDB/CMDB 360",
                "Cloud Solutions (Azure, Google, Oracle, IBM)",
                "Common Service Data Model",
                "IT Asset Management",
                "Application Architecture",
                "Service Delivery Modeling"
            ],
            "all": [
                "ServiceNow",
                "Business Analysis",
                "ITIL",
                "Data Management",
                "Problem-Solving",
                "Collaboration",
                "Interpersonal Skills",
                "Microsoft Excel",
                "Microsoft PowerPoint",
                "Microsoft Word",
                "Microsoft Teams",
                "Microsoft SharePoint",
                "Agile Methodologies",
                "DevOps",
                "ITIL® Foundation Certifications",
                "ServiceNow Vulnerability Response",
                "ServiceNow Multi-Source CMDB/CMDB 360",
                "Cloud Solutions (Azure, Google, Oracle, IBM)",
                "Common Service Data Model",
                "IT Asset Management",
                "Application Architecture",
                "Service Delivery Modeling"
            ]
        },
        "job_type": [
            "onsite",
            "remote"
        ],
        "contact_person": "Karthik",
        "email": "karthik@hclglobal.com",
        "jd": "From: Karthik, Hclglobal karthik@hclglobal.com Reply to: karthik@hclglobal.com ServiceNow ITSM Business Analyst UST/Safeway Must be able to work US hours (both PST and MST). Must be based within 50 miles of the following four client's corporate offices: Plano, TX, Boise, ID, Phoenix, AZ, Pleasanton, CA Need a strong ServiceNow Business Analyst candidate The ServiceNow ITSM Business Analyst is part of the client's IT Service Management team supporting the client's ServiceNow platform. This individual will be responsible for gathering, analyzing, and documenting business requirements from stakeholders and translating them into comprehensive requirements documents. The ServiceNow ITSM Business Analyst will drive collaboration with Product Owners, Scrum Masters, Process Owners, customers and ServiceNow Developers/Admins to ensure that requirements are thorough, accurate and complete. The ServiceNow ITSM Business Analyst will successfully derive functional requirements, validate and vet cross-functional dependencies and document the parameters defining success and completion. Key Responsibilities include, but are not limited to: • Accountable for providing high-performance output of business requirement documentation in support of assigned Products. • Maintain and build alignment with Product Owners and Scrum Masters to provide quality BA services that support Product program increment plans, timing and deliverables. • Responsible for leading translation of assigned business intake requests into comprehensive fully vetted requirements documents. • Collaborating with customers to define (or refine) process flow diagrams and use-case details that support their requirements and functional design. • Serving as the point of contact for ServiceNow requests that need a BA recourse, assessing feasibility of requests, and identifying solutions to meet request requirements. • Provide regular updates to stakeholders on the status of their requests. • Build understanding of how ServiceNow is used by external customers and internal ITSM Product teams to maintain knowledge of all aspects of ServiceNow Products and Platform and their impact on our ITSM implementation. • Collaborate and partner with ServiceNow Developer/Admins to determine level of effort and ensure objectives/requirements are met. • Where applicable, partner with Product Owners, Tech Leads and Process Owners in analysis of the business requirements document to obtain technical and/or governance input to ensure requests align with established client's ServiceNow standards and practices. • Responsible for delivering robust acceptance criteria that align with defined use-cases, successfully harmonizes with existing processes and helps reduce defects. • Support unit testing of stories, creation of test scripts to validate requirements, and facilitating Demos and User Acceptance Testing with the customer and/or Process Owner to validate development output against customer requirements. Qualifications: Required: • A Bachelor's degree in Computer Science or related technical field and 3+ years of related experience • 2-3 years of working experience as a Business Analyst for ITSM, specifically ServiceNow. This includes a deep understanding of ITIL IT Service Management processes (e.g., Incident, Problem and Change Management, Project and Portfolio Management, Service Catalog, etc.) • Demonstrated skills in data management, problem-solving, and the ability to work collaboratively within a team or independently. • Strong interpersonal skills with a proven track record working with a variety of personalities and styles. • Skilled in establishing connections with people and managing relationships. • Able to cope with pressure, time-sensitive situations and delivering against deadlines. • Possesses an inclination or passion for resolving problems and enhancing operational processes. • Strong oral and written communication skills • Proficient with Microsoft tools including Excel, PowerPoint, Word, Teams, SharePoint • Familiarity with DevOps, Product Model and/or Agile methodologies • Must be able to support US operations during US Mountain/Pacific time up to 6PM. Preferred: • 5+ years of working experience as a Business Analyst for ITSM, specifically ServiceNow • ITIL® Foundation Certifications • ServiceNow Vulnerability Response experience • ServiceNow Multi-Source CMDB/CMDB 360 experience • Working experience in multiple Cloud Solutions (Azure, Google, Oracle, IBM, etc.) • Working knowledge of the Common Service Data Model • Exposure to IT Asset Management processes • Knowledge of application architecture and service delivery modeling",
        "source": "Email",
        "date_posted": "2024-10-02 11:57:33-05:00",
        "unique_id": "1924e2d3646908c8",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]