[
    {
        "company": "Thoughtwave Software and Solutions Inc",
        "job_title": "Business Analyst",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "10 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "PeopleSoft Financials",
                "business analysis",
                "functional/technical documentation",
                "test planning",
                "process improvement"
            ],
            "primary": [
                "system design and development",
                "workflow processes",
                "test plans",
                "user acceptance testing",
                "quality assurance validation"
            ],
            "secondary": [
                "interpersonal skills",
                "communication skills",
                "training materials development",
                "user training"
            ],
            "all": [
                "PeopleSoft Financials",
                "business analysis",
                "functional/technical documentation",
                "test planning",
                "process improvement",
                "system design and development",
                "workflow processes",
                "test plans",
                "user acceptance testing",
                "quality assurance validation",
                "interpersonal skills",
                "communication skills",
                "training materials development",
                "user training"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Priya",
        "email": "priya@thoughtwavesoft.com",
        "jd": "Hi Greetings from Team Thoughtwave Software and Solutions,Please find below the exciting Job opening with our esteem client with details Job description and if you are looking for a new Job opening here is the position and you respond with the latest/updated resume to email priya@thoughtwavesoft.com or feel free reach at 630-812-5138 Role: Business AnalystLocation: Richmond, VA(Hybrid)Duration: 10months ABOUT THE ROLEThe Virginia Dept. of General Services (DGS), Information Systems & Services (ISS) is looking for a Business Analyst with documentation and testing experience in support of PeopleSoft Financials systems.This position is primarily responsible for business analysis, functional/technical documentation and test planning of DGS’ PeopleSoft Financials system utilized by DGS Fiscal Services. This person will work closely with a small team of technical analysts and financial officers as DGS works to streamline both the security and the operations of its PeopleSoft Financials system. The selected candidate in this position will work closely with stakeholders, Fiscal Subject Matter Experts (SMEs), and DGS, Information Systems and Services (ISS) development teams. The Business Analyst will report to the ISS Project manager. This position should expect to work 40 hours per week.Required Experience-Experience in system design and development, with a focus on process improvement and business and technical requirements gathering-Experience with PeopleSoft Financials-Experience documenting workflow processes-Experience developing test plans, use cases, and performing quality assurance validation, user acceptance testing, and regression testing-Experience in the development of training materials and conducting user training-Strong interpersonal and communication skills –The successful candidate should be a self-starter with the ability to drive work to completion.",
        "source": "Email",
        "date_posted": "2024-10-02 19:05:17-05:00",
        "unique_id": "1924fb14fab99b3b",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]