[
    {
        "company": "Hanker Systems Inc.",
        "job_title": "Finance Business Analyst - (Project, Grants, Billing)",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "15 years",
            "degree_required": "Bachelor’s degree in accounting or information systems or equivalent",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Workday Financials",
                "Project module",
                "Grants module",
                "Billing module",
                "Functional requirements"
            ],
            "primary": [
                "Change management",
                "System testing",
                "Analytical skills",
                "Communication skills",
                "Training development"
            ],
            "secondary": [
                "Public Sector experience",
                "Customer service",
                "Quality assurance",
                "Data extraction methods",
                "Industry trends"
            ],
            "all": [
                "Workday Financials",
                "Project module",
                "Grants module",
                "Billing module",
                "Functional requirements",
                "Change management",
                "System testing",
                "Analytical skills",
                "Communication skills",
                "Training development",
                "Public Sector experience",
                "Customer service",
                "Quality assurance",
                "Data extraction methods",
                "Industry trends"
            ],
            "with_experience": [
                "Workday Financials (6+ years)",
                "Project module",
                "Grants module",
                "Billing module"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Raj Kumar",
        "email": "raje@hankersystems.com",
        "jd": "From: Raj, Hanker Systems Inc. raje@hankersystems.com Reply to: raje@hankersystems.com Hello,I trust you're doing great!My name is Raj, and I work as a Recruiter at Hanker Systems. I wanted to get in touch because we have a fantastic job opening with one of our clients that I believe would pique your interest. Role: Finance Business Analyst - (Project, Grants, Billing)Loc: Atlanta, GA 3033412 MonthsIn person Interview OnlyExp: 15 YearsNeed Locals to GA Skills Acted as functional consultant implementing Workday Project module Writes and interprets functional and business requirements as an input to application design. Job Description: Duties & Responsibilities:The State Accounting Office (SAO) is seeking a functional Workday professional with proven experience in several Workday Financial Modules (i.e., Project, Grants & Billing, etc.), with extensive experience working with the Project module, to join our Financial Systems Division. Candidate will work closely with Functional and technical developer teams to implement Workday Financials Project & Grants modules. Experience in Project is a MUST have. Leveraging relevant knowledge of Workday Financials, reporting and budgeting processes as well as related accounting considerations including Software Development Live Cycle (SDLC), the qualified candidate will provide high quality support and leadership for the optimal design and configuration of the system to assure maximum benefit to our customers. This candidate will also be required to work in partnership and independently with the relevant Business Owner organizations and other functional SMEs (as required) to identify and refine business requirements and create the functional design and architecture necessary to support the requirements. It is also expected that this candidate will be familiar with full lifecycle implementation processes and perform all expected functional procedures as required. Finally, personal commitment to serve the customer with excellence, competence, proficiency and courtesy will be essential. While the intent may be a long-term tenure, this position is subject to annual budget restrictions. The initial contract is through the end of this fiscal year and is anticipated to be renewed July 1, 2025. ResponsibilitiesImplements Project, Grants & Billing modules. Analyzes information to determine nature and extent of customer requirements and concerns.Develops and/or executes change management plans for transition to new systems.Consults with implementation partner and technical staff to ensure that functionality of automated system is consistent with adherence to laws, regulations, and best practice standards by users.Tests or coordinates testing of new installations or upgrades.Participates in evaluation of new technologies, enhancements or solutions to improve service and efficiency of systems.Researches and analyzes system/user problems by applying a variety of analytical and research techniques.Participates in the establishment of standards and procedures to be used in the development of systems.Technical CompetenciesAbility to research, analyze information and make recommendations. Ability to determine functional needs and system requirements.Ability to develop solutions based on analysis.Ability to evaluate existing systems and understand their structure and component parts. Ability to prepare models, diagrams and layouts.Ability to document project standards and methodologies.Ability to analyze system and data to determine extent of problem or error. Ability to work with other IT units/staff to diagnose problem.Ability to communicate information to stakeholders and customers.Ability to develop effective and feasible business area solutions. Ability to assist in developing communication plans.Ability to review and interpret installation/upgrade notes. Ability to create testing plans and scripts.Ability to execute test scripts.Ability to develop training courses for target audience. Ability to conduct training sessions.Ability to develop training manuals.Ability to research and stay abreast of technological advances. Ability to act as a liaison between groups.Ability to coordinate between multiple workgroups.Ability to assess/evaluate customer’s needs and business requirements. Ability to conduct quality assessments.Knowledge of naming conventions, encyclopedia management, transactions definitions, general specification definition, programming standards and testing procedures.Knowledge of applications and inter-relationships with programs and/or systems. Knowledge of quality assurance plans.Knowledge of customer needs and business requirements. Knowledge of data extraction methods.Knowledge of current industry trends. Knowledge of operational procedures. Knowledge of the change management process. Ability to adhere to deadlines.Preferred Qualifications:6+ years of hands-on experience with Workday Project, Grants & Billing modulesBachelor’s degree in accounting or information systems or equivalent4+ years of experience in Public SectorPrior experience working with the State of GA Financials systemTranslate business needs into business and functional requirementsConduct application design and architecture component configuration for related modules/business processesWrite and interpret functional and business requirements as an input to application designDevelop and test detailed functional design for business solution components and prototypesComplete tasks in an efficient and timely manner, and reporting progress at least weekly to the implementation Project Manager, Project Sponsor, or designated employeeSeek innovative approaches to improve the process of delivering Workday financial accounting and reporting solutions to customersWillingness to share suggestions and knowledge capital to help optimize the Financial Systems Division’s implementation and project methodologyAbility to develop Workday reportsDemonstrate proficiency in relevant analytical abilitiesDemonstrate ability to communicate clearly and effectively in both oral and written formatsDemonstrate ability to work effectively with functional and technical teamsIf this role aligns with your career goals and interests, I’d love to discuss it further. Please feel free to reach out to me with any questions or to express your interest. Looking forward to hearing from you! Best regards,Raj KumarTechnical RecruiterDesk: +1 813 895 3086Phone: +91 9392569352E-Mail: Raje@Hankersystems.comhttps://www.linkedin.com/in/raj-kumar-eda-b72723222 Hanker Systems Inc. #5401, Tampa, Florida, USA",
        "source": "Email",
        "date_posted": "2024-10-02 11:30:58-05:00",
        "unique_id": "1924e4d2b7560524",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]