[
    {
        "company": "Scalable Systems",
        "job_title": "Business Analyst in Production Support",
        "location": "Seattle, WA, USA",
        "full_location": {
            "city": "Seattle",
            "state": "WA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Strong Analytical Skills",
                "Communication Skills",
                "SLA Management",
                "Problem-Solving Skills",
                "ITIL Knowledge"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Strong Analytical Skills",
                "Communication Skills",
                "SLA Management",
                "Problem-Solving Skills",
                "ITIL Knowledge"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Pradeep Sharma",
        "email": "pradeep.sharma@scalable-systems.com",
        "jd": "From: Pradeep, Scalable Systems pradeep.sharma@scalable-systems.com Reply to: pradeep.sharma@scalable-systems.com Hi,Greetings of the day! I have an urgent requirement below, please go through JD and let me know if you are comfortable or have any profile. Kindly revert me back with your updated resume as well. Job Title: Business Analyst in Production Support Location: Seattle, WA (Work from Office)Duration: Long Term Contract Job Description:Strong Analytical Skills: Ability to analyze production issues, understand business impact, and define requirements for resolution.Communication Skills: Clear and concise communication with stakeholders, technical teams, and business users to manage expectations and keep everyone informed.SLA Management: Understanding of SLAs, incident categorization, and prioritization to ensure timely issue resolution.Problem-Solving Skills: Quick decision-making and problem-solving abilities to prevent SLA breaches.ITIL Knowledge: Familiarity with ITIL (Information Technology Infrastructure Library) best practices, especially in incident and problem management, is often essential.By ensuring that production issues are resolved promptly, communicating effectively with stakeholders, and adhering to SLAs, the Business Analyst ensures smooth operations and minimizes business disruptions. Thanks & Regards, Pradeep SharmaEmail: pradeep.sharma@scalable-systems.com \"Scalable Systems is an Equal Opportunity Employer. We are committed to creating an inclusive environment for all employees and do not discriminate based on race, color, religion, sex, national origin, age, disability, or any other legally protected status.",
        "source": "Email",
        "date_posted": "2024-10-02 06:20:03-05:00",
        "unique_id": "1924cf4c43319c8b",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]