[
    {
        "company": "Intellectt INC",
        "job_title": "Scrum Master",
        "location": "Los Angeles, CA, USA",
        "full_location": {
            "city": "Los Angeles",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "5-7 years",
            "degree_required": "Bachelor's Degree or equivalent education and/or experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6-Month Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Scrum Master",
                "JIRA",
                "Confluence",
                "Agile"
            ],
            "primary": [
                "Strong written and verbal communication skills",
                "Planning sprints",
                "Managing the backlog",
                "Identifying impediments",
                "Creating a collaborative environment"
            ],
            "secondary": [
                "Healthcare insurance payer experience",
                "Project Management",
                "Cross-functional team management",
                "Conflict resolution",
                "Team empowerment"
            ],
            "all": [
                "Scrum Master",
                "JIRA",
                "Confluence",
                "Agile",
                "Strong written and verbal communication skills",
                "Planning sprints",
                "Managing the backlog",
                "Identifying impediments",
                "Creating a collaborative environment",
                "Healthcare insurance payer experience",
                "Project Management",
                "Cross-functional team management",
                "Conflict resolution",
                "Team empowerment"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Bhanu Prakash",
        "email": "bhanuprakash@intellectt.com",
        "jd": "From: Bhanu Prakash, Intellectt bhanuprakash@intellectt.com Reply to: bhanuprakash@intellectt.com Hi,Hope you are doing well,This is Bhanu from Intellectt INC; we have an immediate opportunity with one of our clients. Please find the below job description and if you are interested, please forward your resume to bhanuprakash@intellectt.comRole: Scrum MasterLocation: Los Angeles, CA (Onsite)Duration: 6-Month ContractDescription:The Scrum Master II will provide functional coordination for the PMO and Information Technology (I.T.) Project Managers to deliver technical solutions in the context of an Agile SDLC environment. The Scrum Master II will conduct the daily scrum sessions, sprint planning, sprint grooming, product demonstrations, and retrospective reviews as needed. The Scrum Master II is accountable for providing accurate forecasts and the ongoing management of the team’s workload and progress via the Storyboards. Leads conflict resolution and will drive the team forward to achieve the sprint goals leveraging business and interpersonal experience to remove project roadblocks. The Scrum Master II will need to understand current and planned business practices in each of the domains and create good relationships with the business stakeholders as well as technical staff. The Scrum Master II will be responsible for delivering medium-sized to large-scale projects for the team.Qualifications Required:· Bachelor's Degree.· In lieu of a degree, equivalent education and/or experience may be considered.· At least 5-7 years of Scrum Master experience in a multi-Scrum environment managing projects using JIRA.· At least 5-7 years of Scrum Master experience in a multi-Scrum environment managing projects in cross-functional teams.· At least 1-2 years of Scrum Master experience managing projects using Confluence.· Minimum of 1 year of experience working as a Project Manager.Qualifications Preferred:· Prior healthcare insurance payer experience.· Minimum of 5 years of Scrum experience working in a mixed AGILE and traditional I.T. environment.Skills Required:· Strong written and verbal communication skills.· Assist in planning sprints and managing the backlog. Ensure that user stories and tasks are well-defined and prioritized.· Leading by example and focusing on the needs of the team, empowering them to take ownership of their work and make decisions.· Ensure that all tasks and deliverables are completed accurately and on time.· Track the progress of release schedules and generate weekly project status reports. Ensure transparency of work and progress within the team.· Identifying impediments and finding effective solutions to remove obstacles that hinder the team's progress.· Ability to identify issues and implement effective solutions to keep the project on track.· Ability to create a collaborative environment and shape team behaviour through the Agile process.· Must possess the ability to explain succinctly intricate and complicated concepts and ideas.· Must possess the ability to work well with many kinds of people, departments, and divisions.",
        "source": "Email",
        "date_posted": "2024-10-02 09:06:24-05:00",
        "unique_id": "1924d8d8fee9acab",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Scrum Master"
    }
]