[
    {
        "company": "DBHDS (Virginia Department of Behavioural Health and Developmental Services)",
        "job_title": "DBHDS - BA4 - Enterprise Data Warehouse Project",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "748131",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$60 - $65 Per Hr, C2C Or 1099"
        },
        "skills": {
            "core": [
                "SQL querying",
                "data analysis",
                "reporting",
                "business intelligence"
            ],
            "primary": [
                "excellent communication skills",
                "stakeholder management",
                "data governance",
                "quality assurance"
            ],
            "secondary": [
                "cloud architecture",
                "Master Person Identifier (MPI)",
                "data dictionaries",
                "process streamlining"
            ],
            "all": [
                "SQL querying",
                "data analysis",
                "reporting",
                "business intelligence",
                "excellent communication skills",
                "stakeholder management",
                "data governance",
                "quality assurance",
                "cloud architecture",
                "Master Person Identifier (MPI)",
                "data dictionaries",
                "process streamlining"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Hitesh",
        "email": "hitesh@cyber-resource.com",
        "jd": "From: Hitesh, cyber-resource hitesh@cyber-resource.com Reply to: hitesh@cyber-resource.com Role : DBHDS - BA4 - Enterprise Data Warehouse Project (748131)Job Id : 748131Positions : 1Location: 1220 Bank StreetDUE : 10/04Work Mode: HybridInterview: Both Web Cam and In Person InterviewClient: DBHDS (Virginia Department of Behavioural Health and Developmental Services)Client State: VirginiaRate Range : $60 - $65 Per Hr, C2C Or 1099 (for the Right candidate we will go for little bit higher) Pls note: Local candidates preferred. Mgr requests that IN PERSON interviews be conducted if candidate is within 100 miles of RVA (or within 2 hour drive) of Richmond. If outside this driving distance then they will consider virtual, or web based IV if needed. 2 Days ON SITE Required each week No Exceptions). Local candidates preferred. Parking is not provided for contractors Senior Business Analyst will support DBHDS' project to design and implement a new Enterprise Data Warehouse (EDW) and data exchange. Short Description: DBHDS – Sr Business Analyst is needed to work with stakeholders and vendor team to ensure that business and technical requirements are gathered and delivered for the Data Exchange and Modernization Program. This project will replace the existing data warehouse with a new cloud architecture, integrate with a variety of source systems, and implement a Master Person Identifier (MPI) to link individuals across data sources. Report requirements will also need to be documented. FULL JOB DESCRIPTIONThis role will coordinate extensively with internal and external stakeholders to gather and document business and technical requirements, analyze business needs, and analyze and document the data to be ingested into the new data platform. Activities include: Creating data dictionaries with input from data stewards; meeting with stakeholders to document report requirements; working with the business and IT to understand and document current business processes and identifying opportunities to streamline processes and reporting. This position will also oversee quality assurance processes to ensure that the delivered solutions meet business requirements and adhere to data governance and security standards. This role requires an experienced analyst who is skilled in listening, understanding, and communicating with business and technical stakeholders. SQL querying skills and experience with data analysis, reporting and business intelligence is required. Excellent communication skills and the ability to take initiative and ownership over their work is a must.",
        "source": "Email",
        "date_posted": "2024-10-02 11:05:38-05:00",
        "unique_id": "1924dfdc40fe67c6",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]