[
    {
        "company": "Stellar IT Solutions",
        "job_title": "Senior Business Analyst",
        "location": "Baltimore, MD, USA",
        "full_location": {
            "city": "Baltimore City",
            "state": "MD",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "F50B0600045-34",
            "experience_required": "Proven experience as an EHR Business Analyst in a healthcare setting.",
            "degree_required": "Bachelor’s degree in healthcare management, information technology, or related field (master’s degree preferred).",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 months with option to renew",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "EHR system requirements gathering",
                "Clinical workflow analysis",
                "EHR software procurement",
                "Compliance with healthcare regulations",
                "EHR system customization"
            ],
            "primary": [
                "Healthcare operations knowledge",
                "Patient record management",
                "Testing coordination",
                "Training program development",
                "Stakeholder communication"
            ],
            "secondary": [
                "ITIL Certification",
                "Electronic Health Record specific certifications"
            ],
            "all": [
                "EHR system requirements gathering",
                "Clinical workflow analysis",
                "EHR software procurement",
                "Compliance with healthcare regulations",
                "EHR system customization",
                "Healthcare operations knowledge",
                "Patient record management",
                "Testing coordination",
                "Training program development",
                "Stakeholder communication",
                "ITIL Certification",
                "Electronic Health Record specific certifications"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Arpitha S",
        "email": "arpithas@stellarit.com",
        "jd": "From: Arpitha S, Stellar IT Solutions arpithas@stellarit.com Reply to: arpithas@stellarit.com Position: Senior Business Analyst (F50B0600045-34)Location: Baltimore City MDOnsite/Remote: Hybrid with 40% onsite requirement in Baltimore City, designated MDH facility. At least 2 days per week onsite is required.Onsite attendance may also be required during system rollout out activities in addition to the monthly requirement.May require travel to other offices as needed.Duration: 12 months with option to renew.Job Description:The MDH Office of Enterprise Technology is in need of the following resources to assist in driving multiple Major IT Development Projects over the next few years. These individuals will be deployed to support the implementation efforts needed to complete current state assessments and workflow documentation to ensure that business operations are clearly understood. These resources will play a critical role in supporting the MDH business teams, facility project teams, and other external stakeholders by leveraging their subject matter expertise to drive best practices and ensure requirements are implemented to fulfill the business need. MDH is embarking on various modernization projects including but not limited to the implementation of an Electronic Health Records (EHR) system, Bed Registry, Electronic Licensing systems, just to name a few.Our technology landscape is complex and there are many interdependencies that may require resources to work cross-functionally across multiple projects and/or business units. Resources will typically be assigned to a core project team, however, based on workload, allocation, and specialization, work on multiple projects may be required.We are seeking an experienced Electronic Health Records (EHR) Business Analyst to join our healthcare team. In this role, you will be responsible for facilitating the successful implementation and ongoing optimization of our electronic health record system. You will work closely with healthcare professionals, IT teams, and other stakeholders to ensure our EHR system meets the needs of our organization and complies with healthcare regulations.Duties/ Responsibilities:Collaborate with healthcare providers and staff to gather and document EHR system requirements.Evaluate existing EHR systems and workflows to identify areas for improvement and customization.Assist in the selection and procurement of EHR software, considering factors like cost, features, and vendor reputation.Analyze and optimize clinical workflows to enhance efficiency and patient care.Manage and maintain the accuracy, integrity, and security of patient records within the HER system.Customize the EHR system to meet the unique needs of our organization, working closely with software developers.Ensure the EHR system complies with healthcare regulations, including HIPAA, and address compliance issues.Coordinate and oversee testing, including identifying and resolving issues or bugs in the system.Develop training programs and support materials to help healthcare staff effectively use the EHR system.Provide ongoing support and troubleshooting for EHR system users.Maintain comprehensive documentation of system requirements, customizations, and configurations.Communicate effectively with both technical and non-technical stakeholders, bridging the gap between healthcare and IT teams.Education:Bachelor’s degree in healthcare management, information technology, or related field (master’s degree preferred).General Experience:Proven experience as an EHR Business Analyst in a healthcare setting.In-depth knowledge of healthcare operations, regulations, and electronic health record systems.Specialized Experience:ITIL Certification demonstrating in depth experience in information technology service delivery.Electronic Health Record specific certifications, this can include but is not limited to solution specific certifications (i.e. Pharmacy, Core/Locations, Revenue Cycle, etc.). Regards, Arpitha STechnical Recruiter Email: arpithas@stellarit.comRockville, MD | McLean, VA | Palo Alto, CAStellarIT.com | StellariDeaLabs.comCandidates chosen for an interview will meet the Education, General Experience, and Special Experience requirements.",
        "source": "Email",
        "date_posted": "2024-10-02 11:37:06-05:00",
        "unique_id": "1924e43a9dcc079d",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]