[
    {
        "company": "ZealHire",
        "job_title": "Project Manager on Project Catalyst",
        "location": "Miramar, FL, USA",
        "full_location": {
            "city": "Miramar",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Bachelor's Degree",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "ERP Implementation"
            ],
            "primary": [
                "Leadership",
                "Communication",
                "Problem-solving",
                "Project Management Tools",
                "Methodologies"
            ],
            "secondary": [],
            "all": [
                "Project Management",
                "ERP Implementation",
                "Leadership",
                "Communication",
                "Problem-solving",
                "Project Management Tools",
                "Methodologies"
            ],
            "with_experience": [
                "Project Management (5+ years)",
                "ERP Implementation (3+ years)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Rajeev Kumar",
        "email": "rajeeve@zealhire.com",
        "jd": "Hello, My name is Rajeev Kumar and I am a Staffing Specialist at ZealHire. I am reaching out to you on an exciting job opportunity with one of our clients. Job Title - Project Manager on Project CatalystLocation - Miramar, FL USC/GC local to MiramarDuration – 6+ MonthsNote - USC/GC, need LinkedIn, VISA & DL. Local to Miramar or within 70 milesJob Description: Job DescriptionProject Manager on Project Catalyst.Required SkillsProject Management Skills for managing large ERP implementation.Required EducationBachelors Degree Job Description: We are seeking a seasoned Project Manager to join our team and lead the implementation of Project Catalyst, a large-scale ERP system. The ideal candidate will have a strong background in project management, specifically managing large ERP implementations, and will be responsible for overseeing the project from initiation through completion. This role involves coordinating across multiple teams, managing project timelines, ensuring resource allocation, and delivering the project within scope and budget.Key Responsibilities:planning, execution, and closing of the ERP implementation for Project Catalyst.Manage project timelines, milestones, and deliverables.Collaborate with cross-functional teams including IT, business units, and external vendors.Ensure projects are delivered on time, within scope, and within budget.Proactively identify and manage project risks and issues.Report on project progress to stakeholders and executives.Ensure compliance with all relevant project management standards and practices.Required Skills:Strong project management skills with a focus on large ERP implementation.Ability to manage multiple tasks and projects simultaneously.Excellent leadership, communication, and problem-solving skills.Proficiency in project management tools and methodologies.Education:Bachelor's Degree in Business, Information Technology, or a related field.Experience:5+ years of experience in project management, with at least 3 years managing ERP implementations.Eligibility:Must be a U.S. Citizen or Green Card holder.Candidates must be local to Miramar, FL, or within 70 miles.",
        "source": "Email",
        "date_posted": "2024-10-02 13:04:50-05:00",
        "unique_id": "1924e675425dcf48",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]