[
    {
        "company": "Source Infotech Inc",
        "job_title": "Business Analyst",
        "location": "Chicago, IL, USA",
        "full_location": {
            "city": "Chicago",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Bachelor's degree in Computer Science, Information Technology, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Agile methodologies",
                "Communication skills",
                "Technical acumen",
                "Financial services background",
                "Foreign exchange experience"
            ],
            "primary": [
                "Scrum Master experience",
                "Data management concepts",
                "Azure DevOps (ADO)",
                "Confluence",
                "Problem-solving skills"
            ],
            "secondary": [
                "Leadership",
                "Stakeholder management",
                "Continuous learning",
                "Process improvements"
            ],
            "all": [
                "Agile methodologies",
                "Communication skills",
                "Technical acumen",
                "Financial services background",
                "Foreign exchange experience",
                "Scrum Master experience",
                "Data management concepts",
                "Azure DevOps (ADO)",
                "Confluence",
                "Problem-solving skills",
                "Leadership",
                "Stakeholder management",
                "Continuous learning",
                "Process improvements"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Abhisek Kumar",
        "email": "abhisek.k@sourceinfotech.com",
        "jd": "From: abhisek, source infotech inc abhisek.k@sourceinfotech.com Reply to: abhisek.k@sourceinfotech.com Job Title Business Analyst Duration 6 Months Location Chicago, Illinois- onsite- need locals Work Authorization GC, US Citizen Interview Mode Video Job Description Hybrid role - 3 days weekly in office. Candidates needs to be local to Chicago. Additionally, they will need to have financial services background and foreign exchange experience. Must share LinkedIn Url Visa copy and DL. JOB SUMMARY FOR BUSINESS ANALYST: § We are seeking a highly skilled Business Analyst to lead and facilitate agile processes across two key technology teams within our FX Front Office technology group. One team is focused on Data Modernization initiatives, while the other is dedicated to upgrading our Position Management System. The idea candidate will have a strong background in agile methodologies, excellent communication skills to engage with both internal teams and external vendors, and the technical acumen to dive into the details and remove blockers to ensure team success. RESPONSIBILITIES FOR BUSINESS ANALYST: § Lead daily stand-ups, sprint planning, retrospectives, and other agile ceremonies for both the Data Modernization and Position Management System teams. § Ensure adherence to agile principles and practices, and coach teams to continuously improve performance and efficiency. § Serve as the primary point of contact for cross-team communication, ensuring alignment between agile teams, auxiliary groups, and enterprise-wide initiatives. § Facilitate communication with external vendors, ensuring that requirements are clearly understood and deliverables are met. § Work closely with teams to understand the technical aspects of their projects and collaborate with enterprise teams to resolve blockers. § Collaborate with Product Owners, Project Managers, and other stakeholders to ensure that team deliverables align with business objectives. § Provide regular updates to leadership on team progress, highlighting risks, dependencies, and accomplishments. § Identify and implement process improvements to enhance team agility, productivity, and overall effectiveness. § Promote a culture of continuous learning and adaptation within the teams. REQUIRED EXPERIENCE FOR BUSINESS ANALYST: § Education: Bachelor's degree in Computer Science, Information Technology, or a related field. § Experience: 5+ years of experience as a Scrum Master or Business Analyst in a technology-driven environment, preferably within the financial services industry. § Financial Knowledge: Understanding of front office trading, ideally FX (Foreign Exchange), and data management concepts. SKILLS AND QUALIFICATIONS FOR BUSINESS ANALYST: § Proven experience leading agile processes in complex, multi-team environments. § Demonstrated ability to manage relationships with external vendors and stakeholders at various levels. § Strong technical proficiency in software development processes and methodologies. § Experience with agile tools such as Azure DevOps (ADO) and Confluence. § Excellent communication and interpersonal skills, with the ability to influence and engage stakeholders at all levels. § Strong problem-solving skills with the ability to remove blockers and drive team success.",
        "source": "Email",
        "date_posted": "2024-10-02 13:03:01-05:00",
        "unique_id": "1924e65bd7961069",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]