[
    {
        "company": "Stellar Consulting Solutions LLC",
        "job_title": "IT PM Manufacturing Operations",
        "location": "Irvine, CA, USA",
        "full_location": {
            "city": "Irvine",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Bachelor’s degree in computer science, Information Technology, or a related field; advanced degree preferred.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6-12 Month",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Microsoft Office",
                "IT Program Management",
                "Communication"
            ],
            "primary": [
                "PMP Certification",
                "MS Project",
                "Leadership",
                "Stakeholder Management"
            ],
            "secondary": [
                "Resource Management",
                "Risk Management",
                "Budget Management",
                "Cross-functional Team Leadership",
                "Documentation"
            ],
            "all": [
                "Project Management",
                "Microsoft Office",
                "IT Program Management",
                "Communication",
                "PMP Certification",
                "MS Project",
                "Leadership",
                "Stakeholder Management",
                "Resource Management",
                "Risk Management",
                "Budget Management",
                "Cross-functional Team Leadership",
                "Documentation"
            ],
            "with_experience": [
                "Project Management (10+ years)",
                "Leadership",
                "Stakeholder Management"
            ]
        },
        "job_type": [],
        "contact_person": "Deepika Dua",
        "email": "deepika.dua@stellarconsulting.com",
        "jd": "From: Deepika Dua, Stellar Consulting Solutions LLC deepika.dua@stellarconsulting.com Reply to: deepika.dua@stellarconsulting.com HiMy name is Deepika & I am a recruiter at Stellar Consulting, and I came across your profile while looking for qualified candidates for IT PM Manufacturing Operations role. I was impressed by your experience and skills . I think you would be a great fit for this role, as you have almost all the skills & experience required for the role. Below are the job details for your reference. Job Title : IT PM Manufacturing OperationsLocation : Irvine/Brea/Ontario CADuration : 6-12 Month Job Description:Key Responsibilities: • Create project charters and project plan along with resource loading so that it provides view on resource mapping at a task level.• Bring in expertise and leading practices to create project document templates.• Develop and execute comprehensive program plans, and budgets for initiatives focused on manufacturing, distribution, and ordering functions.• Lead cross-functional teams consisting of developers, business analysts, and subject matter experts to ensure successful delivery of projects within scope, schedule, and budget.• Define project objectives, requirements, and deliverables in collaboration with stakeholders, including manufacturing, supply chain, and operations teams.• Manage and prioritize multiple projects concurrently, monitoring project progress, dependencies, risks, issues, and action items; proactively identify and mitigate potential roadblocks to ensure successful project outcomes.• Establish and maintain strong relationships with internal stakeholders and external vendors/partners.• Manage to PM Operating Model (meetings, status reporting).• Maintain up-to-date project documentation in the PMO departmental repository and in ServiceNow.• Adheres to the PMO defined processes, methodologies, and minimum required documentation.• Identifies resources needed • Manages day-to-day operational aspects of a project and scope• Reviews deliverables prepared by team for quality assurance• Minimizes exposure and risk on project• Tracks and reports team hours and expenses on a weekly basis\"Required Skills and Qualifications:• Bachelor’s degree in computer science, Information Technology, or a related field; advanced degree preferred.• Extensive experience (10+ years) managing IT programs/projects.• Proven track record of leading complex implementation projects from inception to completion.• Executive presence leading meetings and strategic discussions with Executive and Senior leadership teams, presentations to large groups of all levels (C-Level to staff)• Effective written and verbal communications.• Ability to work independently and collaboratively in a team environment including project team members, external vendors, consultants, etc.• Proficient use of Microsoft Office products (Outlook, Word, Excel, PowerPoint)• Project Management Professional (PMP) certification preferred. Experience with Project Management tools such as MS Project.",
        "source": "Email",
        "date_posted": "2024-10-02 15:59:15-05:00",
        "unique_id": "1924f06fe0b1f955",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]