[
    {
        "company": "Heliogic LLC",
        "job_title": "Lead Java Developer (Only Local)",
        "location": "Cincinnati, OH, USA",
        "full_location": {
            "city": "Cincinnati",
            "state": "OH",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "12+ years",
            "degree_required": "Bachelor’s degree in computer science, Engineering, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Technical Leadership"
            ],
            "primary": [
                "Application Development"
            ],
            "secondary": [
                "Hadoop",
                "MapReduce",
                "Cloudera",
                "Hive",
                "Spark"
            ],
            "all": [
                "Java",
                "Technical Leadership",
                "Application Development",
                "Hadoop",
                "MapReduce",
                "Cloudera",
                "Hive",
                "Spark"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Ben",
        "email": "ben@heliogic.com",
        "jd": "From: Ben, Heliogic LLC ben@heliogic.com Reply to: ben@heliogic.com Job Title: Lead Java Developer (Only Local) Location: Cincinnati, OH, USA (5day Onsite in a week) Experience: 12+ year TECHNICAL SKILLS Must Have Application Dev. Technical Leadership Job Description: We are seeking an experienced **Backend Services Developer IV** with **5-10 years of Technical Lead experience** to join our Agile Development team. The successful candidate will work in a multi-disciplinary team, contributing to the design, development, and maintenance of software solutions for our organization’s analytical platforms. Key Responsibilities: Design and develop software within an Agile team environment. Collaborate with internal and external teams to gather requirements, understand user issues, and design solutions that translate into high-quality code. Prepare design specifications, process flows, data models, user interface designs, prototypes, use cases, and deployment plans. Create and maintain system documentation and provide product demonstrations when needed. Support the entire software development lifecycle, including updates, bug fixes, and deployment. Qualifications: Education: Bachelor’s degree in computer science, Engineering, or a related field. Experience: Familiarity with cloud architectures and big data technologies such as **Hadoop, MapReduce, Cloudera, Hive, Spark**, Experience supporting intelligence community disciplines is preferred.",
        "source": "Email",
        "date_posted": "2024-10-02 12:02:47-05:00",
        "unique_id": "1924ea6a21f1eab4",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]