[
    {
        "company": "RohaTech",
        "job_title": "Java Developer",
        "location": "New York, NY, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "6+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Only H1 visas accepted or Dependent visas NO GC or GC EAD",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$53-$55/hour"
        },
        "skills": {
            "core": [
                "Java 8",
                "Java 11",
                "Spring Boot",
                "Microservices",
                "REST APIs"
            ],
            "primary": [
                "AWS",
                "CI/CD",
                "Agile"
            ],
            "secondary": [],
            "all": [
                "Java 8",
                "Java 11",
                "Spring Boot",
                "Microservices",
                "REST APIs",
                "AWS",
                "CI/CD",
                "Agile"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Ravikanth",
        "email": "ravi@rohatech.com",
        "jd": "From: Ravikanth, Roha Technologies LLC ravi@rohatech.com Reply to: ravi@rohatech.com I hope this email finds you well.My name is Ravikanth , and I am reaching out to share an exciting job opportunity at RohaTech. We are currently looking for a skilled Java Developer to join our team in Phoenix AZ OR New York .If you or someone you know possesses the required skills and is interested in this opportunity, please feel free to reach out to me at ravi@rohatech.com for further details.About Us:Rohatech LLC is a leading Recruitment company specializing in Technical and Functional Roles . We are at the forefront of innovation, constantly striving to improve our technology stack and provide exceptional solutions to our clients. POSITION : Java Developer - American Express (Day 1 Onsite, New York)🚀 Exciting Opportunity! Java Developer Wanted 🚀🔹 Client: American Express Through Intraedge 🔹 Location: New York, NY (Day 1 Onsite) AND Phoenix, AZ 🔹 Experience: 6+ years🔹 Skills: Java 8/11, Spring Boot, Microservices, REST APIs, AWS, CI/CD, Agile🔹 Employment Type: Full-time, Day 1 Onsite (Max PayRate : 53-55$)Only Hl visas accepeted or Dependent visas NO GC or GC EAD We're seeking an experienced Java Developer to join the American Express team in New York! If you have strong experience in Java, Spring Boot, and Microservices, and are excited about building scalable solutions in a dynamic environment, this could be the perfect fit for you.What You’ll Do:Design and develop high-quality applicationsCollaborate with cross-functional teamsImplement cloud-based solutionsEnsure code quality with unit tests and TDD/BDD practicesWhy Join Us?Be part of a world-class team at AmexEngage in exciting projects in a fast-paced environmentCompetitive salary and benefits📧 Apply today by sharing your updated resume at Ravi@rohatech.com Reach ME at Below +91-7036012291 WhatsApp Me Let's build something amazing together!",
        "source": "Email",
        "date_posted": "2024-10-02 09:48:51-05:00",
        "unique_id": "1924db54e83eda38",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]