[
    {
        "company": "Capgemini",
        "job_title": "DMT Product Manager / BA",
        "location": "Alpharetta, NY, USA",
        "full_location": {
            "city": "Alpharetta",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "5-10 years",
            "degree_required": "Bachelor's Degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Digital Marketing",
                "Adobe Workfront",
                "Vendor Management",
                "Product Management",
                "Business Analysis"
            ],
            "primary": [
                "Project Management",
                "SDLC",
                "Agile",
                "Scrum",
                "Microsoft Office"
            ],
            "secondary": [
                "Adobe's Marketing Cloud",
                "Interactive Marketing Initiatives",
                "Financial Services",
                "JIRA",
                "Qualtrics"
            ],
            "all": [
                "Digital Marketing",
                "Adobe Workfront",
                "Vendor Management",
                "Product Management",
                "Business Analysis",
                "Project Management",
                "SDLC",
                "Agile",
                "Scrum",
                "Microsoft Office",
                "Adobe's Marketing Cloud",
                "Interactive Marketing Initiatives",
                "Financial Services",
                "JIRA",
                "Qualtrics"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Santhoshi",
        "email": "santhoshi@hanstaffing.com",
        "jd": "From: Santhoshi, HAN IT Staffing santhoshi@hanstaffing.com Reply to: santhoshi@hanstaffing.com Role Name: DMT Product Manager / BA - OnsiteLocation: NY/AlpharettaClient : CapgeminiJOB DESCRIPTION:Role: Digital Marketing Technology Product Manager / Business AnalystLocation: North America Position Description: Clients Wealth Management Digital Marketing technology team is responsible for developing and supporting the Wealth Management organization's MarTech and software strategy. We are seeking a Digital Marketing Product Manager/Business Analyst to help support several of our key functions including Adobe Workfront implementations, vendor management across other digital marketing applications such as Qualtrics, Seismic, Yext, etc., IT system owner support tasks such as management of security reviews, entitlement management, hygiene, and contract renewals. Knowledge of Adobe Workfront and strong multi-tasking skills is a must. Solid communication skills, written and verbal. Ability to work seamlessly across marketing, engineering, development, and support teams. Responsibilities: This is a mid-level position for a highly analytical, self-motivated individual who will be working closely with Clients Digital Marketing group on the following:- Configure Adobe Workfront based on business requirements and work closely with Adobe Fusion developer(s) to implement workflow automations for new and existing workflows.- Facilitate Security Architecture reviews for new applications being onboarded- Manage application hygiene reviews and updates- Assist in contract renewals for vendor applications working with business owners, Sourcing, and Legal.- Troubleshoot application issues through analysis and escalation to internal technology or vendor support teams.- Manage application decommissions- Recommend digital marketing solutions based upon business problem statements and gaps- Work with stakeholders to prioritize projects and enhancements, as well as write strong business cases for senior management- Convey business requirements to technical staff Skills Required:- 5+ years of experience in Digital Marketing- Experience with Adobe Workfront- Solid vendor and relationship management skills- 5-10 years of experience in product management, project management, and business analysis- Fluent in digital marketing terminology- Strong understanding of SDLC- Ability to manage a project from start to finish and on-time- Highly organized and able to work on multiple projects/clients simultaneously- Experience in Agile and Scrum methodologies- Polished and confident communication and presentation skills (verbal and written) with an emphasis on client-facing situations- Proficient in Microsoft Office (Microsoft Word, Excel, PowerPoint, SharePoint, Visio)- Results driven, self-motivated, self-starter Skills Desired:- Subject matter expert in Adobe's Marketing Cloud and product integration, especially around content management, analytics, segmentation, and targeting- -Knowledge of interactive marketing initiatives and terminology (Paid Search, SEO, Affiliate, Comparison Shopping Engines, Email)- Experience in Financial Services- Experience using JIRA- Experience with Qualtrics Education Bachelor's Degree",
        "source": "Email",
        "date_posted": "2024-10-02 14:40:47-05:00",
        "unique_id": "1924ebf2b3ad2484",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]