[
    {
        "company": "Msysinc",
        "job_title": ".Net Lead/Architect - Mostly Remote",
        "location": "Harrisburg, PA, USA",
        "full_location": {
            "city": "Harrisburg",
            "state": "PA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "10 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".NET",
                "Microsoft SQL",
                "Azure Cloud",
                "DevSecOps",
                "Agile"
            ],
            "primary": [
                "C#",
                "JavaScript",
                "T-SQL",
                "Unit Testing",
                "Accessibility Standards"
            ],
            "secondary": [
                "Mentoring",
                "Technical Documentation",
                "Project Management",
                "Cross-Platform Solutions",
                "Performance Tuning"
            ],
            "all": [
                ".NET",
                "Microsoft SQL",
                "Azure Cloud",
                "DevSecOps",
                "Agile",
                "C#",
                "JavaScript",
                "T-SQL",
                "Unit Testing",
                "Accessibility Standards",
                "Mentoring",
                "Technical Documentation",
                "Project Management",
                "Cross-Platform Solutions",
                "Performance Tuning"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "saikiran",
        "email": "resume@msysinc.com",
        "jd": "From: saikiran, Msysinc resume@msysinc.com Reply to: resume@msysinc.com Title: .Net Lead/Architect - Mostly RemoteLocation: Harrisburg, PA, United StatesLength: Long termRestriction: W2 or C2CSend resume to: resume@msysinc.com , saikiran@msysinc.com Description:*** Very long term project Long term usually goes for 3+ years *** *** Mostly Remote *** ***** This position will be full time telework with the caveat that there will be occasions that on site meetings, JAD sessions and other collaboration needs could be mandatory. ***The individual is required to pick up commonwealth issued equipment the first day.******The method of interview is Round 1 virtual via Teams, then Round 2 inperson .***Short Description:This is a position as a Functional Application Architect for Azure Cloud, .NET and Microsoft SQL supporting Transportation lines of business, specifically Public Transit problem domains.Position Description:This is a position as a Functional Architect supporting Transportation lines of business, specifically Public Transit problem domains. The selected candidate will work with the agencys development team to engineer applications hosted on a standardized platform of Azure Cloud implementing .NET, front end frameworks, SQL Server, and SSRS. The ideal candidate would have experience in DevSecOps practices with a focus on reduced total cost of ownership and future ease of maintenance. Key deliverables will be cross platform solutions that meet customer requirements for security, accessibility, and functionality.This position will oversee all phases of application development including design, coding/configuration, testing, implementation, and documentation. Activities to support this work include analyzing and documenting requirements, producing solution prototypes, and participating in technology selection. This position is responsible for tracking and communicating project constraints including, risks, time, resources, and scope.This team lead position is responsible for mentoring all levels of applications developers in the design, development, assembly, testing, and deployment of highly complex software systems used to support enterprise products and services.Specific Duties:Design, develop, test, implement and document software solutions to meet business requirementsReview and recommend technical frameworks, technologies, and implementation patternsDevelop and participate in creating detailed project documentation, including plans, design specifications, roadmaps, models, and technical interfaceResearch and consume enterprise services for areas such as identity and access management, content management, and GISCollaborate with other technical teams to deliver services and solutionsParticipate in development and implementation of holistic user management methodology for Public Transit business areaImplement unit testing methodologies such as NUnit or MSTestDevelop and implement data migration plansDevelop performance KPIs for solutions and implement tuning to support application and business needsAnalyze and write .NET C#, JavaScript, T SQL, and other full stack technologies that are recommended to implement the project deliverablesUtilize configuration management tools, design tools, debugging tools, and any other environment specific tools necessary to create, test, and implement an applicationBuild digital products with accessibility in mindIncorporate accessibility features into digital content and resourcesPartner with colleagues and team members to prioritize accessibility in digital content and resourcesDevelop capacity plans to implement technical solutions for project deliverablesAdvise and participate in selection criteria development and candidate interviews for proposed team buildoutsManages and directs application team tasking to complete project deliverablesImplement and participate in code review practices for application teams project solutionsResearch and provide mentoring resources to project team on technologies to meet project needsProvide regular status reports on assigned work to COPA teamRequired Skills:Experience full stack programming using .NET technologies. 10 YearsExperience developing and supporting Microsoft SQL technologies 10 YearsExperience using DevSecOps/Agile practices 5 YearsExperience developing & designing solutions hosted in Azure Cloud. 5 YearsExperience architecting, developing & designing complex enterprise systems to meet business requirements 5 YearsExperience mentoring & leading technical teams. 5 YearsStrong oral and written communication skillsExperience with unit test development, testing, and implementation in SDLC. 5 YearsExperience building digital products where compliance with accessibility standards is part of definition of done. 2 Years",
        "source": "Email",
        "date_posted": "2024-10-02 15:49:27-05:00",
        "unique_id": "1924f8fe843ae8c5",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]