[
    {
        "company": "Kovan Technology Solutions",
        "job_title": "Senior Project Manager",
        "location": "Houston, TX, USA",
        "full_location": {
            "city": "Houston",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "15+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "PM certifications",
                "Scrum certifications",
                "Agile methodologies"
            ],
            "primary": [
                "Project management",
                "Stakeholder management",
                "Risk management",
                "Communication"
            ],
            "secondary": [
                "Team leadership",
                "Planning",
                "Monitoring",
                "Scope management",
                "Budget management"
            ],
            "all": [
                "PM certifications",
                "Scrum certifications",
                "Agile methodologies",
                "Project management",
                "Stakeholder management",
                "Risk management",
                "Communication",
                "Team leadership",
                "Planning",
                "Monitoring",
                "Scope management",
                "Budget management"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Jenifer A.",
        "email": "jenifer.a@kovantech.com",
        "jd": "From: Jenifer.A, Kovan Technology Solutions jenifer.a@kovantech.com Reply to: jenifer.a@kovantech.com Hi Professional, Hope you are safe and good, Please find the below JD and share the suitable profiles Role Job Title : Senior Project Manager - Need 15+ YearsLocation: Houston, TX or Chicago, IL (Hybrid) - Local candidates OnlyDuration: ContractCertifications: PM and scrum agile certifications are required Job description:Management of the migration ensuring it’s delivered based on the business outcomes. This also includes leading the teams (i.e. squads and pods, etc.) to deliver this migrationPlanning (i.e. PI, sprint, etc.), accessing and monitoring should also include the application of agile values, principles and mindsets where applicableProactively manage constraints, stakeholders, interdependencies, risks and conflicting priorities to deliver the migration program Provide advice and guidance to the product pods taking an integrated view of products that cross team and domain boundaries to simplify delivery, improve efficiency and promote reuse of existing solutionsManage trade-offs in support of creating balance between project/product scope, budget (i.e. keeping into consideration due to scope or timeline changes) and time for the program migrationAgree and align the program scope with Product Manager, customers, senior management and stakeholders priorities. Ensure aligned scope is maintained, avoiding scope creep, adapting scope where suitable and beneficial throughout the Fleet program migrationProvide transparent communication (i.e. via ADO daily stand-ups, WPR forms, etc.) between product pods, various squads and stakeholders up to the executive level throughout the product lifecycle specifically for Fleet program migration Thanks & Regards, Jenifer🕵️‍♀️ Senior Recruiter Kovan Technology Solutions Certified Minority Business Enterprise (MBE) ✉ Email : Jenifer.A@kovantech.com |🌐 www.kovantech.com🔗 Linkedin - Connect with me on LinkedIn for a quick response! Bridge the gapThis email and any attached files (\"Message\") may contain confidential and/or privileged information. It is intended solely for the addressee(s). If you receive this Message in error, inform the sender by reply email, delete the Message and destroy any printed copy.Any unauthorized use, distribution, or copying of this Message or any part thereof is prohibited. Emails are susceptible to alteration. Neither KovanTech nor any of its affiliates shall be liable for the Message if altered or falsified nor shall they be liable for any damage caused by any virus that might be transmitted with this Message.",
        "source": "Email",
        "date_posted": "2024-10-02 15:37:26-05:00",
        "unique_id": "1924ef3049d04f06",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]