[
    {
        "company": "Vyze Inc",
        "job_title": "Program Manager",
        "location": "Austin, TX, USA",
        "full_location": {
            "city": "Austin",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Minimum 3 years of Program Management experience, specifically managing large-scale and complex programs.",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 months (with possible extensions)",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Program Management",
                "Project Management",
                "Legal operations",
                "Security",
                "Apple-based tools"
            ],
            "primary": [
                "Communication skills",
                "Leadership skills",
                "Problem-solving skills",
                "Decision-making skills",
                "Interpersonal skills"
            ],
            "secondary": [
                "Mac-based tools",
                "Collaboration",
                "Attention to detail",
                "Proactive attitude"
            ],
            "all": [
                "Program Management",
                "Project Management",
                "Legal operations",
                "Security",
                "Apple-based tools",
                "Communication skills",
                "Leadership skills",
                "Problem-solving skills",
                "Decision-making skills",
                "Interpersonal skills",
                "Mac-based tools",
                "Collaboration",
                "Attention to detail",
                "Proactive attitude"
            ],
            "with_experience": [
                "Program Management (3+ years)",
                "Project Management (10+ years)",
                "Legal operations",
                "Security"
            ]
        },
        "job_type": [
            "hybrid",
            "onsite"
        ],
        "contact_person": "Sanjay",
        "email": "sanjay@vyzeinc.com",
        "jd": "From: Sanjay, Vyze Inc sanjay@vyzeinc.com Reply to: sanjay@vyzeinc.com Job Title: Program ManagerLocation: Austin, TX (Hybrid/Onsite)Duration: 12 months (with possible extensions) Note: If selected for this position, you are required to perform ALL work within a commutable distance of your assigned Worksite Location. You will be onsite three days a week (Tuesday, Wednesday, Thursday), with Monday and Friday as remote workdays.Red Oak Technologies is seeking an experienced Program Manager for a 12-month contract with possible extensions in Austin, TX. This role will support complex program management activities, with a focus on legal or security operations. Prior Apple experience is highly desired.Key Responsibilities:Manage and maintain key project deliverables, including:Project CharterCommunication PlanProject KickoffProject Management PlanProject ScheduleScope Management PlanBenefits TrackerRisk RegisterChange LogProject Status ReportIssue LogValue TrackerAggregate detailed plans from multiple work streams into a comprehensive project overview.Handle ambiguity effectively and drive consensus with work stream leads.Utilize Mac-based tools (e.g., Chorus, Quip, Keynote, Wrike, Miro) for project reporting and communication.Act as the primary point of issue escalation for the project delivery teams.Document risks, issues, decisions, changes, schedules, and tasks in Wrike.Collaborate closely with the Solution Manager on change management activities, such as creating and delivering communications.Coordinate with the project’s Business Analyst, Technical Project Manager, and assigned Business Stakeholders for deliverable development.Manage changes in project scope and schedule using verification techniques.Communicate project status, issues, and risks to project sponsors and leadership.Develop executive-level project summaries using Mac tools.Required Skills:Minimum 3 years of Program Management experience, specifically managing large-scale and complex programs.At least 10 years of Project Management experience, with at least 3 years leading large-scale projects.Experience in Legal operations or Security is mandatory.Strong familiarity with Apple-based tools (Chorus, Quip, Keynote, Wrike) is required.Proven ability to navigate ambiguity and take initiative.Excellent verbal and written communication skills.Ability to work independently with minimal supervision.Strong leadership skills, with the ability to contribute to strategic planning initiatives.Executive presence with the ability to influence outcomes and present innovative opportunities.Excellent collaboration, problem-solving, decision-making, and interpersonal skills.Attention to detail and a proactive attitude are essential.",
        "source": "Email",
        "date_posted": "2024-10-02 12:29:57-05:00",
        "unique_id": "1924e498dd424b89",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]