[
    {
        "company": "Providence Health",
        "job_title": "Sr Project Manager",
        "location": "Renton, WA, USA",
        "full_location": {
            "city": "Renton",
            "state": "WA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Any Visa except H1B",
            "notice_period": "Not specified",
            "duration": "6 Months+",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Budget Management",
                "ERP Experience",
                "Project Management Tool Experience"
            ],
            "primary": [
                "Agile Practices",
                "Cloud Technologies",
                "Financial Reporting",
                "Contract Lifecycle Management"
            ],
            "secondary": [
                "Oracle ERP",
                "Project Online",
                "IQN / Beeline",
                "Azure Marketplace Orders",
                "Process Improvement",
                "PMP Certification"
            ],
            "all": [
                "Project Management",
                "Budget Management",
                "ERP Experience",
                "Project Management Tool Experience",
                "Agile Practices",
                "Cloud Technologies",
                "Financial Reporting",
                "Contract Lifecycle Management",
                "Oracle ERP",
                "Project Online",
                "IQN / Beeline",
                "Azure Marketplace Orders",
                "Process Improvement",
                "PMP Certification"
            ],
            "with_experience": [
                "Project Management",
                "Budget Management",
                "ERP Experience"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Hamid Raza",
        "email": "hamid.raza@sonitalentcorp.com",
        "jd": "From: Hamid Raza, Sonitalentcorp hamid.raza@sonitalentcorp.com Reply to: hamid.raza@sonitalentcorp.com Position: Sr Project ManagerLocation: (Hybrid onsite in Renton, WA) – Need to be localDuration: 6 Months+Visa: Any Visa except H1B,cptnterview: Phone/SkypeNote: Need LinkedInJob Description –this is a backfill for Paul Nassar (see resume attached), this was not a good fit once he got on the job. I’m only sending this to you guys, nobody else. Providence Health has been a loyal client of ours for over 20 years and we’ve hired 509 people for them. Providence needs someone that is a “go getter”. They have 2 projects that they have queued up and ready to go.They have subject matter experts and contacts that you need to connect with. Their calendar should be filled up pretty quickly with meetings after their first two days.The manager Jon Knight will give them all the details and direction they need. Just need to take detailed notes and execute.Will be a very fast paced environment !They work onsite 2 days a week in the Renton office; Mondays and TuesdaysSo need to live close enough to commute in. Valley Office Park: 1801 Lind Avenue SW, Renton, 98057 Team is 200, with teams in US and India. There are 5 divisions on his team: AI/ML, Platform Management, Product, Data Governance and Information Management.This person will be taking on multiple projects ranging from $1-5M. Probably won’t see any go above that for budget.They will be reporting and being supervised by Jon. Healthcare is a nice to have but not mandatory. Their PM experience can be in SW or Infrastructure; both would be ideal though. There are SME’s to help.Examples of projects this person would work on:-Decommission Project: transferring off a reporting system $1.7M-Hardware Upgrade: $5M First 6 months of the job will be focused on Projects; then will transition towards budgeting. The manager says there are 3 key areas of focus: Scope / Scheduling / BudgetIdeal candidate will have strong PM skills including managing a budget within Projects. They should have some type of ERP and Project Management tool experience. Doesn’t have to be theirs. All interviews will be virtual. General Summary:The Providence Healthcare Intelligence (HI) team is developing innovative solutions using agile practices and cutting-edge cloud technologies. We are seeking a talented candidate that reflect Providence core values to work across HI portfolio of programs, projects, and products to manage finances, forecasting, and provide ongoing policies training and support. Key responsibilities include:Manage the HI team operational finances within our systems of record like Genesis, Project Online, and IQN. This includes ongoing budget transfers, creating purchase orders, requisitions, facilitate timely invoice payments, timecard reconciliation, monthly and annual forecasts, annual budget cycle, leading budget review meetings, portfolio reporting and other related duties.Opex SME: Provide consulting support to the HI team regarding operational financial policies, procedures, sources of data, troubleshooting, navigating purchase orders, contract approval process, monthly and annual budget review, accrual process and other related subjects.Capital Admin: Manage the HI capital portfolio including budgeting, forecasting, and reconciliations by working within our ERP, project management, and contract systems of record. This includes ongoing budget transfers, invoice and purchase order research, timecard reconciliation, facilitate labor sweeps, managing monthly and annual forecasts, leading capital management meetings, portfolio reporting and other related duties.Capital SME: Provide consulting support to HI team related to project capital policies, procedures, sources of data, troubleshooting, navigating purchase orders, and other related subjects.Require Qualifications:• Experience with Project Management methodologies and software• Experience with Budgets and Forecast• Experience with Accounting and GL transactions• Experience with Contract Lifecycle• Experience with Financial Reporting Preferred Qualifications:• Experience with Oracle ERP• Experience with Project Online• Experience with IQN / Beeline• Experience with Azure Marketplace Orders• Experience with Process Improvement• Experience making formal and informal presentations to managers and key stakeholders.• Project Management Professional (PMP) from Project Management Institute",
        "source": "Email",
        "date_posted": "2024-10-02 18:40:11-05:00",
        "unique_id": "1924ff159449fbbd",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]