[
    {
        "company": "Yochana IT Solutions",
        "job_title": "Technical Project Manager with .Net",
        "location": "Phoenix, AZ, USA",
        "full_location": {
            "city": "Phoenix",
            "state": "AZ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "NET",
                "TPM",
                "Regression & Performance Testing",
                "Project Management",
                "Product Management",
                "MS SQL"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "NET",
                "TPM",
                "Regression & Performance Testing",
                "Project Management",
                "Product Management",
                "MS SQL"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Gopi Pabbu",
        "email": "pgopi@yochana.com",
        "jd": "From: Gopi Pabbu, Yochana IT Solutions pgopi@yochana.com Reply to: pgopi@yochana.com Hi, Hope you are doing Great!Please find the below job description, if anyone are available please send me their updated resume with contact details at pgopi@yochana.comTechnical Project Manager with .NetPhoenix AZ NET,TPM, Regression & Performance Testing, Project Management, Product Management, MS SQLLooking for an experienced technical project manager that can hit the ground running as part of the Global Sanctions Risk and Compliance team in GRCT. The candidate must be experience of managing the distributed applications especially .NET/API's and be a team contribute candidate will be expected to complete document and co-ordinate with multiple technology teams, product, business and ensure the delivery schedule. They will be part of an end-to-end team and may have to participate in RFC's, tracking application deployment, and tracking proc issues with the components they deliver. Candidate should be an excellent communicator and willing to speak up to contribute and participial meetings and Agile ceremonies Gopi Pabbu Resource Specialist Yochana IT Solutions Inc Mail Id :pgopi@yochana.com www.yochana.com Address : 23000 Commerce Drive, Farmington Hills, MI 48335, USA Join the Referral Revolution of Yochana by Sharing, Earning, and Empowering! Ask us about our rewarding referral program.",
        "source": "Email",
        "date_posted": "2024-10-02 15:42:19-05:00",
        "unique_id": "1924ef77f8be5a46",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]