[
    {
        "company": "Resource Logistics",
        "job_title": ".Net Project Manager",
        "location": "Phoenix, AZ, USA",
        "full_location": {
            "city": "Phoenix",
            "state": "AZ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                ".NET",
                "API",
                "MS SQL"
            ],
            "primary": [
                "Agile Champion",
                "Regressions/Performance testing",
                "Git",
                "Java",
                "Jenkins",
                "Kubernetes"
            ],
            "secondary": [],
            "all": [
                "Project Management",
                ".NET",
                "API",
                "MS SQL",
                "Agile Champion",
                "Regressions/Performance testing",
                "Git",
                "Java",
                "Jenkins",
                "Kubernetes"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Divya Pandey",
        "email": "divya@resource-logistics.com",
        "jd": "Hello, My name is Divya Pandey. and I am a Staffing Specialist at Resource Logistics. I am reaching out to you on an exciting job opportunity with one of our clients. COMPLETE JOB DESCRIPTION IS BELOW FOR YOUR REVIEW:Job Title: .Net Project ManagerLocation: Phoenix, AZ - 3 Days mandatory onsiteHire Type: Contract DOT NET Project Manager with extensive experience in Project Management ,Agile Champion, Firewall, Git (GitHub, GitLab, BitBucket, SVN), Java, Jenkins, Kubernetes. Technical Project Manager (Agile Champion) Job Description: We are seeking - DOT NET/API Technical Project Manager with extensive experience in Project Management , Dot Net/API, MS SQL, Regressions/Performance testing Looking for an experienced technical project manager that can hit ground running as part of Global Sanctions Risk and Compliance Platform team in GRCT. The candidate must be experience of managing distributed applications especially .NET/API and be team contributor. Teh candidate will be expected to coordinate with multiple technology teams, product, business and ensure delivery on schedule. They will be part of end to end and may have to participate in RFC's, track application deployments, tracking production issues with components they deliver. Candidate should be excellent communicator and willing to speak up to contribute and participate in meetings and Agile ceremonies.",
        "source": "Email",
        "date_posted": "2024-10-02 18:14:17-05:00",
        "unique_id": "1924f829ef510c02",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]