[
    {
        "company": "Sspearhead Inc.",
        "job_title": "Junior PM",
        "location": "Albany, NY, USA",
        "full_location": {
            "city": "Albany",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Mid-Level, 36 - 60 months",
            "degree_required": "Bachelor’s Degree in Liberal Arts, Humanities, Social Sciences, or Education",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Waterfall",
                "Agile",
                "Scrum",
                "Kanban"
            ],
            "primary": [
                "Stakeholder Management",
                "Change Management",
                "Facilitation",
                "Continuous Improvement",
                "PMO Standards"
            ],
            "secondary": [
                "Communication-focused Certification",
                "Human Services",
                "Law Enforcement",
                "Justice",
                "State Government"
            ],
            "all": [
                "Project Management",
                "Waterfall",
                "Agile",
                "Scrum",
                "Kanban",
                "Stakeholder Management",
                "Change Management",
                "Facilitation",
                "Continuous Improvement",
                "PMO Standards",
                "Communication-focused Certification",
                "Human Services",
                "Law Enforcement",
                "Justice",
                "State Government"
            ],
            "with_experience": [
                "Project Management (60 Months)",
                "Stakeholder Management (48 Months)",
                "Change Management (48 Months)",
                "Facilitation (36 Months)",
                "PMO Standards (36 Months)",
                "Case Management Application (36 Months)",
                "State Government (30 Months)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Anoop",
        "email": "anoop@sspearhead.com",
        "jd": "From: Anoop, Sspearhead Inc. anoop@sspearhead.com Reply to: anoop@sspearhead.com Job details:Junior PM - Day 1 onsiteAlbany, NYLong Term Mandatory Qualification Project Manager Plans, organizes and integrates cross-functional information technology projects that are significant in scope and impact. Mid-Level 36 - 60 months: Candidate is able to work independently, without assistance. Qualification Number Requested Qualifications:1. 60 Months of experience leading projects from initiation through closeout, creating schedules, scope, resource management, budget estimations, including risk mitigation. Experience should include multiple methodolgies including waterfall, agile, scrum, and/or kanban2. 48 Months of experience facilitating meetings with internal and external stakeholders including executives, business users, and technical resources3. 48 Months of experience working on Enterprise Change Management strategies, plans, and activities designed to prepare and support people to adopt to changes in business processes, systems and technology, and organization structures including experience with change capacity4. 36 Months of experience facilitating Project/Release retrospectives, and evaluation of project outcomes and criteria for success to deliver continuous improvement5. 36 Months of experience contributing to the establishment of PMO standards, processes, and internal controls including establishing SDLC and using Outcomes based metrics such as Objectives and Key Results (OKR)6. 36 Months of experience leading elicitation sessions with executives, managers, developers and subject matter experts using variety of information gathering methods such as interviews, documentation analysis, surveys, site visits, business models7. 36 Months of experience involving a Case Management application that supports workflow, case lifecycle, activities and tasks, storing related documentation, and managing stakeholder communication in one of the following domains: Human Services, Law Enforcement (Investigations), Justice (Legal, Courts)8. 30 Months of experience working in State Government9. Bachelor’s Degree in Liberal Arts, Humanities, Social Sciences, or Education10. Communication-focused Certification (i.e., counseling, mediation, education) Thanks,AnoopSspearhead Inc.www.Sspearhead.com",
        "source": "Email",
        "date_posted": "2024-10-02 10:08:35-05:00",
        "unique_id": "1924dc7f17d66e33",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]