[
    {
        "company": "GVR INFOTEK LLC",
        "job_title": "AWS APPS DEVELOPER",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "70125003 TEA",
            "experience_required": "8 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "JavaScript",
                "Python",
                "AWS IAM",
                "AWS S3"
            ],
            "primary": [
                "AWS Glue",
                "AWS Amplify",
                "AWS MQ",
                "Cloud Solution Architect"
            ],
            "secondary": [
                "Experience with Windows and Linux OS"
            ],
            "all": [
                "Java",
                "JavaScript",
                "Python",
                "AWS IAM",
                "AWS S3",
                "AWS Glue",
                "AWS Amplify",
                "AWS MQ",
                "Cloud Solution Architect",
                "Experience with Windows and Linux OS"
            ],
            "with_experience": [
                "Java (8 years)",
                "JavaScript (8 years)",
                "Python (8 years)",
                "AWS IAM (8 years)",
                "AWS S3 (4 years)",
                "AWS Glue (4 years)",
                "AWS Amplify (4 years)",
                "AWS MQ (4 years)"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Kirty Choudhary",
        "email": "kirty.choudhary@gvrinfotek.com",
        "jd": "From: kirty choudhary, GVR INFOTEK LLC kirty.choudhary@gvrinfotek.com Reply to: kirty.choudhary@gvrinfotek.com Job Description - REMOTE AVAILABILITY: Remote work may be allowed and should be coordinated with the manager. Note: I need only one best candidate profile local to Texas with dl candidate on-site couple of a week Title: AWS APPS DEVELOPER Need three reference for the candidate Must Have : 8 years of AWS IAM and S3? & 4 years with Glue, Amplify and MQ? 70125003 TEA Competitive Solicitation I. DESCRIPTION OF SERVICESTexas Education Agency requires the services of 1 Developer/Programmer Analyst 3, hereafter referred to as Candidate(s), who meets the general qualifications of Developer/Programmer Analyst 3, Applications/Software Development and the specifications outlined in this document for the Texas Education Agency. All work products resulting from the project shall be considered \"works made for hire\" and are the property of the Texas Education Agency and may include pre-selection requirements that potential Vendors (and their Candidates) submit to and satisfy criminal background checks as authorized by Texas law. Texas Education Agency will pay no fees for interviews or discussions, which occur during the process of selecting a Candidate(s).Plans, develops, tests, and documents computer programs, applying knowledge of programming techniques and computer systems. Evaluates user request for new or modified program, such as data ETL pipelines (using Python/AWS Glue) or front-end data submission app developent (using Javascript/AWS Amplify). Consults with user to identify current operating procedures and clarify program objectives. Formulates plan outlining steps required to develop program, using methodologies such as structured analysis and design or object-oriented development. Participate the implementation of AWS Data Lake instance by translating program needs into technical requirements, supporting program leads in defining the long-term vision for the project, defining and implementing data governance / identity and access management policies, tracking project expenses, testing and validating new functionality, enabling program staff to use new tools, and regularly interfacing with both internal and external stakeholders. Role includes programming to implement new data feeds via API, maintaining AWS Amplify data upload platform, and implementing and maintaining crawlers and jobs in AWS Glue. II. CANDIDATE SKILLS AND QUALIFICATIONS Minimum Requirements:Candidates that do not meet or exceed the minimum stated requirements (skills/experience) will be displayed to customers but may not be chosen for this opportunity.YearsRequired/PreferredExperience8RequiredJava, JavaScript or Python programming8RequiredAWS IAM8RequiredAWS S34RequiredCloud Solution Architect4PreferredAWS Glue4PreferredAWS Amplify4PreferredAWS MQ, SQ4PreferredExperience with Windows and Linux OS",
        "source": "Email",
        "date_posted": "2024-10-02 11:53:31-05:00",
        "unique_id": "1924eae0004c51aa",
        "emp_type": [
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]