[
    {
        "company": "NCS",
        "job_title": "Project Manager Coordinator",
        "location": "Houston, TX, USA",
        "full_location": {
            "city": "Houston",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "2+ years",
            "degree_required": "Bachelor’s degree in business administration, Project Management, or a related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Vendor Management",
                "Contract Analysis",
                "Power BI",
                "Microsoft Office Suite",
                "Project Management"
            ],
            "primary": [
                "Communication Skills",
                "Interpersonal Skills",
                "Data Visualization",
                "Resource Management",
                "Scheduling"
            ],
            "secondary": [
                "SAP",
                "ERP Systems",
                "Organizational Skills"
            ],
            "all": [
                "Vendor Management",
                "Contract Analysis",
                "Power BI",
                "Microsoft Office Suite",
                "Project Management",
                "Communication Skills",
                "Interpersonal Skills",
                "Data Visualization",
                "Resource Management",
                "Scheduling",
                "SAP",
                "ERP Systems",
                "Organizational Skills"
            ],
            "with_experience": [
                "Power BI (2+ years)",
                "Vendor Management (2+ years)",
                "Contract Analysis (2+ years)"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Debbie",
        "email": "debbie@ncsus.net",
        "jd": "Hi,Job Title: Project Manager CoordinatorLocation: [Downtown - Houston]Need to have Oil and gas background Job Summary:We are seeking a detail-oriented Project Manager Coordinator to support vendor management, contract analysis, Power BI reporting, and resource management. The ideal candidate will also assist with scheduling meetings, coordinating with contract owners, and tracking contract renewal strategies with a focus on cost reduction. An SAP background is a plus but not required. Skills:Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint).Experience with project management tools and software.Knowledge of Power BI for data visualization and reporting.Excellent communication and interpersonal skills for working with cross-functional teams.Ability to analyze contracts and suggest cost-effective solutions. Key Responsibilities:Vendor Management:Manage relationships with vendors, ensuring deliverables are met according to contract terms.Act as a point of contact between vendors and internal stakeholders for issue resolution and performance reviews.Contract Analysis:Assist with contract reviews and renewals, ensuring compliance with terms and conditions.Work with contract owners to track progress and strategize renewal options aimed at cost reduction.Provide follow-up support to ensure contract owners adhere to renewal timelines and strategies.Power BI Reporting & Dashboard Management:Develop and maintain Power BI reports and dashboards to monitor project metrics and provide insights to management.Analyze data and generate reports to help in decision-making and strategy adjustments.Resource Management:Assist in managing and tracking resource allocation and utilization across multiple projects.Monitor project staffing needs and ensure optimal use of resources.Coordinate with team leads to ensure that resource schedules align with project timelines.Meeting Scheduling and Coordination:Schedule and organize project-related meetings, including follow-ups with contract owners, vendors, and internal stakeholders.Prepare meeting agendas, document action items, and track progress on decisions made during meetings.Stakeholder Communication:Regularly communicate with contract owners and stakeholders to ensure alignment with the project plan and objectives.Assist in resolving any issues related to vendor performance, resource constraints, or contractual obligations. Preferred Qualifications:Bachelor’s degree in business administration, Project Management, or a related field.2+ years of experience in a project coordinator role, with experience in vendor management and contract analysis.Experience with Power BI reporting and dashboard development.Strong organizational and communication skills with the ability to manage multiple priorities simultaneously.Familiarity with SAP or similar ERP systems is a plus",
        "source": "Email",
        "date_posted": "2024-10-02 10:07:05-05:00",
        "unique_id": "1924dc6c3fef4c9c",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]