[
    {
        "company": "Nitya INC",
        "job_title": "AI/Gen AI Developer",
        "location": "Alpharetta, GA, USA",
        "full_location": {
            "city": "Alpharetta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Advanced degree in a quantitative field (e.g. Computer Science, Statistics, Applied Math, Econometrics, Operations Research, Quantitative Social Science)",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Python",
                "Java",
                "R",
                "AI/ML models",
                "Big Data"
            ],
            "primary": [
                "Keras",
                "PyTorch",
                "scikit-learn",
                "Data manipulation",
                "Model deployment"
            ],
            "secondary": [
                "Hypothesis testing",
                "Sampling",
                "Causal inference",
                "Communication skills",
                "Cross-functional collaboration",
                "GenAI models",
                "RAG architecture"
            ],
            "all": [
                "Python",
                "Java",
                "R",
                "AI/ML models",
                "Big Data",
                "Keras",
                "PyTorch",
                "scikit-learn",
                "Data manipulation",
                "Model deployment",
                "Hypothesis testing",
                "Sampling",
                "Causal inference",
                "Communication skills",
                "Cross-functional collaboration",
                "GenAI models",
                "RAG architecture"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Nitya Sravani",
        "email": "sravani@nityainc.com",
        "jd": "From: sravani, Nitya INC sravani@nityainc.com Reply to: sravani@nityainc.com AI/Gen AI DeveloperGen AI Python Language – MandatoryAPI – UnderstandingTelecom exp would be good to haveWorking mostly on Gen AI based solution Interview Process: No idea. Coding exercise would be happening. Location – Alpharetta, GA or Irving, TX (3 times a week) Tampa, FL would also work Responsibilities: • Drive the development and application of new technologies focused on Big Data Artificial Intelligence • Identify and initiate opportunities across the Enterprise, building collaboration, and influencing strategic direction by raising visibility of trends and issues across the competitive landscape • Lead cross-functional initiatives, develop action plans, establish milestones, and provide status updates • Drive cross functional Big Data AI initiatives, including the development of the roadmaps, key metrics, and success criteria • Manage and communicate key timelines and deliverables to execute on strategic initiatives • Stand up Ad-hoc Work Groups (AWGs) and Proofs of Concepts for new Big Data AI initiatives • Define and own key metrics and key performance indicators • Identify and leverage expertise, technological investments, and AI techniques • Research new technology opportunities, investigate industry trends, and deliver compelling, data driven recommendations to guide business decisions and improve business performance MUST HAVE SKILLS (Most Important): · Advanced degree in a quantitative field (e.g. Computer Science, Statistics, Applied Math, Econometrics, Operations Research, Quantitative Social Science) · Proficient in manipulating and analyzing data from different sources (cloud and on-premise), at different scales (big data and small data), and of different formats · Must have excellent coding proficiency with demonstrated expertise in python, java, R, etc. · Knowledgeable of a variety of AI/ML models, frameworks(keras, pytorch, etc.) and libraries/packages/apis (e.g., scikit) · Must have the ability to explain both the code and the underlying math used in algorithms/models. · Experience with model deployment in production environments a big plus · Familiarity with hypothesis testing, sampling, and causal inference methods · Excellent communication & cross-functional collaboration skills DESIRED SKILLS: . Must have hands on experience working on GenAI models. Ability to write code and identify techniques to use in the RAG architecture to solve for problem at hands JOB DUTIES: . Design/Develop custom RAG pipeline for GenAI solutions . Participate in daily touch point calls, design calls and interface with other technical leads and business stakeholders to understand requirements and plan a solution around it. . Provide timely updates to management on progress and any challenges. . Research and develop new solutions for unique problems in AI/ML and GenAI space. EDUCATION/CERTIFICATIONS: Advanced degree in a quantitative field (e.g. Computer Science, Statistics, Applied Math, Econometrics, Operations Research, Quantitative Social Science)",
        "source": "Email",
        "date_posted": "2024-10-02 10:08:34-05:00",
        "unique_id": "1924dc7dd44d008d",
        "emp_type": [
            "third party"
        ],
        "tag": "Python developer"
    }
]