[
    {
        "company": "Yochana Solutions INC",
        "job_title": "Supply Chain Program Manager",
        "location": "San Jose, CA, USA",
        "full_location": {
            "city": "San Jose",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "BABS degree in Supply Chain, Industrial Engineering or equivalent practical experience in relevant industry",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "1+ year",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Supply Chain Principles",
                "Material Requirements Planning Tools",
                "Project Management",
                "Spreadsheet/database capabilities"
            ],
            "primary": [
                "Analytics",
                "SQL",
                "BigQuery",
                "Supply Chain Certification",
                "ERP",
                "Product Lifecycle Management (PLM)"
            ],
            "secondary": [
                "Financial and cost accounting practices",
                "S&OP processes",
                "Planning materials for new product launches"
            ],
            "all": [
                "Supply Chain Principles",
                "Material Requirements Planning Tools",
                "Project Management",
                "Spreadsheet/database capabilities",
                "Analytics",
                "SQL",
                "BigQuery",
                "Supply Chain Certification",
                "Financial and cost accounting practices",
                "S&OP processes",
                "ERP",
                "Product Lifecycle Management (PLM)",
                "Planning materials for new product launches"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "James Smith",
        "email": "smith@yochana.com",
        "jd": "From: James Smith, Yochana Solutions INC smith@yochana.com Reply to: smith@yochana.com Job Title- Supply Chain Program ManagerLocation – San Jose, CA - Onsite- Need Locals Duration – 1+year Data Center Equipment Supply Inventory Planning, Program Manager Role Description (and additional job description)As a Supply Inventory Planning Program Manager, you will be responsible for the data center equipment supply planning for sustaining and new products, interpretation of the data center demand signal and translating it to a supply & inventory plan for equipment and drive optimal planning decisions. You will work closely with Data Center Supply Planning, Purchasing, Engineering, Fulfillment, Commodity Management, and Contract Manufacturing teams to develop and oversee the execution of an accurate supply and inventory plan through the product life cycle. You will apply your knowledge of supply chain principles and your problem solving prowess to key planning processes. You will establish and drive metrics, drive process and system improvements to accomplish efficiency and scalability goals and influence our rapidly growing data center infrastructure supply chain. ResponsibilitiesManage material supply, including inventory, to meet existing and new product demand requirements to meet business objectives, coordinating with Demand Planning on changes to demand which impacts delivery of key components as demand needs fluctuateProactive communication of sustaining and new product material plans and status to internal customers.Identify and quickly solve supply chain gaps and inefficiencies. Clearly document process solutions and requirements. Define and manage clear business metrics and goals to manage supply chain performanceLeverage Market intelligence and Statistical inputs towards driving continued, sustained improvements of inventory models and supply chain buffers.Develop short and long term supply models to minimize total costs and inventories while maintaining service levels, develop and justify inventory buffer strategies that optimize cost and flexibility. Minimum Qualifications (MQs)BABS degree in Supply Chain, Industrial Engineering or equivalent practical experience in relevant industryProject Management experience with the ability to communicatecollaborate cross-functionally with technical/non-technical groups spanning all organizational levelsExperience using Material Requirements PlanningToolsSpreadsheet/database capabilities, able to create models and maneuver within them to manage supply chain processes Preferred Qualifications (PQs) MS/MBA degree in Business Process Management, Industrial Engineering, Supply Chain Management or related planning disciplines.Expertise in Analytics / SQL / BigQueryA Supply Chain CertificationKnowledge of financial and cost accounting practicesDeep knowledge of S&OP processes as well as experience in development and implementation of planning systems and processesUnderstanding and experience in using Enterprise Resource Planning (ERP) and Product Lifecycle Management (PLM) systems and toolsExperience in planning materials for new product launches and transitions Thanks & Regards, James Smith- Team Lead smith@yochana.com Direct No: 949-201-1313Yochana Solutions INCWindsor, Ontario- CanadaFarmington hills, MI-48335- USAUSA | CANADA I INDIA W: www.yochana.comNote: This is not an unsolicited mail. If you are not interested in receiving our e-mails then please reply with subject line",
        "source": "Email",
        "date_posted": "2024-10-02 10:42:22-05:00",
        "unique_id": "1924de9cf658be01",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]