[
    {
        "company": "Credit One Bank",
        "job_title": "Java Lead (web flux)",
        "location": "Las Vegas, NV, USA",
        "full_location": {
            "city": "Las Vegas",
            "state": "NV",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "20513",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Must have existing work authorization",
            "notice_period": "Not specified",
            "duration": "Long term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Spring Boot",
                "Microservices",
                "RESTful APIs",
                "Web Flux"
            ],
            "primary": [
                "Kafka",
                "Cloud",
                "HTML",
                "CSS",
                "JavaScript",
                "React.JS",
                "Automated Testing",
                "JUnit",
                "Agile",
                "Scrum"
            ],
            "secondary": [
                "Oracle",
                "MS SQL",
                "Postgres",
                "Jira",
                "GitLab",
                "Swagger",
                "Postman",
                "SOAP UI",
                "Kibana",
                "ELK",
                "Dynatrace",
                "Data Structures",
                "Design patterns",
                "Asynchronous programming",
                "Entity",
                "Hibernate",
                "Dapper",
                "oAuth",
                "Docker",
                "GIT",
                "SonarQube",
                "BIAN framework"
            ],
            "all": [
                "Java",
                "Spring Boot",
                "Microservices",
                "RESTful APIs",
                "Web Flux",
                "Kafka",
                "Cloud",
                "HTML",
                "CSS",
                "JavaScript",
                "React.JS",
                "Automated Testing",
                "JUnit",
                "Agile",
                "Scrum",
                "Oracle",
                "MS SQL",
                "Postgres",
                "Jira",
                "GitLab",
                "Swagger",
                "Postman",
                "SOAP UI",
                "Kibana",
                "ELK",
                "Dynatrace",
                "Data Structures",
                "Design patterns",
                "Asynchronous programming",
                "Entity",
                "Hibernate",
                "Dapper",
                "oAuth",
                "Docker",
                "GIT",
                "SonarQube",
                "BIAN framework"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Harish Varma",
        "email": "harish@r2techcorp.com",
        "jd": "From: Harish Varma, R2 Technologies harish@r2techcorp.com Reply to: harish@r2techcorp.com Title: Java Lead (web flux)Duration: Long term, Job Id: 20513Location: Las Vegas, NV (onsite - Mon to Fri) Client: Credit One BankVisa: GC/USC/EAD/Transfer Description:Total minimum 10+ Years of experience in development· Lead experience Must.· Must need web flux, Spring reactive experience,· Experiences in Spring boot, Microservices, API, Kafka, Cloud, design What will you do? · Experiences in Spring boot, Microservices, API, Kafka, webflux, Spring reactive Cloud· Proficiency in front-end technologies such as HTML, CSS, JavaScript, and frameworks, React.JS.· Partner with business and marketing to Implement detailed customer applications· Build microservice applications using best practices· Write high-quality, scalable, reusable and fault-tolerant code· Write automated unit tests and perform API validations· Debug errors, troubleshoot issues, and perform routine performance optimizations· Collaborate with Solution Architects and define API schemas· Collaborate with front-end developers to integrate UI components with back-end systems· Collaborate with Product Owners and Solutions Architect to gather business requirements and groom user stories· Set development standards within the team and make sure we maintain high quality technical documentation.· Manage a team to deliver new solutions that solve user and business problems for our website· Identify and communicate development best practices to the team, enhancing efficiency and performance across the department.· Perform technical assessment of the requirements to ensure the possibility of their implementation within a reasonable time.· Serve as a mentor, technical leader, and thought leader for a talented team by challenging them and helping them grow.· Actively participate in scrum/agile ceremonies· Gather and document requirements for development and delivery· Contribute code to improve and implement new and existing features· Perform code reviews and mentor developers· Communicate with business and various other departments· What are we looking for? · Strong communication skills and collaboration skills to communicate to different audiences (technology leadership, business leadership, team members, etc.) appropriately. · Ability to understand and translate business/functional requirements to High / Low-Level Designs · Experience working in Agile / Scrum / Iterative development methodologies. · Solid programming experience in Java Spring Boot and RESTful Microservices development,· Experience in working with one of the concurrency frameworks like Mono, Flux · Strong relational database experience in either Oracle, MS SQL, or Postgres · Experience with Automated Testing and tools such as JUnit. · Experience in using tools like Jira, GitLab, Swagger, Postman, SOAP UI · Experience using Logging framework and understanding of monitoring tools like Kibana, ELK, Dynatrace · Strong understanding of Data Structures, Design patterns and asynchronous programming · Strong problem solving and debugging skills.· 10+ years of software development experience. · Knowledge of Agile / Scrum / Iterative development methodologies · Background and relevant experience in Financial Domain/Sector· Experience working in ORM frameworks like Entity, Hibernate, Dapper · Experience in API authentication and Authorization using oAuth · Knowledge of queuing or streaming engines like Kafka · Knowledge of Docker, GIT, SonarQube and other deployment tools for CI/CD · Awareness & Experience in implementing BIAN framework.",
        "source": "Email",
        "date_posted": "2024-10-02 16:20:45-05:00",
        "unique_id": "1924f1aaf3b8ee67",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]