[
    {
        "company": "GVR Infotek LLC",
        "job_title": "Business Analyst/Solutions Analyst",
        "location": "Houston, TX, USA",
        "full_location": {
            "city": "Houston",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 plus years",
            "degree_required": "Bachelor's degree in Accounting, Computer Science, or Information Systems preferred",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "24 + months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Data analysis",
                "Customer Support",
                "SQL",
                "Project Management",
                "Analytical tools"
            ],
            "primary": [
                "Oil & Gas industry experience",
                "Team leadership",
                "Business requirements gathering",
                "QC/QA software testing",
                "Reporting tools"
            ],
            "secondary": [
                "TOAD",
                "Crystal Reports",
                "Business Objects",
                "Python",
                "Elasticsearch",
                "MEMSQL",
                "Accounts Payable",
                "Concur",
                "Microsoft Word",
                "Microsoft Excel",
                "Microsoft Access",
                "Microsoft Visio",
                "Microsoft Project"
            ],
            "all": [
                "Data analysis",
                "Customer Support",
                "SQL",
                "Project Management",
                "Analytical tools",
                "Oil & Gas industry experience",
                "Team leadership",
                "Business requirements gathering",
                "QC/QA software testing",
                "Reporting tools",
                "TOAD",
                "Crystal Reports",
                "Business Objects",
                "Python",
                "Elasticsearch",
                "MEMSQL",
                "Accounts Payable",
                "Concur",
                "Microsoft Word",
                "Microsoft Excel",
                "Microsoft Access",
                "Microsoft Visio",
                "Microsoft Project"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "ANKUR CHAUDHARY",
        "email": "ankur.chaudhary@gvrinfotek.com",
        "jd": "Hi,Please find the below job descriptions :-Job title :-Business Analyst/Solutions Analyst ( Must Have Oil and Gas exp. )Location: Houston, TX, (Onsite)Duration: 24 + monthsMOI: Virtual & Final Round F2FMust Have: Need candidate local to Houston, TexasNeed 2 professional references. Job Description for Sr. Solutions AnalystThe key responsibilities of a Sr. Solutions Analyst focus on data analysis, the development and customization of analytical tools for accounting and operations, and providing customer support for all assigned software applications. The Sr. Solutions Analyst must work closely with the development, accounting, and operations teams to ensure specifications for a software are implemented accurately and presented to end users articulately. This position also requires effective resource management in terms of personnel, hardware, software, budget, and project management for specifically assigned software applications and projects.Essential Functions and Principal Accountabilities:Data analysisCustomer Support Analyzing day-to-day production issues and identify short term/long term fixesTracking and appropriately escalating production issuesTesting and supporting the deployment of applicationsSupporting application releases and change management functionsPreparing and maintaining comprehensive administrator documentationSupporting proprietary, as well as 3rd-Party software applicationsIdentifying, documenting, and reporting software bugs/functionality issues to vendors and monitoring them for corrective actionCreating specifications for new or existing productsCreating/using SQL queries for issue resolution and reportingInterfacing between business users, tech support, IT project managers and software vendors, including training and workshop facilitationManage Projects by coordinating with Users, Developers, and various other groups. Know, practice, and enforce the relevant IT policies and proceduresAct as a Team Leader by coordinating with Users, Developers, and various other groups a plus. Organize a project in its entirety and articulate the project as a logical sequence of executable tasks a plus.Provide strategic planning that meets corporate goals and objectives a plus.",
        "source": "Email",
        "date_posted": "2024-10-02 10:14:54-05:00",
        "unique_id": "1924e053b4c4c447",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]