[
    {
        "company": "Stellent IT",
        "job_title": "IT Project Manager with Cybersecurity",
        "location": "Austin, TX, USA",
        "full_location": {
            "city": "Austin",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "A degree is required.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Multi-year contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "cybersecurity",
                "project management",
                "risk management",
                "cloud migrations"
            ],
            "primary": [
                "leadership",
                "organizational skills",
                "communication skills"
            ],
            "secondary": [
                "PMP certification",
                "CAPM certification"
            ],
            "all": [
                "cybersecurity",
                "project management",
                "risk management",
                "cloud migrations",
                "leadership",
                "organizational skills",
                "communication skills",
                "PMP certification",
                "CAPM certification"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Priyanka",
        "email": "priyanka@stellentit.com",
        "jd": "From: priyanka, Stellent IT priyanka@stellentit.com Reply to: priyanka@stellentit.com Title: IT Project Manager with Cybersecurity Location: Austin, TX (Hybrid Schedule) Type: Multi-year contract About Us: We are collaborating with a client in Austin, TX, seeking a skilled IT Project Manager to lead critical cybersecurity initiatives. This role is vital in ensuring the security and integrity of their data and systems. Key Responsibilities: Manage and implement cybersecurity projects, focusing on establishing risk management protocols and building an identity and access management strategy. Lead the migration of the data hub to a cloud infrastructure, ensuring compliance and security best practices are followed. Collaborate with cross-functional teams to enhance cybersecurity posture and implement best practices. Develop project plans, timelines, and budgets while ensuring alignment with the college’s strategic goals. Communicate effectively with stakeholders to report on project status, risks, and mitigation strategies. Qualifications: Proven experience in managing cybersecurity projects, including risk management and cloud migrations. Project management certification (PMP preferred; CAPM or other certifications considered). A degree is required. Strong leadership, organizational, and communication skills. Why Join Us? Work in a supportive and innovative environment committed to enhancing Information Security measures. Enjoy a flexible hybrid schedule with remote work options on Mondays and Fridays, with onsite collaboration during the week. Competitive pay and benefits, with opportunities for professional growth.",
        "source": "Email",
        "date_posted": "2024-10-02 17:49:34-05:00",
        "unique_id": "1924fa2859070581",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]