[
    {
        "company": "DVG Tech Solutions",
        "job_title": "Sr .Net Application Developer",
        "location": "Tallahassee, FL, USA",
        "full_location": {
            "city": "Tallahassee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Microsoft .NET (C#)",
                "ASP.NET/MVC",
                "WCF/WebAPI",
                "SQL Server",
                "JavaScript frameworks (Angular, Knockout, etc.)"
            ],
            "primary": [
                "REST",
                "XML",
                "JSON",
                "HTML",
                "Python",
                "CSS",
                "Relational Database Management Systems (RDBMS)",
                "DB2"
            ],
            "secondary": [
                "design patterns",
                "performance issues",
                "troubleshooting strategies",
                "development methodologies (waterfall and agile)",
                "verbal and written communication",
                "interpersonal skills",
                "conflict resolution",
                "customer service",
                "complex systems analysis",
                "cloud-based applications",
                "PaaS",
                "IaaS",
                "Microsoft Azure",
                "security incident response",
                "OOP (Object Oriented Programming)"
            ],
            "all": [
                "Microsoft .NET (C#)",
                "ASP.NET/MVC",
                "WCF/WebAPI",
                "SQL Server",
                "JavaScript frameworks (Angular, Knockout, etc.)",
                "REST",
                "XML",
                "JSON",
                "HTML",
                "Python",
                "CSS",
                "Relational Database Management Systems (RDBMS)",
                "DB2",
                "design patterns",
                "performance issues",
                "troubleshooting strategies",
                "development methodologies (waterfall and agile)",
                "verbal and written communication",
                "interpersonal skills",
                "conflict resolution",
                "customer service",
                "complex systems analysis",
                "cloud-based applications",
                "PaaS",
                "IaaS",
                "Microsoft Azure",
                "security incident response",
                "OOP (Object Oriented Programming)"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Vikas",
        "email": "vikas@dvgts.com",
        "jd": "From: vikas, DVG Tech Solutions vikas@dvgts.com Reply to: vikas@dvgts.com Hi,Hope you are doing good! Position: Sr .Net Application Developer Location: Tallahassee, FL (Remote) Only LOCALSLong Term Primary Job Duties/ Tasks The submitted candidate must be able to perform the following duties and/or tasks. Duties of the selected candidate will include, but not be limited to:Work as a senior developer on various cross-functional application projects, ensuring that robust and scalable solutions are implemented. Collaborate with other team members and Subject Matter Experts to ensure solutions are implemented according to customer requirements.Responsible for full lifecycle application development. Ensures code is written to implement the architecture and design such that it meets standards in terms of code quality and efficiency.Initiate, drive, and deliver effective experiences in partnership with distributed cross-functional teams to ensure all aspects of the architectural vision are communicated, supported, and delivered to the highest standards; align development initiatives with Department development vision, strategy, and deployment.Monitor service desk tickets, as well as and incoming requests, and resolve issues as assigned. Perform advanced troubleshooting to determine root cause of problems and issues. Identify, analyze, and resolve problems and issues using troubleshooting tools and techniques, coordinating with team members as needed. Research, document, and understand FDOT business processes and technical assets, as well as their inter-relationships.Provide high level of customer service by providing status and information to the customer. Assist customers with development of business cases. Perform application testing; fully unit test all solutions prior to User Acceptance Testing and implementation. Job Specific Knowledge, Skills, and Abilities Knowledge of design patterns, performance issues, and troubleshooting strategies.Knowledge of development methodologies including waterfall and agile.Skilled in the use of multiple development technologies including Microsoft .NET (C#), ASP.NET/MVC, WCF/WebAPI, SQL Server, JavaScript frameworks (Angular, Knockout, etc.), REST, XML, JSON, HTML, Python, and CSS.Skill in architecting and deploying high volume, high transaction based, distributed, and critical web applications.Skill with Relational Database Management Systems (RDBMS) including DB2 and SQL Server.Skilled in verbal and written communication, interpersonal, conflict resolution, and customer service.Ability to work effectively in a fast-paced, high volume, deadline-driven environment.Ability to balance multiple demands and work both independently and as part of a team.Ability to conduct complex systems analysis and translate user requirements into business solutions.Ability to integrate research and best practices into problem avoidance and continuous improvement.Ability to architect cloud-based applications leveraging PaaS (Platform as a Service) and IaaS (Infrastructure as a Service) offerings for leading vendors such as Microsoft Azure.Ability to lead technical teams in delivering web technology architecture, design, and implementation.Ability to effectively work as part of a distributed development team.Ability to display professionalism in dealing with all levels of management and staff.Ability to exhibit creativity and resourcefulness at problem solving while collaborating and working effectively with others across varied disciplines.Ability to support security incident response efforts through analysis of system logs.Knowledge of OOP (Object Oriented Programming) concepts. Thanks, and regards.VikasSr. US IT Recruiter",
        "source": "Email",
        "date_posted": "2024-10-02 13:02:55-05:00",
        "unique_id": "1924ef86ea6631ff",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]