[
    {
        "company": "Sibitalent",
        "job_title": "Senior Python Developer",
        "location": "Newport Beach, CA, USA",
        "full_location": {
            "city": "Newport Beach",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Bachelor's or Master's degree in Computer Science, Engineering, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Python",
                "JavaScript",
                "C#",
                ".NET",
                "Azure",
                "AWS",
                "Snowflake",
                "Terraform",
                "Bicep",
                "Azure CLI",
                "CDK",
                "Redis",
                "Docker",
                "Git",
                "Gitlab CI/CD",
                "Database (NoSQL: CosmosDB, MongoDB, DocumentDB)"
            ],
            "primary": [
                "Django",
                "Flask",
                "PostgreSQL",
                "React",
                "Angular",
                "Vue.js",
                "Kubernetes",
                "Open AI",
                "Llama"
            ],
            "secondary": [
                "Excellent problem-solving skills",
                "Attention to detail",
                "Strong communication skills",
                "Teamwork skills",
                "Development Experience deploying Python solutions",
                "Azure Machine Learning",
                "AI Stack",
                "Asset Management",
                "Financial Services",
                "Real-time distributed systems"
            ],
            "all": [
                "Python",
                "JavaScript",
                "C#",
                ".NET",
                "Azure",
                "AWS",
                "Snowflake",
                "Terraform",
                "Bicep",
                "Azure CLI",
                "CDK",
                "Redis",
                "Docker",
                "Git",
                "Gitlab CI/CD",
                "Database (NoSQL: CosmosDB, MongoDB, DocumentDB)",
                "Django",
                "Flask",
                "PostgreSQL",
                "React",
                "Angular",
                "Vue.js",
                "Kubernetes",
                "Open AI",
                "Llama",
                "Excellent problem-solving skills",
                "Attention to detail",
                "Strong communication skills",
                "Teamwork skills",
                "Development Experience deploying Python solutions",
                "Azure Machine Learning",
                "AI Stack",
                "Asset Management",
                "Financial Services",
                "Real-time distributed systems"
            ],
            "with_experience": [
                "Python (10+ years)",
                "Full-stack development (7+ years)",
                "Cloud-native APIs and micro-services with C# .NET"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Deepali Jha",
        "email": "deepali@sibitalent.com",
        "jd": "Hello,Hope you are doing well!!My name is Deepali Jha and I am a Staffing Specialist at Sibitalent. I am reaching out to you on an exciting job opportunity with one of our clients. Job Title: Senior Python DeveloperVisa :: H4-EAD or OPT-EADLocation:: Newport Beach, CA or Nashville, TN (Hybrid)Duration :: 12 months Experience :: 10+ years Note: Any applicant with less than 5 years working in the USA will be rejected immediately.Seeking candidates who can work on-site in Newport Beach, CA (4 days a week onsite) or Nashville, TN (3 days a week onsite) Requirement:5 years at least in USINVESTMENT BANK EXPERIENCE, NOT RETAIL BANKSNo summaries or technology tables in the resumeResume no longer than 4 pages Role Overview:We are seeking a highly skilled and experienced Senior Python Engineer with a strong background in full-stack development to join our team.The ideal candidate will have a deep understanding of both front-end, middle-tier and back-end technologies, with a passion for developing scalable, high-performance applications.You will play a key role in the entire application lifecycle, from concept stage to delivery and post-launch support. Our Tech Stack includes: Python, JavaScript (& based frameworks), C#,.NET, Azure, AWS, Snowflake, Terraform, Bicep, Azure CLI, CDK, Redis, Docker, Git, Gitlab CI/CD, Database (NoSQL: CosmosDB, MongoDB, DocumentDB)Responsibilities:Design, develop, and maintain efficient, reusable, and reliable Python code.Lead the development of high-quality web applications, micro-services, and APIs.Collaborate with cross-functional teams to define, design, and ship new features.Implement security and data protection solutions.Optimize applications for maximum speed and scalability.Mentor junior developers and promote a culture of continuous learning and improvement.Apply proven cloud-native patterns & practices to deliver robust solutions with API First mindset.Deliver solutions with responsive design across Desktop, tablet and Mobile UX.Ensure exceptional software quality via test-driven development (TDD) standards.Continued focus on platform sustainability and supportabilityStay informed on emerging technologies and industry trends and apply them into operations and activities. Requirements:Bachelor's or Master's degree in Computer Science, Engineering, or a related field.7+ years of experience in full-stack development with a strong focus on Python.Experience with Python web frameworks (e.g., Django, Flask).Solid understanding of object-oriented programming (OOP) principles.Familiarity with database technologies (e.g. PostgreSQL, CosmosDB, MongoDB).Familiarity integrating Cloud native Apps and micro-services with front-end frameworks (e.g., React, Angular, Vue.js).Experience with cloud services (e.g., Azure, AWS).Proficient in front-end technologies, including JavaScript, HTML5, and CSS3.Knowledge of containerization and orchestration technologies (e.g., Docker, Kubernetes).Strong understanding of code versioning tools, such as Git.Excellent problem-solving skills and attention to detail.Strong communication and teamwork skills.Experience building LLM Apps using Open AI, Llama or other AI foundation stacks.Experience developing cloud-native APIs and micro-services with C# .NET. Nice to Have:Development Experience deploying Python solutions (e.g., Web Apps, APIs, SPA integrations) to Azure with IaC (e.g., Azure CLI, Azd, Bicep, Powershell/Bash, Oryx).Experience with Azure Machine Learning or AI Stack (e.g., Azure Client Studio, Azure AI Studio).Experience in Asset Management and/or Financial Services is preferredExperience delivering real-time, distributed systems at large enterprise scale",
        "source": "Email",
        "date_posted": "2024-10-02 17:03:07-05:00",
        "unique_id": "1924fdcaedd416e8",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Python developer"
    }
]