[
    {
        "company": "Synkriom Inc",
        "job_title": "Lead Microsoft Dynamics 365 Developer",
        "location": "Charlotte, NC, USA",
        "full_location": {
            "city": "Charlotte",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Microsoft Dynamics CRM",
                "CRM Business Processes",
                "Integrations",
                "JavaScript",
                "C#"
            ],
            "primary": [
                "Sales Force Automation",
                "Marketing automation",
                "Service management",
                "Data Migration",
                "SSIS",
                "SSRS"
            ],
            "secondary": [
                "O365 Administration",
                "AD Synchronization",
                "CRM security model",
                "Custom/SSRS reports",
                "Agile development"
            ],
            "all": [
                "Microsoft Dynamics CRM",
                "CRM Business Processes",
                "Integrations",
                "JavaScript",
                "C#",
                "Sales Force Automation",
                "Marketing automation",
                "Service management",
                "Data Migration",
                "SSIS",
                "SSRS",
                "O365 Administration",
                "AD Synchronization",
                "CRM security model",
                "Custom/SSRS reports",
                "Agile development"
            ],
            "with_experience": [
                "Microsoft Dynamics CRM (2 implementation projects)",
                "Integrations with web services",
                "PlugIns",
                "Workflow",
                "business process flows",
                "custom scripts"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Mohini Devi",
        "email": "mohini.devi@synkriom.com",
        "jd": "From: MOHINI DEVI, Synkriom Inc mohini.devi@synkriom.com Reply to: mohini.devi@synkriom.com Hi, Hope you're doing well. Kindly find the job description below and if you are comfortable with the requirement, please share your updated resume. Visa: H1B, USC and GC Requirement ID: 9691509Location: Charlotte, NC~Malvern, PA ( Day One Onsite)Implementation: TCS (Contract Position) Role Description:Excellent in communication, documentation and articulation skills Client facing, assertive, excellent communication. Ensuring excellent Customer Satisfaction from Requirements and CRM Functional perspective High level understanding of Microsoft Dynamics CRM Online/Dynamics 365 product Proficient on CRM Business Processes in Sales Force Automation, Marketing automation and Service management functionality for CRM Online/Dynamics 365 CRMInvolved in various project activities like Requirement Gathering and Gap Fit Analysis Solution Design and configurations Experience in Integrations with other enterprise systems like ERP, LOB on premise and online systems Experience in integrations with MS Outlook, SharePoint, O365 Administration and AD Synchronization Data Migration using Scribe/SSIS or similar toolsShould have worked on extending dynamics CRM by plugins, custom workflow activities and web resources.Should have a good understanding of CRM security model Should have experience in creating OOB CRM and Custom/SSRS reports for CRM. Hands on Experience in configuring, customizing MS Dynamics CRM, CRM Web API and JavaScript (OData/REST). Extremely good understanding of Microsoft Dynamics CRM Online/Dynamics 365 product (Entities, Workflows and configuration) Exposure to Dynamics CRM technical aspects esp. Java-scripting, InstallationExtremely sound in Dynamics CRM Entities , workflows , configurations , customization development , integrations development.Sound in core .NET technology and SSRS Proficient on CRM Functional areas in Sales Force Automation, Marketing automation and Service management functionality. Extremely sound in core .NET technology and related areas - WCF, SSIS, SSRS, SQL Server Sound in deployment aspectsExperience of working as CRM Developer for at least 2 implementation projects Experience integrating CRM using web services (rest/soap) and messaging (NServiceBus) Expertise in writing PlugIns, Workflow, business process flows and custom scriptsKnowledge of best practices and guidelines for design and development in CRM 2013/2015? Hands on knowledge of Agile development Good and assertive in communication and articulation skills",
        "source": "Email",
        "date_posted": "2024-10-02 11:08:45-05:00",
        "unique_id": "1924e6aad4ee6fd4",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]