[
    {
        "company": "Technocraft Solutions LLC",
        "job_title": "Release Train Engineer (RTE) Scrum Master",
        "location": "Fountain Valley, CA, USA",
        "full_location": {
            "city": "Fountain Valley",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Leadership Skills",
                "Problem-Solving and Critical Thinking",
                "Communication Skills",
                "Technical Knowledge",
                "Organizational Change Management",
                "Conflict Resolution"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Leadership Skills",
                "Problem-Solving and Critical Thinking",
                "Communication Skills",
                "Technical Knowledge",
                "Organizational Change Management",
                "Conflict Resolution"
            ],
            "with_experience": []
        },
        "job_type": [],
        "contact_person": "Saurabh",
        "email": "saurabh@technocraftsol.com",
        "jd": "Hope you are doing well My name is Saurabh. And I am a Technical Recruiter at Technocraft Solutions LLC. I am reaching out to you on an exciting job opportunity with one of our clients. Role: Release Train Engineer (RTE)/Scrum MasterLocation: Fountain Valley, CA Job description:SKILLS REQUIRED:Leadership Skills: A strong leader with the capacity to motivate and influence teams is required for an effective RTE. They provide a good example and embody the concepts of Agile and Lean thinking. Problem-Solving and Critical Thinking: An RTE must be able to assess complicated challenges, identify root causes, and provide effective solutions. They should be knowledgeable about root cause analysis approaches. Communication Skills: Communication must be clear, straightforward, and compassionate. The RTE must effectively communicate with teams, stakeholders, and leadership to ensure alignment and understanding. Technical Knowledge: While not necessarily required, having technical knowledge or experience in software development can be beneficial in understanding the ART s work and effectively conducting technical talks. Organizational Change Management: The RTE is frequently used to guide firms through Agile transitions. Understanding the principles and techniques of change management is advantageous. Conflict Resolution: Conflicts can occur inside teams as well as at the program level. To maintain a harmonious and productive atmosphere, the RTE must be skilled in dispute resolution and negotiation.",
        "source": "Email",
        "date_posted": "2024-10-02 14:53:44-05:00",
        "unique_id": "1924ecb07171de4a",
        "emp_type": [
            "third party"
        ],
        "tag": "Scrum Master"
    }
]