[
    {
        "company": "Msysinc",
        "job_title": "Business Analyst",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Software Development Lifecycle",
                "Requirements Gathering",
                "Azure DevOps",
                "Communication Skills"
            ],
            "primary": [
                "MS Office",
                "Project Management",
                "Liaison Experience",
                "Complex IT Web Applications"
            ],
            "secondary": [
                "Microsoft SharePoint",
                "Project Management Methodologies"
            ],
            "all": [
                "Business Analysis",
                "Software Development Lifecycle",
                "Requirements Gathering",
                "Azure DevOps",
                "Communication Skills",
                "MS Office",
                "Project Management",
                "Liaison Experience",
                "Complex IT Web Applications",
                "Microsoft SharePoint",
                "Project Management Methodologies"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Rohit",
        "email": "resume@msysinc.com",
        "jd": "From: Rohit, Msysinc resume@msysinc.com Reply to: resume@msysinc.com Title: Business Analyst - Hybrid - Onsite interview - Lansing, MI.Location: Lansing, MI, United StatesLength: Long termRestriction: W2 or C2CSend resume to: resume@msysinc.com, rohit@msysinc.com Description:*** Very long term project initial PO for 1 year and usually the project goes for 3/5 years with this customer *** *** Hybrid *** 2 days a week onsite(Tuesdays and Wednesdays) ****** Interviews: 1st round interviews will be held via MS Teams. 2nd round interviews will likely be held in person, so candidates should be available for an inperson interview. ****** Local candidates (strongly preferred) or non local candidates who are willing to relocate ***Business Analyst Level 3 Position Description Seeking a Business Analyst to assist with the Michigan Department of Education (MDE) Grants Management System known as NexSys. The MDE Grants Management System is comprised of about 130/140 different grant applications that is responsible for over 2 billion dollars of payments to state educational entities. Business AnalystWe are looking for someone who understands and has experience with the software development lifecycle as they will be managing work requests to support operational support needs for web applications and gather requirements for project initiatives. This role is the liaison between the technical team and the business client. This will be about 90% of the time for this resource.Tasks:Facilitates meetings with the technical team and business client.Gathers requirements and project specifications by leading requirement sessions independentlyMaintain backlog of work items in Azure DevOpsManage project tasks, timelines, and communication between business product owner and development team associated with the Change Management lifecycleTrack sprints and ticket progress in Azure DevOpsEnsures the team is adhering to the department change management policiesActs as a liaison with State of Michigan auditorsMaintains documentation on the project SharePoint Site.Must be detail oriented and a critical thinkerProvide management with information such as project status reports and resource demand projections.Clear and concise communication skills required. Required Skills:Exposure to Complex IT web Applications, within the past 5 yearsExperience in a professional office environment 5 years Experience in a role, as a business analyst, supporting a software development project, in the past 5 years 3 YearsAbility to conduct meetings, communicate at a level appropriate to the audience, make oral and written reports and presentations 3 YearsProficiency with MS Office 3 YearsExperience working as a liaison between the development team and project manager or business client in a software development project 2 YearsExperience with Azure DevOps 6 MonthsHighly Desired Skills:Knowledge and understanding of the Software Development Lifecycle 2 YearsProject management skills and knowledge in project management and related methodologies 6 monthsExperience with Microsoft SharePoint 6 months",
        "source": "Email",
        "date_posted": "2024-10-02 12:35:05-05:00",
        "unique_id": "1924e4c5ede0312a",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]