[
    {
        "company": "Panzer Solutions LLC",
        "job_title": "SQL Server DBA",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "3-6 years",
            "degree_required": "Education in SQL Database Administration.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "3-6 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SQL Database",
                "Windows Server OS",
                "SQL Management Studio",
                "SQL",
                "T-SQL",
                "Data Tuning",
                "Query Tuning",
                "Database Security"
            ],
            "primary": [
                "SQL scripting",
                "Application software tools",
                "Application development methodology",
                "Visual Studio",
                "WebSphere Application Server"
            ],
            "secondary": [
                "Access DB experience",
                "Good organization and workload management skills",
                "Effective written and oral communication skills"
            ],
            "all": [
                "SQL Database",
                "Windows Server OS",
                "SQL Management Studio",
                "SQL",
                "T-SQL",
                "Data Tuning",
                "Query Tuning",
                "Database Security",
                "SQL scripting",
                "Application software tools",
                "Application development methodology",
                "Visual Studio",
                "WebSphere Application Server",
                "Access DB experience",
                "Good organization and workload management skills",
                "Effective written and oral communication skills"
            ],
            "with_experience": [
                "SQL Database (3-6 years)",
                "T-SQL",
                "Data Tuning",
                "Query Tuning",
                "Database Security"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Sam",
        "email": "sam@panzersolutions.com",
        "jd": "From: Sam, Panzer Solution LLC sam@panzersolutions.com Reply to: sam@panzersolutions.com Hi ,Hope you are doing well My name is Sam and I am working as a Talent Acquisition at Panzer Solutions LLC.We deal with US IT and non IT recruitment services. We have the below opening with our preferred client,let me know if you are available & interested in this position. If interested please share a copy of your resume and best time, number to reach. Position : SQL Server DBA Location : 100% remote Duration : 3-6 months Contract SQL SERVER DBAThis position is within the Tools and DBA section of Application Management and will be required to extract data and create reports to address legal questions in conjunction with discovery efforts associated with ongoing legal investigation. • Work with our legal analysts in providing data/analysis to adequately address submitted requests in a manner that is meaningful and relative to the legal questions asked. Format and present in a user-friendly format.• Consults with programmer/system analysts, peers, business users, outside agencies, third parties and vendors on issues related to the database and application software and if needed, presents written and oral solution and analyses. The procedure to resolve will vary based on the issue/question raised. • Convert or transfer database files or tables from existing storage locations and formats to replacement locations and formats; develop and test automated means for performing conversion to assign reports.• Ensure software and application documentation is prepared and updated this assigned projects, problem reports, work efforts and service requests.• Analyze content and quality of databases, recommend data management procedures, and develops extraction processes.• Identify opportunities for process improvement and automation.• Work closely with cross-functional teams to understand their data needs and provide support.• Other duties as assigned. Preferred skills: • At least 3 to 6 years of experience as an SQL Database Administrator in a Windows Server environment 2008, 2012, 2014, 2016 or 2019. • Education in SQL Database Administration. • Knowledge and experience with application software tools and application development methodology through complete life cycles. - preferred• Knowledge and experience with the following system software; database management, SQL scripting/programming and operating systems:O SQL Database - must have, current knowledge and trainingO Windows Server OS, functions/commands - must haveO SQL Management Studio – must haveO SQL – must haveO SQL scripting and modifications of files generated out of the DB – must haveO Extensive knowledge of T-SQL (Stored Procedures, Triggers, Indexing, Agents), Data Tuning and cleansing, Query Tuning, and Database Security – must haveO Visual Studio – preferredO WebSphere Application Server – optional.• Ability to deal effectively with the information technology needs of: IT technicians and development staff; business users; and software vendor and management staff. – Strongly preferred• Good organization and workload management skills. - Strongly preferred• Effective written and oral communication skills and ability to establish and maintain good rapport with agency staff for effective and timely problem identification, resolution, and work efforts. - Strongly preferred.• Capability to work independently and effectively in complex environments.• Access DB experience - optional. Thank youSam",
        "source": "Email",
        "date_posted": "2024-10-02 16:34:33-05:00",
        "unique_id": "1924f2750fe5eb84",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "DB Admin"
    }
]