[
    {
        "company": "Pivotal",
        "job_title": "Senior Business Analyst",
        "location": "Quincy, MA, USA",
        "full_location": {
            "city": "Quincy",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "3 years",
            "degree_required": "Bachelor’s degree in computer science, Information Systems, Business Administration, or a related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$52/hr C2C",
            "job_code": "",
            "contact_person": "Mayank Mer",
            "email": "mayank.mer@pivotal-technologies.com"
        },
        "skills": {
            "core": [
                "Jira",
                "Long Term Care Population",
                "Complex eligibility systems",
                "Microsoft Suite"
            ],
            "primary": [
                "AWS",
                "Cloud Rehosting",
                "Software Development Life Cycle (SDLC)",
                "Project Management"
            ],
            "secondary": [
                "Attention to detail",
                "Communication skills",
                "Flow charts",
                "Diagrams",
                "Use Cases"
            ],
            "all": [
                "Jira",
                "Long Term Care Population",
                "Complex eligibility systems",
                "Microsoft Suite",
                "AWS",
                "Cloud Rehosting",
                "Software Development Life Cycle (SDLC)",
                "Project Management",
                "Attention to detail",
                "Communication skills",
                "Flow charts",
                "Diagrams",
                "Use Cases"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Mayank Mer",
        "email": "mayank.mer@pivotal-technologies.com",
        "jd": "Need local to MA only || We need DL || Healthcare Background \nRole : Senior Business Analyst\nLocation: 100 Hancock St, Quincy, MA 02171, Hybrid – 2-3 days per week onsite\nRate : $52/hr C2C\nMust show proof of residency (License copy) at time of submittal\nMust have BA Experience\nCloud – preferred AWS\nLong term care population or complex eligibility systems\nJIRA\nImportant Skills\nTechnical – Jira, Long Term Care Population, Complex eligibility systems, and unified processes. Proficiency in Microsoft Suite\nSoft – Attention to detail, ability to communicate with technical and business stakeholders – prepare flow charts, diagrams and use cases. Deliver oral and written instructions in a precise and understandable manner.\nPOSITION OVERVIEW: EOHHS (EHS) is developing a strategic plan to streamline and combine its current eligibility and enrollment processes through the One Health initiative. Eligibility and enrollment processes for MAGI members, currently serviced through the Health Insurance Exchange (HIX), and non-MAGI members, currently serviced through the legacy MA21 mainframe system. The system will be modernized on a modular basis to provide a single point of access for individuals and/or families applying for public health insurance benefits. The modernization will provide common data storage and eligibility determination processes and rules for all Medicaid programs. To develop a plan for implementing a single point of access for benefits, EOHHS is undertaking an intensive effort to map the current state of Medicaid and MA21 operations and the systems that support those operations, then will port those operations and systems to a new infrastructure. The MA21 system is the MassHealth legacy, mainframe-based eligibility determination system that manages seniors and those in need of long-term care services populations. These populations are also described as non-MAGI. MA21 seeks a highly motivated Sr. Business Analyst (SBA) to liaison between the business community, the technical development team, and Cloud Rehosting Vendors. The business analyst will be mainly responsible for determining operational objectives by studying existing mainframe-based business functions, gathering information, and evaluating output requirements and formats for the AWS cloud transition. The SBA for MA21 will analyze requirements, construct workflow charts and diagrams, study system capabilities, and write specifications. The SBA will analyze business and user needs and document Use Cases that conclude with approved Functional Requirements. The SBA is an active member in all phases of the Software Development Life Cycle (SDLC), including postproduction verification. The SBA will ensure that the implemented cloud rehosting project, maintenance enhancements that may be implemented on the cloud platform, or defect fixes that need to be remediated on the cloud platform meet the requirements of the business community. The first step in porting operations and systems to a new infrastructure will be to rehost the legacy MA21 mainframe system in the AWS cloud. The successful candidate will support the MA21 AWS Cloud rehosting effort in support of the One Health Initiative.\nResponsibilities: Act as liaison between business users, the MA21 development group, and Cloud Vendors to gather and document Scope, Use Cases, and Functional Requirements. Prepare, manage and communicate project plans and coordinate project activities with team members as required. Create and maintain required Unified Process artifacts for the approved SDLC process. Submit the artifacts for review, distribution, and business approvals. Participate in the preparation/execution of test plans and/or test criteria. Prepare or administer the preparation of implementation plans, user guides, and/or documentation as required. Facilitate interactions with other IT areas and business units, both internal and external. Serve as liaison between EHS development groups and Infrastructure Teams. Serve as Project Manager, as required, for simple projects and report projects and task status to senior management. Diagnose and resolve system performance problems identified by Production Control, users, or management. Communicate effectively with business users and managers. Ensure project documentation, plans, and scheduling comply with agency initiatives and priorities. Identify, communicate, and facilitate a resolution to any production support, user requests, or triaged Helpdesk tickets. Monitor and measure the success of implemented solutions in the Production environment. Participate in release meetings for maintenance and development projects, ensuring all platform requirements are met. Work closely with QA to resolve any issues prior to the release date. Identify risks, potential scope creeps and escalating issues to the client and management. Create Unit test results in accordance with process Scope and Business requirements. Ensure testing validates the quality, reliability, and completeness of business services deployed on the new platform.\nPreferred Qualifications: Knowledge of the principles of software development using the approved SDLC. Proficient knowledge of Jira, Long Term Care Population, Complex eligibility systems, and Unified processes. Proficiency in Microsoft 365, Excel, Word, PowerPoint, Access, and Visio. Knowledge of methods and techniques of computer systems analysis, design, technical terminology, codes, and standard abbreviations. Experience with one or more of the following: data structures, application programming, database development, or relational database theory and technology. Ability to prepare flow charts, diagrams, and Use Cases. Deliver oral and written instructions in a precise, understandable manner. Prepare required deliverables in accordance with established procedures. Strong organizational skills with the ability to maintain accurate records and status reporting. Ability to understand and apply the policies, procedures, specifications, standards, and guidelines governing assigned unit activities. Knowledge of MA HIX or other State Health Exchange. Ability to work with multiple vendors. Strong organizational skills, problem-solving aptitude, and attention to detail. Ability to work well with others in a fast fast-paced, dynamic environment. Strong initiative and ability to manage multiple projects, as well as strong follow-through skills. Must be able to work collaboratively, collegially, and cooperatively with others in an environment where deliverables are potentially dependent on the output of others.",
        "source": "Email",
        "date_posted": "2024-10-02 09:11:58-05:00",
        "unique_id": "1924d928cab9b12a",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]