[
    {
        "company": "Msysinc",
        "job_title": "Accessibility Analyst/SME with Gov Exp - Hybrid",
        "location": "Saint Paul, MN, USA",
        "full_location": {
            "city": "Saint Paul",
            "state": "MN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "4 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Web Content Accessibility Guidelines (WCAG)",
                "WCAG 2.1 AA compliance",
                "accessibility testing",
                "JAWS",
                "NVDA",
                "ZoomText",
                "VoiceOver Screen Reader Software",
                "TalkBalk",
                "aXe testing tool"
            ],
            "primary": [
                "communication skills",
                "project management methodology",
                "business process improvements",
                "vendor management"
            ],
            "secondary": [
                "IAAP certification",
                "code review",
                "government experience",
                "inclusive design"
            ],
            "all": [
                "Web Content Accessibility Guidelines (WCAG)",
                "WCAG 2.1 AA compliance",
                "accessibility testing",
                "JAWS",
                "NVDA",
                "ZoomText",
                "VoiceOver Screen Reader Software",
                "TalkBalk",
                "aXe testing tool",
                "communication skills",
                "project management methodology",
                "business process improvements",
                "vendor management",
                "IAAP certification",
                "code review",
                "government experience",
                "inclusive design"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "k mahesh",
        "email": "mahesh@msysinc.com",
        "jd": "From: k mahesh, Msysinc mahesh@msysinc.com Reply to: mahesh@msysinc.com Title: Accessibility Analyst/SME with Gov Exp - HybridLocation: Saint Paul, MN, United StatesLength: Long termRestriction: W2 or C2CSend resume to: kmahesh@msysinc.com Description:*** Very long term project initial PO for 1 year but expect to go for 3/4 years *** Webcam Interview*** *** Hybrid ***In this role the business analyst will work on a project team to support Disability Accessibility of Web Information and Services of State and Local Government Entities. The scope of the project will cover websites, SharePoint sites, documents, applications developed by the and third party vendors products/services. Successful candidates for this role will demonstrate the ability to facilitate project deliverables such as drafting software business requirements, robust gap analysis of digital content, current state process mapping, and development of processes to create digitally accessible online content. The list below indicates the projects for which the project manager would have responsibilities:Digital Accessibility ProjectProject Deliverables:The State PMO Manager will work with the contracted business analyst to determine the specific and necessary deliverables for each project based on how each of the projects is progressing during the contracted timeframe.The following project deliverables will be expected from the business analyst for each of the projects identified above. It should be noted that not all of the identified projects may be fully completed in the time period contracted, but all projects must complete at a minimum, the deliverables for the stages determined by the State PMO Manager and have concrete plans in place for project execution. Therefore, the list below indicates all deliverables expected to be delivered for projects that are completed within the contracted timeframe.Map current processes that generate digital content from creation to publication.Identify processes that result in materials that are not digitally accessible.Analyze identified problems/gaps to determine whether system changes are required.Document business process improvements for projects to develop a representation of functionality to be used by the business to understand itself better, improve the business system, or design future state business processes to meet the courts needs.Work directly with the project team to ensure understanding of the IT solutions requirements, functionality, size, and scalability.Facilitate meetings with business owners and subject matter experts to identify impacted business processes and document the project business requirements.Work with vendors on business and system analysis practices and project requirements.Perform detailed research when required and reports research findings to the project team.In addition to the above deliverables, the selected business analyst will participate in project team meetings and maintain all necessary communications between team members, the State PMO Manager and other State leadership, as necessary. Resume must clearly demonstrate the following:Required Minimum Qualifications:Demonstrated subject matter expertise in Web Content Accessibility Guidelines (WCAG) and a thorough understanding of its legal requirements.Strong experience with assessing WCAG 2.1 AA compliance according to legal requirementsAwareness and understanding of technical, legal, and compliance concerns related to accessibility.Four years hands on accessibility testing experience covering quality assurance, usability, access requirements, and inclusive design.Knowledge in applying accessibility tools such as JAWS, NVDA, ZoomText, VoiceOver Screen Reader Software for iOS, TalkBalk for Android, and automated aXe testing tool.Access to reliable transportation as this position may require travel. Required Skills:Ability to communicate, both orally and in writing, and to translate technical terminology into terms understandable to non technical employees.Ability to interact with and influence resources at every level within the organization.Ability to work with vendors, architects, and highly technical resources to implement projects and resolve issues.Knowledge of and expertise in project, program and portfolio management methodology, tools and techniques desired. Desired Skills:Current IAAP certification, such as WAS, CPWA, and/or ADS or equivalent.Capable of code review to ensure proper digital accessibility structural setup (e.g., landmarks, headings, lists).Work experience in a state agency, criminal justice, or other government settings.Other related certifications",
        "source": "Email",
        "date_posted": "2024-10-02 14:26:23-05:00",
        "unique_id": "1924f530a2d57838",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]