[
    {
        "company": "TEK Inspirations LLC",
        "job_title": "Software Developer ( Java )",
        "location": "Albany, NY, USA",
        "full_location": {
            "city": "Albany",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "60 months",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "J2EE",
                "Spring",
                "JDBC",
                "JavaScript",
                "JSON"
            ],
            "primary": [
                "SQL",
                "XML",
                "DB2",
                "MQ",
                "JMS",
                "Kafka"
            ],
            "secondary": [],
            "all": [
                "J2EE",
                "Spring",
                "JDBC",
                "JavaScript",
                "JSON",
                "SQL",
                "XML",
                "DB2",
                "MQ",
                "JMS",
                "Kafka"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Shubham Singh",
        "email": "shubham@tekinspirations.com",
        "jd": "Hello,I Hope you are great in good health and sprit 🙂 !! Note: Urgent Java Developer opportunity in WA Harriman Campus Location Need consultant with DL, Visa, Passport Copy, Three References and Degree Copy ( If needed )The client has a new MANDATE for contractors to adhere to, or they will reject the submission, please pay attention to this section in the skills form. (Option 1, 2, and/or 3 section on the skills form must be completed in its entirety and a copy of supporting documents must be provided or the submission will be rejected, BOTH INFORMATION AND DOCUMENTS needed.Please only send candidates that will provide the following documents listed when requested Must provide: Résumé Degree ( if requested in the skills form)Three referencesDriver’s LicenseGreen CardVisa Passport Job Description -Job Title: Software Developer ( Java )Skill Level: SeniorWhat are the daily work hours: 7 am - 5:00 pmWhere is the physical work office located: WA Harriman Campus, Building 8, Albany, NY, 12227If YES, note if negotiable or list the percentage allowed/number of days allowed per week: Onsite for first four months, then up to 40% each 2 week pay period.What is the format of the Candidate interview: WebcastingIf Webcasting, is Candidate required to be on camera: Yes Provide a short description of the Position: This position will be in support of the NYS Tax Modernization Program. This program will encompass multiple projects to modernize legacy systems within the NYS Department of Taxation and Finance, which is responsible for billions in state revenue. This position is targeted for the Real Property Systems Modernization project.Provide a complete list of the day-to-day tasks to be performed by the Selected Candidate: The selected candidate will be a lead developer for the Tax Modernization effort and provide support for maintenance activities. Specific duties include but are not limited to:Obtain business requirements to develop automated applications which meet business priorities.Provide lead programming duties for tax related applications.Develop and mentor staff using various technologies including J2EE, Spring, JSON, JavaScript and JDBC.Develop and review detailed documentation for system and program change requirement including detail specifications documents.Assist and provide guidance through all phases of the project management life cycle.Develop unit test plans based on coding changes and user specifications. Conduct unit testing and debugging of all code changes in the development environment.Coordinate the migration of all code changes (programs, procedures, etc.) from development environment into user test environment.Assist team members using distributed technologies including Java, DB2, XML and XQuery. Ensure that staff members are properly trained and mentored.Provide support, as needed, for defects and issue resolution. Ensure that defects and issues are addressed promptly based on priority.Facilitate and participate in meetings with ITS and DTF customers.Communicate clearly, both verbally and in writing, with DTF management and users, ITS management, and team members. List all the Position REQUESTED Qualifications:60 months experience with J2EE technologies including JDBC, JSP and XML.60 months experience developing, building, and testing Java EE applications using modern IDE's, such as Eclipse, Netbeans, or IntelliJ.60 months experience with Spring/Struts using application servers such as Tomcat, JBoss, Websphere or Weblogic60 months experience writing SQL statements for relational databases.60 months of experience in system analysis and design of multi-tiered transactional systems.36 months of experience in messaging technologies, such as MQ, JMS, Kafka.Required Documentation:RésuméCopy of Candidate Identification (i.e., Driver's License/Green Card/Visa and Passport if applicable)Any documents referenced in the above Requested Qualifications (i.e., professional certifications, degrees, etc.) Are there additional security requirements for the Authorized User: YesIf YES, include the additional security requirements: Mandatory ITS Security Agreements and Fingerprint-based Background Check.Will additional training potentially be required during the Engagement: YesIf YES, provide description of anticipated training: Annual workplace policy trainingWhat type and/or manner, of knowledge transfer is requested during the Engagement: Documentation and trainingIs travel anticipated during the Engagement: No Regards!! Shubham SinghTechnical Recruiter| IT Healthcare & InformaticsTEK Inspirations LLC | 13573 Tabasco Cat Trail, Frisco, TX 75035 Email: shubham@tekinspirations.com II Phone: +1 469-498-0636Whats'up No. :+91-(953-232-0892) Disclaimer: If you are not interested in receiving our e-mails then please reply with a \"REMOVE\" in the subject line to remove@tekinspirations.com. And mention all the e-mail addresses to be removed with any e-mail addresses,which might be diverting the e-mails to you. We are sorry for the inconvenience",
        "source": "Email",
        "date_posted": "2024-10-02 15:01:25-05:00",
        "unique_id": "1924f31f176d13e7",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]