[
    {
        "company": "Cloud Think Technologies",
        "job_title": "Full Stack .Net Developer",
        "location": "San Jose, CA, USA",
        "full_location": {
            "city": "San Jose",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "C#"
            ],
            "primary": [
                "E-commerce"
            ],
            "secondary": [
                "Agile",
                "Scrum",
                "Automated Testing",
                "CI/CD",
                "Code Reviews",
                "Version Control Systems (GIT)"
            ],
            "all": [
                "C#",
                "E-commerce",
                "Agile",
                "Scrum",
                "Automated Testing",
                "CI/CD",
                "Code Reviews",
                "Version Control Systems (GIT)"
            ]
        },
        "job_type": [
            "onsite",
            "hybrid"
        ],
        "contact_person": "Rohit Yadav",
        "email": "rohit@cloudthinktech.com",
        "jd": "Hi, This is Rohit Yadav, Senior Technical Recruiter from Cloud think tech Inc. I have urgent requirement for the position mentioned below. Please let me know if you are interested regarding this position.Reply me with your confirmation, waiting for your positive reply. Job: Full-Stack Software EngineerLocation: San Jose, CA (onsite)Term: 12+ Months Visa : ALL VISA Linked in must Must have C# + E-commerce experience Job DescriptionBusiness partner is looking for a highly motivated Software Engineer to join our Product Led Growth team under the Growth vertical. The Software Engineer will execute on all aspects of the software development lifecycle including design, development, testing, deployment, and maintenance of the e-commerce application. This position is an individual contributor role reporting to the Sr. Engineering Manager, Commerce Services. Responsibility Write high-quality code, primarily in C#, that is easy to maintain and testMaintain and develop automated tests for your codeParticipate in an Agile environment using Scrum software development practices, automated unit testing, CI/CD, code reviews, version control systems (GIT)Raise issues proactively that might impact delivery commitmentsAvailability to diagnose and resolve production impacting issues and maintain the code as needed Job Designation Hybrid:Employee divides their time between in-office and remote work. Access to an office location is required. (Frequency: Minimum 2 days per week; may vary by team but will be weekly in-office expectation)",
        "source": "Email",
        "date_posted": "2024-10-02 11:59:10-05:00",
        "unique_id": "1924e2eecfcac8e5",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]