[
    {
        "company": "Dia Software Solutions",
        "job_title": "Business Analyst Level 3",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "12+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "1 year with extension possible",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Software Development Lifecycle",
                "Azure DevOps",
                "MS Office",
                "Communication Skills"
            ],
            "primary": [
                "Project Management",
                "Documentation",
                "Liaison between technical team and business client",
                "Requirements Gathering",
                "Meeting Facilitation"
            ],
            "secondary": [
                "Microsoft SharePoint",
                "Change Management",
                "Critical Thinking",
                "Detail Oriented"
            ],
            "all": [
                "Business Analysis",
                "Software Development Lifecycle",
                "Azure DevOps",
                "MS Office",
                "Communication Skills",
                "Project Management",
                "Documentation",
                "Liaison between technical team and business client",
                "Requirements Gathering",
                "Meeting Facilitation",
                "Microsoft SharePoint",
                "Change Management",
                "Critical Thinking",
                "Detail Oriented"
            ],
            "with_experience": [
                "Business Analysis",
                "Software Development Lifecycle",
                "Azure DevOps",
                "MS Office"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Sayyad Akif Husain",
        "email": "sayyad.husain@diasoftwaresolutions.com",
        "jd": "From: Sayyad Akif Husain, Dia Software Solutions sayyad.husain@diasoftwaresolutions.com Reply to: sayyad.husain@diasoftwaresolutions.com Hi,I hope this message finds you well! I am reaching out to you on an exciting Direct client opportunity with one of our clients. Can you please go through the requirements and let me know if you are interested in this position?Job Title: Business Analyst Level 3Location: Lansing, MIHybridExperience: 12+ yearsDuration: 1 year with extension possible Interviews: 1st round interviews will be held via MS Teams. 2nd round interviews will likely be held in person, so candidates should be available for an in-person interview.Duration: 1 year with extension possiblePosition location: Lansing, MI. Resource will be working a hybrid schedule. NO REMOTE ONLY OPTION. Will need to be onsite from day 1, two days a week (Tuesdays and Wednesdays).Local candidates (strongly preferred) or non-local candidates who are willing to relocate and follow the hybrid work schedule from day 1 may be submitted. Clear and concise communication skills required. Business AnalystWe are looking for someone who understands and has experience with the software development lifecycle as they will be managing work requests to support operational support needs for web applications and gather requirements for project initiatives. This role is the liaison between the technical team and the business client. This will be about 90% of the time for this resource.Tasks:Facilitates meetings with the technical team and business client.Gathers requirements and project specifications by leading requirement sessions independentlyMaintain backlog of work items in Azure DevOpsManage project tasks, timelines, and communication between business product owner and development team associated with the Change Management lifecycleTrack sprints and ticket progress in Azure DevOpsEnsures the team is adhering to the department change management policiesActs as a liaison with State of Michigan auditorsMaintains documentation on the project SharePoint Site.Must be detail oriented and a critical thinkerProvide management with information such as project status reports and resource demand projections. Desired Start Date: October 21st; start date is flexibleWork location is hybrid, 2 days in office (Tuesday & Wednesday) and 3 days working from home. (Candidate can be full time in office, if desired.)Contract Length: 12 months.• Contract may be extended as desired.SkillRequired / DesiredRequired Years of experienceExposure to Complex IT web Applications, within the past 5 yearsRequired5 YearsExperience in a professional office environmentRequired5 YearsExperience in a role, as a business analyst, supporting a software development project, in the past 5 yearsRequired3 YearsAbility to conduct meetings, communicate at a level appropriate to the audience, make oral and written reports and presentationsRequired3 YearsProficiency with MS OfficeRequired3 YearsExperience working as a liaison between the development team and project manager or business client in a software development projectRequired2 YearsExperience with Azure DevOpsRequired6 MonthsKnowledge and understanding of the Software Development LifecycleHighly Desired2 YearsProject management skills and knowledge in project management and related methodologiesHighly Desired6 MonthsExperience with Microsoft SharePointHighly Desired6 Months Thanks & Regards, Sayyad Akif Husain______________________ DIA Software Solutions LLC, Contact: 228-280-4778 | Email: sayyad.husain@diasoftwaresolutions.comAddress: Austin, TX | Website: Diasoftwaresolutions.com",
        "source": "Email",
        "date_posted": "2024-10-02 14:22:24-05:00",
        "unique_id": "1924eb8f8075865c",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]