[
    {
        "company": "Tanisha Systems Inc",
        "job_title": "Analytics - Snowflake and Hadoop",
        "location": "Wilmington, DE, USA",
        "full_location": {
            "city": "Wilmington",
            "state": "DE",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "7+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Snowflake",
                "Hadoop",
                "AWS",
                "Java",
                "SQL"
            ],
            "primary": [
                "Data pipelines",
                "Apache Spark",
                "Kafka",
                "ETL tools",
                "Cloudwatch"
            ],
            "secondary": [
                "CI/CD",
                "Agile methodologies",
                "DataDog metrics",
                "AdTech",
                "MarTech"
            ],
            "all": [
                "Snowflake",
                "Hadoop",
                "AWS",
                "Java",
                "SQL",
                "Data pipelines",
                "Apache Spark",
                "Kafka",
                "ETL tools",
                "Cloudwatch",
                "CI/CD",
                "Agile methodologies",
                "DataDog metrics",
                "AdTech",
                "MarTech"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Akshat Kumar",
        "email": "akshat@tanishasystems.com",
        "jd": "Greetings..!! My name is Akshat, and I am a Technical Recruiter at Tanisha Systems Inc. Tanisha Systems Inc is a global contingency staffing firm servicing. We have an excellent job opportunity with one of our clients. Role: Analytics - Snowflake and Hadoop Location : Wilmington, DE (Onsite- 3 days per week)Type: ContractExp: 7+ yrsJob Description:Job responsibilityExecutes software solutions, design, development. and technical troubleshooting with ability to think beyond routine of conventional approaches to build solutions or break down technical problemsCreates secure and high-quality production code and maintains algorithms that run synchronously with appropriate systemsProduces architecture and design artifacts for complex applications while being accountable for ensuring designconstraints are met by software code developmentGathers, analyzes, synthesizes, and develops visualizations and reporting from large, diverse datasets in service ofcontinuous improvement of software applications and systemsProactively identifies hidden problems and patterns in data and uses these insights to drive improvements to coding hygiene and system architectureContributes to software engineering communities of practice and events that explore new and emerging technologies.‘Adds to team culture of diversity. equity inclusion. and respectRequired qualifications, capabilities, and skills:Formal training or certification on software engineering concepts and 3+ years applied experienceHands-on practical experience in system design, application development, testing, and operational stabilityHands-on experience building data pipelines on AWS using Lambda, SQS, SNS, Athena, Glue, EMR Hands-on experience Data warehouse Proficient in coding in one or more languagesExperience in developing. debugging, and maintaining code in a large corporate environment with one or more modern programming languages and database querying languagesOverall knowledge of the Software Development Life CycleSolid understanding of agile methodologies such as CI/CD. Applicant Resiliency, and SecurityDemonstrated knowledge of software applications and technical processes within a technical discipline (eg. cloud,artificial intelligence, machine learning, mobile, etc)Preferred qualifications, capabilities, and skills:Hands-on experience building data pipelines on AWS using Lambda, SQS, SNS, Athena, Glue, EMRStrong experience with distributed computing frameworks such as Apache Spark specifically Java SparkStrong hands-on experience building event driven architecture using KafkaExperience writing Splunk or Cloudwatch queries. DataDog metricsStrong experience on ETL tools such as Abiitio, Informatica, SSIS eteExperience writing SQL QueriesExperience working on AdTech/MarTech platforms is a plus RegardsAkshat KumarAkshat@tanishasystems.comwww.tanishasystems.comlinkedin.com/in/akshat-kumar-7245821a299 Wood Ave South, Suite # 308, Iselin, New Jersey, NJ 08830, USA",
        "source": "Email",
        "date_posted": "2024-10-02 09:18:02-05:00",
        "unique_id": "1924d98286d88d78",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]