[
    {
        "company": "Appian Infotech",
        "job_title": "PLM (Product Lifecycle Management) Teamcenter BA II",
        "location": "Hillsboro, OR, USA",
        "full_location": {
            "city": "Hillsboro",
            "state": "OR",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Siemens Teamcenter",
                "PLM processes"
            ],
            "primary": [
                "change management",
                "requirements management",
                "bill of materials (BOM)",
                "application integrations",
                "workflows"
            ],
            "secondary": [],
            "all": [
                "Siemens Teamcenter",
                "PLM processes",
                "change management",
                "requirements management",
                "bill of materials (BOM)",
                "application integrations",
                "workflows"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Chandan Mishra",
        "email": "chandan.m@appianinfotech.com",
        "jd": "From: Chandan Mishra, Appian Infotech chandan.m@appianinfotech.com Reply to: chandan.m@appianinfotech.com Hi My name is Chandan from Appian InfotechI have a new job opening for PLM (Product Lifecycle Management) Teamcenter BA II Hillsboro, OR. Please let me know if you are interested and share your updated resume. Job Title PLM (Product Lifecycle Management) Teamcenter BALocation: Hillsboro, OR OnsiteDuration: Contract Job Description: Requirements Translation and Solution Design: Bridge Requirements à You’ll translate business needs into technical capabilities within the Siemens Teamcenter PLM system. Application Capability Options à Provide options for implementing PLM solutions that align with business goals. Estimation and Prioritization à Generate estimates for development efforts and sequence delivery priorities. Testing Facilitation Ensure successful testing to achieve desired outcomes. Collaboration and Troubleshooting: Business and Technology Alignment à Work closely with product, business, and technology leaders. Design and troubleshooting à Collaborate with architects and development teams on system design, troubleshooting, and user acceptance testing (UAT). Technical Skills and Knowledge: Teamcenter Expertise à Solid background knowledge of Siemens Teamcenter. PLM Process Understanding à Familiarity with PLM processes. Additional Skills à Experience with change management, requirements management, bill of materials (BOM), application integrations and workflows.Thanks & RegardsChandan MishraTeam Lead - Recruitment Email-chandan.m@appianinfotech.comLinkedIn- https://www.linkedin.com/in/chandan-mishra-profile/Website - www.appianinfotech.com",
        "source": "Email",
        "date_posted": "2024-10-02 12:47:35-05:00",
        "unique_id": "1924e57893f6d982",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]