[
    {
        "company": "Supreme Court of Virginia",
        "job_title": ".NET Developer",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "College degree preferred",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".NET",
                "VB.Net",
                "C#",
                "SQL",
                "GIT"
            ],
            "primary": [
                "Object-Oriented development",
                "Software maintenance",
                "Unit and Functional Testing",
                "Linux",
                "Windows"
            ],
            "secondary": [
                "Java",
                "JavaScript",
                "Angular",
                "React",
                "Agile programming",
                "SOAP",
                "REST",
                "Apache",
                "IIS",
                "Fiddler",
                "PostMan",
                "SoapUI",
                "Informix",
                "GDPicture",
                "DevExpress",
                "iText"
            ],
            "all": [
                ".NET",
                "VB.Net",
                "C#",
                "SQL",
                "GIT",
                "Object-Oriented development",
                "Software maintenance",
                "Unit and Functional Testing",
                "Linux",
                "Windows",
                "Java",
                "JavaScript",
                "Angular",
                "React",
                "Agile programming",
                "SOAP",
                "REST",
                "Apache",
                "IIS",
                "Fiddler",
                "PostMan",
                "SoapUI",
                "Informix",
                "GDPicture",
                "DevExpress",
                "iText"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Shaily",
        "email": "shailesh.pandey@tekinspirations.com",
        "jd": "From: Shaily, Tek Inspirations shailesh.pandey@tekinspirations.com Reply to: shailesh.pandey@tekinspirations.com !! In Person Interview !! Job Description -.NET DeveloperHybrid – Richmond, VAClient – SC of VIRGINIAInterview – In personUSC/GCNeed LINKEDINMust have state client experienceLocal to RICHMOND only Work Environment: This is a hybrid-telework position, averaging three (3) days onsite per week at the Supreme Court of Virginia, located at 100 North Ninth Street, Richmond, Virginia 23219. The ability to telework and the schedule is up to the reporting manager’s discretion.Equipment: The resource will be provided the necessary equipment to perform their job duties.Physical Requirements: Ability to sit for extended periods and use computer equipment.Travel Requirements: No travel is required for this position.Position SummaryThe Office of the Executive Secretary of the Supreme Court of Virginia is seeking applicants for an experienced .Net Developer. The candidate will enhance, develop, and support applications for mission-critical enterprise imaging applications. The Case Imaging System (CIS), GeneralDistrict Imaging System (GDIS), and JDR Imaging System (JDIS) are existing productionapplications that require continuing enhancements, modifications, support, and development. This position is hybrid-telework with a minimum of three (3) assigned days per week at the Supreme Court of Virginia headquarters located at 100 North Ninth Street, in Richmond, Virginia.Standard .Net Developer Duties:Software Development in VB.Net and C# environment based on user requirements.Software maintenance for enhancements and bug fixes of existing applications.Unit and Functional Testing.PC support/maintenance in VB and shell scripting.Critical Analysis and collaboration with business analysts.Creation of deployment scripts in Linux or Windows as needed.Experience with Version Control: GIT (Primary), or Subversion.Training, documentation, and knowledge transfer of completed application. Minimum Qualifications/ExperienceMinimum 5+ years of proficiency with Object-Oriented development methodologies using MS .NET VB (primarily) and C# in a work environment.Database Experience using SQL in a mission-critical relational database application.Ability to work independently with minimal supervision.Excellent communication skills and ability to interact with other developers and second level support engineers. Additional Preferred QualificationsInformix experience storing images in blobspaces.Operating System Experience: Unix/Linux (RHEL), Windows.Experience with additional programming languages: Java, JavaScript Front-End Frameworks (Angular/React).Candidates who have experience with Imaging toolkits such as GDPicture, DevExpress, and iText will receive priority consideration.Experience with Agile programming methodology having multiple software iterations. Writing and debugging DDL/DML.Experience with Web Server (Apache/IIS) configuration and support, SOAP/REST Webservice Development, and Consumption.Strong troubleshooting experience using tools like Fiddler, PostMan, and SoapUI.College degree preferred.",
        "source": "Email",
        "date_posted": "2024-10-02 11:53:20-05:00",
        "unique_id": "1924e28c333ddb1a",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]