[
    {
        "company": "Veridian Tech Solutions, Inc",
        "job_title": "Lead Java Developer",
        "location": "Chicago, IL, USA",
        "full_location": {
            "city": "Chicago",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long-term Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Spring Boot",
                "Mongo",
                "Java",
                "Spring API"
            ],
            "primary": [
                "Microservices",
                "MQ"
            ],
            "secondary": [
                "Communication",
                "Collaboration",
                "Mentoring"
            ],
            "all": [
                "Spring Boot",
                "Mongo",
                "Java",
                "Spring API",
                "Microservices",
                "MQ",
                "Communication",
                "Collaboration",
                "Mentoring"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Nitin Raj",
        "email": "nitin@veridiants.com",
        "jd": "From: Nitin Raj, Veridian Tech Solutions nitin@veridiants.com Reply to: nitin@veridiants.com Hi,Greetings from Veridian Tech Solutions, Inc!!! This is Nitin from Veridian Tech Solutions, Inc. Veridian Tech Solutions, Inc is providing enhanced IT consulting to top Notch IT Clients. I would appreciate it if you could render the requirement details below and if interested, kindly share a copy of your resume, else please take a moment to forward these Job details to someone you think might be interested and good fit for the job. Find the JD for your reference. Position: Java Architect Location: Lead Java Developer Duration: Long-term Contract Must have: Experience in Spring Boot, MongoJob Description:Java Microservices Dev Lead - Strong Microservices experience with Sprint Boot implementation.Hands on knowledge and expertise in Mongo and MQStrong Java and Spring API Skills ExperienceBeing self-initiated and taking ownership of efforts.Communication and Collaboration with the product teams and the peer developers. Nice to have senior/lead developers experience with mentoring skills Roles: -Lead complex technology initiatives including those that are companywide with broad impact.Act as a key participant in developing standards and companywide best practices for engineering complex and large-scale technology solutions for technology engineering disciplines.Design, code, test, debug, and document for projects and programsReview and analyze complex, large-scale technology solutions for tactical and strategic business objectives, enterprise technological environment, and technical challenges that require in-depth evaluation of multiple factors, including intangibles or unprecedented technical factors.Make decisions in developing standard and companywide best practices for engineering and technology solutions requiring understanding of industry best practices and new technologies, influencing and leading technology team to meet deliverables and drive new initiatives.Collaborate and consult with key technical experts, senior technology team, and external industry groups to resolve complex technical issues and achieve goals. Lead projects, teams, or serve as a peer mentor. Linkedin - https://www.linkedin.com/in/nitin-raj-83169b15a/Nitin RajTechnical Recruiter Veridian Tech Solutions, IncCertified by WOSB, WBENC, HUB nitin@veridiants.comwww.veridiants.com11931 Wick Chester Lane Suite 150 Houston, TX, 77043“Verdian is an Equal Opportunity Employer and prohibits discrimination and harassment of any kind.",
        "source": "Email",
        "date_posted": "2024-10-02 16:38:37-05:00",
        "unique_id": "1924f2b098b50536",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]