[
    {
        "company": "Tek Inspirations LLC",
        "job_title": "Salesforce Business Analyst",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Salesforce BA",
                "Public Sector Solutions",
                "Agile Scrum",
                "Project Management",
                "Scrum Master certification"
            ],
            "primary": [
                "customer relationship management platforms",
                "user story construction",
                "coaching and influencing teams",
                "modern software engineering techniques",
                "exceptional written and oral communication skills"
            ],
            "secondary": [
                "continuous integration",
                "test-driven development",
                "backlog management",
                "sprint planning",
                "daily stand-ups",
                "sprint reviews",
                "retrospectives",
                "story mapping",
                "process enhancement",
                "mentorship"
            ],
            "all": [
                "Salesforce BA",
                "Public Sector Solutions",
                "Agile Scrum",
                "Project Management",
                "Scrum Master certification",
                "customer relationship management platforms",
                "user story construction",
                "coaching and influencing teams",
                "modern software engineering techniques",
                "exceptional written and oral communication skills",
                "continuous integration",
                "test-driven development",
                "backlog management",
                "sprint planning",
                "daily stand-ups",
                "sprint reviews",
                "retrospectives",
                "story mapping",
                "process enhancement",
                "mentorship"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Anju Pathak",
        "email": "anju.pathak@tekinspirations.com",
        "jd": "From: Anju Pathak, Tek Inspirations LLC anju.pathak@tekinspirations.com Reply to: anju.pathak@tekinspirations.com Job Description -LinkedIn mandatory, EST candidates preferred\nSalesforce Business Analyst\nRemote\nVisa that does not expire in the next year is good, No H1B/CPT Candidates MUST have experience working with Salesforce’s dedicated data model: Public Sector Solutions (PSS). Applicants without this experience will not be considered.\nREQUIRED/DESIRED SKILLSSkill Required/Desired Years of Experience\nExperience as a Salesforce BA working with a software development project team (Required 5)\nExperience with Salesforce’s dedicated data model: Public Sector Solutions (Required 2)\nExperience with customer relationship management platforms including Salesforce. (Required 5)\nExperience applying Agile Scrum to projects with multiple Scrum teams utilizing a Scrum of Scrums approach. (Required 5)\nPrevious experience in Project Management or using Agile methodology (Required 3)\nExperience with user story construction, user story estimation, sprint health indicators (burn-down/burn-up), velocity, continuous improvement (Required 3)\nExperience coaching and influencing multi-disciplined and cross-functional teams (Required 4)\nModern software engineering techniques - Continuous integration, build, deliver, test-driven development & other automated acceptance testing techniques (Required 3)\nScrum Master certification required (Required 3)\nExceptional written and oral communication skills are required as candidate will work with various teams and stakeholders in role (Required)\nWork with Product Support Specialists, Technical Leads, Development Team and Stakeholders to deliver low code, no code, out of the box solutions.\nParticipates in planning sessions with Business Partners, Developers, and Stakeholders to identify dependencies, craft delivery strategies, and involve customers in early, incremental delivery of Saleforce’s dedicated data model; Public Sector Solutions.\nHeavily involvement in planning stages: identify goals and vision, remove impediments and block distractions in order to keep the agile team focused on committed objectives.\nA deep agile toolbox including awareness of various agile techniques, alternate project management approaches and the wisdom to understand when to apply which process to the problem at hand.\nFacilitates scrum and agile ceremonies such as sprint planning, daily stand-ups, sprint reviews, and retrospectives.\nProficient with Agile methods such as story sizing, backlog management, story mapping, etc.\nDemonstrated experience managing multiple time-sensitive, complex projects, involving multiple stakeholders and/or external vendors.\nResponsible for supporting complex projects/products and programs using pre-existing knowledge, skills, templates, and expertise in various organizational and implementation methodologies.\nResponsible for concurrently managing multiple projects/products with multiple teams across multiple business areas in a matrixed reporting structure.\nAssists with removing roadblocks and manages the process and culture to ensure team progress and continuous improvement.\nAssists Product Owners enact effective backlog grooming techniques; facilitate sprint planning, daily scrum, and sprint retrospectives.\nProactively address issues, conflicts, and bottlenecks, ensuring a smooth and efficient workflow\nDrive continuous improvement within the team by identifying opportunities for process enhancement and efficiency.\nProvide training, mentorship, and support to team members on Agile principles and Scrum practices.",
        "source": "Email",
        "date_posted": "2024-10-02 15:09:12-05:00",
        "unique_id": "1924f28f53c742d1",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]