[
    {
        "company": "Yochana Solutions INC",
        "job_title": "SharePoint Data Migration Project Manager",
        "location": "Houston, TX, USA",
        "full_location": {
            "city": "Houston",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "1+ year",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SharePoint architecture",
                "SharePoint configuration",
                "SharePoint administration",
                "migration tools",
                "project management"
            ],
            "primary": [
                "data migration",
                "content migration",
                "site migration",
                "O365 technologies",
                "stakeholder management",
                "communication skills"
            ],
            "secondary": [
                "Agile methodology",
                "project management certification",
                "technical guidance",
                "code reviews",
                "quality assurance",
                "performance optimization"
            ],
            "all": [
                "SharePoint architecture",
                "SharePoint configuration",
                "SharePoint administration",
                "migration tools",
                "project management",
                "data migration",
                "content migration",
                "site migration",
                "O365 technologies",
                "stakeholder management",
                "communication skills",
                "Agile methodology",
                "project management certification",
                "technical guidance",
                "code reviews",
                "quality assurance",
                "performance optimization"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "James Smith",
        "email": "smith@yochana.com",
        "jd": "From: James Smith, Yochana Solutions INC smith@yochana.com Reply to: smith@yochana.com Job Title- SharePoint Data Migration Project ManagerLocation – Houston TX- Onsite Duration – 1+year Job Duties: Develop and manage the overall strategy for the migration from all data structures of acquired company (SharePoint, One Drive, Shared Drives, etc.) into SharePoint, including data classification, timelines, and migration tool requirements. Manage the business engagement sessions and coordinate with business unit stakeholders to gather requirements and define project scope, objectives, and success criteria. Collaborate with internal operations team to execute technical aspects of the migration, including data migration, configuration, and testing. Develop communications to end users. Identify and mitigate risks and issues throughout the migration process, ensuring timely resolution and minimal impact on project timelines. Communicate project status, updates, and key milestones to business unit stakeholders, project team members, and operations team. Deliver SharePoint training for impacted end users; including data retention guidelines, etc. Required Skills Requirements: Excellent Leadership and stakeholder management skills. Demonstrated experience to interact with business contacts in non-technical terms. Excellent communication skills (written and oral) to the business unit stakeholders Ability to organize and manage multiple parallel projects at various stages of migration. Ability to work effectively in a cross-functional team environment. Proven experience as a Project Manager, leading SharePoint migration projects.Required Technical Skills Requirements: Strong understanding of SharePoint architecture, configuration, and administration. Experience with migration tools and methodologies for SharePoint, including data migration, content migration, and site migration. Extensive hands-on experience in O365 technologiesPreferred Skills Requirements: Knowledge in Agile methodology Project management certification (e.g., PMP, PRINCE2). (1.) To be responsible for providing technical guidance to a team of developers, enhancing their technical capabilities and increasing productivity. (2.) To conduct comprehensive code reviews, establish and oversee quality assurance processes, performance optimization , implementation of best practices and coding standards to ensure succeful delivery of complex projects. (3.) To ensure process compliance in the assigned module, and participate in technical discussionsorreview as a technical consultant for feasibility study (technical alternatives, best packages, supporting architecture best practices, technical risks, breakdown into components, estimations). (4.) To collaborate with stakeholders to define project scope, objectives, deliverables and accordingly prepare and submit status reports for minimizing exposure and closure of escalations.",
        "source": "Email",
        "date_posted": "2024-10-11 10:21:34-05:00",
        "unique_id": "1927c4c7b0d092ea",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]