[
    {
        "company": "Starbucks",
        "job_title": "Technical Deployment/Release Engineer III",
        "location": "Seattle, WA, USA",
        "full_location": {
            "city": "Seattle",
            "state": "WA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "8+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Technology Producer",
                "Delivery Manager",
                "Release Manager"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Technology Producer",
                "Delivery Manager",
                "Release Manager"
            ],
            "with_experience": []
        },
        "job_type": [],
        "contact_person": "Virendra Singh",
        "email": "vsingh@valiantiq.com",
        "jd": "From: Virendra Singh, ValiantIQ INC vsingh@valiantiq.com Reply to: vsingh@valiantiq.com Client: Starbucks Job Title: Technical Deployment/Release Engineer IIILocation: Seattle, WADuration: 12+ Months Required SkillsJob DescriptionSeeking a Technical Delivery Manager who will contribute to our client's success by managing and facilitating the product release process and execution across the Digital Platform Engineering (DPE) organization. This role also supports various tech initiative delivery within the DPE organization.The successful candidate is someone who enjoys bringing definition to complex technologyprojects and are skilled at navigating ambiguous new frontiers. This candidate has a technical background and attention to detail enable them to identify risks, drive development with predictability and challenge assumptions. Relationships and teamwork are important to how the candidate inspires and leads the teams to deliver their best work. This person is a team player that does what it takes; and also has an intolerance for mediocrity and are unafraid to take a stand on what you believe is right. Required Skills -Technology Producer, Delivery Manager, Release Manager Job Duties - Facilitate the overall release delivery process, coordinate release activites anddependencies across products and teams Maintain overall release schedule and coordinate with cross functional groups on crossteam dependencies and release readiness activities Own release status updates and provide clarity to all stakeholders, including the team,on progress towards the agreed milestones Measure release effectiveness leveraging data trends and metrics to improve the overallcustomer experience Support various tech initiative delivery by driving implementation planning, supporttesting, and go-to market planning and execution Coordinate project activities across associated project teams; track progress againstestablished plans, report results with project stakeholders Develop project communications, including creation of status reports and summaries,tracking escalations and resolutions of issues, coordinating stakeholder meetings andupdates, and updating project and program plans Support project timelines, clearly setting expectations, and realigning expectationsinternally as priorities change Job Requirements -Top level:• 8+ years in IT delivery• 5+ years in IT delivery leadership with a combination of Project leadership, Release leadership, producer, etc.",
        "source": "Email",
        "date_posted": "2024-10-11 14:24:22-05:00",
        "unique_id": "1927d2ac6245243c",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]