[
    {
        "company": "Parin Technologies",
        "job_title": "IT Applications Project Manager",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "12+ years",
            "degree_required": "Bachelor’s degree in IT, Computer Science, or related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "8 months+",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management Certification",
                "Software Testing and Quality Assurance (QA)",
                "Experience with Housing Management Systems",
                "Experience with SQL and Data Manipulation",
                "Proficiency in HUD Reporting"
            ],
            "primary": [
                "Change Management Experience",
                "Business Process Analysis",
                "Experience with Agile or Waterfall Project Methodologies"
            ],
            "secondary": [
                "Training and Facilitation Skills",
                "Customer Service Orientation"
            ],
            "all": [
                "Project Management Certification",
                "Software Testing and Quality Assurance (QA)",
                "Experience with Housing Management Systems",
                "Experience with SQL and Data Manipulation",
                "Proficiency in HUD Reporting",
                "Change Management Experience",
                "Business Process Analysis",
                "Experience with Agile or Waterfall Project Methodologies",
                "Training and Facilitation Skills",
                "Customer Service Orientation"
            ],
            "with_experience": [
                "Project Management Certification",
                "Software Testing and Quality Assurance (QA)",
                "Experience with Housing Management Systems",
                "Experience with SQL and Data Manipulation",
                "Proficiency in HUD Reporting"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Rehana Remo",
        "email": "rehana@parintec.com",
        "jd": "From: Rehana, Parin Technologies rehana@parintec.com Reply to: rehana@parintec.com HiPlease share your Updated Resumerehana@parintec.com Title: IT Applications Project ManagerLocation: Atlanta, GAExp:12+ years RemoteDuration: 8 months+Interview: Either Webcam or In PersonCandidate Must be Local to Atlanta, GA This is position is primarily remote. However, local candidates only as they may be required to come to the office for project meetings. Required / Desired Skills SkillRequired / DesiredAmountof ExperienceProject Management CertificationRequired5Years Software Testing and Quality Assurance (QA)Required4YearsExperience with Housing Management SystemsRequired3Years Experience with SQL and Data ManipulationRequired2YearsProficiency in HUD ReportingRequired2Years Change Management ExperienceHighly desired2YearsBusiness Process AnalysisHighly desired2Years Experience with Agile or Waterfall Project MethodologiesDesired2YearsTraining and Facilitation SkillsNice to have2Years Customer Service OrientationNice to have2Years Description:The Public Housing Authority seeks a seasoned IT Applications Project Manager – Housing Systems to lead, coordinate, and support the transition from Tenmast WinTen2+ to Yardi Voyager. This role will serve as the project lead, ensuring the successful implementation and integration of housing management software while maintaining data integrity, compliance, and effective communication across all stakeholders. The ideal candidate will have strong project management skills, data analysis expertise, and proficiency in HUD PIC reporting. The role requires a deep understanding of housing management systems and proven experience configuring and managing platforms such as Tenmast WinTen2+ and Yardi Voyager. Key Responsibilities:Project Leadership: Lead the planning, execution, and completion of the housing software transition project, ensuring alignment with project goals and timelines.Coordination & Support: Coordinate with internal teams and external vendors, providing technical and operational support to drive project success.Data Management: Oversee data analysis and cleanup activities, ensuring data quality and accuracy during migration.HUD Reporting: Develop and refine HUD PIC and other compliance-related reports, ensuring all data and system configurations adhere to HUD standards.Training & Documentation: Create user guides, training materials, and process documentation to support staff in navigating the new system. Qualifications:Bachelor’s degree in IT, Computer Science, or related field.Experience: Minimum of 5 years in IT project management, with a focus on housing management systems.Strong proficiency in Yardi Voyager, Tenmast WinTen2+, and HUD reporting.Demonstrated expertise in data analysis and data migration strategies.Excellent communication skills and the ability to lead cross-functional teams. Preferred Skills:Certification in project management (PMP or similar) or application management.Experience with SQL and data manipulation for housing systems.Knowledge of Housing Choice Voucher Program lifecycle and financial management. Screening Question:Does the candidate have at least 5 years of IT project management experience specifically in housing management systems (e.g., Yardi Voyager, Tenmast WinTen2+)?Has the candidate previously led a housing software transition or implementation project from start to finish?Does the candidate have experience preparing HUD PIC reports and ensuring compliance with HUD standards? Please provide an example of a project where they handled HUD-related reporting.Is the candidate comfortable performing data analysis and cleanup during a system migration? How many years of experience do they have in data management?Does the candidate have experience in vendor management and coordinating with external stakeholders during a software transition?Does the candidate possess a formal project management certification (e.g., PMP) or relevant training?How proficient is the candidate in SQL or other data querying tools? What specific data analysis or manipulation tasks have they performed in previous projects?Does the candidate have experience with business process analysis or change management? If yes, please describe how they’ve managed system adoption and addressed resistance to change.",
        "source": "Email",
        "date_posted": "2024-10-11 09:09:57-05:00",
        "unique_id": "1927c0aeb34e6be6",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]