[
    {
        "company": "vyze inc",
        "job_title": "Full Stack .NET Core Technical Lead With Angular 13 or above",
        "location": "Pittsburgh, PA, USA",
        "full_location": {
            "city": "Pittsburgh",
            "state": "PA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Bachelor's degree in Computer Science, Engineering, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".NET",
                ".NET Core",
                "Azure",
                "CosmosDB"
            ],
            "primary": [
                "Full Stack Development",
                "Frontend Development",
                "Backend Development",
                "Database Solutions",
                "Code Reviews"
            ],
            "secondary": [
                "React",
                "DevOps",
                "Problem-solving",
                "Debugging"
            ],
            "all": [
                ".NET",
                ".NET Core",
                "Azure",
                "CosmosDB",
                "Full Stack Development",
                "Frontend Development",
                "Backend Development",
                "Database Solutions",
                "Code Reviews",
                "React",
                "DevOps",
                "Problem-solving",
                "Debugging"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Roshani",
        "email": "roshani@vyzeinc.com",
        "jd": "From: Roshani, vyze inc roshani@vyzeinc.com Reply to: roshani@vyzeinc.com Job Description -Full Stack .NET Core Technical Lead With Angular 13 or above Onsite (Pittsburgh / Dallas)Linkedin need2 round interview1: virtual2: F2FJob Overview:We are looking for a skilled and experienced .NET Core Application Developer to join our dynamic team. As a key member of our technology department, you will play a crucial role in developing and maintaining robust mortgage processing applications. The ideal candidate should have a strong background in full-stack development, with expertise in .NET, Azure, .NET Core, and CosmosDB. Roles and Responsibilities:Design, develop, and maintain both frontend and backend components of mortgage processing applications.Utilize your in-depth knowledge and experience with .NET Core to build scalable and high-performance applications.Collaborate with cross-functional teams to integrate applications with Azure services, ensuring seamless functionality and optimal performance.Design and implement database solutions using CosmosDB, ensuring efficient data storage, retrieval, and management.Conduct thorough code reviews and implement optimization techniques to enhance application performance and maintainability.Work closely with product managers, UI/UX designers, and other stakeholders to understand requirements and deliver solutions that meet business needs.Create and maintain comprehensive technical documentation for developed applications, APIs, and systems.Develop and execute unit tests, integration tests, and end-to-end tests to ensure the reliability and robustness of the applications.Provide support for production issues, troubleshoot problems, and implement effective solutions promptly.Qualifications:Bachelor's degree in Computer Science, Engineering, or a related field.Proven experience as a Full Stack Developer with a focus on .NET technologies.Strong expertise in .NET, .NET Core, Azure, and CosmosDB.Familiarity with modern front-end frameworks such as React or Angular.Knowledge of DevOps practices and tools for continuous integration and deployment.Excellent problem-solving and debugging skills.Ability to work effectively in a fast-paced and dynamic environment.RegardsRoshaniroshani@vyzeinc.com",
        "source": "Email",
        "date_posted": "2024-10-11 11:10:29-05:00",
        "unique_id": "1927c92d6e30ee3b",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]