[
    {
        "company": "RCI",
        "job_title": "Java Application Architect",
        "location": "Madison, WI, USA",
        "full_location": {
            "city": "Madison",
            "state": "WI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Must have existing work authorization",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified",
            "job_code": "135849"
        },
        "skills": {
            "core": [
                "Java",
                "JavaScript",
                "Version control systems",
                "Continuous Integration systems"
            ],
            "primary": [
                "Architectural roles (Java)",
                "Development Tool/Framework Selection/Implementation (Java/JS)"
            ],
            "secondary": [
                "Establishment of best practices/policies/procedures around development tools",
                "Lead roles",
                "Support role(s) around development tools",
                "Software Development Frameworks (Java)"
            ],
            "all": [
                "Java",
                "JavaScript",
                "Version control systems",
                "Continuous Integration systems",
                "Architectural roles (Java)",
                "Development Tool/Framework Selection/Implementation (Java/JS)",
                "Establishment of best practices/policies/procedures around development tools",
                "Lead roles",
                "Support role(s) around development tools",
                "Software Development Frameworks (Java)"
            ],
            "with_experience": [
                "Java (5+ years)",
                "JavaScript (5+ years)"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Sajjad",
        "email": "sajjad@rconsultinginc.com",
        "jd": "From: Sajjad, RCI sajjad@rconsultinginc.com Reply to: sajjad@rconsultinginc.com Only Local WITH local DL Job Title: Java Application Architect Location: Hybrid Madison, WIDuration: 6+ Months ContractInterview mode: Phone and Skype (Locals only)Visa: USC, GC, H4 EAD or GC EADExperience level: 10+ yearsJob ID: 135849 Client Notes:Our client seeks a Java Application Architect with a history of providing leadership to organizations regarding the tools used for development on Java/JS stacks. This includes policies, procedures, best practices, and support of development teams around the same. Work Arrangement: 40-60% Remote [in Wisconsin]. Candidates must be current Wisconsin residents or relocate to Wisconsin at the contract's start. Required Skills: Architectural roles (Java), Development Tool/Framework Selection/Implementation (Java/JS), Version control systems (selection/implementation), CI Systems. Nice to Have Skills: Establishment of best practices/policies/procedures around development tools, lead roles, support role(s) around development tools, and Software Development Frameworks (Java). Must haves:The candidate is currently a Wisconsin resident at the time of submission or will relocate before the start of the contract (and will remain in WI for the duration of the contract)5+ years with Java/JS Development2+ Projects where part of the role was selecting tools/frameworks to support Java/JS development (and then supporting those tools). I need to see good commentary around this part of the role in the CV.2+ Projects where part of the role defined best practices for Java/JS development tools/frameworks (policies, procedures, standards, etc.) and then supported/educated development teams. I need to see good commentary around this part of the role in the CV. Detailed job description:The State of Wisconsin is looking for an Application Architect II to provide development tool support for software product lifecycles. The candidate will ensure quality and consistency in supporting software development tools across the system. They will also provide daily technical guidance to development teams, helping maintain cost-effectiveness and quality across application development tools and systems.The role involves researching and implementing the best practices to control costs, improve quality, and increase predictability in service delivery. The candidate will also research new technology and development tools to stay updated with industry standards. Responsibilities include solving complex technical problems related to application development tools and working with team members to create policies, procedures, and standards for using these tools. Required Skills (4+ years):Java software development toolsJavaScript software development toolsVersion control system support (e.g., GitHub.com)Continuous Integration systems Nice to Have Skills:Application Development Tools (installation, documentation, and setup)Software development tools (standards, policies, procedures)Software development frameworks (standards, policies, procedures)Ticketing software (as a tool to manage customer requests)Lead RolesSoftware development tools -- Support RolesSoftware development tools -- Helpdesk Roles Interview Process:Teams interview with the camera on — one to two rounds.",
        "source": "Email",
        "date_posted": "2024-10-11 09:15:00-05:00",
        "unique_id": "1927c0f8a1148236",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]