[
    {
        "company": "IDC Technologies",
        "job_title": "Project Manager",
        "location": "Indianapolis, IN, USA",
        "full_location": {
            "city": "Indianapolis",
            "state": "IN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "IT Project Management",
                "Azure DevOps",
                "Waterfall methodology",
                "Agile methodology",
                "Communication and presentation skills"
            ],
            "primary": [
                "Project Management Institute (PMI) framework",
                "Information systems development life cycle",
                "Technical support",
                "Risk management",
                "Team management"
            ],
            "secondary": [
                "Professional certification",
                "Business intelligence",
                "Software project management",
                "Stakeholder communication",
                "Application features design"
            ],
            "all": [
                "IT Project Management",
                "Azure DevOps",
                "Waterfall methodology",
                "Agile methodology",
                "Communication and presentation skills",
                "Project Management Institute (PMI) framework",
                "Information systems development life cycle",
                "Technical support",
                "Risk management",
                "Team management",
                "Professional certification",
                "Business intelligence",
                "Software project management",
                "Stakeholder communication",
                "Application features design"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "John Joseph",
        "email": "john.joseph@idctechnologies.com",
        "jd": "HI, Hope you are doing well. We have an urgent opening for the below role with Contract position for our clients, kindly Check the below job description and let me know your interest. Position – Project ManagerLocation – Indianapolis, IN 46204 - HybridShort Description -Designs, plans, and coordinates work teams. Follows standard project management industry practices such as the PMI framework. Full Job Description -Only local candidates will be considered for this position. OVERVIEWMinimum five years or more of project management experience. Capable of managing technical, software, and/or data and reporting-centric IT projects with 10 or more staff and/or a project with multiple subprojects. POSITION DESCRIPTIONDesigns, plans, and coordinates IT work teams. Follows standard project management industry practices such as the PMI's framework. Understands business and technical objectives of a project and works closely with the project sponsor. Creates project kickoff, progress, and close-out reports, and tracks budget and schedule progress via appropriate metrics. Establishes project organization and methodologies and defines roles and responsibilities. Documents risks and develops mitigation plans. Manages scope. Creates and implements a communication plan as/where appropriate. Builds an effective team inclusive of the right IT technical and business-facing subject matter experts and user testers. Assigns tasks to team members and evaluates outcomes. Communicates to stakeholders and project sponsor. Identifies, tracks, and ensures resolution of issues and removal of barriers. Provides technical support to project team members. Handles complex application features and technical designs. Designs and implements the components required for complex application features. Generally, manages a group of applications systems analysts. Relies on experience and judgment to plan and accomplish goals. Executive presence. Professional certification is highly desirable. EXPERIENCE DESCRIPTIONProject Manager capabilities with 5 or more years of experience. Capable of managing a project with up to ten (10) or more staff and/or a project with multiple subprojects. Skills Matrix -Experience in IT Project Management Required 5 YearsPrior experience working on the State of Indiana large data, business intelligence, or software projects as a Senior IT PM Highly desired Experience managing projects within Azure DevOps Required Strong knowledge of information systems development life cycle, information technology, project tools, and approaches to development and implementation. Required Experience with Waterfall methodology Required Experience with Agile methodology Required Ability to translate technology terms and explain concepts of SDLC to program/business folks who have little to no exposure to large software projects Required Ability to work with technical team members, and other IT professionals to flesh out project plans and risk registers and overcome obstacles Required Strong communication and presentation skills Required PMP Certified Highly desired",
        "source": "Email",
        "date_posted": "2024-10-11 09:48:57-05:00",
        "unique_id": "1927c2e9ffa057e0",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]