[
    {
        "company": "Maryland Judiciary",
        "job_title": "Integration Business Analyst",
        "location": "Maryland, USA",
        "full_location": {
            "city": "Maryland",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Master’s degree in information systems",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "UML",
                "NIEM",
                "JIEM data modeling",
                "XML",
                "SOAP",
                "Integration patterns",
                "web services",
                "APIs",
                "Odyssey Case Management System"
            ],
            "primary": [
                "Requirements capture and tracking software",
                "Communicate effectively",
                "Establish and maintain effective working relationships",
                "Provide training and demonstrations"
            ],
            "secondary": [
                "Systems development life cycle principles",
                "Database knowledge – logical, relational"
            ],
            "all": [
                "UML",
                "NIEM",
                "JIEM data modeling",
                "XML",
                "SOAP",
                "Integration patterns",
                "web services",
                "APIs",
                "Odyssey Case Management System",
                "Requirements capture and tracking software",
                "Communicate effectively",
                "Establish and maintain effective working relationships",
                "Provide training and demonstrations",
                "Systems development life cycle principles",
                "Database knowledge – logical, relational"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "GARGI",
        "email": "gargi@wiseq.net",
        "jd": "From: GARGI, Wise Equation solutions Inc. gargi@wiseq.net Reply to: gargi@wiseq.net Note: For this submission, we will require a Completed Resume, Completed Reference List (attached), Signed Right to Represent Letter (attached), and a Copy of any degree and/or certificate for each proposed resource (Evidence of an Active PMP Certificate & Copy of Master’s Degree or Transcript Proving Receipt of Master’s). Title: Integration Business AnalystExperience: 10+ yearsLocation: Maryland (Hybrid)Client : Maryland Judiciary (MJUD) SCOPE OF WORK : Mandatory Qualification: Documenting existing systems and/or business processes. Interviewing users to determine functional requirements for new development and enhancement projects. Working with Judiciary personnel as needed to develop test plans and coordinate testing efforts. Working with technical leads and developers to understand, develop, and refine project technical requirements. Assisting in the development and refinement of systems development methodology processes and artifacts as needed. Assisting in the tracking and reporting of project status as required in support of project and Project Management Office efforts. Providing input to and support for the development of Project Definition documents used to establish initial project scope, cost and resource estimates, impact on existing activities, and estimated return on investment. Performing data analysis in support of projects and develop database inquiries as needed. Coordinating use of business analysis, project requirements, test planning, tracking, problem reporting throughout projects within JIS as needed. Assisting JIS project managers and IT/Court managers, as needed, with the coordination of requirements gathering and test planning activities. Conducting Joint Application Design (JAD) sessions and coordinate business unit review and approval of project functional requirements and test plans. Weekly time reporting focused on total time and segments of time allocated to tasks or projects. Reporting will be via templates and/or time and activities tracking software. Acting as liaison with justice partners in providing accurate data exchanges and changes to data exchanges required by legislation or business mandates. Experience with:UML and other tools used to capture and document user and functional requirements. NIEM / JIEM data modeling. Requirements capture and tracking software. XML and SOAP protocol software. Discussing, analyzing and documenting high-level business requirements related to internal and external clients. Integration patterns, web services and APIs. Odyssey Case Management System. Ability to:Communicate effectively and to establish and maintain effective working relationships with peers, end users and vendor development staff, as well as all levels of management and judicial personnel as necessary.Work effectively within a diverse IT organization. Provide training and demonstrations pertaining to integrations software. Knowledge of:Systems development life cycle principles and methodologies Database knowledge – logical, relational Qualification: The Offeror shall propose resource(s) that meet the following minimum qualifications:Active Project Management Professional (PMP) Certification. Master’s degree in information systems. The AOC prefers Offeror proposed resource(s) to have the following qualifications:Experience with court or a legal background. Ten (10) years’ experience in Information Technology (IT)",
        "source": "Email",
        "date_posted": "2024-10-11 09:55:08-05:00",
        "unique_id": "1927c62b7c4fb4d9",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]