[
    {
        "company": "Technocraft solutions",
        "job_title": "Business analyst",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "63447",
            "experience_required": "5 years",
            "degree_required": "Bachelor's in Business Administration or a related field (Masters preferred)",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Information Systems",
                "Business Process Reengineering",
                "Data Analysis",
                "Six Sigma"
            ],
            "primary": [
                "Requirements Gathering",
                "Stakeholder Communication",
                "Project Management",
                "Technology Solutions",
                "Process Documentation"
            ],
            "secondary": [
                "Leadership",
                "Training",
                "Problem Solving",
                "Report Generation",
                "Client Interaction"
            ],
            "all": [
                "Business Analysis",
                "Information Systems",
                "Business Process Reengineering",
                "Data Analysis",
                "Six Sigma",
                "Requirements Gathering",
                "Stakeholder Communication",
                "Project Management",
                "Technology Solutions",
                "Process Documentation",
                "Leadership",
                "Training",
                "Problem Solving",
                "Report Generation",
                "Client Interaction"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Harsh Tiwari",
        "email": "harsh.tiwari@technocraftsol.com",
        "jd": "From: Harsh Tiwari, Technocraft solutions harsh.tiwari@technocraftsol.com Reply to: harsh.tiwari@technocraftsol.com Job Title: Business analystJob id - 63447 (AIM)Location: Atlanta, GA(Hybrid)Duration: 12 Months Minimum QualificationsEducation and ExperiencePersons applying must have a bachelor’s degree in Business Administration or a related field (Masters preferred) and five years of Information Systems experience, analyzing and redesigning business processes, and providing business requirements to technical teams. Six Sigma highly preferred. Equivalent combinations of training and experience will be determined under prescribed guidelines. Essential Capabilities and Work EnvironmentRequired physical, lifting, and sensory capabilities are requirements to perform the job successfully. Typical environmental conditions associated with job. General Description and Classification StandardsThis is a fully seasoned professional level capable of independently carrying out most assignments typical of the profession. This level would be attainable by multiple incumbents in a work group (not necessarily by all), but would not be an \"automatic\" promotional level. This position leads the requirements development for applying technology to satisfy business needs. Defines and documents internal and external user interfaces and supports system and data requirement clarification and definition. Also, acting as the liaison among internal stakeholders to analyze, document, communicate and validate business and system requirements for platform applications.Supervision ReceivedWorks under very general supervision. Depending on organization structure, may work independently with responsibility for an assigned function or program.Essential Duties & ResponsibilitiesThese are typical responsibilities for this position and should not be construed as exclusive or all inclusive. May perform other duties as assigned. This employee supports the Project Managers and Senior Level Project Managers in the gathering and analysis of client business requirements, the development of business cases and return on investment analysis in support of enterprise level technology solutions; leads the definition and execution of enterprise level technology solutions; assists in the coordination and execution of implementation plans; supports post implementation analysis and review to ensure realization of expected project benefits; gathers business requirements for development of client business cases, project concept formulation, and technology selection efforts; analyzes business requirements by conducting information gathering sessions with clients; assists in Business Process Reengineering activities and the application of technology to the process; documents current state processes and systems; performs data analysis by monitoring end to end business applications or infrastructure to proactively identify or resolve problems in accordance with operational standards and procedures. This employee acts as a spokesperson for assigned clients’ business departments as they interact with AIM to determine appropriate computer and process solutions to business problems; validates business plans against strategic imperatives for assigned area to ensure alignment; consults with assigned departments to develop understanding of varied and complex business needs; provides IT input to assigned City departments’ business plans, as they relate to financial, business and legislative impacts; manages deployment of resources to ensure successful execution of service delivery; performs business process analysis, developing recommendations to streamline processes and leverage technology; works with project managers and outside resources to ensure client needs are met; produces reports, timelines, and graphics using desktop tools to satisfy user requests, process analysis, data sampling and test verification. Decision Making Selects from multiple procedures and methods to accomplish tasks. Applies organizational policies; may interpret organizational policies and recommend exceptions. Establishes work methods, timetables, performance standards, etc. Leadership Provided Routinely provides work group leadership, guidance, and/or training to less experienced staff. May lead cross functional team to address business issues. Knowledge, Skills & Abilities This is a partial listing of necessary knowledge, skills, and abilities required to perform the job successfully. It is not an exhaustive list. Extensive knowledge of concepts, processes and tools of profession. Knowledge of relationship of professional disciple among related organizations and functions. Well-developed technical skills within profession. Skills in organizing and presenting proposals Ability to plan and carry out virtually any typical assignment within professional area. Ability to train others; ability to build effective relationships within the organization.",
        "source": "Email",
        "date_posted": "2024-10-11 12:17:26-05:00",
        "unique_id": "1927cb68f9555932",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]