[
    {
        "company": "TechRooted",
        "job_title": "Project/Program Manager",
        "location": "Salem, OR, USA",
        "full_location": {
            "city": "Salem",
            "state": "OR",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "12+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "project management",
                "IT-related projects",
                "risk management",
                "change control",
                "PMBOK standards"
            ],
            "primary": [
                "technical reviews",
                "project scope management",
                "project schedule management",
                "quality assurance",
                "collaboration tools"
            ],
            "secondary": [
                "administrative project support",
                "document management",
                "mentoring",
                "communication",
                "stakeholder management"
            ],
            "all": [
                "project management",
                "IT-related projects",
                "risk management",
                "change control",
                "PMBOK standards",
                "technical reviews",
                "project scope management",
                "project schedule management",
                "quality assurance",
                "collaboration tools",
                "administrative project support",
                "document management",
                "mentoring",
                "communication",
                "stakeholder management"
            ],
            "with_experience": [
                "project management",
                "IT-related projects"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Zaman Wasi",
        "email": "zaman@techrooted.com",
        "jd": "Hello,I am hiring a consultant for one of my client's requirement. Job Description for the same is written below. If you find yourself comfortable with the requirement please reply back with your updated resume.Job Title Project/Program ManagerDuration 12+ monthsLocation Salem, Oregon – Hybrid – Local OnlyUSC/GC/GC-EADClient – State or OregonState/Govt/federal/Public Sector Experience - MUSTDescription :Individuals with a mastery of project management skills, qualifications and experience. This individual shall function effectively with very little supervision, while maintaining a high professional standard. They are assigned to extremely complex and/or high risk projects that reflect the highest priorities of state government. These individuals are comfortable working with the highest levels of state government and are able to contribute to the furtherance of the states’ objectives. These individuals have the necessary skills and experience to assist in statewide project portfolio management and/or IT Investment Management.Contractor will provide services include administrative project support, document management, collaboration tools and coordination for project tasks which will involve using the Authorized Purchaser and/or state’s project management tools, processes and templates (as defined and required by the customer), or off-the-shelf tools or using vendor’s own proprietary tools and processes to manage a project. Services also may include updated project schedules, organized project repositories, project meeting logistics, and other project-related project support materials. Service providers must have demonstrated success with IT-related projects.Skills :Contractor shall perform the following Services:Facilitate technical reviews, processes, policies and operations for Project.Ensure completion of project documents and artifacts in accordance with Project Management Body of Knowledge (PMBOK) standards and best practicesCoordinate with Project Sponsors and OEM Project Team.Organize and lead the technical staff in coordination with the agency, the Vendor, and the project team.Report on the progress of the project tasks and deliverables to the project team, sponsors and steering committeeManage project scope and schedule for technical activities.Coordinate with the technical resources, project team and external partners during the design and testing of solution.Schedule applicable quality assurance reviews for technical deliverables in coordination with the project team.Manage outstanding technical issues.Manage to project priorities.Monitor, track and report out on action items.Perform risk management.Enforce effective change control.Act as an agent of change and employ organizational change management practices to mentor agency and external partners using PROSCI methodologyMentor project membersPromote good working relationships.",
        "source": "Email",
        "date_posted": "2024-10-11 15:12:24-05:00",
        "unique_id": "1927d56bed7fd826",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]