[
    {
        "company": "Tek Inspirations LLC",
        "job_title": "Full-Stack Developer",
        "location": "Virginia, VA, USA",
        "full_location": {
            "city": "Virginia",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "React",
                "Git",
                "SpringBoot",
                "Unix",
                "MongoDB"
            ],
            "primary": [
                "Leadership",
                "Communication"
            ],
            "secondary": [
                "Python",
                "Big Data Processing",
                "Production System Migration"
            ],
            "all": [
                "Java",
                "React",
                "Git",
                "SpringBoot",
                "Unix",
                "MongoDB",
                "Leadership",
                "Communication",
                "Python",
                "Big Data Processing",
                "Production System Migration"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Nitin Tehriya",
        "email": "nitin.tehriya@tekinspirations.com",
        "jd": "From: Nitin Tehriya, Tek Inspirations LLC nitin.tehriya@tekinspirations.com Reply to: nitin.tehriya@tekinspirations.com Full-Stack Developer Local to VA (No Relocation)Virtual interview Job Description:Developing software solutions by studying organizational needs; conferring with users; studying systems flow and work processes; investigating problem areas; following the software development lifecycle.Follow established methodology and controls guidelines. Maintain agility and quality throughout development process.Documenting Technical Design, Interface Specifications and Unit Testing.Participate in technical discussions and provide recommendations or solutionsMigration to production environment for existing applications with compliance to production governance regulationsDesign, develop and support systems within the financial modeling and research area.Design and develop new code and review existing code changes to ensure standard technology development practices are met. Must Haves:5+ year experience as full stack java developer w/ senior experienceMust have 10/10 comm skillsProfessional communication and correspondence with high level stakeholdersLeadership experience or experience in senior roleTech StackJavaReactGITSpringBootUnixMongoDB50/50 front end/back end split Nice to Have:Python, big data processing, and/or production system migration.Freddie/Fannie/CapOne Supplier Vetting Questions:1) Please describe your most recent java development project. What was the project? What tools did you use? What for? 2) Please describe your approach to communicating and collaborating effectively across multiple groups and/or teams within an organization. Provide examples from your own experiences. 3) Please describe your approach to task prioritization and task management. Please provide examples from your own experience.",
        "source": "Email",
        "date_posted": "2024-10-11 16:16:32-05:00",
        "unique_id": "1927d917403368f1",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]