[
    {
        "company": "Parin Technologies",
        "job_title": "IT Applications Project Manager",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "12+ years",
            "degree_required": "Bachelor’s degree in IT, Computer Science, or related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "8 months+",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "project management",
                "data analysis",
                "HUD PIC reporting",
                "Tenmast WinTen2+",
                "Yardi Voyager"
            ],
            "primary": [
                "housing management systems",
                "data migration strategies",
                "communication skills",
                "cross-functional team leadership"
            ],
            "secondary": [
                "PMP certification",
                "SQL",
                "data manipulation",
                "Housing Choice Voucher Program lifecycle",
                "financial management"
            ],
            "all": [
                "project management",
                "data analysis",
                "HUD PIC reporting",
                "Tenmast WinTen2+",
                "Yardi Voyager",
                "housing management systems",
                "data migration strategies",
                "communication skills",
                "cross-functional team leadership",
                "PMP certification",
                "SQL",
                "data manipulation",
                "Housing Choice Voucher Program lifecycle",
                "financial management"
            ],
            "with_experience": [
                "project management",
                "data analysis",
                "HUD PIC reporting",
                "Tenmast WinTen2+",
                "Yardi Voyager"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Rehana Remo",
        "email": "rehana@parintec.com",
        "jd": "HiPlease share your Updated Resumerehana@parintec.com Title: IT Applications Project ManagerLocation: Atlanta, GAExp:12+ years RemoteDuration: 8 months+Interview: Either Webcam or In PersonCandidate Must be Local to Atlanta, GA Job DescriptionIT Applications Project Manager – Housing Systems needed to lead, coordinate, and support a housing software transition project. Requires project management skills, data analysis, HUD PIC reporting, and experience with Tenmast WinTen2+ and Yardi Voyager. Seeking a seasoned IT Applications Project Manager – Housing Systems to lead, coordinate, and support the transition from Tenmast WinTen2+ to Yardi Voyager. This role will serve as the project lead, ensuring the successful implementation and integration of housing management software while maintaining data integrity, compliance, and effective communication across all stakeholders. The ideal candidate will have strong project management skills, data analysis expertise, and proficiency in HUD PIC reporting. The role requires a deep understanding of housing management systems and proven experience configuring and managing platforms such as Tenmast WinTen2+ and Yardi Voyager.Key Responsibilities:Project Leadership: Lead the planning, execution, and completion of the housing software transition project, ensuring alignment with project goals and timelines.Coordination & Support: Coordinate with internal teams and external vendors, providing technical and operational support to drive project success.Data Management: Oversee data analysis and cleanup activities, ensuring data quality and accuracy during migration.HUD Reporting: Develop and refine HUD PIC and other compliance-related reports, ensuring all data and system configurations adhere to HUD standards.Training & Documentation: Create user guides, training materials, and process documentation to support staff in navigating the new system. Qualifications:Bachelor’s degree in IT, Computer Science, or related field.Experience: Minimum of 5 years in IT project management, with a focus on housing management systems.Strong proficiency in Yardi Voyager, Tenmast WinTen2+, and HUD reporting.Demonstrated expertise in data analysis and data migration strategies.Excellent communication skills and the ability to lead cross-functional teams. Preferred Skills:Certification in project management (PMP or similar) or application management.Experience with SQL and data manipulation for housing systems.Knowledge of Housing Choice Voucher Program lifecycle and financial management.",
        "source": "Email",
        "date_posted": "2024-10-11 08:36:49-05:00",
        "unique_id": "1927bec940c5bc29",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]