[
    {
        "company": "Yochana Solutions Inc.",
        "job_title": "SharePoint Data Migration Project Manager",
        "location": "Houston, TX, USA",
        "full_location": {
            "city": "Houston",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "$70/hour"
        },
        "skills": {
            "core": [
                "SharePoint architecture",
                "SharePoint migration",
                "Project management",
                "Stakeholder management",
                "Communication skills"
            ],
            "primary": [
                "O365 technologies",
                "Migration tools",
                "Data migration",
                "Content migration",
                "Site migration"
            ],
            "secondary": [
                "Agile methodology",
                "Project management certification",
                "Technical guidance",
                "Code reviews",
                "Quality assurance"
            ],
            "all": [
                "SharePoint architecture",
                "SharePoint migration",
                "Project management",
                "Stakeholder management",
                "Communication skills",
                "O365 technologies",
                "Migration tools",
                "Data migration",
                "Content migration",
                "Site migration",
                "Agile methodology",
                "Project management certification",
                "Technical guidance",
                "Code reviews",
                "Quality assurance"
            ],
            "with_experience": [
                "SharePoint migration (Proven experience)",
                "Project management (Proven experience)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Madhulatha",
        "email": "madhulatha@yochana.com",
        "jd": "Hello ,I’m a Madhulatha Technical Recruiter with Yochana Solutions Inc., a national IT staffing solutions provider with 14+ years of experience delivering value to leading companies across the U.S.A. and Canada,I'm currently staffing for : SharePoint Data Migration Project Manager- Houston, TX Onsite Below you will find the job description, if you are qualified and interested, please send me your Updated Word Document Resume.I'm very sorry if this position is not an ideal fit, We'll keep you in mind for other suitable positions and referrals would be appreciated.Thank you so much for your attention and participation. Title: SharePoint Data Migration Project Manager Location: Houston, TX OnsiteDuration : ContractRate-70/HR on C2CJob Description: SharePoint Data Migration Project Manager Job Duties: Develop and manage the overall strategy for the migration from all data structures of acquired company (SharePoint, One Drive, Shared Drives, etc.) into Chevron SharePoint, including data classification, timelines, and migration tool requirements.Manage the business engagement sessions and coordinate with business unit stakeholders to gather requirements and define project scope, objectives, and success criteria. Collaborate with internal Chevron IT teams and HCL operations team to execute technical aspects of the migration, including data migration, configuration, and testing.Develop communications to end usersIdentify and mitigate risks and issues throughout the migration process, ensuring timely resolution and minimal impact on project timelines. Communicate project status, updates, and key milestones to business unit stakeholders, project team members, and operations team. Deliver SharePoint training for impacted end users; including data retention guidelines, etc.Required Skills Requirements: Excellent Leadership and stakeholder management skills. Demonstrated experience to interact with business contacts in non-technical terms.Excellent communication skills (written and oral) to the business unit stakeholders Ability to organize and manage multiple parallel projects at various stages of migration.Ability to work effectively in a cross-functional team environment. Proven experience as a Project Manager, leading SharePoint migration projects.Required Technical Skills Requirements: Strong understanding of SharePoint architecture, configuration, and administration. Experience with migration tools and methodologies for SharePoint, including data migration, content migration, and site migration. Extensive hands-on experience in O365 technologies Preferred Skills Requirements: Knowledge in Agile methodology Project management certification (e.g., PMP, PRINCE2).(1.) To be responsible for providing technical guidance to a team of developers, enhancing their technical capabilities and increasing productivity. (2.) To conduct comprehensive code reviews, establish and oversee quality assurance processes, performance optimization , implementation of best practices and coding standards to ensure succeful delivery of complex projects.(3.) To ensure process compliance in the assigned module, and participate in technical discussions review as a technical consultant for feasibility study (technical alternatives, best packages, supporting architecture best practices, technical risks, breakdown into components, estimations). (4.) To collaborate with stakeholders to define project scope, objectives, deliverables and accordingly prepare and submit status reports for minimizing exposure and closure of escalations.",
        "source": "Email",
        "date_posted": "2024-10-11 08:18:53-05:00",
        "unique_id": "1927bdc2db9dcd1e",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]