[
    {
        "company": "Scalable Systems",
        "job_title": "Salesforce Business Analyst",
        "location": "Sunnyvale, CA, USA",
        "full_location": {
            "city": "Sunnyvale",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "8+ years",
            "degree_required": "Degree in Business management, Computer Science, Engineering or related discipline required. MBA degree preferred.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Salesforce Platform functionality",
                "Business analysis",
                "Project management",
                "Agile / Scrum delivery models",
                "Data analysis"
            ],
            "primary": [
                "Partner Portal",
                "Implementation experience",
                "Process documentation",
                "Salesforce data tools",
                "Dashboard design on Einstein Analytics/Tableau CRM"
            ],
            "secondary": [
                "Strong written and verbal communication",
                "Active listening",
                "Team leadership",
                "System security and controls",
                "Salesforce certifications"
            ],
            "all": [
                "Salesforce Platform functionality",
                "Business analysis",
                "Project management",
                "Agile / Scrum delivery models",
                "Data analysis",
                "Partner Portal",
                "Implementation experience",
                "Process documentation",
                "Salesforce data tools",
                "Dashboard design on Einstein Analytics/Tableau CRM",
                "Strong written and verbal communication",
                "Active listening",
                "Team leadership",
                "System security and controls",
                "Salesforce certifications"
            ],
            "with_experience": [
                "Salesforce Platform functionality",
                "Business analysis",
                "Project management",
                "Agile / Scrum delivery models",
                "Data analysis"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Pradeep Sharma",
        "email": "pradeep.sharma@scalable-systems.com",
        "jd": "From: Pradeep, Scalable Systems pradeep.sharma@scalable-systems.com Reply to: pradeep.sharma@scalable-systems.com Hi,Greetings of the day! I have an urgent requirement below, please go through JD and let me know if you are comfortable or have any profile. Kindly revert me back with your updated resume as well. Job Title: Salesforce Business Analyst Location: Sunnyvale, CA (Work from Office)Duration: Long Term Contract Responsibilities:Organized, with a natural inclination for both strategic and tactical planning and turn strategy into tangible deliverables.Resilient and tenacious with a propensity to persevere.Problem solving and root cause identification skills.Flexibility to work in ambiguous situations, highly matrix environments, and support other cross-program work-streams, as necessary.Ability to be detail oriented and can separate priorities from distractions.You are able to analyze business requirements to determine the most ejective approach to serving the needs of the organization .High level of professionalism, energy and sense of urgency to make things happen.Ability to establish and maintain trust, credibility and build strong relationships.Ability to influence others and move toward a common vision or goal.Lead by example and support, encourage and develop team members.Exceptional written and verbal communication, and presentation skills, to audiences of varying seniority.Excellent active listening skillsSelf-motivated individual, who thrives working in a global, matrixed, fast-paced environment.Experience working on projects with teams based outside the US including international engagements. Related Technical Skills required:Strong knowledge of Partner Portal8 + years of experience as a business analyst and admin role leading enterprise-scale PRM projects.Deep understanding of Salesforce Platform functionality and best practices.Strong experience in implementation; ability to determine whether requirements are configuration, customization, and/or integrations with external systemsExperience with Agile / Scrum delivery modelsPrior experience in SLDC project management and analysis including scoping /timeline management, documenting use cases, process flows/swim lane diagrams, requirements, user acceptance testing, change management, etc.Working knowledge of process documentation & project management softwareExperience working with large-scale, complex datasets and using salesforce data tools.Superior ability to design and implement dashboards on Einstein Analytics/ Tableau CRM preferred and reports to deliver business insightKeen understanding of system security and controlsEducations or equivalent degree in Business management, Computer Science, Engineering or related discipline required. MBA degree preferred. Salesforce certifications:Business AnalystSalesforce Administrator Certification (preferred)Agile SCRUM Master certification (preferred)Salesforce Sales Cloud Consultant Certification (preferred) Thanks & Regards, Pradeep SharmaEmail: pradeep.sharma@scalable-systems.com \"Scalable Systems is an Equal Opportunity Employer. We are committed to creating an inclusive environment for all employees and do not discriminate based on race, color, religion, sex, national origin, age, disability, or any other legally protected status.",
        "source": "Email",
        "date_posted": "2024-10-11 06:33:17-05:00",
        "unique_id": "1927b7b7eb638272",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]