[
    {
        "company": "InfoTech Spectrum Inc.",
        "job_title": "Business Analyst ll",
        "location": "Jersey City, NJ, USA",
        "full_location": {
            "city": "Jersey City",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Bachelor’s Degree preferred",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "ServiceNow",
                "Azure",
                "UAT"
            ],
            "primary": [
                "Business Analysis",
                "Requirements Gathering",
                "User Acceptance Testing",
                "Process Improvement",
                "Technical Design"
            ],
            "secondary": [
                "Financial Services Experience",
                "Microsoft SharePoint",
                "UI/Design Specs/Wireframes",
                "Microsoft Office (Visio, Excel, Word, PowerPoint)",
                "Azure DevOps",
                "JIRA",
                "SDLC"
            ],
            "all": [
                "ServiceNow",
                "Azure",
                "UAT",
                "Business Analysis",
                "Requirements Gathering",
                "User Acceptance Testing",
                "Process Improvement",
                "Technical Design",
                "Financial Services Experience",
                "Microsoft SharePoint",
                "UI/Design Specs/Wireframes",
                "Microsoft Office (Visio, Excel, Word, PowerPoint)",
                "Azure DevOps",
                "JIRA",
                "SDLC"
            ],
            "with_experience": [
                "ServiceNow",
                "Azure",
                "UAT"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Minu Roy",
        "email": "minu.roy@infotechspectrum.com",
        "jd": "From: Minu, infotechspectrum minu.roy@infotechspectrum.com Reply to: minu.roy@infotechspectrum.com Role: Business Analyst Work Location: Jersey City, New Jersey and Philadelphia, Pennsylvania, It’s a hybrid role. Work from office 2-3 days in a week.- (Local candidates Only) Primary Skills:- ServiceNow, Azure, UAT(USC, GC, H4 EAD Only) It would be great if you also had: Experience in the financial services industry. Job Summary: Formulates and defines systems scope and objectives based on both user needs and a good understanding of business systems and industry requirements. Devises or modifies procedures to solve problems while considering technical feasibility and desired results. Essential Job Functions: Responsible for eliciting, analyzing, and documenting business and functional requirements. Responsible for identifying, evaluating, and recommending potential solution options. Responsible for analyzing the feasibility and cost benefit of potential solution options. Responsible for managing communications between IT and business for assigned work. Assists in formulating and designing system scope and objectives based on user needs and thorough understanding of IT and business processes. Participates in the technical design, prototyping, test planning, developing, testing, and implementation of new or enhanced applications. Provides support to development, testing, and/or business teams during application deployment. Works with internal business and IT groups on process improvement projects designed to improve output and/or efficiency. Provides technical guidance concerning business implications of application development projects. Assists in training users on new or enhanced applications. Supports the planning and execution of User Acceptance Testing (UAT). Other Functions: Perform special projects and other duties as may be assigned. Complies with proper internal controls as necessary to conduct job functions and/or carry out responsibilities and/or administrative activities at the Company. Establishes and builds strong working relations and partnerships with Business Units and Senior Management. Qualifications: Bachelor’s Degree preferred 10+ years’ experience as an IT business analyst preferred Excellent writing, communication, problem solving, and analytical skills Experience writing business requirements and functional specifications Experience performing gap analyses, and comparing and documenting current and future states Strong customer service orientation and interpersonal relationship building skills: able to work with a variety of people and groups in a constructive and collaborative manner Superior attention to detail Experience as a business analyst during system design and/or configuration and implementation Insurance industry experience is very helpful, but not required Experience with Microsoft SharePoint is very helpful, but not required Experience with UI/design specs/wireframes Knowledge of Microsoft Office products (Visio, Excel, Word, and PowerPoint) Experience creating and editing user stories in Azure DevOps and/or JIRA Experience with ServiceNow Knowledge of activities, tasks, practices and deliverables associated with eliciting and clearly defining and documenting required business functionality as well as non-functional requirements Demonstrated knowledge of SDLC, as well as other formal methodologies for planning and executing application development, enhancement, or support Strong analytical ability with the capability to determine the root cause of problems and issues and provide solutions Ability to juggle multiple, competing, frequently changing time-sensitive deadlines and priorities.",
        "source": "Email",
        "date_posted": "2024-10-11 14:56:41-05:00",
        "unique_id": "1927d485a841a2eb",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]