[
    {
        "company": "Vy Systems",
        "job_title": "Java Full Stack Developer with AWS and Angular and Kubernetes",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "2+ years",
            "degree_required": "Bachelor's Degree in Computer Science, Information Systems, with 4+ years of relevant technical experience or Master’s degree in Computer Science, Information Systems with 2+ years of technical experience.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "AWS",
                "Kubernetes",
                "Graal VM",
                "Java Quarkus"
            ],
            "primary": [
                "Postman",
                "REST Assured",
                "Cypress",
                "Ready API",
                "Jenkins",
                "Circle CI",
                "ECS",
                "EKS",
                "S3",
                "Lambda",
                "SQS/SNS",
                "PostgreSQL",
                "Dynamo",
                "Sagemaker",
                "Athena"
            ],
            "secondary": [
                "Agile development",
                "VersionOne",
                "SDLC processes",
                "CSS-based design",
                "REST services",
                "Analytical skills",
                "Good attitude",
                "Excellent communication skills"
            ],
            "all": [
                "Java",
                "AWS",
                "Kubernetes",
                "Graal VM",
                "Java Quarkus",
                "Postman",
                "REST Assured",
                "Cypress",
                "Ready API",
                "Jenkins",
                "Circle CI",
                "ECS",
                "EKS",
                "S3",
                "Lambda",
                "SQS/SNS",
                "PostgreSQL",
                "Dynamo",
                "Sagemaker",
                "Athena",
                "Agile development",
                "VersionOne",
                "SDLC processes",
                "CSS-based design",
                "REST services",
                "Analytical skills",
                "Good attitude",
                "Excellent communication skills"
            ]
        },
        "job_type": [],
        "contact_person": "Bharath",
        "email": "bharath.r@vysystems.com",
        "jd": "From: Bharath, Vy systems bharath.r@vysystems.com Reply to: bharath.r@vysystems.com Hi,Looking for Java Full Stack Developer with AWS and Angular and Kubernetes (only locals)Job title:Java Full Stack Developer with AWS and Angular and KubernetesAtlanta, GA, USA\"Need only locals don't share non locals\"Who are we looking for?Looking for a Experienced in full stack Cloud-native development, AWS, Graal VM, Java Quarkus, Kubernetes.Specific Qualifications2+ years’ experience in Java, Full-stack, Graal VM, Java Quarkus development experience is requiredExperience in Kubernetes.Automation-minded: Hands on experience of designing and writing automated tests for backend applications and data flow, using tools such as Postman, REST Assured, Cypress, Ready API etc.Hands on experience of working with continuous integration tools such Jenkins, Circle CI.Broad hands on experience in AWS Cloud serverless components and ability to build and maintain cloud data processing systems (i.e. ECS, EKS, S3, Lambda, SQS/SNS, PostgreSQL, Dynamo, Sagemaker, Athena, etc.)Experience working in an agile development environment using workload management tools like VersionOne/AgilityExcellent judgment and problem-solving skills; individual should be able to resolve urgent problems in a calm and quick manner and display a high degree of initiative and driveAbility to be effective in a high stress environmentBe flexible and embrace challenges that are outside of your comfort zone WHAT WILL GIVE YOU A COMPETITIVE EDGE (PREFERRED QUALIFICATIONS)Bachelor's Degree in Computer Science, Information Systems, with 4+ years of relevant technical experience or Master’s degree in Computer Science, Information Systems with 2+ years of technical experience.AWS Certification is a plusDevOps and/or automation experience in code testing, building, and deployment a plusKnowledge and experience with the Airline Industry a plus.Process Skills:General SDLC processesWeb standards, CSS-based design, REST servicesDesign, develop, document, test and debug new and existing software APIsAnalytical Skills:Strong analytical skills required with strong attention to detail and accuracy. Ability to source, disseminate and properly apply secondary research.Behavioral Skills:Good Attitude and Excellent communication skills both oral and written.Ability to excel in a team environment required. Must be able to successfully interface with multiple departments. Excellent verbal, written and interpersonal communication skillsQuick learner Regards,BHARATH- Vy​SystemsEmail ID:bharath.r@vysystems.com",
        "source": "Email",
        "date_posted": "2024-10-11 12:29:16-05:00",
        "unique_id": "1927cc164000b668",
        "emp_type": [
            "third party"
        ],
        "tag": "Java developer"
    }
]