[
    {
        "company": "Scalable Systems",
        "job_title": "Business Systems Analyst",
        "location": "Sunnyvale, CA, USA",
        "full_location": {
            "city": "Sunnyvale",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Data Analysis",
                "Technical Skills",
                "Communication",
                "Problem-Solving",
                "Collaboration",
                "Attention to Detail"
            ],
            "primary": [
                "Excel",
                "Tableau",
                "SQL"
            ],
            "secondary": [
                "Agile development methodologies",
                "Scrum",
                "Kanban",
                "Certifications in business analysis",
                "CBAP",
                "CCBA"
            ],
            "all": [
                "Business Analysis",
                "Data Analysis",
                "Technical Skills",
                "Communication",
                "Problem-Solving",
                "Collaboration",
                "Attention to Detail",
                "Excel",
                "Tableau",
                "SQL",
                "Agile development methodologies",
                "Scrum",
                "Kanban",
                "Certifications in business analysis",
                "CBAP",
                "CCBA"
            ]
        },
        "job_type": [],
        "contact_person": "ayush",
        "email": "ayush.yadav@scalable-systems.com",
        "jd": "From: ayush, Scalable Systems ayush.yadav@scalable-systems.com Reply to: ayush.yadav@scalable-systems.com Job Description: Business Systems AnalystLocation: Sunnyvale, CAAbout the Role:As a Business Systems Analyst, you will play a crucial role in bridging the gap between business needs and technical solutions. You will collaborate with various stakeholders to gather, analyze, and document business requirements, ensuring that IT solutions effectively support the organization's goals. Your strong analytical skills and ability to translate complex business needs into technical specifications will be essential in driving successful project outcomes.Key Responsibilities:Requirement Gathering and Analysis: Collaborate with business stakeholders to identify, document, and analyze business requirements. Conduct in-depth interviews, workshops, and surveys to gather comprehensive information.Data Analysis: Utilize data analysis techniques to identify trends, patterns, and areas for improvement. Leverage tools like Excel, Tableau, or other data visualization software to present findings effectively.Process Mapping: Create detailed process maps and workflow diagrams to visualize current and future state processes. Identify inefficiencies and opportunities for optimization.Stakeholder Management: Facilitate workshops and meetings to elicit requirements, monitor project progress, and provide regular updates to stakeholders. Build strong relationships and maintain effective communication channels.Testing and Quality Assurance: Assist in the testing process to ensure that solutions meet business requirements and deliver expected outcomes. Identify and resolve defects to maintain quality standards.Technical Documentation: Prepare clear and concise technical documentation, including requirements specifications, process flows, and data models.Problem-Solving: Analyze business problems and provide innovative solutions that align with organizational objectives.Collaboration: Work closely with technical teams, including developers, architects, and testers, to ensure successful project implementation.Required Skills and Qualifications:Business Analysis: Strong understanding of business analysis methodologies and techniques.Data Analysis: Proficiency in data analysis tools and techniques, such as Excel, Tableau, or SQL.Technical Skills: Knowledge of software development methodologies and IT systems.Communication: Excellent written and verbal communication skills, including the ability to explain complex technical concepts to non-technical stakeholders.Problem-Solving: Strong analytical and problem-solving skills. Collaboration: Ability to work effectively in a team environment and build strong relationships with stakeholders.Attention to Detail: Meticulous attention to detail and accuracy.Preferred Skills and Qualifications:Experience with Agile development methodologies (e.g., Scrum, Kanban).Knowledge of industry-specific business processes.Certifications in business analysis (e.g., CBAP, CCBA).",
        "source": "Email",
        "date_posted": "2024-10-11 10:36:20-05:00",
        "unique_id": "1927c5a02c2d4870",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]