[
    {
        "company": "Klaxontech Pvt Ltd",
        "job_title": "Business Analyst (O2C)",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "11+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "financial systems",
                "ERP",
                "billing",
                "invoicing",
                "contract review"
            ],
            "primary": [
                "JDE",
                "change management",
                "process analysis",
                "communication",
                "training"
            ],
            "secondary": [
                "acute listening skills",
                "inquisitive nature",
                "detail-focused",
                "relationship-building",
                "improvisation"
            ],
            "all": [
                "financial systems",
                "ERP",
                "billing",
                "invoicing",
                "contract review",
                "JDE",
                "change management",
                "process analysis",
                "communication",
                "training",
                "acute listening skills",
                "inquisitive nature",
                "detail-focused",
                "relationship-building",
                "improvisation"
            ],
            "with_experience": [
                "financial systems",
                "ERP",
                "billing",
                "invoicing",
                "contract review"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Gary Ronald",
        "email": "gary.r@klaxontech.com",
        "jd": "From: Gary Ronald, Klaxontech Pvt Ltd gary.r@klaxontech.com Reply to: gary.r@klaxontech.com This is a critical role, so please ensure you thoroughly review the requirements before submitting any resumes. Only profiles with 11+ years of experience will be considered. Immediate interview calls will be scheduled, as this is a fast-moving position. You will only receive a response and client submission if you are sending the right candidate to me. Position: Business Analyst (O2C) – 8 open positions Location: Remote – prefer est/cstType: Contract JDE integration experience- Background: Order-to-Cash (O2C) kicked off early in 2024 as a proof of concept for a modernized billing process to bring accuracy, consistency and efficiency to customer invoicing. Currently, all bus depots/locations rely on manual and cumbersome Excel-based processes. The expected benefits of this project are to elevate First Student to a best-in-class level. As the proof of concept wraps up, there will be a large effort to roll out the new process across all existing locations (500+). Each location operates independently – much like a franchise model, which will require significant process analysis and deep dives to understand current state. This understanding will need to rapidly be translated to the future state process while not disrupting business operations. The Financial Systems/Business analyst will be responsible for:Learning setup and processing steps for all systems involved in customer invoicing (current state and future state)Evaluating contracts and interpreting the future state system setup requirements across these systemsAnticipating scenarios/gaps that have not been documented/identified through working with locations and project teamDocumenting requirements of system gaps, reviewing with broader project team, prioritizing backlogs and assisting with testingExtensive change management, planning and relationship-building with location team members based on aggressive project scheduleHands-on training (virtual) and production support with non-technical end users Required Skills:Experience with financial systems/ERP and associated billing/invoicing business processes and approvals; JDE experience is beneficialAcute listening skills coupled with an inquisitive nature and strong yet empathetic communication – both with external locations and core project teamAbility to flex and improvise while adhering strictly to the plan and expected outcomesExtremely detail-focused and experienced in contract review and financial reconciliation from current state to future state",
        "source": "Email",
        "date_posted": "2024-10-11 12:47:46-05:00",
        "unique_id": "1927cd254ff6aa86",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]