[
    {
        "company": "Navy Federal Credit Union",
        "job_title": "Scrum Master",
        "location": "Vienna, VA, USA",
        "full_location": {
            "city": "Vienna",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Significant experience leading agile development teams",
            "degree_required": "Advanced degree in Information Systems, Computer Science, Engineering, or related field",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Scrum Master certifications",
                "Agile development",
                "Analytics",
                "Business Intelligence applications",
                "PowerBI",
                "Tableau"
            ],
            "primary": [
                "Leading agile development teams",
                "Mentoring and coaching",
                "Project management",
                "Cloud Applications (e.g. Azure, Data Bricks)",
                "Resource allocation and management"
            ],
            "secondary": [
                "Banking/Finance/Investments knowledge",
                "CSM certification",
                "PMI-ACP certification",
                "Advanced database skills",
                "Analytical and problem-solving skills"
            ],
            "all": [
                "Scrum Master certifications",
                "Agile development",
                "Analytics",
                "Business Intelligence applications",
                "PowerBI",
                "Tableau",
                "Leading agile development teams",
                "Mentoring and coaching",
                "Project management",
                "Cloud Applications (e.g. Azure, Data Bricks)",
                "Resource allocation and management",
                "Banking/Finance/Investments knowledge",
                "CSM certification",
                "PMI-ACP certification",
                "Advanced database skills",
                "Analytical and problem-solving skills"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "ashish",
        "email": "ashish@tekinspirations.com",
        "jd": "From: ashish, Tekinspirations ashish@tekinspirations.com Reply to: ashish@tekinspirations.com Hi,Job Description -Need DL Copy at time of Submission and Please provide candidate’s Active LinkedIn Profile with profile picture as it is Required. Also I have a Skills Matrix which is to fill by candidate at time of Submission. Resume no longer than 5 pages. Client: Navy Federal Credit UnionJob Title: Scrum Master Location: This is a hybrid role in either Vienna or Winchester, VA; Pensacola, FL; or San Diego, CA. Need Local Candidates of these AreaDuration: 6+ monthsMOI: Skype.Visa: USC Only This role will require someone with analytics or BI applications/products. PowerBI and Tableau are used at NFCU. Because this group is intelligent automation, we want to find someone that has worked with teams of BI, analytics, data scientists and analysts.Focus:•Significant experience leading an agile development team with the ability to lead two teams concurrently if needed•Significant experience in leading, mentoring, guiding and coaching professional staff•Scrum Master certifications (Required)•Shift (Time): 8:00am - 4:30pmThe Scrum Master works closely with the Product Owner to prioritize and lead delivery of the initiative's capabilities by removing impediments, facilitating team meetings and events, and fostering an environment for high performance. The Scrum Master manages a continuous workflow of their team. They advocate, adopt and coach their team on lean, agile and scrum practices. Participate on complex, essential projects working under minimal supervision and with wide latitude for independent judgment. Accountable for completion of assigned deliverables and milestones. Individual contributor and mentor to junior staff. Highly skilled and proficient in discipline, considered senior level position.Responsibilities:Exhibit behaviors of a Lean-Agile Leader through mindset; helps the team embrace SAFe core values, adopt and apply SAFe principles and implement SAFe practicesSupport the team rules of Scrum, eliminate impediments and lead the team in efforts for relentless improvement and heightened efficiencyEnsure technology and service delivery roadmap support the solution strategy and are sustainable to meet the needs of the various solutions being delivered on that productFacilitate the team's progress toward team goals; utilizing the current Program Increment (PI) Objectives as Iteration GoalsEnsure that goals, scope and product backlog items are understood and can be fulfilled by team membersCollaborate with Product Owner, customers and developers to identify and clarify scope of problems/issues in terms of business/systems requirements and processesSupport the team's efforts to continuously improve communications and relationships with other delivery teams; represent the team in the Scrum of Scrums (SoS), helping the team remain aware of engagement opportunities and program effectivenessEngage in challenging the old norms of development to improve performance in the areas of quality, predictability, flow, and velocitySupport software development teams in applying the Scrum frameworkQualifications (Skills which are mentioned below, will be mentioned in the Skill Matrix, so all the points are very important): Functional and technical expertise in at least 1 analytics or business intelligence application or productSignificant project management experience, as well as strong fundamentals in advanced analytics, data integration, and visualizationWorking knowledge of Cloud Applications (e.g. Azure, Data Bricks)Proficient in software development and system administrationSignificant experience in resource allocation and managementSignificant experience in leading, guiding and coaching professional staffSignificant experience leading agile development teams and facilitating team meetings in Agile environmentAdvanced knowledge of development or operations framework methodologies, including Agile principlesDesired - In-depth knowledge and experience in Banking/Finance/Investments, familiar with terminology, concepts and business processes and systemsDesired - Familiarity with industry standards and regulationsDesired - CSM and/or PMI-ACP certificationAdvanced database and presentation software skillsAdvanced research, analytical, and problem solving skillsEffective skill in building strategic and execution-focused plans and alliances with partner leadershipDesired - Advanced degree in Information Systems, Computer Science, Engineering, or related field",
        "source": "Email",
        "date_posted": "2024-10-11 14:02:26-05:00",
        "unique_id": "1927d6c724c130cb",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Scrum Master"
    }
]