[
    {
        "company": "infotechspectrum",
        "job_title": "Product Delivery Manager",
        "location": "New York, NY, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "20+ years",
            "degree_required": "Bachelor's degree in Computer Science, Information Technology, or a related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "28 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Product Delivery",
                "Technical Leadership",
                "Agile Methodologies",
                "Stakeholder Collaboration",
                "Product Metrics"
            ],
            "primary": [
                "Cross-functional Team Leadership",
                "User-Centric Product Development",
                "Continuous Improvement",
                "Value-Driven Delivery",
                "Strategic Alignment"
            ],
            "secondary": [
                "PMP",
                "PgMP",
                "CSM",
                "Agile certifications",
                "Lean Methodologies"
            ],
            "all": [
                "Product Delivery",
                "Technical Leadership",
                "Agile Methodologies",
                "Stakeholder Collaboration",
                "Product Metrics",
                "Cross-functional Team Leadership",
                "User-Centric Product Development",
                "Continuous Improvement",
                "Value-Driven Delivery",
                "Strategic Alignment",
                "PMP",
                "PgMP",
                "CSM",
                "Agile certifications",
                "Lean Methodologies"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "abhishek saini",
        "email": "abhishek.s@infotechspectrum.com",
        "jd": "From: abhishek saini, infotechspectrum abhishek.s@infotechspectrum.com Reply to: abhishek.s@infotechspectrum.com HIRING----Product Delivery ManagerLOCATION---New York, NY. HYBRID This role is On site, (then becomes Hybrid, 50% in office required) and is a long term contract, 28 months. The mission of the Integrated Eligibility System (IES) is to enhance the well-being of New Yorkers by transforming health and human service delivery through coordinated business practices, modernized technology, and strategic partnerships. IES will provide eligibility, enrollment, case management, and payment functionality for Health and Human Service programs currently served by the Welfare Management System, Benefits Issuance Control System and other State systems. IES will build on the successful opening of the New York State of Health (NYSoH) by leveraging assets created for the health benefit exchange to modernize the eligibility system for health and human service programs. Key Responsibilities:The Product Delivery Manager (or Technology Delivery Manager) is responsible for driving the end-to-end delivery of digital products and technology solutions that align with the organization's strategic objectives. Reporting directly to the Technical Director, this role requires a deep understanding of product delivery, strong technical acumen, and leadership skills to foster cross-functional collaboration. The manager will ensure the successful delivery of high-value products, focusing on user needs, market trends, and creating meaningful outcomes.Key Responsibilities:Product & Technology Ownership: Lead the delivery of innovative products, collaborating with stakeholders to define the vision, value proposition, and key outcomes. Align products and technology initiatives with business goals and ensure consistent progress toward that vision.Strategic Alignment: Work closely with the Technical Director to ensure that all initiatives align with the organization's strategic objectives, prioritizing feature development based on business impact and customer needs.Stakeholder Collaboration: Partner with product owners, UX designers, engineers, and other stakeholders to translate user needs into actionable delivery plans. Drive clarity and ensure everyone shares a common understanding of product objectives and priorities.Technical and Product Leadership: Provide technical and product guidance to cross-functional teams, including development, architecture, and UX. Foster collaboration and ensure the teams are working effectively towards delivering valuable outcomes.Agile & Lean Methodologies: Promote Agile and Lean principles to create a culture of continuous learning, adaptation, and improvement across all product teams. Focus on iterative delivery and ensuring customer feedback drives product development.Value-Driven Delivery: Emphasize user value in all product decisions. Champion features that deliver the most value to customers and eliminate unnecessary work that does not contribute to product success.Product Metrics & Outcomes: Establish and track product success metrics (KPIs) to assess the value delivered, user engagement, and other key performance indicators. Use insights from metrics to drive improvements in product delivery and user satisfaction.Continuous Improvement: Lead efforts to optimize team performance and product quality, identifying opportunities for improvement and implementing new strategies for increased efficiency and effectiveness.Team Collaboration & Leadership: Cultivate a culture of innovation and teamwork across delivery teams. Encourage open communication and support a collaborative environment that enables the successful creation of user-centric products. Mandatory Qualifications:Level III- More than seven (7) years of experience working on complex projects with 2 or more years in a leadership role as a SpecialistTwenty or more years of experience managing product and technology delivery, including successful delivery of large-scale digital products.Fifteen or more years of experience working closely with senior technical leadership, such as Technical Directors, CTOs, or CPOs, to align product and technology outcomes with strategic goals. Desirable Qualifications:Fifteen or more years of experience leading cross-functional teams, including developers, architects, UX designers, QA, and product owners.Ten or more years of working experience in delivering impactful digital products in an Agile environment, with experience in both product and technical leadership roles.Fifteen or more hands-on experience in optimizing product delivery processes to ensure efficient resource allocation and high-quality outputs.PMP, PgMP, CSM or Agile certificationsBachelor's degree in Computer Science, Information Technology, or a related field",
        "source": "Email",
        "date_posted": "2024-10-11 09:49:04-05:00",
        "unique_id": "1927c2eba34f8f35",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]