[
    {
        "company": "TEK Inspirations LLC",
        "job_title": "SDET with .Net Developer exp",
        "location": "New York, NY, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Bachelor's or Master's degree in Computer Science, Information Technology, or related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "C#",
                ".NET",
                "desktop applications",
                "unit testing",
                "test automation"
            ],
            "primary": [
                "Equity Derivatives",
                "SWAP business",
                "Windows services",
                "Git",
                "object-oriented programming"
            ],
            "secondary": [
                "WPF",
                "WinForms",
                "CI/CD",
                "SQL",
                "agile development methodologies"
            ],
            "all": [
                "C#",
                ".NET",
                "desktop applications",
                "unit testing",
                "test automation",
                "Equity Derivatives",
                "SWAP business",
                "Windows services",
                "Git",
                "object-oriented programming",
                "WPF",
                "WinForms",
                "CI/CD",
                "SQL",
                "agile development methodologies"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Bhawana Arya",
        "email": "bhawana.arya@tekinspirations.com",
        "jd": "Job Description -Title: SDET with .Net Developer expLocation: New York, NY (Hybrid – 3 days/week onsite)Duration: 6+monthsMOI: F2F Recruiters Note:- SDET needed in recent experience / need old LinkedIn 5 years / .net, C#, exp in Automation testing, WinForms, WPF / Equity Derivative and SWAP business functionalities is not mandatory / exp in desktop based applications Job Description:We are seeking a highly skilled C#/.NET Developer with experience in desktop-based applications and a strong background in the Equity Derivatives and/or SWAP business. The ideal candidate will have a deep understanding of financial markets and instruments, particularly in equity derivatives or swaps, and will be responsible for creating robust unit testing modules for Windows service-based applications, as well as automating test harnesses. Key Responsibilities:Develop and maintain desktop-based applications Collaborate with business analysts and stakeholders to translate business requirements into technical specifications.Design and implement Windows service-based applications with a focus on performance, scalability, and security.Develop comprehensive unit testing modules to validate the functionality and performance of Windows services.Automate test harnesses to streamline the testing process and ensure consistent quality.Participate in code reviews and adhere to best practices in software development.Maintain up-to-date knowledge of C#/.NET programming, design patterns, and application development methodologies.Troubleshoot and resolve complex issues within the application and related systems.Document technical designs, processes, and procedures for cross-team knowledge sharing and future maintenance.Work closely with the quality assurance team to ensure delivery of high-quality and reliable software.Provide technical support and guidance to junior developers and team members.Stay abreast of new trends and best practices in software development and introduce them to the team where beneficial. Required Skills and Qualifications:Bachelor's or Master's degree in Computer Science, Information Technology, or related field.Hands on experience in C#/.NET development, particularly with desktop applications.Proven experience in the financial services industry, with a strong understanding of Equity Derivatives and/or SWAP business.Expertise in developing unit testing modules for Windows services.Experience with test automation and familiarity with test harness frameworks.Proficient understanding of code versioning tools, such as Git.Strong understanding of object-oriented programming and design patterns.Excellent problem-solving and analytical skills.Strong communication and interpersonal abilities. Desirable Skills:Experience with WPF, WinForms, or other GUI libraries in .NET for desktop application development.Familiarity with Continuous Integration/Continuous Deployment (CI/CD) pipelines.Knowledge of SQL and experience with database design and management.Experience with agile development methodologies such as Scrum or Kanban.",
        "source": "Email",
        "date_posted": "2024-10-11 11:08:00-05:00",
        "unique_id": "1927c76ffdef744b",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]