[
    {
        "company": "Tek Inspirations",
        "job_title": "T-SQL Database Technician",
        "location": "Harrisburg, PA, USA",
        "full_location": {
            "city": "Harrisburg",
            "state": "PA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "2-3 years",
            "degree_required": "Bachelor's degree with an IT-related major or minor; or Associate's degree with an IT-related major or minor and two years of experience in the IT area.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "T-SQL"
            ],
            "primary": [
                "metadata administration",
                "application security administration",
                "data analysis"
            ],
            "secondary": [
                "helpdesk ticket management",
                "user security change requests",
                "data scripts development",
                "quality assurance",
                "procedural documentation"
            ],
            "all": [
                "T-SQL",
                "metadata administration",
                "application security administration",
                "data analysis",
                "helpdesk ticket management",
                "user security change requests",
                "data scripts development",
                "quality assurance",
                "procedural documentation"
            ]
        },
        "job_type": [
            "onsite",
            "hybrid"
        ],
        "contact_person": "Roshan Singh Yadav",
        "email": "roshan.yadav@tekinspirations.com",
        "jd": "From: Roshan singh yadav, Tek Inspirations roshan.yadav@tekinspirations.com Reply to: roshan.yadav@tekinspirations.com Hi,Hope you are doing well.Have a look at role. Let me know your view. Job Description -This is an entry-level role (2-3 years experience). Please let me know what you come up with and we'll go from there. The T-SQL experience is a must-haveTitle: T-SQL Database Tech (entry level)Duration: through 2027Client: PA State Government AgencyLocal to Harrisburg, Pa. HYBRID. First 6 weeks will be 100% onsite. After 6 weeks, candidate MUST be able to report onsite 3 days/week. The selected candidate will oversee metadata administration, application security administration, and data analysis for a case management systems. The position also involves accurately applying county-customized business rules to the data store using Administration screens, in-house tools, and T-SQL for data modifications.Job DutiesMonitors helpdesk ticket queues and prioritizes tasks based on severity and priority levels.Performs lookup value and metadata entry and maintenance to support the application.Understands Administration screens and uses the application where appropriate.Performs user security change requests using in-house tools and template T-SQL scripts.Utilizes knowledge of T-SQL to perform application metadata and security maintenance activities.Develops and implements data scripts using IDERA Rapid SQL for SAP ASE databases.Performs testing of lookup values, metadata modifications, and application security for quality assurance.Performs metadata analysis to ensure the case management systems function properly.Assists with maintaining procedural documentation for the metadata administration and application security tasks.Assists team members and training staff with the collection and implementation of metadata. Minimum QualificationsKnowledge and understanding of T-SQL fundamentals.Bachelor's degree with an IT-related major or minor; or Associate's degree with an IT-related major or minor and two years of experience in the IT area.",
        "source": "Email",
        "date_posted": "2024-10-11 11:57:49-05:00",
        "unique_id": "1927cd152c95bd8c",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "DB Admin"
    }
]