[
    {
        "company": "Cognizant",
        "job_title": "PROGRAM MANAGER",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "11 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "TIBCO BW",
                "TIBCO BE",
                "TIBCO ActiveSpace",
                "Java",
                "Kafka",
                "ElasticSearch",
                "Kibana",
                "Apache Flink",
                "Shell Scripting",
                "REST API"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "TIBCO BW",
                "TIBCO BE",
                "TIBCO ActiveSpace",
                "Java",
                "Kafka",
                "ElasticSearch",
                "Kibana",
                "Apache Flink",
                "Shell Scripting",
                "REST API"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Isaac",
        "email": "isaac@centraprise.com",
        "jd": "From: Isaac, Centraprise isaac@centraprise.com Reply to: isaac@centraprise.com Hi Professional, I am writing to let you know regarding a job opportunity as “PROGRAM MANAGER” with “Cognizant”. Mentioned is the job description for your review. Job Title: PROGRAM MANAGERLocation: RemoteJob Type: Contract Job Description: Mandate Skills TIBCO BW, TIBCO BE, TIBCO ActiveSpace, Java, Kafka, ElasticSearch, Kibana, Apache Flink, Shell Scripting, REST API Job summary: We are seeking an experienced Program Manager with 11 years of experience to join our dynamic team. The ideal candidate will have a strong background in TIBCO and will be responsible for overseeing various projects in a hybrid work model. This role requires excellent organizational and communication skills to ensure the successful delivery of projects. The position does not require travel and operates during day shifts. Qualifications Possess a minimum of 10 years of experience in program management, with a strong focus on TIBCO. Demonstrate excellent organizational and time management skills. Exhibit strong communication and interpersonal skills. Show proficiency in project management software and tools. Have a proven track record of successfully managing complex projects. Display the ability to work effectively in a hybrid work model. Hold a relevant certification in project management, such as PMP or PRINCE2. If interested, please fill the below details and revert with your updated resume. Candidate Full Name Current Location Phone Email ID Skype ID Linked in ID Passport number Total Years of Experience Education Visa Status Willing to relocate Rate Last 4 Digits of SSN#: Availability to start on the project Previously worked with Cognizant (Y/N) If Yes – Provide the CTS Emp ID Interview Availability with the time Zone Thanks & RegardsIsaacIsaac@centraprise.comDirect: 469-923-8111Centraprise",
        "source": "Email",
        "date_posted": "2024-10-11 10:37:55-05:00",
        "unique_id": "1927c855d64c51f2",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]