[
    {
        "company": "ICS Global Soft",
        "job_title": "Java Lead",
        "location": "Dearborn, MI, USA",
        "full_location": {
            "city": "Dearborn",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long-term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java"
            ],
            "primary": [
                "Project Management",
                "Technical Documentation",
                "Team Leadership"
            ],
            "secondary": [
                "Production Support",
                "SLA Management",
                "Quality Assurance"
            ],
            "all": [
                "Java",
                "Project Management",
                "Technical Documentation",
                "Team Leadership",
                "Production Support",
                "SLA Management",
                "Quality Assurance"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Ram",
        "email": "ram@icsglobalsoft.com",
        "jd": "Hello ,Hope you are doing well.This is Ram from ICS Global Soft. Kindly find the below job description and let me know your availability. Role: Java LeadLocation: DEARBORN,MI(Onsite)Duration: Long-term Java Lead To ensure successful initiation, planning, execution, control and completion of the project by guiding team members on technical aspects, conducting reviews of technical documents and artefacts. Lead project development, production support and maintenance activities. Fill and ensure timesheets are completed, as is the invoicing process, on or before the deadline. Lead the customer interface for the project on an everyday basis, proactively addressing any issues before they are escalated. Create functional and technical specification documents. Track open tickets/ incidents in queue and allocate tickets to resources and ensure that the tickets are closed within the deadlines. Ensure analysts adhere to SLA¿s/KPI¿s/OLA¿s. Ensure that all in the delivery team, including self, are constantly thinking of ways to do things faster, better or in a more economic manner. Lead and ensure project is in compliance with Software Quality Processes and within timelines. Review functional and technical specification documents. Serve as the single point of contact for the team to the project stakeholders. Promote team work, motivate, mentor and develop subordinates. Provide application production support as per process/RACI (Responsible, Accountable, Consulted and Informed) Matrix.",
        "source": "Email",
        "date_posted": "2024-10-11 13:30:40-05:00",
        "unique_id": "1927cf99bd82df50",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]