[
    {
        "company": "Vyzeinc",
        "job_title": "Business Analyst - Lead",
        "location": "Washington, DC, USA",
        "full_location": {
            "city": "Washington",
            "state": "DC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Five or more years",
            "degree_required": "Bachelor's degree in a technical discipline such as Computer Science, Information Technology, Systems Engineering, or related field, or specialized training and equivalent work experience.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business analysis",
                "Requirements elicitation",
                "Documentation",
                "Microsoft Office Tools",
                "HP Quality Center’s Requirements Module"
            ],
            "primary": [
                "Quality assurance",
                "Workflow tools",
                "Business case development",
                "Technology solution assessment",
                "Analytical thinking",
                "Problem solving",
                "Negotiation",
                "Conflict management"
            ],
            "secondary": [
                "Certified Business Analysis Professional (CBAP)",
                "Master's degree",
                "ARROW reservation system",
                "Enterprise Applications (SAP, Ariba)",
                "E-Commerce sites",
                "Kiosks",
                "Point of Sale (POS) Systems",
                "Mobile Devices",
                "Travel/airline industry",
                "Microsoft SharePoint 2010"
            ],
            "all": [
                "Business analysis",
                "Requirements elicitation",
                "Documentation",
                "Microsoft Office Tools",
                "HP Quality Center’s Requirements Module",
                "Quality assurance",
                "Workflow tools",
                "Business case development",
                "Technology solution assessment",
                "Analytical thinking",
                "Problem solving",
                "Negotiation",
                "Conflict management",
                "Certified Business Analysis Professional (CBAP)",
                "Master's degree",
                "ARROW reservation system",
                "Enterprise Applications (SAP, Ariba)",
                "E-Commerce sites",
                "Kiosks",
                "Point of Sale (POS) Systems",
                "Mobile Devices",
                "Travel/airline industry",
                "Microsoft SharePoint 2010"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "sujata",
        "email": "sujata@vyzeinc.com",
        "jd": "From: sujata, Vyzeinc sujata@vyzeinc.com Reply to: sujata@vyzeinc.com Job Title- Business Analyst - LeadLocation- Washington DCDuration- 12monthsMOI - Virtual Interview Need Candidate from DMV area .Must be residing in US from Last 7 yearsNEED LINKEDIN . Job Description-Business Analyst - LeadThe Lead Business Analyst is responsible for leading the collection, analysis, documentation and coordination of a client’s business requirements on multiple projects and programs. Works with multiple business partners within one or more business unit to align technology solutions with business strategies. Demonstrates an in depth knowledge of a business area in the context of the business client’s unit to identify and communicate how IT solutions can assist.Manage client’s priorities of projects and requests. Assess client needs utilizing a structured requirements process (gathering, analyzing, documenting, and managing changes) to prioritize immediate business needs and recommend options, risks and cost vs. benefits. Conduct feasibility studies and draft proposals for evaluation by appropriate users and managers. Develop and present business cases. Develop, write, and communicate business requirements for the design and implementation of business solutions. Procure technical assistance to help in problem resolution. Review quality of deliverables from other business analysts Review test plans and monitor the testing process to ensure that business results are adequately tested with minimal risk. Develop Service Level Agreements. May assist in the selection of vendors for clients in accordance with IT standards and specifications. Investigate, resolve and escalate problems. Monitor and analyze metrics to ensure customer satisfaction.Deliverables• High-Level Business Objective • Business Requirements Document • Functional Requirements Document • Technical Requirements Document • Business Analysis Diagrams (Business Process Flows, Sequence Diagrams, Workflow Diagrams, Activity Models) • Requirements Traceability MatrixRequirementsFive or more years related work experience Bachelor's degree in a technical discipline such as Computer Science, Information Technology, Systems Engineering, or related field, or specialized training and equivalent work experience. Minimum five years of experience with HP Quality Center’s Requirements Module Proficient with Microsoft Office Tools such as Word, Visio and PowerPoint Knowledge of requirements elicitation, analysis and documentation Knowledge of business analysis, quality assurance, and workflow tools and/or practices Knowledge of business case development and presentation Knowledge of technology solution assessment and validation Effective professional relationship building skills Ability to lead, design, and facilitate multiple concurrent workshops and deliver effective presentations that are valued by the client. Demonstrated ability to quickly learn existing business processes and combine knowledge from multiple disciplines in order to produce an optimal business solution. Demonstrated ability to manage and/or participate in multiple projects/assignments with a high degree of complexity.Possess the skills to initiate, evaluate, develop and influence users on adoption of solid, actionable recommendations. Strong analytical thinking and problem solving skills Effective negotiation and conflict management skills Ability to execute project deliverables in an independent fashion Excellent written and verbal communication skills to both business users and technical staff Ability to work closely with peers and team members in a collaborative manner. Ability to ensure compliance to guidelines, controls, policies, and proceduresSpecial Skillset (Preferred)• Business analysis certification such as the Certified Business Analysis Professional (CBAP). • Master's degree. • Experience with the ARROW reservation system or similar travel systems. • Experience with Enterprise Applications such as SAP and/or Ariba. • Experience with Distributed Systems such as E-Commerce sites, Kiosks, Point of Sale (POS) Systems, and Mobile Devices • Experience in the travel/airline industry. • Five years of experience working with project managers to plan business analysis and highlight risks and issues. • Five years of experience working with business users to define accurate, meaningful and measurable business cases, functional requirements, technical requirements, and use cases. • Five years of experience working with the business owners to define acceptance criteria. • Five years of experience partnering with business owners to ensure expectations and requirements are met and managed. • Three years of experience using Microsoft SharePoint 2010",
        "source": "Email",
        "date_posted": "2024-10-11 12:58:55-05:00",
        "unique_id": "1927cdc8c935a270",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]