[
    {
        "company": "Dia Software Solutions",
        "job_title": "Business Analyst",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "5+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "1 year with extension possible",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Clear and concise communication skills",
                "Experience in a professional office environment",
                "Experience as a business analyst supporting a software development project",
                "Ability to lead meetings and conduct training",
                "Proficiency with MS Office",
                "Experience with Azure DevOps"
            ],
            "primary": [
                "Exposure to Complex IT web Applications",
                "Experience working as a liaison between the development team and project manager",
                "Experience with Microsoft SharePoint"
            ],
            "secondary": [
                "Knowledge and understanding of the Software Development Lifecycle",
                "Project management skills and knowledge in project management methodologies",
                "Experience with Salesforce Platform",
                "Experience with MS Dynamics 365"
            ],
            "all": [
                "Clear and concise communication skills",
                "Experience in a professional office environment",
                "Experience as a business analyst supporting a software development project",
                "Ability to lead meetings and conduct training",
                "Proficiency with MS Office",
                "Experience with Azure DevOps",
                "Exposure to Complex IT web Applications",
                "Experience working as a liaison between the development team and project manager",
                "Experience with Microsoft SharePoint",
                "Knowledge and understanding of the Software Development Lifecycle",
                "Project management skills and knowledge in project management methodologies",
                "Experience with Salesforce Platform",
                "Experience with MS Dynamics 365"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Sayyad Akif Husain",
        "email": "sayyad.husain@diasoftwaresolutions.com",
        "jd": "From: Sayyad Akif Husain, Dia Software Solutions sayyad.husain@diasoftwaresolutions.com Reply to: sayyad.husain@diasoftwaresolutions.com Hi,I hope this message finds you well! I am reaching out to you on an exciting Direct client opportunity with one of our clients. Can you please go through the requirements and let me know if you are interested in this position?Job Title: Business AnalystLocation: Lansing, MI HybridExperience: 5+ yearsDuration: 1 year with extension possibleInterviews: MS Teams video interview with camera ON, In-person second round REQUIREDPosition location: Lansing, MI. Hybrid Role with 2 days onsite from day 1 - Tuesday and WednesdayLocal ONLYClear and concise communication skills required. Tasks:Facilitates meetings with the technical team and business client. Gathers requirements and project specifications by leading requirement sessions independentlyMaintain backlog of work items in Azure DevOpsManage project tasks, timelines, and communication between business product owner and development team associated with the Change Management lifecycleTrack sprints and ticket progress in Azure DevOpsEnsures the team is adhering to the department change management policies Maintains documentation on the project SharePoint Site.Must be detail oriented and a critical thinkerProvide management with information such as project status reports and resource demand projections. Top Skills & Years of Experience Required: Exposure to Complex IT web Applications, within the past 5 years Required 5 Years Experience in a professional office environment Required 5 YearsExperience in a role, as a business analyst, supporting a software development project, in the past 5 years Required 3 YearsAbility to lead meetings, conduct training & information sessions, communicate at a level appropriate to the audience, make oral and written reports and presentations Required 3 YearsProficiency with MS Office Required 3 YearsExperience working as a liaison between the development team and project manager or business client in a software development project Required 2 Years Experience with Azure DevOps Required 6 Months Highly Desired Skills -Knowledge and understanding of the Software Development Lifecycle Highly Desired 2 YearsProject management skills and knowledge in project management and related methodologies Highly Desired 6 MonthsExperience with Microsoft SharePoint Highly Desired 6 MonthsExperience with Salesforce Platform Highly Desired 6 MonthsExperience with MS Dynamics 365 Highly Desired 6 Months",
        "source": "Email",
        "date_posted": "2024-10-11 07:25:39-05:00",
        "unique_id": "1927bab729a281cb",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]