[
    {
        "company": "Tek Inspirations LLC",
        "job_title": "Sr. Angular/Java/Node Developer",
        "location": "Baltimore, MD, USA",
        "full_location": {
            "city": "Baltimore",
            "state": "MD",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Bachelor's degree in computer science, Mathematics, Engineering, or a related field",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Angular 8 and above",
                "Node",
                "Java",
                "Spring Boot",
                "REST API"
            ],
            "primary": [
                "TypeScript",
                "PostgreSQL",
                "Oracle",
                "Microservices",
                "Agile development"
            ],
            "secondary": [
                "Hibernate",
                "JPA",
                "JDBC",
                "HTML",
                "JavaScript",
                "CSS",
                "YUI",
                "jQuery",
                "Jenkins",
                "Splunk",
                "Git",
                "Bitbucket",
                "Jira",
                "VersionOne",
                "Nexus",
                "Maven",
                "OpenShift",
                "XML",
                "XSLT",
                "VisualVM",
                "Eclipse Profiler",
                "Amazon Web Services",
                "BDD",
                "Cucumber",
                "Linux environments"
            ],
            "all": [
                "Angular 8 and above",
                "Node",
                "Java",
                "Spring Boot",
                "REST API",
                "TypeScript",
                "PostgreSQL",
                "Oracle",
                "Microservices",
                "Agile development",
                "Hibernate",
                "JPA",
                "JDBC",
                "HTML",
                "JavaScript",
                "CSS",
                "YUI",
                "jQuery",
                "Jenkins",
                "Splunk",
                "Git",
                "Bitbucket",
                "Jira",
                "VersionOne",
                "Nexus",
                "Maven",
                "OpenShift",
                "XML",
                "XSLT",
                "VisualVM",
                "Eclipse Profiler",
                "Amazon Web Services",
                "BDD",
                "Cucumber",
                "Linux environments"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Shubham Singh",
        "email": "shubham@tekinspirations.com",
        "jd": "Hello,I Hope you are great in good health and sprit 🙂 !!Note: Urgent Angular Developer hybrid opportunity Need Genuine Visa Holder Consultant who they are able to obtain Public Trust Clearance.Job Description -Role: Sr. Angular/Java/Node DeveloperLocation: Baltimore, MD (Need Only MD, DC, PA, VA, DE local candidates within 2 hours of commute) HybridVisa: USC & GC Only (Need Only Genuine visa candidate Who they are able to obtain public trust clearance)Do Not Submit Fake Visa CandidatesMOI: Phone/SkypeMust-have skills: Strong knowledge of modern Angular 8 and above, Node, Java, Spring boot, Spring, and REST API. Position description:• ?Develop highly innovative products/solutions in Java, achieved through collaboration and dialogue with other experts in the field. • Attend all customer technical discussions/design/development meetings and provide technical inputs to further enhance the code quality/process.• Full stack development using Spring boot, Java, REST API, and Angular 9 and above.• Provide guidance/support to other junior/mid-level developers. • Impact functional strategy by developing new solutions, processes, standards, or operational plans that position Leidos competitively in the marketplace.• All other duties as assigned or directed. Minimum qualifications:• Bachelor's degree in computer science, Mathematics, Engineering, or a related field• Master's or Doctorate degree may substitute for required experience.• 10+ years of experience of modern software development experience with a solid understanding of designing, building, deploying, and running applications.o Combined experience using: Angular 9 and above, TypeScript, Node, Java, Spring boot, Spring and REST API.• 10+ years of experience on an Agile development team Required skills/experience:• Extensive understanding and experience in programming and designing software with Angular/Java/Node. Strong experience in Angular 8 and above, REST API, Node, Java/J2EE, Spring Boot, and Spring. • Strong understanding of Hibernate, JPA and JDBC• Strong understanding of OOPS, Twelve Factor Application Design principles, architecture styles and APIs (Web API/Rest API)• Develop applications using Java/Spring Boot and design and develop database components using PostgreSQL DB or Oracle as needed for application.• Strong front-end development skills: Angular 8.0 and above, HTML/JavaScript, Cascading Style Sheets (CSS), YUI and/or jQuery• Strong development experience on Microservices and REST API.• Work on Agile projects and work with tools including VersionOne/JIRA Standout skills/experience:• Experience with modern development software, tools, and methodologies; Jenkins, Splunk, Git/Bitbucket, Jira/VersionOne, Nexus, Maven, Jenkins, OpenShift, XML/XSLT, VisualVM/Eclipse Profiler (Java performance monitoring tool), Amazon Web Services (S3), BDD (Cucumber or similar)• Experience working on Agile projects and understanding Agile terminology.• Work in DevOps Environment.• Experience with Linux environments.• Participate in daily scrum and provide updates.• Excellent communication and written skills",
        "source": "Email",
        "date_posted": "2024-10-11 08:36:37-05:00",
        "unique_id": "1927bec66c9e4992",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]