[
    {
        "company": "Tek Inspirations",
        "job_title": "Program Manager",
        "location": "Blue Ash, OH, USA",
        "full_location": {
            "city": "Blue Ash",
            "state": "OH",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Data mapping",
                "Organizational change management",
                "PMP certification"
            ],
            "primary": [
                "Heavy data organization",
                "Relationship building",
                "Project management",
                "Problem solving",
                "Communication skills"
            ],
            "secondary": [
                "Leadership",
                "Dynamic presentation",
                "Engagement management",
                "Technical insights",
                "Customer management"
            ],
            "all": [
                "Data mapping",
                "Organizational change management",
                "PMP certification",
                "Heavy data organization",
                "Relationship building",
                "Project management",
                "Problem solving",
                "Communication skills",
                "Leadership",
                "Dynamic presentation",
                "Engagement management",
                "Technical insights",
                "Customer management"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Roshan Singh Yadav",
        "email": "roshan.yadav@tekinspirations.com",
        "jd": "From: Roshan singh yadav, Tek Inspirations roshan.yadav@tekinspirations.com Reply to: roshan.yadav@tekinspirations.com Hi,Hope you are doing well.Have a look at role. Let me know your view. Job Description - Title: Program Manager Location: Blue Ash/Cincinnati, OH (hybrid schedule) Duration: 6 +months MOI: skype Recruiters Note:- need linkedin / Must PASS video prescreening within 24 hours. Mention exact interview availability in submittal email Hybrid from Cincinnati OH from Day 1. PMP certification. Job Description Delivery of new infrastructure, data mapping/algorithm code, new system consumer facing output, reporting solutions in PowerBI, flipping tech stacks in retail stores, operational impacts. Heavy dependencies on supply chain and manufacturing, and Finance. Project person will be supporting: Delivery of new infrastructure, data mapping/algorithm code, new system consumer facing output, reporting solutions in PowerBI, flipping tech stacks in retail stores, operational impacts. Heavy dependencies on supply chain and manufacturing, and Finance on clients. Is travel required: Some travel to new stores as needed Top 3 skills: Data mapping, heavy data organization and organizational change management Soft Skills Needed: Relationship building, someone who can take initiative, someone who is not afraid of asking questions and self-motivated Experience leading an acquisition, merger, or related program.PMP certification.experience in leadership position delivering large and/or complex projects and programs.Proven track record of delivering objectives on time and within budget.Ability to anticipate and manage project/program risksConfident, solution-oriented independent workerDynamic presenter and facilitator skills, experience in presenting to senior managementPossess strong engagement management skills, strong business acumen, deep technical insights and with that have the ability to speak in both business and technical termsExperience with managing external customers and understanding of deployment lifecycles is a plusExpertise in applying the systems development and project management life-cycle processes involved with implementing I.T. solutions.Proven problem solving and organizational skills.Demonstrated ability in team motivation and delegation.Excellent communication and presentation skills to effectively communicate information to customers and to all levels within the organization. Key Responsibilities Work with Product Managers, Designers and Engineers across multiple Merchandising Domains and teams to help deliver new data mapping technology to support the newly merged Company.Work with Product Managers, Designers and Engineers across multiple Merchandising Domains and teams to help deliver technology that supports rebannering newly aquired stores for the newly merged Company.Work with other Merchandising Pillar PgMs and IMO Leaders to ensure weekly and executive status is accurate and audience appropriate.Work cross-functionally to deliver technology with multiple dependencies on other Tech Pillars.Mentor and coach Project Managers within the program.Establish and update project and program plans with actual and forecasts and manage deviations from plan and program parameters.Ensure all program and project requirements and/or objectives are properly documented and vigorously pursued to deliver the final product.Deliver to time and cost within agreed tolerances for projects/programs.Provide leadership for project managers and stakeholders and apply conflict resolution skills to resolve program and project issues.Manage program and project risk, develop mitigation plans, and escalate decisions and unresolved issues as needed.Create and track schedules, budget, risks and issuesMaintain program level communications with stakeholders at multiple levelsWork with peers to develop and drive goals, define technical specifications and detailed implementation plans for projects/programsEffectively apply skills to impact program decisionsFocus on the benefits to be realized and the outcomes to be achieved.Provide coordination of complex planning activities and optimize the use of resources (human and material)Provide for an integration of outcomes with on-going business operationsManage issues as they arise among the program’s component projectsTrack project’s contributions to the program and toward the organizations’ overall benefits and work to ensure the ultimate success and acceptance of the programMaintain continuous alignment of program scope with strategic business objectives and make recommendations to modify the program to enhance effectiveness toward the business result or strategic intent Regards, Roshan Singh YadavTechnical RecruiterTEK Inspirations LLC | 13573 Tabasco Cat Trail, Frisco, TX 75035.Email: - roshan.yadav@tekinspirations.com",
        "source": "Email",
        "date_posted": "2024-10-11 11:10:33-05:00",
        "unique_id": "1927c795533be488",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]