[
    {
        "company": "TEK INSPIRATIONS",
        "job_title": "Project Manager",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Senior-level, 5+ years",
            "degree_required": "Bachelor's Degree in appropriate field of study or equivalent work experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Commonwealth Project Management (CPM) methodologies",
                "Project Management Institute (PMI) Project Management Professional (PMP) certification",
                "Risk management",
                "Microsoft Office",
                "Microsoft Project"
            ],
            "primary": [
                "Agile Certified Practitioner (ACP)",
                "Client-facing communication",
                "Internal communication",
                "Written communication",
                "Verbal communication",
                "Organizational skills",
                "Attention to detail",
                "Multitasking"
            ],
            "secondary": [
                "Familiarization with the Commonwealth’s Technology Portfolio (CTP) tool",
                "Planview Enterprise One"
            ],
            "all": [
                "Project Management",
                "Commonwealth Project Management (CPM) methodologies",
                "Project Management Institute (PMI) Project Management Professional (PMP) certification",
                "Agile Certified Practitioner (ACP)",
                "Risk management",
                "Bachelor's Degree in appropriate field of study or equivalent work experience",
                "Microsoft Office",
                "Microsoft Project",
                "Client-facing communication",
                "Internal communication",
                "Written communication",
                "Verbal communication",
                "Organizational skills",
                "Attention to detail",
                "Multitasking",
                "Familiarization with the Commonwealth’s Technology Portfolio (CTP) tool",
                "Planview Enterprise One"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Arudhi Singh",
        "email": "arudhi.singh@tekinspirations.com",
        "jd": "From: ARUDHI SINGH, TEK INSPIRATIONS arudhi.singh@tekinspirations.com Reply to: arudhi.singh@tekinspirations.com HiiHope you are doing great!!!Job Description -PV Notes: Looking for local candidates from Richmond, VA. Candidates with relevant experience in state roles strongly preferred. Please provide all the items requested below under \"items required at the time of submittal.Project Manager Hybrid- 2-3 days per week will be onsite. Location: Richmond, VA- Need local candidates with any address proof12+ MonthsJob Description:Our client is seeking a senior level Project Manager (PM) to lead the implementation of the Statewide Voter Registration System (SVRS). SVRS is a statewide voter registration and election management system. This is a high-risk project and will require strict adherence to the requirements in this posting.SVRS is a high-risk project with high visibility and significant complexity, therefore the SVRS Project Manager will be required to work in a fast-paced, potentially stressful environment. Relevant experience in similar environments should be clearly documented on the resume.Responsibilities:Daily interaction with stakeholders, project team members, and staff.Attendance at virtual and in-person project meetings daily.Management of project performance metrics and recording of data in CTP.Adhere to requirements of Commonwealth Project Management Standard.Coordination with SVRS contractor project management team for all aspects of project performance.Work in conjunction with members of the SVRS project team.Facilitate communication between SVRS contractor PM team and staff.Oversee coordination of SVRS project calendar.Conduct briefings on SVRS project status to internal and external audiences, including the Interagency Oversight Committee.Required Skills:Completion of a Category 1 or 2 Commonwealth project of $5M or more, or completion of a non-COV project with a value greater than $10M as PM of recordExperience with Commonwealth Project Management (CPM) methodologies in large-scale projects (greater than $10 million and medium to high complexity)Active Project Management Institute (PMI) Project Management Professional (PMP) or PMI Agile Certified Practitioner (ACP) certificationDocumented risk management experienceBachelor's Degree in appropriate field of study or equivalent work experience.Review of PM qualification consistent with the VITA PMQR and CIO overviewStrong working knowledge of Microsoft Office and Microsoft Project.Self-starter with the ability to work with minimal direct supervision.Excellent client-facing and internal communication skills.Excellent written and verbal communication skills.Solid organizational skills including attention to detail and multitasking skills.Desired Skill:Familiarization with the Commonwealth’s Technology Portfolio (CTP) tool, Planview Enterprise OneSkills MatrixSkillYears Used Last UsedCompletion of a Category 1 or 2 Commonwealth project of $5M or more, or completion of a non-COV project with a value greater than $10M as PM of record Experience with Commonwealth Project Management (CPM) methodologies in large-scale projects (greater than $10 million and medium to high complexity) Active Project Management Institute (PMI) Project Management Professional (PMP) or PMI Agile Certified Practitioner (ACP) certification Documented risk management experience Bachelor's Degree in appropriate field of study or equivalent work experience. Review of PM qualification consistent with the VITA PMQR and CIO overview Strong working knowledge of Microsoft Office and Microsoft Project. Self-starter with the ability to work with minimal direct supervision. Excellent client-facing and internal communication skills. Excellent written and verbal communication skills. Solid organizational skills including attention to detail and multitasking skills. Familiarization with the Commonwealth’s Technology Portfolio (CTP) tool, Planview Enterprise One .Regards,Arudhi Singh",
        "source": "Email",
        "date_posted": "2024-10-11 09:40:51-05:00",
        "unique_id": "1927c2734709c0d4",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]