[
    {
        "company": "Securekloud Technologies",
        "job_title": "Java Full Stack Developer",
        "location": "Phoenix, AZ, USA",
        "full_location": {
            "city": "Phoenix",
            "state": "AZ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "8-10 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long-term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Spring",
                "Spring Boot",
                "React",
                "microservices",
                "Oracle",
                "PL/SQL",
                "AWS"
            ],
            "primary": [
                "JMS",
                "ActiveMQ",
                "Tomcat",
                "Maven",
                "GitHub",
                "Jenkins",
                "Linux/Unix",
                "AWS EC2",
                "S3",
                "API Gateway",
                "Lambda",
                "Route53",
                "Secrets Manager",
                "CloudWatch"
            ],
            "secondary": [
                "Experience with rewriting legacy Java applications using Spring Boot & React",
                "Building serverless applications",
                "Ocean Shipping domain knowledge",
                "AWS CodePipeline"
            ],
            "all": [
                "Java",
                "Spring",
                "Spring Boot",
                "React",
                "microservices",
                "JMS",
                "ActiveMQ",
                "Tomcat",
                "Maven",
                "GitHub",
                "Jenkins",
                "Linux/Unix",
                "Oracle",
                "PL/SQL",
                "AWS",
                "AWS EC2",
                "S3",
                "API Gateway",
                "Lambda",
                "Route53",
                "Secrets Manager",
                "CloudWatch",
                "Experience with rewriting legacy Java applications using Spring Boot & React",
                "Building serverless applications",
                "Ocean Shipping domain knowledge",
                "AWS CodePipeline"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Shalman M",
        "email": "shalman.mohamed@securekloud.com",
        "jd": "From: Shalman M, Securekloud Technologies shalman.mohamed@securekloud.com Reply to: shalman.mohamed@securekloud.com Hi ,Greetings !!!This is Shalman from Securekloud !!!We do have opening for our client,Role : Java Full Stack Developer,Location : Phoenix, AZ (Onsite - Weekly 2 Days of Office)Duration : Long-term ContractNote : Interview will be held at In-person (F2F) at client location (Mandatory).Experience: 8 - 10 years Required Skills: Java, Spring, Spring Boot, React, microservices, JMS, ActiveMQ, Tomcat, Maven, GitHub, Jenkins, Linux/Unix, Oracle and PL/SQL, AWS EC2, S3, API Gateway, Lambda, Route53, Secrets Manager, CloudWatch Nice to have skills: Experience with rewriting legacy Java applications using Spring Boot & ReactBuilding serverless applicationsOcean Shipping domain knowledgeAWS CodePipeline Responsibilities: Develop and implement front-end and back-end solutions using Java, Spring, Spring Boot, React, microservices, Oracle and PL/SQL and AWS services.Experience working with business users in defining processes and translating those to technical specifications. Design and develop user-friendly interfaces and ensure seamless integration between front-end and back-end components. Write efficient code following best practices and coding standards. Perform thorough testing and debugging of applications to ensure high-quality deliverables. Optimize application performance and scalability through performance tuning and code optimization techniques.Integrate third-party APIs and services to enhance application functionality. Build serverless applicationsDeploy applications in AWS environmentPerform Code Reviews.Pick up production support engineer role when neededExcellent grasp of application security concerns and remediation techniques.Well-rounded technical background in current web and micro-service technologies.Responsible for being an expert resource for architects in the development of target architectures to ensure that they can be properly designed and implemented through best practices.Should be able to work in a fast-paced environment.Stay updated with the latest industry trends and emerging technologies to continuously improve skills and knowledge.",
        "source": "Email",
        "date_posted": "2024-10-11 11:53:33-05:00",
        "unique_id": "1927cd5c9b43f900",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]