[
    {
        "company": "TEK Inspirations LLC",
        "job_title": "Telecom Project Manager",
        "location": "Dallas, TX, USA",
        "full_location": {
            "city": "Dallas",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Bachelor's degree in a technology-related field preferred",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ Months(may be extend)",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SQL",
                "Python",
                "PowerBI",
                "Tableau"
            ],
            "primary": [
                "Data analytics",
                "Project management",
                "Data visualization",
                "Analytical abilities",
                "Communication skills"
            ],
            "secondary": [
                "Cellular network deployment experience",
                "AI/ML techniques",
                "Telecom industry standards",
                "PMP certification"
            ],
            "all": [
                "SQL",
                "Python",
                "PowerBI",
                "Tableau",
                "Data analytics",
                "Project management",
                "Data visualization",
                "Analytical abilities",
                "Communication skills",
                "Cellular network deployment experience",
                "AI/ML techniques",
                "Telecom industry standards",
                "PMP certification"
            ],
            "with_experience": [
                "SQL",
                "Python",
                "PowerBI",
                "Tableau"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Gagan Shrivastava",
        "email": "gagan.shrivastava@tekinspirations.com",
        "jd": "From: Gagan, TEK Inspirations LLC gagan.shrivastava@tekinspirations.com Reply to: gagan.shrivastava@tekinspirations.com Hello,Hope you are doing great!!Please have a look on given JD below. And, please let me know if you have any candidate for this role. Thanks. Job Title: Telecom Project ManagerLocation: Hybrid/Downtown Dallas, TXDuration: 6+ Months(may be extend) Note: Local canddiates of TX Job Description:We are seeking a project manager with extensive data analytics experience to support telecom network deployment projects. The ideal candidate will possess strong analytical abilities, project management experience, and expertise in data visualization and tracking. This position is a hybrid role, requiring three days onsite and two days remote work. It is slated as a six-month contract with a likely extension.In this role, you will be at the forefront of our network deployment efforts, ensuring the successful implementation of complex telecom projects. You will leverage your data analytics skills to provide strategic insights, optimize processes, and drive project success. Your work will directly impact on the efficiency and effectiveness of our network deployments, contributing to the expansion and improvement of telecommunications infrastructure. Duties and Responsibilities:- Manage complex projects involving multiple stakeholders and dependencies, ensuring coordination and timely delivery- Develop dashboards and visual reports using tools like PowerBI, Tableau, or similar for tracking project status and key performance indicators (KPIs)- Gather, process, and analyze advanced data sets to provide strategic insights, employing AI/ML methods where possible to identify trends, risks, and forecast project timelines- Track project milestones, manage dependencies, and provide data-driven updates and recommendations to stakeholders- Coordinate and monitor work from multiple subcontractors and vendors to align project goals and timelines- Oversee material management and logistics, optimizing inventory and resource allocation- Schedule and lead status meetings with stakeholders to provide updates and ensure alignment- Streamline workflow by optimizing processes and establishing new procedures to minimize project inefficiencies- Establish run-rate schedules to meet internal and external project deadlines- Ensure resources are aligned with project goals, identifying and addressing critical resource gaps with management- Collaborate with management, RF engineering, and site acquisition teams to ensure project alignment with technical requirements and site development timelines- Engage stakeholders to implement corrective actions to mitigate project delays and risks Must have Skills:- Expertise in SQL, Python, and other associated tools used to analyze, manipulate, and process large data sets- Strong demonstrated skills in generating reports with PowerBI or Tableau- Ability to manage complex projects with multiple dependencies and coordinate work across subcontractors, vendors, and construction crews- Excellent verbal and written communication skills- Strategic thinker with strong problem-solving abilities Nice-to-Haves:- Cellular network deployment experience- Experience with AI/ML techniques for project forecasting and optimization- Familiarity with telecom industry standards and regulations- PMP certification or equivalent project management qualification Education:- Bachelor's degree in a technology-related field preferred Thanks & Regards,Gagan Shrivastava Technical RecruiterTEK Inspirations LLC | 13573 Tabasco Cat Trail, Frisco, TX 75035Ph: +1 (469) 498-0305Linkedin: linkedin.com/in/gagan-shrivastava-a7b15b22a",
        "source": "Email",
        "date_posted": "2024-10-11 11:58:17-05:00",
        "unique_id": "1927ccf93cd5a9ce",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]