[
    {
        "company": "TEK Inspirations LLC",
        "job_title": "Senior Project Manager",
        "location": "Denver, CO, USA",
        "full_location": {
            "city": "Denver",
            "state": "CO",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "6+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6-12 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Technology Project Management",
                "Agile Methodologies",
                "Database Migration",
                "Stakeholder Management",
                "Communication"
            ],
            "primary": [
                "Cross-functional Collaboration",
                "Risk Management",
                "User Acceptance Testing",
                "Product Launch Approval",
                "Performance Metrics"
            ],
            "secondary": [
                "Technical Expertise",
                "SCRUM",
                "Project Plans",
                "Roadmaps",
                "KPI Monitoring"
            ],
            "all": [
                "Technology Project Management",
                "Agile Methodologies",
                "Database Migration",
                "Stakeholder Management",
                "Communication",
                "Cross-functional Collaboration",
                "Risk Management",
                "User Acceptance Testing",
                "Product Launch Approval",
                "Performance Metrics",
                "Technical Expertise",
                "SCRUM",
                "Project Plans",
                "Roadmaps",
                "KPI Monitoring"
            ],
            "with_experience": [
                "Technology Project Management",
                "Agile Methodologies",
                "Database Migration"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Sourabh Singh",
        "email": "sourabh.singh@tekinspirations.com",
        "jd": "Hi Hope you are Doing Well!!! Position: Senior Project Manager Location: Denver, CO (Hybrid) Duration: 6-12 months Job Description: Qualifications: 6+ Years of proven experience as a Technology Project Manager or similar leadership roles in managing complex projects across multiple teams or business units. Strong understanding of agile methodologies and experience implementing them in large-scale projects. Managed a minimum of 3 database migration projects with at least one of them focused on Databricks. Demonstrated ability to balance technical expertise with strong business acumen. Demonstrated success in driving cross-functional collaboration and stakeholder management. Excellent communication, presentation, and interpersonal skills to engage and influence Key Responsibilities Own and drive end-to-end delivery of medium to large-scale initiatives, build roadmaps, project plans with dependencies, track progress, identify and resolve dependencies, proactively identify risks and mitigate, escalate in a timely manner eliminating issues by managing systemic impediments. Work with multiple Engineering leads and teams, Product, Business to define E2E delivery milestones and drive value delivery for our customers. Partner with the Product team ensuring a large backlog is built. Ensure Program/Project status is up to date in the system of record, communicate the status at regular intervals to all stakeholders including executive updates. Monitor progress ensuring results are reviewed and facilitate the User Acceptance Testing process, developing rollout plans, and communicating them to all stakeholders ensuring alignment. Partner with the Operations team for successful roll out of the product to global agents. Coordinate major feature releases and ongoing delivery of value to customers where multiple teams are involved in development. Responsible for Product Launch approval, ensures each product release has mandatory approval from including Engineering, Product, Marketing, and business stakeholders. Ensure appropriate systems development and project management processes are being utilized. Provide expert advice and coaching to leads and teams to ensure best process execution. Communicate roll up of project issues and status in a concise, accurate, and professional manner for senior leadership consumption, escalating blocking issues risking milestone delivery. Build work breakdown structures with dependencies aligning to the project goals. Program Metrics and Reporting: Establish performance metrics and KPIs to monitor project health and progress. Provide regular program status updates and executive-level reports communicating the status with outcomes and accomplishments. Technical Expertise: Possess a strong understanding of the technical aspects of projects they manage. Collaborate with technical teams to make informed decisions and assess feasibility. Hold daily SCRUM calls as needed to ensure healthy sprint deliverables Partner with Engineering team to build detailed WBS/Schedule and hold team accountable to deliverables.",
        "source": "Email",
        "date_posted": "2024-10-11 09:10:00-05:00",
        "unique_id": "1927c0af8870f8da",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]