[
    {
        "company": "Smart IT Frame",
        "job_title": "Automation/Migration Lead",
        "location": "Charlotte, NC, USA",
        "full_location": {
            "city": "Charlotte",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "16-20 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "AWS MigrationHub",
                "AWS Server Migration Service",
                "AWS DataSync",
                "AWS DMS",
                "AWS Storage Gateway",
                "AWS Migration Evaluator"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "AWS MigrationHub",
                "AWS Server Migration Service",
                "AWS DataSync",
                "AWS DMS",
                "AWS Storage Gateway",
                "AWS Migration Evaluator"
            ],
            "with_experience": [
                "AWS MigrationHub",
                "AWS Server Migration Service",
                "AWS DataSync",
                "AWS DMS",
                "AWS Storage Gateway",
                "AWS Migration Evaluator"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Syed Ashik",
        "email": "ashik@smartitframe.com",
        "jd": "From: Syed Ashik, Smart IT Frame ashik@smartitframe.com Reply to: ashik@smartitframe.com Hi,Greetings from Smart IT Frame, Hope you are doing well!Smart IT Frame specializes in enabling you with your most critical line of resources. Whether it is for permanent staffing, contract staffing, contract-to-hire or executive search, we understand the importance of delivering the most suitable talent; on time and within budget. With our Core focus in emerging technologies, we have provided global technology workforce solutions in North America, Canada &amp; India. We take pride in delivering specialized talent, superior performance, and seamless execution to meet the challenging business needs of customers worldwide. Job title: Automation/Migration LeadLocation: Charlotte, NCDuration : ContractTop Qualifications:· AWS MigrationHub· AWS Server Migration Service· AWS DataSyncAWS DMS· AWS Storage Gateway· AWS Migration EvaluatorJob summary:We are seeking an experienced Architect with 16 to 20 years of experience to join our team. The ideal candidate will have extensive expertise in AWS Storage Gateway, AWS DMS, AWS DataSync, AWS Server Migration Service, AWS MigrationHub, and AWS Migration Evaluator. This role is hybrid with day shifts and does not require travel. The Architect will play a crucial role in designing and implementing cloud migration strategies that align with our company's objectives and enhance our technological capabilities. Responsibilities:· Lead the design and implementation of cloud migration strategies using AWS services.· Oversee the deployment and management of AWS Storage Gateway to ensure seamless data transfer.· Provide expertise in AWS DMS to facilitate efficient database migrations. - Utilize AWS DataSync to automate and accelerate data transfers between on-premises storage and AWS.· Implement AWS Server Migration Service to streamline the migration of on-premises servers to AWS.· Manage AWS MigrationHub to track and monitor the progress of migration projects.· Conduct assessments using AWS Migration Evaluator to provide cost-effective migration solutions.· Collaborate with cross-functional teams to ensure alignment with business objectives and technical requirements.· Develop and maintain comprehensive documentation for all migration processes and configurations.· Ensure compliance with security policies and best practices during the migration process.· Provide technical guidance and support to team members and stakeholders throughout the migration lifecycle.· Continuously evaluate and optimize migration strategies to improve efficiency and reduce costs.· Stay updated with the latest AWS technologies and industry trends to drive innovation and improvement.·Qualifications:- Possess extensive experience in AWS Storage Gateway, AWS DMS, AWS DataSync, AWS Server Migration Service, AWS MigrationHub, and AWS Migration Evaluator.- Demonstrate strong problem-solving skills and the ability to troubleshoot complex issues.- Exhibit excellent communication and collaboration skills to work effectively with cross-functional teams..- Show proficiency in creating detailed technical documentation and reports.- Have a deep understanding of cloud security best practices and compliance requirements.- Display a proactive approach to learning and adopting new technologies.- Hold relevant AWS certifications such as AWS Certified Solutions Architect or AWS Certified Advanced Networking Specialty.",
        "source": "Email",
        "date_posted": "2024-10-11 10:43:21-05:00",
        "unique_id": "1927c7fc6a4fb1f2",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]