[
    {
        "company": "Vyze",
        "job_title": "PeopleSoft Business Analyst",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "PeopleSoft",
                "SQL",
                "SQR",
                "People Code",
                "Analytical Skills"
            ],
            "primary": [
                "System Development Life Cycle",
                "Troubleshooting",
                "Documentation",
                "System Testing",
                "Regression Testing"
            ],
            "secondary": [
                "Communication Skills",
                "Collaboration",
                "Flexibility",
                "Training Material Development"
            ],
            "all": [
                "PeopleSoft",
                "SQL",
                "SQR",
                "People Code",
                "Analytical Skills",
                "System Development Life Cycle",
                "Troubleshooting",
                "Documentation",
                "System Testing",
                "Regression Testing",
                "Communication Skills",
                "Collaboration",
                "Flexibility",
                "Training Material Development"
            ]
        },
        "job_type": [],
        "contact_person": "Aryan Sinha",
        "email": "aryan@vyzeinc.com",
        "jd": "From: Aryan Sinha, Vyze aryan@vyzeinc.com Reply to: aryan@vyzeinc.com Job Description: As a valued member of the Cardinal Post Production Support (PPS) team, the PeopleSoft Business Analyst plays a pivotal role in ensuring the smooth operation and support of the application from the functional perspective (Tier 2). This entails taking the lead by using strong analytical skills on help desk tickets, troubleshooting software issues, documenting issues for the development team, and assisting end users with “how-to” type questions. The ideal candidate is well-versed in the standard system development life cycle, including design, development, and testing of system objects such as reports and interfaces to meet specific business requirements of the Commonwealth of Virginia. While familiarity with PeopleSoft Benefits module is required, training on Commonwealth-specific system functionality will be provided as part of the onboarding process. Collaboration is key, as the Business Analyst works closely with a developer (Tier 3) counterpart responsible for making system changes and unit testing the application based on the design material produced by the Business Analyst. Upon successful completion of unit testing, the Business Analyst conducts system/regression testing before submitting changes for migration. Additionally, responsibilities include drafting or providing input to communications, updating job aids, and potentially overseeing changes to training materials. Reporting to a team lead, the Business Analyst ensures detailed, accurate, and timely status of tasks, issues, and help desk tickets. This team member must be able to adapt to changing project needs, demonstrating flexibility. Beyond functional expertise, technical proficiency in PeopleSoft, including the ability to read SQL, SQR, and/or People Code, write and execute simple SQL. The role also involves developing system test scenarios and writing/executing test scripts. Excellent verbal and written communication skills are crucial, as the Business Analyst serves as the primary point of contact for the Commonwealth’s end users of this module.",
        "source": "Email",
        "date_posted": "2024-10-26 00:23:28-05:00",
        "unique_id": "192c767b7fdfbf7a",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]