[
    {
        "company": "Nukasanigroup Inc.",
        "job_title": "Center of Excellence Programmer Manager",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "20 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Best competitive rate"
        },
        "skills": {
            "core": [
                "Project Management",
                "Agile",
                "SAFe",
                "Waterfall",
                "Microsoft Project"
            ],
            "primary": [
                "Leadership",
                "Team Management",
                "Process Improvement",
                "Risk Management",
                "Communication"
            ],
            "secondary": [
                "PMP Certification",
                "VITA Project Manager Certification",
                "Microsoft Teams",
                "Power BI",
                "SharePoint"
            ],
            "all": [
                "Project Management",
                "Agile",
                "SAFe",
                "Waterfall",
                "Microsoft Project",
                "Leadership",
                "Team Management",
                "Process Improvement",
                "Risk Management",
                "Communication",
                "PMP Certification",
                "VITA Project Manager Certification",
                "Microsoft Teams",
                "Power BI",
                "SharePoint"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Bhavani",
        "email": "bhavaniatnukasanigroupusa.com",
        "jd": "From: Bhavani, nukasanigroup recruitment@nukasanigroup.com Reply to: recruitment@nukasanigroup.com Dear Partner,Good Morning ,GreetingsfromNukasanigroupInc!,Wehavebelowurgentlongtermcontractprojectimmediatelyavailable for**Center of Excellence Programmer Manager, Richmond, VA, Hybrid** need submissions you please review the below role, if you are available, could you please send me updated word resume, and below candidate submission format details, immediately. If you are not available, any referrals would be greatly appreciated.Interviews are in progress, urgent response is appreciated. Looking forward for your immediate response and working with you. **Candidate Submission Format - needed from you**Full Legal NamePersonal Cell No ( Not google phone number)Email IdSkype IdInterview AvailabilityAvailability to start, if selectedCurrent LocationOpen to RelocateWork AuthorizationTotal Relevant ExperienceEducation./ Year of graduationUniversity Name, LocationLast 4 digits of SSNCountry of BirthContractor Type DOB: mm/dd Home Zip CodeAssigned Job DetailsJob Title : Center of Excellence Programmer ManagerLocation: Richmond, VA, HybridRate : Best competitive rate20+ years experienced candidates needed**Local Richmond, VA candidates required due to onsite requirement**This position requires onsite 3 days a week with 2 remote**Contractor will be responsible for purchasing parking through VDOT’s Parking Management Office or procuring their own parkingCoE Program Manager VDOT is seeking a senior, experienced Center of Excellence Program Manager to join the Project & Product Delivery Center of Excellence Team. This position is located in Richmond, Virginia. This position will lead strategic direction for assigned program area. Candidate will lead and manage the CoE team. Candidate will provide guidance to project teams using Waterfall, Agile, SAFe, and Kanban methodologies. This includes working with other Program Managers, Project Managers, Scrum Masters, and Release Train Engineers (RTEs) to ensure they comply with VDOT and VITA procedures. This position’s specific responsibilities and duties will include, but are not limited to: Oversee initiatives for the assigned program. Oversee work in assigned program to ensure consistent process and quality standards. Assign resources to complete deliverables. Assign resources to support processes. Recommend changes to systems/processes as appropriate. Compliance with VDOT and VITA policies, standards, and guidelines. Work with peers and subordinates to define strategic direction for assigned program. Identify gaps, trends, patterns and implement process improvements as needed Be an expert in VDOT and VITA project management procedures and requirements. Be an expert in the use of the division core project management tool, Microsoft Project On-Line (POL). Assist in developing training objectives and needs on VDOT and VITA project management procedures and best practices. Develop project management processes, tools, templates, and training, drawing on common project management methodology, the PMBOK and established VDOT and VITA methodologies. Establish and maintain Agile Project Management, Scaled, Kanban and Waterfall Project Management frameworks and their supporting practices Create new and enhanced procedures to capture best practices and mature the project management process. Manage the knowledgebase of project management reference materials to ensure accuracy, relevancy and currency. Monitor projects for compliance with established policies and procedures. Monitor projects to detect risks and issues and escalate as needed to ensure appropriate mitigation is applied to keep the project on-track. Guide project managers in identifying and managing risks. Guide project managers in managing organizational change. Guide project managers in defining critical path and managing schedule. Guide project managers in managing budget. Minimum Qualifications 10 years' experience leading and managing direct reports. Set direction and strategy for the assigned team Ability to interact effectively with customers and project team members. Knowledge of project management tools, methods and practices. Ability to communicate effectively orally and in writing. Ability to program and create custom reports using IT application standard tools. PMP certification VITA Project Manager Certification (can be obtained within 120 days of hire) is a plus but not required. Advanced skills using Microsoft Project Professional. 15 years of combined experience with scrum, Agile, SAFe, Product Line and Waterfall methodologies. 15 years experience managing complex projects with multiple workstreams and high organizational change. Must be able to quickly and easily adapt to changing priorities, embracing changes to deliver leadership and guidance. Experience creating and managing knowledge bases, job aids and training programs. Strong functional understanding of MS Project, Project Server, SharePoint, Microsoft Teams, Microsoft Planner and Power BI Ability to assess project risks and issues, and determine mitigation required to contain or resolve them. Demonstrated understanding of project portfolio and lifecycle management processes Demonstrated understanding of governance processes, procedures and policies for project management. Demonstrated understanding of organizational change. Demonstrated understanding of how to manage the project critical path. Demonstrated strong facilitation and collaboration skills. Demonstrated skills in developing new processes that incorporate best practices and address stakeholder needs. Demonstrated ability to create clear and concise written procedural documentation. Demonstrated understanding of procurement and vendor management Ability to articulate thoughts and ideas in support of initiatives that are being newly developed. Ideal candidates would be self-starters who can articulate thoughts and ideas in support of initiatives that are being newly developed.",
        "source": "Email",
        "date_posted": "2024-10-18 07:17:03-05:00",
        "unique_id": "1929fafc9de72136",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]