[
    {
        "company": "Nukasani Group",
        "job_title": "Product Analyst Mid Level",
        "location": "Marlborough, MA, USA",
        "full_location": {
            "city": "Marlborough",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5-10 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Contract, potential to extend",
            "rate": "Best competitive rate",
            "contact_person": "Nancy",
            "email": "recruiter5@nukasanigroup.com"
        },
        "skills": {
            "core": [
                "Jira",
                "Confluence",
                "Strong interpersonal skills",
                "Verbal communication skills",
                "Written communication skills"
            ],
            "primary": [
                "Analytical skills",
                "Presentation skills",
                "Ability to drive conversations with cross-functional teams"
            ],
            "secondary": [
                "1-3 years experience SAFe framework",
                "Agile delivery method knowledge",
                "Experience in the Loss Prevention field",
                "Knowledge and experience with Loss Prevention applications",
                "Familiarity with the retail industry",
                "Experience working with vendors and 3rd party solutions",
                "Experience working in a retail environment"
            ],
            "all": [
                "Jira",
                "Confluence",
                "Strong interpersonal skills",
                "Verbal communication skills",
                "Written communication skills",
                "Analytical skills",
                "Presentation skills",
                "Ability to drive conversations with cross-functional teams",
                "1-3 years experience SAFe framework",
                "Agile delivery method knowledge",
                "Experience in the Loss Prevention field",
                "Knowledge and experience with Loss Prevention applications",
                "Familiarity with the retail industry",
                "Experience working with vendors and 3rd party solutions",
                "Experience working in a retail environment"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "jd": "Dear Partner, Good Morning, Greetings from Nukasani Group Inc! We have below urgent long-term contract project immediately available for Product Analyst Mid Level, Marlborough, MA. Need submissions you please review the below role, if you are available, could you please send me updated word resume, and below candidate submission format details, immediately. If you are not available, any referrals would be greatly appreciated. Interviews are in progress, urgent response is appreciated. Looking forward for your immediate response and working with you. Candidate Submission Format - needed from you: Full Legal Name, Personal Cell No (Not google phone number), Email Id, Skype Id, Interview Availability, Availability to start, if selected, Current Location, Open to Relocate, Work Authorization, Total Relevant Experience, Education./ Year of graduation, University Name, Location, Last 4 digits of SSN, Country of Birth, Contractor Type, DOB: mm/dd, Home Zip Code. Assigned Job Details: Job Title: Product Analyst Mid Level, Location: Marlborough, MA, Rate: Best competitive rate? Potential to extend? Local talent only (about 1.5 hour away); will need to go in office for ad hoc workshops? Contract and contract to perm talent (funding only for 2 years but would consider the contractor if an FTE opened)? Shortlisting top 15 resumes for HM to review. What you’ll discover? Inclusive culture and career growth opportunities? Global IT Organization which collaborates across U.S., Canada, Europe, and Australia? Challenging, collaborative, and team-based environment. What you’ll do: The Loss Prevention (LP) Global Solution Delivery Team is responsible for managing solutions and technology that delivers capabilities to keep our associates and customers safe, preserve company assets, and provide business value. What you’ll need: Our team is looking for people with a passion for delivering solutions, intellectual curiosity, and willingness to try new things. We are a collaborative culture and looking for somebody who enjoys meeting with and learning about how technology solves problems for our retail business. Key Responsibilities: Work to determine detailed requirements from key stakeholders for the team, Contribute to the Loss Prevention team’s backlog refinement, including user story point estimation and testing considerations, Articulate context around requirements and solutions, and work to build consensus within a stakeholder group, Work with and support the product team to achieve iteration goals and objectives, Ensure the functional integrity of the product/solution. Minimum Qualifications (Requirements): 5-10 years’ experience as a Product Analyst or Business Analyst, Jira and Confluence (required), Strong interpersonal, verbal, and written communication skills, Presentation skills, Analytical skills, Ability to drive conversations with cross-functional teams. Preferred Qualifications: 1-3 years’ experience SAFe framework/Agile delivery method knowledge, Experience in the Loss Prevention field, Knowledge and experience with Loss Prevention applications, Genetec, Appriss or other Loss prevention software platforms, Familiarity with the retail industry & best practices, Experience working with vendors and 3rd party solutions, Experience working in a retail environment is desirable.",
        "source": "Email",
        "date_posted": "2024-10-18 06:10:09-05:00",
        "unique_id": "1929f728d57961c6",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]