[
    {
        "company": "Executive Software Guild Inc",
        "job_title": "Scrum Master (Agile Coach)",
        "location": "Chicago, IL, USA",
        "full_location": {
            "city": "Chicago",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "onsite",
                "third party"
            ],
            "experience_required": "5+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Agile training",
                "Agile coaching",
                "Scrum",
                "Kanban",
                "Lean"
            ],
            "primary": [
                "Agile development methodologies",
                "PMI Agile Certified Practitioner (PMI-ACP)",
                "SAFe Program Consultant (SPC)",
                "Certified Scrum Professional (CSP)",
                "Waterfall project management"
            ],
            "secondary": [
                "DevOps practices",
                "Agile Thought Leadership",
                "Strong written and verbal communications skills",
                "Innovative thinking"
            ],
            "all": [
                "Agile training",
                "Agile coaching",
                "Scrum",
                "Kanban",
                "Lean",
                "Agile development methodologies",
                "PMI Agile Certified Practitioner (PMI-ACP)",
                "SAFe Program Consultant (SPC)",
                "Certified Scrum Professional (CSP)",
                "Waterfall project management",
                "DevOps practices",
                "Agile Thought Leadership",
                "Strong written and verbal communications skills",
                "Innovative thinking"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Vamshikrishna Reddy",
        "email": "vamshikrishna@esginc.us",
        "jd": "From: Vamshikrishna Reddy, Executive Software Guild Inc vamshikrishna@esginc.us Reply to: vamshikrishna@esginc.us Hi Position: Scrum Master (Agile Coach)Location - Chicago (IL)Experience:12+YVisa: GC,USC,GC EAD,H4EADThis is an onsite position in Chicago – Preferred, will need to be onsite working with me and other leaders and occasional travel to Houston. Looking for local candidates(IL)Seeking an Agile Trainer/Coach.* In addition to the following responsibilities you will be responsible for working with teams and leadership on Agile adoption, facilitating workshops, removing impediments and obstacles programs and teams are experiencing, monitoring training and reporting on productivity improvement, creating standards and processes and training.* The Agile Trainer/Coach will be engaged throughout the enterprise transformation to facilitate a smooth transformation into Agile processes.Any project details – Engage on Agile transformation across all my teams to transition to Agile Delivery, Metrics, Agile Portfolio ManagementResponsibilities:* Coaching: Working with teams to institute, practice, and adopt Scrum and Agile techniques. Identify and introduce opportunities for the team to improve through coaching and questioning.* Mentoring: Serve as a mentor to Scrum Masters, Product Managers and other Agile leaders with an aim to make Agile techniques successful, resilient and permanent.* Training: Collaborate to develop Agile training materials, newsletters, and support communities as they relate to Agile practices. Provide Agile and role-specific training (group and one-on-one) for management, team members, Product Owners, and Scrum Masters.* Observing / Assessments: Observe program and team activities (e.g., sprint, release and roadmap planning) and provide constructive feedback to teams and leads. Critical impediments and non-adherence to the Agile core principles should be brought to leadership attention immediately.* Process Adherence: Work with the teams to ensure adherence to the defined Scrum processes and framework (status reporting, compliance, estimation).* Tool Adherence: Work with the teams to ensure the appropriate tools are being leveraged and enterprise practices are being followed to enable consistency and metrics where needed.* Culture: Work with management and teams to strengthen our Agile culture.Skills/Requirements:* Experience in delivering Agile training and coaching in a transforming organization* 5+ years experience working in an Agile environment and experience with Agile development methodologies (i.e. Scrum, XP, Kanban, Lean, etc.) • One or more Expert-level Agile certification(s) - PMI Agile Certified Practitioner (PMI-ACP), SAFe Program Consultant (SPC), Certified Scrum Professional (CSP), or other Agile related certifications a plus* Knowledge and experience in Waterfall project management* Experience implementing and continually improving Agile principles and practices, and coaching the customer on the recommended approach* Strong written and verbal communications skills, including the ability to communicate solutions effectively to technical and non-technical audiences.* Technical background with a deep understanding of modern DevOps practices preferred • Innovative thinking – ability to learn new tools and techniques and apply them to the program* Experienced in Agile Thought LeadershipTop 5 Skill sets1. Has been in some leadership role on Agile Transformation2. Has developed Agile Portfolio Management, Center of Excellence and Understands Agile Delivery (Scum, Kanban)3. Coach Role – Has great personality, can influence, Communicate and collaborate with different leaders and business stakeholders. Can influence business leaders on Agile way of working4. Has been part of Agile Transformation, Where they have seen the transformation from a Waterfall to a Agile Delivery5. This person is a doer, brings to the table external perspective on challenges and pitfalls and is able to hit the ground running quickly. They have the leadership ability to work with different teams and enable the teams to align on the Agile transformation and Agile way of working.6. Great communication skills – verbal and Written( Narratives, Executive Decks). Is knowledgeable on organizational design and the role of culture to create high performing teams.",
        "source": "Email",
        "date_posted": "2024-10-18 12:42:48-05:00",
        "unique_id": "192a0da057b2fa32",
        "emp_type": [
            "onsite",
            "third party"
        ],
        "tag": "Scrum Master"
    }
]