[
    {
        "company": "UST",
        "job_title": "Java Application Architect",
        "location": "Bellevue, WA, USA",
        "full_location": {
            "city": "Bellevue",
            "state": "WA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "8+ years",
            "degree_required": "Bachelor’s or Master’s degree in Computer Science, Information Technology, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java (Spring Boot)",
                "Node.js",
                "React (Frontend)",
                "RESTful API Design",
                "GraphQL",
                "AWS",
                "Azure",
                "GCP"
            ],
            "primary": [
                "IAM (Identity Access Management)",
                "OAuth2 Authentication & Authorization",
                "Kubernetes APIs",
                "Containerized Application Deployment",
                "Application Architecture",
                "Mentoring & Leadership",
                "Performance Optimization",
                "Technical Documentation"
            ],
            "secondary": [
                "strong Managerial skills",
                "Hyperscaler Frameworks",
                "DevOps practices",
                "CI/CD"
            ],
            "all": [
                "Java (Spring Boot)",
                "Node.js",
                "React (Frontend)",
                "RESTful API Design",
                "GraphQL",
                "AWS",
                "Azure",
                "GCP",
                "IAM (Identity Access Management)",
                "OAuth2 Authentication & Authorization",
                "Kubernetes APIs",
                "Containerized Application Deployment",
                "Application Architecture",
                "Mentoring & Leadership",
                "Performance Optimization",
                "Technical Documentation",
                "strong Managerial skills",
                "Hyperscaler Frameworks",
                "DevOps practices",
                "CI/CD"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Dharani K",
        "email": "dharani.k@vdartinc.com",
        "jd": "Hello, Hope you are doing well,Please find the job description below; if you are interested, kindly let me know. Title: Java Application ArchitectDuration: ContractLocation: Bellevue, WA(Onsite)Client: USTLocals Required Job Description :Mandatory Skills:Skill 1 – Java (Spring Boot), Node.js,React (Frontend),RESTful API DesignSkill 2 – GraphQL, AWS/Azure/GCPSkill 3 – GraphQL ,UAuth ,Authentication, AuthorizationSkill 4 – Must be local to Bellevue, WA • Nice to have Skills: strong Managerial skills, must be ArchJava (Spring Boot)Node.jsReact (Frontend)RESTful API DesignGraphQLAWS/Azure/GCPIAM (Identity Access Management)OAuth2 Authentication & AuthorizationHyperscaler FrameworksKubernetes APIsContainerized Application DeploymentApplication ArchitectureMentoring & LeadershipPerformance OptimizationTechnical Documentation Job Overview: We are seeking a highly skilled and experienced Application Architect to join our team. The ideal candidate will have a deep understanding of application development using Java, NodeJS, API design, React, and will bring advanced knowledge of modern technologies such as GraphQL, AWS services, and Kubernetes APIs. This role requires a strategic thinker who can drive architectural decisions and provide technical leadership across multiple projects. Key Responsibilities: • Develop and maintain robust application architectures, ensuring scalability, performance, and security. • Lead and mentor development teams in the design, development, and deployment of high-quality applications. • Design and implement RESTful APIs, ensuring seamless integration with various services and applications. • Architect and develop web applications using Spring Boot, Node.JS, and React frameworks. • Establish and enforce coding standards and best practices to maintain high code quality. • Work closely with product managers, designers, and other stakeholders to translate business requirements into technical solutions. • Identify and address performance bottlenecks and optimize applications for speed and efficiency. • Create and maintain technical documentation, including architectural diagrams, design specifications, and operational procedures. • Leverage knowledge of GraphQL to enhance API capabilities and improve client-server interactions. • Utilize AWS/Azure/GCP services, with a strong focus on IAM, to ensure secure and efficient cloud-based solutions. • Apply Hyperscaler Frameworks for scalable and resilient cloud architecture. • Implement OAuth2 authentication and authorization concepts to secure applications and manage user access. • Interact with Kubernetes APIs to facilitate deployment, scaling, and management of containerized applications. • Research emerging technologies and trends to build Proofs of Concept (POCs) that demonstrate the viability and benefits of new approaches. Qualifications: • Bachelor’s or Master’s degree in Computer Science, Information Technology, or a related field. • 8+ years of experience in application development and architecture. • Strong programming skills in designing, development, and implementation of multi-tier, distributed, and highly scalable applications using Java, J2EE, Spring Boot, Node.JS, JavaScript, JSON. • Strong expertise in designing and implementing RESTful APIs. • Understanding on React for frontend development. • Proficiency in GraphQL for advanced API design and development. • In-depth knowledge on of the cloud services (AWS, Azure, or GCP)., especially IAM, and experience with cloud platforms. • Experience with OAuth2 authentication and authorization. • Experience in interacting with Kubernetes APIs for container management and orchestration. • Familiarity with Hyperscaler Frameworks and their application in cloud architecture is an added advantage. • Solid understanding of database design and management. • Knowledge of DevOps practices and CI/CD pipelines is beneficial. • Excellent problem-solving skills and the ability to think critically. • Strong communication and interpersonal skills. • Ability to work independently and as part of a team.",
        "source": "Email",
        "date_posted": "2024-10-18 08:23:47-05:00",
        "unique_id": "1929fece23b29d89",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]