[
    {
        "company": "VizonInc",
        "job_title": "Business System Analyst",
        "location": "Minnesota, USA",
        "full_location": {
            "city": "Minnesota",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "3+ years",
            "degree_required": "Bachelor’s Degree from a four-year college or university is required, practical experience in lieu of education is acceptable.",
            "visa_sponsorship": "Green Card or Citizen Only",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "business systems analysis",
                "communication",
                "interpersonal skills",
                "analytical skills",
                "ERP application systems",
                "CRM application systems"
            ],
            "primary": [
                "Scrum",
                "Agile methodologies",
                "basic SQL",
                "project management"
            ],
            "secondary": [
                "software integration initiatives",
                "MS operating systems",
                "dynamic environment"
            ],
            "all": [
                "business systems analysis",
                "communication",
                "interpersonal skills",
                "analytical skills",
                "ERP application systems",
                "CRM application systems",
                "Scrum",
                "Agile methodologies",
                "basic SQL",
                "project management",
                "software integration initiatives",
                "MS operating systems",
                "dynamic environment"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Kuldeep Sharma",
        "email": "kuldeep@vizoninc.com",
        "jd": "From: Kuldeep Sharma, VizonInc kuldeep@vizoninc.com Reply to: kuldeep@vizoninc.com Job Description -The difference with this role is it is Intergration Focused instead of ERP. Please note I need small client work history as withthis role the candidate needs to be able to Multi Task, so even though they are a BSA they may have to do Product Owner , Intergration and etc . (Just not there title Role) This person may needs to be in Mn located not to far from Brooklyn Center as this will be hybrid. First Interview will be a Teams interview 2nd may be in person .Title : Business System Analyst Inperson InterviewPosition Type: contract to permLocation: Minnesota Onsite Flexibility: Hybrid 1 week on 1 week offsite Green Card or Citizen OnlyNeed write up why he/she is fit for this role! I only want two candidates a piece anything after two will not be considered . • If you forget to list the bullets points on your submittal, I will put your candidate at the end of consideration and review the ones with correct submittals.• Please include Linkedin links in submittal • I prefer Green Card and citizens for this role . Job Summary: The Business Analyst will focus on understanding, organizing, prioritizing, and assessing work for the development team based on the needs of the company. This role is responsible for the analysis, requirements gathering, design, end user interaction, acceptance criteria definition, facilitating, and product releases on 3rd party vendor solutions, integrations, and existing applications. The Business Analyst will also serve as liaison between business stakeholders, IT staff, and offshore IT contractors supporting and improving our systems and applications. The Business Analyst will be facilitating and participating in cross functional teams, both onshore and offshore, in all phases of the development lifecycle, addressing software applications, workflows, data flows, mockups, and systems. Essential Functions:Essential functions as defined are ILLUSTRATIVE ONLY and not a comprehensive listing of all functions and duties performed by incumbents within this classification. To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions of this position. Essential duties and responsibilities may include, but are not limited to, the following:• Ability to communicate with and document 3rd party application requirements.• Drive and facilitate the 3rd party application partner, product development team, with the proven ability to provide high level requirement documentation, functional requirements, workflow diagrams, user stories, and data mappings.• Responsible for meeting with internal stakeholders to gain thorough understanding of current business process and define problem statements to effectively provide business context to the development team.• Define, develop, and ensure functional requirements and acceptance criteria are ready for development to start work.• Responsible for validating requirement functionality meets the acceptance criteria and definition of done.• Ability to drive a variety of project types including but not limited to 3rd party software implementation, integrations, and hardware/software solutions.• Ability to query and track transactional data through integrated systems.• Assist in gaining buy-in from stakeholders on decisions regarding product functionality and process.• Responsible for creating, maintaining, and prioritizing the list of backlog items, based on the overall strategy and business objectives. • Work with business stakeholders and 3rd party application partner to ensure the product backlog has visibility, transparency, and clear understanding of functionality and timing.• Ensures close collaboration with the development team, when applicable.• Facilitate in daily standups, sprint meetings and retrospectives.• Being a member of the team, you’ll help drive the projects’ success by completing it on time, within budget, meeting team members’ expectations and meeting the projects’ goals.Skills/Experience Required• Bachelor’s Degree from a four-year college or university is required, practical experience in lieu of education is acceptable. • 3+ years of business systems analysis experience.• Strong communication, interpersonal and analytical skills.• ERP and CRM application systems experience. • Previous Scrum Experience preferred.• Prior experience with Agile methodologies preferred. • Ability to understand and build basic SQL statements.• Project Management skills nice to have.• Prior experience with software integration initiatives nice to have.• Working knowledge of MS operating systems and applications.• Ability to work in dynamic environment.• Travel may be required up to 10% for training or conferences.FYI. Just added this one to JD. It’s a new BSA role in addition to the one we’re already working. Instead of an ERP focus, this one is more integration focused. They’ll be working to get large clients integrated into their Accumatica system for ordering and fulfillment. • Drive and facilitate the 3 rd party application partner, product development team, with the proven ability to provide high level requirement documentation, functional requirements, workflow diagrams, user stories, and data mappings. ( all hands on )",
        "source": "Email",
        "date_posted": "2024-10-18 07:43:28-05:00",
        "unique_id": "1929fdd2e68df84e",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]