[
    {
        "company": "Siri Info Solutions",
        "job_title": "Java Developer with AWS and Node JS",
        "location": "Malvern, PA, USA",
        "full_location": {
            "city": "Malvern",
            "state": "PA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Node.js",
                "AWS",
                "SQL",
                "NoSQL"
            ],
            "primary": [
                "Grafana",
                "Splunk",
                "CI/CD",
                "CloudFormation",
                "Terraform",
                "Observability engineering",
                "Agile methodologies"
            ],
            "secondary": [
                "Troubleshooting",
                "Version control systems",
                "Automated data analysis frameworks",
                "Strong analytical skills",
                "Strong communication skills",
                "Documentation skills"
            ],
            "all": [
                "Java",
                "Node.js",
                "AWS",
                "SQL",
                "NoSQL",
                "Grafana",
                "Splunk",
                "CI/CD",
                "CloudFormation",
                "Terraform",
                "Observability engineering",
                "Agile methodologies",
                "Troubleshooting",
                "Version control systems",
                "Automated data analysis frameworks",
                "Strong analytical skills",
                "Strong communication skills",
                "Documentation skills"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Faraz Khan",
        "email": "faraz.khan@siriinfo.com",
        "jd": "Hello,Hope you are doing great.If you have any suitable candidate for below role kindly share with meVisa - H1B, GC and USC only10+ Years exp.Role: Java Developer with AWS and Node JSLocation: Malvern, PA (Onsite)Duration: Contract Job Description:Mandatory Skills: Java Full stack with Node JS and AWS, Grafana or any other other monitoring tool like Splunk, strong troubleshooting skill Proficiency in AWS services such as EC2, ECS, S3, DynamoDB, RDS, Route53, ELB, and Lambda along with the AWS SDK and CLI. Programing language: proficiency in Java & Node.js Hands on knowledge on SQL and NoSQL databases, including querying, managing, and optimizing data structures for both relational and non-relational databases. Strong experience with version control systems and CI/CD pipeline automation. Familiarity with infrastructure as code tools like CloudFormation or Terraform for automating cloud deployments. Familiarity with Observability engineering concepts, with hands on experience on modern observability tools and metrics solutions (Cloudwatch, Prometheus, etc.).Familiarity with Resilience Testing Frameworks. Experience with automated data analysis frameworks. Strong analytical and problem-solving skills. Work with business team and understand the criteria, develop code, unit test and integrate with other components of the application. Should be able to interact with the business and understand the requirements Build technological capabilities and mentor team Experience with Agile methodologies - Scrum, Continuous integration Attention to detail, Desire, and ability to work in a multi-distributed team environment Ability to excel in a short timeframe under short sprints Strong communication and documentation skillsDigital : Amazon Web Service(AWS) Cloud Computing, Core Java? Experience in Java & Node.js? AWS Cloud experience ? CI/CD, Version Control? CloudFormation or terraform for automating cloud deployments? Experience in Java & Node.js? AWS Cloud experience ? CI/CD, Version Control? CloudFormation or terraform for automating cloud deployments",
        "source": "Email",
        "date_posted": "2024-10-18 10:37:44-05:00",
        "unique_id": "192a090b366cdfe3",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]