[
    {
        "company": "Tek Inspirations",
        "job_title": "Financial ERP Functional Business Analyst",
        "location": "Washington, DC, USA",
        "full_location": {
            "city": "Washington",
            "state": "DC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "THREE (3)+ years",
            "degree_required": "Bachelor’s degree from an accredited university",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Financial Management",
                "Business Process Analysis",
                "Requirements Gathering",
                "ERP Systems",
                "Analytical Skills"
            ],
            "primary": [
                "General Ledger Accounting",
                "Accounts Payable",
                "Accounts Receivable",
                "Fixed Asset Management",
                "Inventory Management",
                "Budgeting and Forecasting",
                "Treasury and Cash Management",
                "Communication Skills"
            ],
            "secondary": [
                "Visio",
                "Problem-solving",
                "Critical Thinking",
                "Stakeholder Engagement",
                "Project Management"
            ],
            "all": [
                "Financial Management",
                "Business Process Analysis",
                "Requirements Gathering",
                "ERP Systems",
                "Analytical Skills",
                "General Ledger Accounting",
                "Accounts Payable",
                "Accounts Receivable",
                "Fixed Asset Management",
                "Inventory Management",
                "Budgeting and Forecasting",
                "Treasury and Cash Management",
                "Communication Skills",
                "Visio",
                "Problem-solving",
                "Critical Thinking",
                "Stakeholder Engagement",
                "Project Management"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Pallavi Singh",
        "email": "pallavi.singh@tekinspirations.com",
        "jd": "Job Description -Financial ERP Functional Business Analyst - Need 1 Profile OnlyWashington DC-Baltimore Area (Hybrid)Federal ClientProject start date (close to December). MUST HAVE LINKEDINMUST BE LOCAL TO DC or MDWe are seeking a highly skilled Financial Management Modernization Business Analyst with a strong background in financial management and/or accounting to join a high profile, complex financial modernization project. The successful Financial Management Modernization Business Analyst will be a key project team member and will be responsible for conducting detailed discovery of the client’s existing financial management technologies and processes, and analyzing and documenting requirements for the client’s future financial system modernization. This role requires familiarity with AT LEAST one of the common financial management/accounting functional areas (General Ledger Accounting and sub-ledger accounting, Accounts Payable, Accounts Receivable, Fixed Asset Management, Inventory Management, Project and Grants Accounting, Budgeting and Forecasting, Procurement, Treasury and Cash Management). This role will interact with numerous stakeholders to understand and define business, functional, and technical financial needs, and will require candidates who are very detailed, self-motivated, results oriented, and excellent communicators.What You Will Need:· Bachelor’s degree from an accredited university· Relevant business process analysis experience required. · THREE (3)+ years experience in a business analyst role or performing requirements gathering functions, including for financial management/ERP modernizations · Experience gathering requirements for one or more of the following functional areas: General Ledger Accounting and sub-ledger accounting, Accounts Payable, Accounts Receivable, Fixed Asset Management, Inventory Management, Revenue Expenditure Accounting, Project and Grants Accounting, Budgeting and Forecasting, Procurement, Treasury and Cash Management) · Strong understanding of ERP/Financial Management System concepts, modules, and best practices, with experience working with ERP systems such as Workday, Oracle, SAP, and/or CGI · Experience with implementation of ERP and financial management systems, such as Workday, Oracle, SAP, and/or CGI · Experience with business process modelling tools (e.g. Visio) · Excellent analytical, problem-solving, and critical thinking skills · Strong communication and interpersonal skills, with the ability to communicate complex technical concepts to non-technical audiences, and vice versa · Ability to understand complex business processes, and to effectively articulate the information to others through visuals/diagrams or other requirements documentation · Ability to operate independently and set priorities amongst multiple task assignments. · Ability to manage multiple tasks, assignments, and projects. Self motivated and highly engaged· Experience on an ERP Modernization Project and Financial Management Implementation is a plusRESPONSIBILITIES· Conduct detailed discovery and analysis of existing financial/accounting technologies and processes and identify areas for process improvement that align with current ERP financial management systems · Collaborate with stakeholders to gather and define ERP requirements for financial management modernization · Facilitate requirements gathering sessions and design activities with stakeholders for the following functional areas: General Ledger Accounting and sub-ledger accounting, Accounts Payable, Accounts Receivable, Fixed Asset Management, Inventory Management, Revenue Expenditure Accounting, Project and Grants Accounting, Budgeting and Forecasting, Procurement, Treasury and Cash Management) · Conduct user research to understand user needs, behaviors, and blockers of existing financial/accounting processes · Define, document, and maintain business processes requirements and policies and identify ways to improve client financial and accounting processes & procedures. · Write and document business and customer requirements. · Develop project plans, priorities, and timelines for multiple waves of requirements gathering sessions · Support client Financial Management System procurement by conducting market research, developing product evaluation criteria, and identifying products that best meet client financial management needs What You Will Need:· Bachelor’s degree from an accredited university· Relevant business process analysis experience required. · THREE (3)+ years experience in a business analyst role or performing requirements gathering functions, including for financial management/ERP modernizations · Experience gathering requirements for one or more of the following functional areas: General Ledger Accounting and sub-ledger accounting, Accounts Payable, Accounts Receivable, Fixed Asset Management, Inventory Management, Revenue Expenditure Accounting, Project and Grants Accounting, Budgeting and Forecasting, Procurement, Treasury and Cash Management) · Strong understanding of ERP/Financial Management System concepts, modules, and best practices, with experience working with ERP systems such as Workday, Oracle, SAP, and/or CGI · Experience with implementation of ERP and financial management systems, such as Workday, Oracle, SAP, and/or CGI · Experience with business process modelling tools (e.g. Visio) · Excellent analytical, problem-solving, and critical thinking skills · Strong communication and interpersonal skills, with the ability to communicate complex technical concepts to non-technical audiences, and vice versa · Ability to understand complex business processes, and to effectively articulate the information to others through visuals/diagrams or other requirements documentation · Ability to operate independently and set priorities amongst multiple task assignments. · Ability to manage multiple tasks, assignments, and projects. Self motivated and highly engaged· Experience on an ERP Modernization Project and Financial Management Implementation is a plus",
        "source": "Email",
        "date_posted": "2024-10-18 10:50:39-05:00",
        "unique_id": "192a07357858fefe",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]