[
    {
        "company": "Panzer Solutions LLC",
        "job_title": "AI Software Engineer with CCAI",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "3+ years",
            "degree_required": "Bachelor's or master’s degree in Computer Science, Engineering, or related technical field",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "GCP CCAI service",
                "Dialog flow CX",
                "Agent Assist",
                "Telecom domain",
                "AI/ML domain"
            ],
            "primary": [
                "Technical Leadership",
                "User-centric conversation experiences",
                "Design and Architecture",
                "Innovation and Technology Trends",
                "Cross-functional Collaboration",
                "Communication and Stakeholder Management"
            ],
            "secondary": [
                "Problem-solving skills",
                "Agile development environment",
                "Sentiment analysis",
                "Intent classification",
                "Dialog flows"
            ],
            "all": [
                "GCP CCAI service",
                "Dialog flow CX",
                "Agent Assist",
                "Telecom domain",
                "AI/ML domain",
                "Technical Leadership",
                "User-centric conversation experiences",
                "Design and Architecture",
                "Innovation and Technology Trends",
                "Cross-functional Collaboration",
                "Communication and Stakeholder Management",
                "Problem-solving skills",
                "Agile development environment",
                "Sentiment analysis",
                "Intent classification",
                "Dialog flows"
            ],
            "with_experience": [
                "GCP CCAI service",
                "Dialog flow CX",
                "Agent Assist",
                "Telecom domain"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Shujath Ali",
        "email": "shujath.ali@panzersolutions.com",
        "jd": "Hi ,Hope you are doing well!!My name is Shujath Ali and I am working as a Lead Talent Acquisition at Panzer Solutions LLC.We deal with US IT and non IT recruitment services. We have the below opening with our preferred client,let me know if you are available & interested in this position. If interested please share a copy of your resume and best time, number to reach.Position:- AI Software Engineer with CCAILocation:- 100% RemoteDuration - Long TermNo OPT, CPTAs a CCAI Designer (Contact Center Artificial Intelligence), your primary responsibility will be to lead and manage the development and execution of technical projects related to CCAI. You will be working with a cross-functional team of engineers, product managers, and designers to ensure the successful delivery of CCAI products. • Technical Leadership:You will provide technical leadership to the engineering team, ensuring that technical solutions are scalable, reliable, and meet the needs of the business. You will also be responsible for identifying technical dependencies and driving the resolution of technical issues.• Good knowledge of GCP CCAI service, Dialog flow CX, Agent Assist.• Experience in driving conversational bots for various channels (web, voice etc.) projects.• Experience in user-centric conversation experiences involving chat, text or voice• Experience in Telecom domain and processes.• Design and Architecture: You will work with the design team to review the technical architecture of CCAI solutions. You will also be responsible for ensuring that the design is aligned with business objectives and meets the needs of our customers.• Strong understanding of the understanding, sentiment analysis, Intent classification, dialog flows etc• Innovation and Technology Trends: You will keep up to date with emerging technologies and trends in the AI/ML domain and identify opportunities for innovation and improvement. You will also work with the product management team to ensure that CCAI solutions are competitive and meet the needs of our customers.• Cross-functional Collaboration: You will work closely with product management, design, user research, and other cross-functional teams to ensure alignment on project objectives, timelines, and deliverables. You will also work with external partners and vendors to deliver technical solutions.• Communication and Stakeholder Management: You will be responsible for communicating technical issues and risks to stakeholders at all levels of the organization. You will also work closely with senior leaders to ensure technical objectives are aligned with overall business objectives. • Qualifications:• Bachelor\\\\'s or master’s degree in Computer Science, Engineering, or related technical field.• Experience in software engineering, with experience in the AI/ML domain.• Strong technical leadership skills with experience leading complex technical projects.• Strong problem-solving skills with the ability to identify and mitigate technical risks and issues.• Strong communication and stakeholder management skills, with the ability to work effectively with senior leaders and external partners.• Expertise working in an Agile development environment short sprint.• Strong Experience (~3+ years) in projects related Telecom domain and processes.• Good knowledge of GCP CCAI service, Dialog flow CX, Agent Assist & some experience in telecom domain with contact center technologies and workflows.",
        "source": "Email",
        "date_posted": "2024-10-18 14:54:28-05:00",
        "unique_id": "192a1528f71938a5",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "GCP Data Engineer"
    }
]