[
    {
        "company": "Infiniti Infotech Solutions LLC",
        "job_title": "FrontEnd Developer",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "12 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "React.js",
                "HTML5",
                "CSS Frameworks",
                "ADA compliance",
                "WCAG 2.1",
                "Section 508 compliance",
                "User Experience design principles",
                "Java",
                "JPA framework",
                "Spring framework",
                "Spring Boot",
                "Spring Data",
                "Java 8+",
                "Agile development"
            ],
            "primary": [],
            "secondary": [
                "JBOSS Enterprise environment"
            ],
            "all": [
                "React.js",
                "HTML5",
                "CSS Frameworks",
                "ADA compliance",
                "WCAG 2.1",
                "Section 508 compliance",
                "User Experience design principles",
                "Java",
                "JPA framework",
                "Spring framework",
                "Spring Boot",
                "Spring Data",
                "Java 8+",
                "Agile development",
                "JBOSS Enterprise environment"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Madhvendra Kumar",
        "email": "madhav@iinfiniti-solutions.com",
        "jd": "Need at least 12 years’ experience profile with 5 +years US experienceAlso Local to Michigan Hello,Hope you are doing great!!!!My name is Madhvendra kumar, I am a professional recruiter with Infiniti Infotech Solutions LLC. Infiniti Infotech Solutions LLC, Inc is Most Promising Enterprise Software Technology Company. I am looking forward to have a quick conversation with you. Below are some key highlights of the position, if this is of your interest, please call me. We can discuss the details of this opportunity and / or further determine which types of opportunities you may be interested in exploring. Job Title: FrontEnd DeveloperLocation : Lansing, MI (Hybrid)Type: Contract This resource position will be supporting the MDOT Development program. As a frontend developer, responsibilities include but not limited to working with development project teams, UI/UX designers and Business analysts to develop and maintain reusable UI components that are accessible, performant, scalable, and robust. Must be familiar with WCAG 2.1, ADA compliance and responsive design. All development will be tested by the developer for accessibility using Jaws reader along with multiple browser plugins. Strong background with React.js. Required, 5 years. Experience with HTML5 and CSS Frameworks. Required, 5 Years. Strong knowledge and background with ADA, WCAG 2.1, Section 508 compliance policies, User Experience design principles and standards. Required, 5 years. Experience with current JAVA, this includes using relevant IDE tools such as Eclipse/Jboss Developer Studio. Required, 3 Years. Experience programming in projects using JPA framework. Required, 2 Years. Experience programming in projects using current Spring framework. Required, 2 Years. Experience programming with Spring Boot and Spring Data. Required, 2 Years. Experience programming with Java 8+. Required, 3 Years. Experience participating as a programmer within an Agile development environment. Required, 2 Years. Experience programming in the JBOSS Enterprise environment. Desired, 2 Years.",
        "source": "Email",
        "date_posted": "2024-10-18 08:06:12-05:00",
        "unique_id": "1929ff47b67983a5",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]