[
    {
        "company": "iTech US, Inc.",
        "job_title": "Java Full Stack Developer with Angular 13+",
        "location": "Culver City, CA, USA",
        "full_location": {
            "city": "Culver City",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "onsite",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Must have existing work authorization",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Angular 13+",
                "Spring 3.x",
                "Hibernate 4.0",
                "JPA 2.0"
            ],
            "primary": [
                "Git",
                "Spring Boot",
                "jQuery",
                "Ajax",
                "Bootstrap",
                "Microservices",
                "PLSQL",
                "Stored Procedure",
                "JMS",
                "JBoss Messaging",
                "Active MQ",
                "UML",
                "SOAP",
                "REST Webservices",
                "CICD",
                "Jenkins",
                "Liquibase"
            ],
            "secondary": [
                "Agile",
                "Object Oriented Analysis",
                "Classic Design Patterns",
                "J2EE Patterns",
                "Eclipse",
                "Data Analysis",
                "Problem Solving",
                "Critical Thinking",
                "Client Facing",
                "Team Management",
                "Jira Administration"
            ],
            "all": [
                "Java",
                "Angular 13+",
                "Spring 3.x",
                "Hibernate 4.0",
                "JPA 2.0",
                "Git",
                "Spring Boot",
                "jQuery",
                "Ajax",
                "Bootstrap",
                "Microservices",
                "PLSQL",
                "Stored Procedure",
                "JMS",
                "JBoss Messaging",
                "Active MQ",
                "UML",
                "SOAP",
                "REST Webservices",
                "CICD",
                "Jenkins",
                "Liquibase",
                "Agile",
                "Object Oriented Analysis",
                "Classic Design Patterns",
                "J2EE Patterns",
                "Eclipse",
                "Data Analysis",
                "Problem Solving",
                "Critical Thinking",
                "Client Facing",
                "Team Management",
                "Jira Administration"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Srikanth V",
        "email": "srikanth.v@itechus.net",
        "jd": "Hi , This is Srikanth from iTech US. I have below requirement with one of the premier Client. Please go through it and let me if you are interested to apply for same. Role: Java Full Stack Developer with Angular 13+ Location: Culver City, CA(Onsite) - Local to CA Candidates Visa: Only H1B with PPnum Mandatory Job Description: Total IT Experience required 10+ Years Minimum 8 years of experience in JDK 1.8 , Springs3.x, Hibernate 4.0, JPA 2.0 Experience in working with Version Control Tools like Github, etc. Good knowledge and experience of Spring boot and Angular 13+ ,jQuery, Ajax, Bootstrap Strong experience working in Agile framework Good knowledge of Microservices based architecture Strong Experience working on large volume databases, PLSQL, Stored Procedure. Working knowledge of JMS and JBoss Messaging, Active MQ. Deep expertise in Object Oriented analysis and design, UML modeling, Classic design patterns and J2EE patterns. Experience with Eclipse, XML, SOAP/REST Webservices. Need to have excellent communication skills (including English conversation skills), demonstrate excellent problem solving and critical thinking skills Well proven skills in data analysis and ability to relate data to business processes Hands On Experience in CICD tools like Jenkins, Liquibase Experience working in complex projects with multi-tier architecture. Excellent client facing ability Quick learner and able to take ownership of the task with minimal guidance Identifying risks and forming contingency plans as soon as possible. Analyzing existing operations and scheduling training sessions and meetings to discuss improvements. Keeping up to date with industry trends and developments. Updating work schedules and performing troubleshooting as required. Manage team metrics and work with the Jira administration team to define any customizations needed in support of those metrics. Motivating staff and creating a space where they can ask questions and voice their concerns. Being transparent with the team about challenges, failures, and successes. Writing progress reports and delivering presentations to the relevant stakeholders. Conduct Code reviews and provide suggestions to the team Help team to manage Git repository and plan Deploy activities Identify recurring issues/alerts and conduct root cause analysis.",
        "source": "Email",
        "date_posted": "2024-10-18 11:31:38-05:00",
        "unique_id": "192a098dc98428db",
        "emp_type": [
            "onsite",
            "third party"
        ],
        "tag": "Java developer"
    }
]