[
    {
        "company": "Quantig",
        "job_title": "Business Analyst",
        "location": "Quincy, MA, USA",
        "full_location": {
            "city": "Quincy",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "2 years",
            "degree_required": "Bachelor's Degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Requirements Analysis",
                "Stakeholder Management",
                "Documentation"
            ],
            "primary": [
                "Benefits Management",
                "JRM",
                "JAD",
                "RTM"
            ],
            "secondary": [
                "Communication Skills",
                "Negotiation Skills",
                "Process Improvement",
                "Information Systems"
            ],
            "all": [
                "Business Analysis",
                "Requirements Analysis",
                "Stakeholder Management",
                "Documentation",
                "Benefits Management",
                "JRM",
                "JAD",
                "RTM",
                "Communication Skills",
                "Negotiation Skills",
                "Process Improvement",
                "Information Systems"
            ]
        },
        "job_type": [],
        "contact_person": "Alex",
        "email": "recruiter4@quantig.com",
        "jd": "From: Alex, quantig.com recruiter4@quantig.com Reply to: recruiter4@quantig.com Hi,Title: Business AnalystLOCATION:Quincy, MA (LOCALS FROM MA, NEW HAMSHIRE,RI ONLY)Duration : LOng termMUST HAVE: 2 years of experience supporting a benefits management, JRM , JAD,RTMJ.D:DETAILED STATEMENT OF JOB DUTIES AND RESPONSIBILITIES: * Stay current on stakeholder needs and the program vision * Serve as the custodian of program objectives and businessrequirements and assist in their realization * Produce a variety of high-quality documents within stipulatedtimelines that are complete, universally acceptable, and effectivelycommunicate objectives. * Participate in and contribute to JRM/JAD workshops with businessSMEs, developers, testers, and BAs to analyze business processes,workflows, business policies, events, triggers, roles, integratedsystems, data flows, etc. * Develop user stories working closely with business SME's inidentifying/eliciting and documenting business requirements * Publish/Review Business Requirements Documents, RequirementsTraceability Matrix (RTM), mapping requirements, and test cases toensure complete test coverage against in-scope requirements. * Review test summary reports ensuring adequate testing coverage forkey functional areas. * Support stakeholders during each release/implementation. * Closely co-ordinate with business stakeholders and track thedeliverable submission, review and approval for supporting the ongoingenhancement release schedule. * Support program director for tracking the enhancement resourcescapacity, assignment of weekly tasks, and utilization of the weeklyhours. * Learn the program's requirements management, change management, anddefect management tools and track requirements/defect status throughoutthe project for the functional areas. * Understand and proactively review existing processes, identifyopportunities for improvement and make constructive suggestions forchange that would benefit the Program * Serve as an SME for the program and contribute to and reviewdocuments crafted by other teams.EDUCATION, EXPERIENCE, and QUALIFICATIONS * Bachelor's Degree * 4-5 years of IT applications experience as a Business Analyst * At least 2 years of experience supporting a benefits managementprogram's eligibility management processes * Demonstrated understanding of complex information workflows through aContent Management Solution to publish sensitive information * Demonstrated ability to analyze and synthesize business requirements * Demonstrated ability to understand and negotiate the needs andexpectations of multiple stakeholders. * Excellent communication & negotiation skills and experience insupporting technical and non-technical staff * Strong background in developing trust and confidence in relationshipswith stakeholders and cross-functional teams; experience coordinatingand fulfilling requests for internal/external changes * Demonstrated expertise in information systems, business operations,requirements analysis, and integration/design of solutions. * The candidate must be process-oriented with sound judgment, attentionto detail, accuracy, and follow-through including flexibility to performin an ever",
        "source": "Email",
        "date_posted": "2024-10-18 07:29:45-05:00",
        "unique_id": "192a003ce2e50055",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]