[
    {
        "company": "Texas Health and Human Services Commission",
        "job_title": "Oracle Database Administrator Level 3",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "8 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle Database 12c or higher",
                "Oracle RAC",
                "Golden Gate",
                "Advanced SQL",
                "Shell scripting",
                "Supporting multi-terabyte database",
                "Advanced performance tuning"
            ],
            "primary": [
                "Experience with Microsoft O365 applications (Word, Excel, PowerPoint, Visio)",
                "Experience with MS Team and Channel communication with a large team"
            ],
            "secondary": [
                "Experience working with a public sector organization (Federal, State, or Local Government)",
                "Experience with SharePoint",
                "Experience with Jira",
                "Experience working with the Scrum framework"
            ],
            "all": [
                "Oracle Database 12c or higher",
                "Oracle RAC",
                "Golden Gate",
                "Advanced SQL",
                "Shell scripting",
                "Supporting multi-terabyte database",
                "Advanced performance tuning",
                "Experience with Microsoft O365 applications (Word, Excel, PowerPoint, Visio)",
                "Experience with MS Team and Channel communication with a large team",
                "Experience working with a public sector organization (Federal, State, or Local Government)",
                "Experience with SharePoint",
                "Experience with Jira",
                "Experience working with the Scrum framework"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Vinita Singh",
        "email": "vinita.singh@tekinspirations.com",
        "jd": "From: Vinita Singh, Tek Inspirations vinita.singh@tekinspirations.com Reply to: vinita.singh@tekinspirations.com Job Description -Note 1 : Candidates must fill out the job form with 3 References, Skill matrix Solicitation 529501199 Role : Oracle Database Administrator Level 3 End Client : Texas Health and Human Services Commission.Need Texas candidates ( Remote in Texas ) Visa only H1B, USC, GC, EAD , H4, TN, E2, L2 LinkeDIn yes THE JD Enters codes to create production data base. Selects and enters codes of utility program to monitor database performance, such as distribution of records and amount of available memory. Directs programmers and analysts to make changes to data base management system. Reviews and corrects programs. Answers user questions. Confers with coworkers to determine impact of data base changes on other systems and staff cost for making changes to data base. Modifies data base programs to increase processing performance, referred to as performance tuning. ?Texas Health and Human Services Commission requires the services of a Database Administrator who meets the general qualification of Database Administrator 3. The critical duties will be advanced performance tuning on complex processes on multi-terabyte databases with heavy transaction volumes. Initial duties include installing Oracle Database 19c, Oracle RAC, and Golden Gate to establish a new database tier and capacity planning for the ERP upgrade project. Core duties include the standard administration and support responsibilities of backup, recovery, monitoring, troubleshooting, tuning, and assisting the upgrade project team as needs arise.This position requires work outside of standard business hours depending on the project activities and system maintenance schedule to minimize the impact on the project team's productivity. Must demonstrate and excel in communicating and working with a diverse team with collaboration tools competently in a remote work environment. Also, the candidate must be able to estimate work, set deadlines, and prioritize work to align with the project schedule. II. CANDIDATE SKILLS AND QUALIFICATIONS Minimum Requirements:Candidates that do not meet or exceed the minimum stated requirements (skills/experience) will be displayed to customers but may not be chosen for this opportunity.YearsRequired/PreferredExperience8RequiredOracle Database 12c or higher8RequiredOracle RAC8RequiredGolden Gate8RequiredAdvanced SQL8RequiredShell scripting8RequiredSupporting multi-terabyte database8RequiredAdvanced performance tuning8Required(at least 4) Experience with Microsoft O365 applications (Word, Excel, PowerPoint, Visio)8Required(at least 2) Experience with MS Team and Channel communication with a large team4PreferredExperience working with a public sector organization (Federal, State, or Local Government)2PreferredExperience with SharePoint1PreferredExperience with Jira1PreferredExperience working with the Scrum framework E: vinita.singh@tekinspirations.com Contact No-+ 469-205-(6817)",
        "source": "Email",
        "date_posted": "2024-10-18 15:10:44-05:00",
        "unique_id": "192a161735c74bb7",
        "emp_type": [
            "third party"
        ],
        "tag": "Oracle DBA"
    }
]