[
    {
        "company": "PiplNow LLC",
        "job_title": "Senior Salesforce Business Analyst",
        "location": "Stillwater, MN, USA",
        "full_location": {
            "city": "Stillwater",
            "state": "MN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "8+ years",
            "degree_required": "Salesforce Certified Administrator (Required)",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Salesforce",
                "Sales Cloud",
                "Experience Cloud",
                "Informatica",
                "MuleSoft"
            ],
            "primary": [
                "Business Analysis",
                "Requirements Gathering",
                "Stakeholder Management",
                "Project Management",
                "Process Design"
            ],
            "secondary": [
                "Charisma",
                "Communication Skills",
                "Detail-Oriented",
                "Analytical Problem Solver",
                "Self-Driven"
            ],
            "all": [
                "Salesforce",
                "Sales Cloud",
                "Experience Cloud",
                "Informatica",
                "MuleSoft",
                "Business Analysis",
                "Requirements Gathering",
                "Stakeholder Management",
                "Project Management",
                "Process Design",
                "Charisma",
                "Communication Skills",
                "Detail-Oriented",
                "Analytical Problem Solver",
                "Self-Driven",
                "Salesforce Certified Administrator (Required)",
                "Salesforce BA Certification (Optional)"
            ]
        },
        "job_type": [
            "onsite",
            "hybrid"
        ],
        "contact_person": "Gobi",
        "email": "gobi@piplnow.com",
        "jd": "From: Gobi, PiplNow LLC gobi@piplnow.com Reply to: gobi@piplnow.com Hi, We have an urgent opening for Senior Salesforce Business Analyst - Day 01 Onsite Role at Stillwater, MN (Hybrid) Our client is looking to fill this role immediately. If you are interested in this role, Please share the updated resume, filled skill matrix, consultant details, visa and dl copy ASAP. Skill Matrix: SkillsYears of experienceOver all experience Total years of work exp in US As Senior Salesforce Business Analyst Sales Cloud Experience Cloud Leadership exp User Stories Dealing with Stakeholders Requirement gathering Consultant Details: Full Name Phone Email Rate/salary Month & Date of Birth Last 4 Digits of SSN Passport Number Available time Slots to take an Interview FTE/Contract/C2H Current Location (City, State & ZIP) Willing to work Onsite/Remote/Hybrid If non-local - Open to relocate? Availability from Date of Offer Last date of the project Any offers in the pipeline Linked In Profile Highest Education Details Are you a Citizen? If no, answer below Current Work Authorization/Date of Expiry Month/Year For 1st Visa and Year of Entry into the US? Proof of Work Authorization attached? Driver's License Attached? Total Years of Experience. Role: Senior Salesforce Business AnalystLocation: Day 01 Onsite Role at Stillwater, MN (Hybrid)Job Description:The team supports all aspects of the Sales Division which includes partnership and support with: Sales, Sales Operations, Marketing, Lead Management Teams that support Homeowner and Trade Leads, Finance, Events & Experience, and Strategic Pricing Teams. The team has existed since Salesforce was implemented in 2007; however, experienced significant growth and change beginning with a large Sales Transformation effort in 2019. The roles on the team include: Scrum Master, Product Owner, Business Analysts, Salesforce Developers, Salesforce Admins, and Support Analysts. Most of the members of the Team live locally, and we enjoy three days a week in the office as a Team together.This team supports upwards of 1,000+ users that span across many areas of the Salesforce ecosystem. These areas include:Sales CloudLeads, Accounts, Contacts, Opportunities, and ActivitiesExperience CloudThere is heavy interaction with the Salesforce Dealer and Trade Teams as they largely support Marketing Programs the present to our Customers via Experience Cloud. Those clouds are largely based on data and logic within Sales Cloud. The ability to collaborate with this Team is necessary.Informatica & MuleSoft for all integrations in and out of SalesforceIntegrations to downstream systems, Legacy Customer Systems, Transportation Management, etc.Responsibilities:This role will specifically focus on the launch and support of new sales strategies. This means that there is both a “project” and “product” element to this role. This role would be responsible for meeting with Business Partners to gather and write requirements, guide development, and advise QA. In addition, assist the Product Owner with prioritization and management of the work/roadmap. This role needs to be comfortable working with and talking with both Business and Technical Resources across our Salesforce Teams.Must Have Experience:·Responsible for leading planning and requirements for functional business areas.·Demonstrated ability to mentor and provide work direction to others.·Assists less experienced business analysts with design and knowledge transfer.·Responsible for collaboration with stakeholders to identify requirements and recommend solutions.·Responsible for designing business processes for high complexity objectives.·Responsible for communication of application capabilities, collaborates with Tech Lead for support.·Responsible for complex business analysis and process design in functional areas.·Responsible for specifying and validating high complexity business needs/requirements.·Drives business relationships and integrates departmental activities.·Responsible for defining application scope and solving complex business problems.Qualifications:·Soft skills are an integral part of being successful as a Business Analyst. The person in this role should have the following qualities:·Charisma and Communication Skills·Building good relationships is essential in a customer/business-facing role. Need to be comfortable speaking and working with others·Someone that can develop into a reliable, go-to contact for business partners·Situation awareness to know what questions to ask to a certain audience·Detail-Oriented·Someone that cares about the little details·Good at planning and organizing multiple things at once·Able to keep track of multiple deliverables·Analytical Problem Solver·Knows how to ask the right questions·Can find out where to dig (what to investigate, who to ask, etc)·Someone that asks “why” or “tell me more”·Self-Driven·Proactively seeks out training and knowledge·Shows consistent improvements in their knowledge of our business and processes·Salesforce Certified Administrator (Required)·Salesforce BA Certification (Optional)·Years of Experience: 8+ years",
        "source": "Email",
        "date_posted": "2024-10-18 10:39:34-05:00",
        "unique_id": "192a06932e4046e7",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]