[
    {
        "company": "Virginia Retirement System (VRS)",
        "job_title": "Business Analyst II",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "749676",
            "experience_required": "5+ years",
            "degree_required": "Bachelor's in Computer Science or closely related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Up to 6 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Software Development Life Cycle",
                "Business Systems Analysis",
                "Procurement Processes",
                "Analytical Techniques",
                "Documentation Skills"
            ],
            "primary": [
                "Web-based systems",
                "M365 apps",
                "IT security standards"
            ],
            "secondary": [
                "Team collaboration",
                "Problem-solving",
                "Communication skills"
            ],
            "all": [
                "Software Development Life Cycle",
                "Business Systems Analysis",
                "Procurement Processes",
                "Analytical Techniques",
                "Documentation Skills",
                "Web-based systems",
                "M365 apps",
                "IT security standards",
                "Team collaboration",
                "Problem-solving",
                "Communication skills"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Swapna J",
        "email": "swapnaj@cyber-resource.com",
        "jd": "From: Swapna, Cyber-resources swapnaj@cyber-resource.com Reply to: swapnaj@cyber-resource.com Role: VRS - Business Analyst 4 (749676)Job Id : 749676Positions : 1Location: Richmond, VAWork mode: HybridInterview: Web Cam Interview OnlyDUE : 10/24Experience : 5+Client : -VRSClient State: VirginiaABOUT THE ROLEThe Virginia Retirement System (VRS) is seeking an experienced business analyst to assist with documenting current and future state requirements, developing test cases, testing the system, documenting users guides and standard operating procedures for a procurement and contract management system. As a Business Analyst, the ideal candidate brings proven leadership experience in the procurement and contract management domain and thrives in a highly collaborative, fast-paced work environment. This position is hybrid, requiring onsite presence on Tuesdays, Wednesdays and other days as required. Essential Duties and Responsibilities include the following (other duties may be assigned as needed): Analysis· Independently and proactively lead/facilitate efforts to identify opportunities to leverage technology to enable business success and alignment with strategic vision. · Collaborate with all stakeholders to gather, evaluate, and document requirements for new systems or system enhancements based on business user input, technical requirements and constraints. · Document requirements using Structured Analysis Techniques such as Use Cases, Entity Relationship Diagrams, Process Decomposition Diagrams, Workflows and Wireframes.· Analyze proposed system and process changes to identify strategies for meeting business objectives and impacts, including assessing costs and implementation efforts. · Develop innovative strategies to meet business requirements by leveraging the capabilities of existing technology tools or acquiring/developing new ones. · Present strategies and findings in meetings and presentations with key users and agency executives.· Serve as a liaison between business partners and technical staff. · Coordinate with business users and technical staff to develop test data and test procedures to verify application functionality and oversee testing within projects. Technical Expertise and Guidance· Apply a broad range of expertise of technology principles, best practices and procedures to complex assignments across multiple functional areas.· Ensure security best practices in accordance with VRS Security policies.· Utilize comprehensive technical knowledge of software solutions analysis and design to oversee significant assignments, escalating only the most complex technology issues to higher levels.· Develop and document technology processes and methodologies.· Promote and adhere to the Systems Development Life Cycle (SDLC) methodology and recommend changes when appropriate. Collaborate with both business partners and technical staff to ensure adherence to the SDLC methodology, ensuring high-quality project deliverables. Skills and AbilitiesDemonstrated ability to:- Work effectively and independently in a fast-paced team environment where priorities can rapidly change.- Prioritize task with minimal guidance and coaching.- Solve complex problems through discovery and analysis with minimal guidance.- Communicate effectively orally and in writing with users at all levels within VRS.Expert knowledge and experience in the following:- The Software Development Life Cycle- Business Systems Analysis and Design Techniques- General understanding of procurement processes, systems and best practices Demonstrated ability to:- Analyze complex processes and understand intricate materials and documentation.- Research and gather data, compile results and solve problems.- Define user requirements and document user stories.- Use of various analytical techniques including process flows and use cases.- Prepare complex documents, including general and detail design specifications.- Successfully interact in a team environment. Demonstrated working knowledge of the following tools/technologies:- Web-based systems and business support tools such as procure-to- pay systems and contract management systems.- M365 apps – Word, Excel, PowerPoint, SharePoint.- General IT security standards and practices. Education and Experience Candidates must possess a bachelor’s degree in computer science or closely related field from a four-year college or university, with 5 or more years of relevant experience. Preferred qualifications include at least 3 years as an analyst in the implementation of procurement workflows and contract management systems, as well as 2 years of experience organizing and coordinating multiple work assignments and priorities. This position will be on a contract basis for a period of up to 6 months. For optimal effectiveness, the selected candidate should be available to start within the next month. VRS desires to interview proposed individuals before final approval. VRS feels the individual needs to be onsite the majority of the time to work closely with the teams to be successful. SkillRequired / DesiredAmountof ExperienceExpert knowledge and experience in software development cycle.Required5Years Expert knowledge and experience in business systems analysis and design techniques.Required5YearsGeneral understanding of procurement processes, systems and best practices.Required5YearsWork effectively and independently in a fast-paced team environment where priorities can rapidly change.Required5YearsPrioritize task with minimal guidance and coaching.Required5YearsSolve complex problems through discovery and analysis with minimal guidance.Required5YearsCommunicate effectively orally and in writing with users at all levels within VRS.Required5YearsAnalyze complex processes and understand intricate materials and documentation.Required5YearsResearch and gather data, compile results and solve problems.Required5YearsDefine user requirements and document user stories.Required5YearsUse of various analytical techniques including process flows and use cases.Required5YearsPrepare complex documents, including general and detail design specifications.Required5YearsSuccessfully interact in a team environment.Required5YearsWeb-based systems and business support tools such as procure-to- pay systems and contract management systems.Required5YearsM365 apps – Word, Excel, PowerPoint, SharePoint.Required5YearsGeneral IT security standards and practices.Required5Years Description Question 1Commonwealth of Virginia security policies prohibit the use of offshore IT contractors. Do you attest to the fact that your candidate will physically reside within the US for the duration of the assignment? Question 2Please list candidate's email address.Question 3In what city and state does your candidate currently reside?Question 4This role requires the candidate be ON SITE on Tuesday and Wednesday of each week (with rest of the team). If selected, does your candidate agree to this arrangement?",
        "source": "Email",
        "date_posted": "2024-10-18 11:12:11-05:00",
        "unique_id": "192a0870cc8029ec",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]