[
    {
        "company": "Carnival",
        "job_title": "Oracle EBS Administrator – Financial Systems",
        "location": "Miami, FL, USA",
        "full_location": {
            "city": "Miami",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "2 years",
            "degree_required": "Bachelor's Degree in Accounting and/or Management of Information Systems",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle EBS",
                "Financial software",
                "Microsoft Office suite"
            ],
            "primary": [
                "Accounting terminology",
                "Finance terminology",
                "DataLoader tool",
                "Service ticket management"
            ],
            "secondary": [
                "Communication skills",
                "Interpersonal skills",
                "Attention to detail",
                "Organizational skills"
            ],
            "all": [
                "Oracle EBS",
                "Financial software",
                "Microsoft Office suite",
                "Accounting terminology",
                "Finance terminology",
                "DataLoader tool",
                "Service ticket management",
                "Communication skills",
                "Interpersonal skills",
                "Attention to detail",
                "Organizational skills"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Shubham Sharma",
        "email": "shubhams@vyzeinc.com",
        "jd": "From: Shubham sharma, VyzeInc shubhams@vyzeinc.com Reply to: shubhams@vyzeinc.com Oracle EBS Administrator – Financial SystemsLocation: Miami, FL (Onshore)- Hybrid – Need Local Only Duration: 12 MonthsCompany: CarnivalNeed linkeldn MOI: Skype Visa: AnyDescription:Perform the user creation, update and de-provisioning functions for CCL Financial Systems – Oracle ebs. Analyze user and responsibility assignment requests for appropriate approvals as per company policy and ensure there is no segregation of duty violations.Perform the required SOX reviews related to user access and approval limits. . This position has the primary responsibility to provide day-to-day support for Oracle Ebs. 60%Perform various data uploads in Oracle EBS using the DataLoader tool. Extract financial data from various systems/files for purposes of performing analysis. Consolidate information and produce reports. 20% Manage service tickets related to user issues within the agreed SLA's. 10%Organize and maintain all supporting documentation related to the functions assigned. Produce process flow charts and procedures for the functions responsible for. 5%Perform any testing required for changes and upgrades to the systems/workflows supported. 5% Education: Bachelor's DegreeDiscipline/Major Accounting and/or Management of Information SystemsAdditional education / Certifications N/AYears and area of Professional experience (required for the role) 2 years of clerical accounting and systems-related functions. Knowledge, Skills & Abilities Solid understanding of accounting and finance terminology and functions. Highly organized, focused on deadlines and sense of urgency. Attention to detail.Critical Professional related Technical Skills; Computer Skills Experience with Financial software, Oracle Ebs required. Microsoft Office suite.Other Requirements Solid communication and interpersonal skills.Must be able to remain in a stationary position at a desk and/or computer for extended periods of time.",
        "source": "Email",
        "date_posted": "2024-10-18 13:34:37-05:00",
        "unique_id": "192a109748385070",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Oracle DBA"
    }
]