[
    {
        "company": "Dimiour",
        "job_title": "Technical Project Manager",
        "location": "Mountain View, CA, USA",
        "full_location": {
            "city": "Mountain View",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Device Testing",
                "Quality Assurance"
            ],
            "primary": [
                "Stakeholder Collaboration",
                "Process Improvement",
                "Documentation",
                "Reporting"
            ],
            "secondary": [],
            "all": [
                "Project Management",
                "Device Testing",
                "Quality Assurance",
                "Stakeholder Collaboration",
                "Process Improvement",
                "Documentation",
                "Reporting"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Santhosh",
        "email": "santhosh.mohan@dimiour.io",
        "jd": "From: Santhosh, Dimiour santhosh.mohan@dimiour.io Reply to: santhosh.mohan@dimiour.io Role Title: Technical Project Manager/Program with device testingHiring Mode: Contract (TP)Location: Mountain View, CA (On-Site) Responsibilities: Project Management: Lead and manage multiple projects related to device testing, from initiation to completion.Develop project plans, timelines, and budgets, ensuring alignment with business goals.Monitor project progress and performance, adjusting plans as necessary to meet objectives. Device Testing & Quality Assurance:Oversee the device testing lifecycle, ensuring compliance with industry standards and best practices.Collaborate with engineering, QA, and product teams to define testing requirements and ensure thorough execution of test plans.Analyze test results, identify issues, and drive resolution efforts to enhance product quality. Stakeholder Collaboration:Act as the primary point of contact for stakeholders, providing regular updates on project status, risks, and outcomes.Facilitate communication between technical teams, management, and external partners to ensure alignment and support. Process Improvement:Identify opportunities for process enhancements in device testing and project management.Implement best practices and methodologies to streamline workflows and improve efficiency. Documentation & Reporting:Ensure proper documentation of project deliverables, test cases, and results.Prepare and present reports on project status, risks, and testing outcomes to stakeholders.",
        "source": "Email",
        "date_posted": "2024-10-18 12:18:46-05:00",
        "unique_id": "192a0c4037f4e963",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]