[
    {
        "company": "Absolute IT",
        "job_title": "NET Developer",
        "location": "Lincoln, NE, USA",
        "full_location": {
            "city": "Lincoln",
            "state": "NE",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "8+ years",
            "degree_required": "Bachelor’s/Master’s degree in computer science, Information Technology, Software Engineering, or an associated field.",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".NET Core",
                "ReactJS",
                "Azure",
                "SQL Server",
                "Restful APIs"
            ],
            "primary": [
                ".NET modernization",
                "Web application development",
                "Vue.js",
                "Angular",
                "JavaScript",
                "jQuery",
                "HTML",
                "CSS",
                "Bootstrap",
                "CI/CD",
                "NUnit",
                "XUnit",
                "MSTest"
            ],
            "secondary": [
                "Code optimization",
                "Performance tuning",
                "GitHub",
                "TFS",
                "Technical documentation",
                "Financial industry experience"
            ],
            "all": [
                ".NET Core",
                "ReactJS",
                "Azure",
                "SQL Server",
                "Restful APIs",
                ".NET modernization",
                "Web application development",
                "Vue.js",
                "Angular",
                "JavaScript",
                "jQuery",
                "HTML",
                "CSS",
                "Bootstrap",
                "CI/CD",
                "NUnit",
                "XUnit",
                "MSTest",
                "Code optimization",
                "Performance tuning",
                "GitHub",
                "TFS",
                "Technical documentation",
                "Financial industry experience"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Devyani Kumari",
        "email": "devyani@absoluting.com",
        "jd": "NET Developer Opportunity in Lincoln, NE – Long-Term Onsite ContractThis is a long-term onsite contract, and we are looking for highly skilled candidates to fill this position. Contract Type: Long-TermCandidate must have an active and an updated LinkedIn ID (REQUIRED!!)No. of positions: 15Experience: 8+ years of .NET development Skills Required:Proficiency in .NET Core and .NET modernizationExperience with ReactJS and Azure platformsStrong problem-solving skills and ability to work in an agile environmentStart Date: 1st Nov 2024 Duration: Long TermHands on experience in Web application (full stack) development using .Net framework & .Net (Core), MVC.Strong hands on using one of the front-end UI frameworks Vue.js, Angular or React and complimentary technologies ie., JavaScript, jQuery, HTML, CSS, Bootstrap. Must have React experience.Having SQL Server skills with the ability to create complex stored procedures, views, functions, tables etc.,Good experience in developing Restful APIs and integrating 3rd party APIs.Experience in implementation of design patterns, code optimization and performance tuning.Good knowledge on code repositories like GitHub, TFS etc.Good to have knowledge of App services and Azure functions.Good knowledge of integrating code into CI/CD pipelines.Good unit testing skills to ensure responsiveness and efficiency with knowledge of tools like NUnit, XUnit, MSTest etc.Perform code reviews, mentor junior developers and fix QA raised defects seamlessly.A good team player, collaborate with project managers, tech leads and support offshore-onsite coordinationSupport during various stages of deployment and collaborate with the relevant teams during deployment.Knowledge on writing technical documentation and presentations.Demonstrated ability to work independently with little direction or as part of a team.Demonstrated ability to work on highly complex projects within tight timelinesThe ability to clearly communicate complex technical specifications, and a motivation to achieve best-in-class results.Financial industry experience is beneficial. Qualifications:Experience 8+ years.Bachelor’s/Master’s degree in computer science, Information Technology, Software Engineering, or an associated field.",
        "source": "Email",
        "date_posted": "2024-10-18 11:48:30-05:00",
        "unique_id": "192a0a8512574496",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]