[
    {
        "company": "Mobcoder IT Solutions LLC",
        "job_title": ".NET with Python / Senior Principal Software Engineer wiith python",
        "location": "Austin, TX, USA",
        "full_location": {
            "city": "Austin",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "13+ years",
            "degree_required": "Bachelor’s or master’s degree in computer science or related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "long Term Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Python",
                "WebAPIs",
                "Angular UI",
                "Azure DevOps",
                "Docker",
                "Kubernetes",
                "SQL Server database",
                "Stored Procedures",
                "Performance tuning",
                "Azure functions",
                "Microservices",
                "Kafka"
            ],
            "primary": [
                ".Net Core",
                "MVC Core",
                "C#",
                "Restful Web API",
                "Data analytics"
            ],
            "secondary": [],
            "all": [
                "Python",
                "WebAPIs",
                "Angular UI",
                "Azure DevOps",
                "Docker",
                "Kubernetes",
                "SQL Server database",
                "Stored Procedures",
                "Performance tuning",
                "Azure functions",
                "Microservices",
                "Kafka",
                ".Net Core",
                "MVC Core",
                "C#",
                "Restful Web API",
                "Data analytics",
                "Large Language Models",
                "Machine Learning",
                "Deep Learning",
                "Generative AI",
                "Supervised learning",
                "data science",
                "data engineering",
                "JavaScript",
                "Typescript",
                "CSS",
                "HTML",
                "Multithreading",
                "Caching technology like Redis",
                "SQL /NoSQL database",
                "JUnit",
                "cloud platforms like Azure / AWS",
                "Microservices Architecture",
                "Micro Frontend",
                "DevOps"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Preet",
        "email": "preet.k@mobcoderstaffing.com",
        "jd": "From: Preet, Mobcoder IT Solutions LLC preet.k@mobcoderstaffing.com Reply to: preet.k@mobcoderstaffing.com Position: .NET with Python / Senior Principal Software Engineer wiith pythonLocation: Austin, TX (Hybrid Onsite)Duration: long Term ContractJob Description:Mandatory skills: Python WebAPIsAngular UI (strong in angular), Azure DevOps, Docker, kubernetes, Sql Server database, Stored Procedures and Performance tuning. Azure functions, Microservices.KafkaGood to have: .Net Core, MVC Core, C#, Restful Web API, Data analytics. You will:Ensure successful deployment of AI-based tools and systems that significantly improve operational efficiency or customer experience.Develop innovative algorithms or models that advance the state-of-the-art in AI technology.Integrate AI solutions into existing workflows or platforms, enabling automation and data-driven decision-making.Lead teams through the entire lifecycle of AI projects, from conception to deployment and maintenance.Contribute to open-source AI initiatives or communities, fostering collaboration and knowledge sharing within the industry.Design and lead the effort on automation, CI/CD processes and tools to make our services simpler and more robust.Mentor team members in design collaboration, code reviews, development tools and processes.Take part in the full software development life cycle including development, test, continuous delivery and support.Be an active member of an agile team, collaboratively realizing features through development, test and delivery.Essential Requirements13+ years of software development experience.Excellent knowledge and application of engineering concepts along with effective problem-solving ability.Solid understanding of Large Language Models, Machine Learning, Deep Learning, Generative AI, Supervised learning, data science, and data engineering.Proficiency in .NET and Python, which are crucial for developing robust and scalable AI solutions.Extensive knowledge and hands-on experience Kafka, & Angular / React, JavaScript, Typescript, CSS, HTML.Strong proficiency in Multithreading, Caching technology like Redis, experience in SQL /NoSQL database.Experience implementing test-driven development and hands-on with JUnit cases.Ability to code/debug using design specifications.Experience with cloud platforms like Azure / AWS. Extensive knowledge of Microservices Architecture, Micro Frontend and DevOps.Ability to manage, motivate, and direct a cross-functional workgroup; and drive successful negotiations.Solid interpersonal and presentation skills in Artificial Intelligence.Desirable RequirementsBachelor’s or master’s degree in computer science or related field.Proficiency in container technologies like Docker and Kubernetes (K8S).",
        "source": "Email",
        "date_posted": "2024-10-18 13:56:11-05:00",
        "unique_id": "192a11d340cc0d6b",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]