[
    {
        "company": "Panzer Solutions LLC",
        "job_title": "Data Scientist (Big Data Engineer)",
        "location": "Austin, TX, USA",
        "full_location": {
            "city": "Austin",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Snowflake",
                "SAS Viya",
                "ETL",
                "SQL",
                "Python",
                "R",
                "AWS Glue",
                "AWS Lambda",
                "Data Analytics",
                "Business Intelligence (BI) Tools",
                "Agile/Scrum Development Environment",
                "Database Management",
                "Data Warehousing"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Snowflake",
                "SAS Viya",
                "ETL",
                "SQL",
                "Python",
                "R",
                "AWS Glue",
                "AWS Lambda",
                "Data Analytics",
                "Business Intelligence (BI) Tools",
                "Agile/Scrum Development Environment",
                "Database Management",
                "Data Warehousing"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Zaid Khan",
        "email": "zaid.khan@panzersolutions.com",
        "jd": "From: zaid, Panzer zaid.khan@panzersolutions.com Reply to: zaid.khan@panzersolutions.com Hi ,How are you doing well!My name is Zaid Khan, and I am a certified LinkedIn Recruiter currently working as a Talent Acquisition Specialist at Panzer Solutions LLC. We specialize in both IT and non-IT recruitment services across the U.S. I wanted to inform you about an exciting opportunity we have with one of your preferred clients. If you're available and interested, please let me know. You can also send me your updated resume and the best contact number for a quick follow-upData Scientist (Big Data Engineer) 2 Location : Austin Texas ( Position will be Remote in Texas ) Skill Matrix Table :YearsExperience Proven experience in data conversion and report building using Snowflake and SAS Viya. Demonstrated experience in data transformation processes using ETL, SQL, Python, and R. Experience working with data analytics and business intelligence tools. Experience working in a Scrum or Agile development environment. Proficiency in ETL processes and tools such as AWS Glue and Lambda. Strong knowledge of database management and data warehousing concepts. Expertise in SQL for data querying and manipulation. Proven experience in data conversion and report building using Snowflake and SAS Viya. Demonstrated experience in data transformation processes using ETL, SQL, Python, and R. Experience working with data analytics and business intelligence tools. Experience working in a Scrum or Agile development environment. Proficiency in ETL processes and tools such as AWS Glue and Lambda. Below Skills are Must need In Resume · Snowflake - Data conversion and report building· SAS Viya - Data conversion and report building· ETL (Extract, Transform, Load) - Data transformation processes and proficiency in ETL tools· SQL - Expertise in data querying and manipulation· Python - Data transformation and analytics· R - Data transformation and analytics· AWS Glue - ETL processes and data management· AWS Lambda - ETL and serverless architecture· Data Analytics - Experience with data analytics tools· Business Intelligence (BI) Tools - Experience with BI platforms· Agile/Scrum Development Environment - Working experience in Agile frameworks· Database Management - Strong knowledge of database management systems· Data Warehousing - Familiarity with data warehousing concepts and best practices Warm Regards,Zaid Khan| Talent AcquisitionPanzer Solutions LLC50 Washington Street, 9th Floor,SONO Corporate Center - Norwalk CT 06854Email: zaid.khan@panzersolutions.comNotice of Confidentiality:The information contained herein is intended only for the confidential use of the recipient. If the reader of this message is neither the intended recipient, nor the person responsible for delivering it to the intended recipient, you are hereby notified that you have received this communication in error, and that any review, dissemination, distribution, or copying of this communication is strictly prohibited. If you receive this in error, please notify the sender immediately by telephone, and destroy this e-mail message OR reply with the subject \"REMOVE\" or \"Unsubscribe\" such that your email would be taken out of our distribution list. You can also forward your \"REMOVE\" or \"Unsubscribe\" emails to mailto:info@panzersolutions.com",
        "source": "Email",
        "date_posted": "2024-10-18 13:19:05-05:00",
        "unique_id": "192a0fb3c3486017",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]