[
    {
        "company": "University of California Office of the President",
        "job_title": "Business Systems Analyst (Asset Management)",
        "location": "Oakland, CA, USA",
        "full_location": {
            "city": "Oakland",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "8+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Must have existing work authorization",
            "notice_period": "Immediate",
            "duration": "6-month contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Asset Management",
                "Data Cleanup",
                "Process Analysis",
                "Systems Analysis"
            ],
            "primary": [
                "ServiceNow",
                "AWS",
                "Rapid7",
                "Documentation",
                "Risk Analysis",
                "Interpersonal Skills"
            ],
            "secondary": [
                "Agile",
                "SCRUM",
                "Waterfall",
                "Technical Communication",
                "Problem Solving",
                "Higher Education Experience"
            ],
            "all": [
                "Business Analysis",
                "Asset Management",
                "Data Cleanup",
                "Process Analysis",
                "Systems Analysis",
                "ServiceNow",
                "AWS",
                "Rapid7",
                "Documentation",
                "Risk Analysis",
                "Interpersonal Skills",
                "Agile",
                "SCRUM",
                "Waterfall",
                "Technical Communication",
                "Problem Solving",
                "Higher Education Experience"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Roopesh Sharma",
        "email": "roopesh@vizoninc.com",
        "jd": "Hello, Hope you are doing great. Please response me on my official email - roopesh@vizoninc.com Job Title: Business Systems Analyst (Asset Management) Location: Oakland, CA (100% Remote) Must Live In CA / Manager prefers 1-2 hours from the BayUCOP (LinkedIn mandatory)Please include a summary with the must haves about their projects ?? Resumes should not exceed 4 pages. NOTES FROM MANAGER:We’re now looking for an additional resource, a Business Analyst that can help us on the current SN Asset Inventory / Rapid7 integration project as well as the upcoming Asset Management project (Phase 2).We are looking for an experienced Business Analyst with experience in Asset Management and not developer.We want to hire a six-months contractor to manage data cleanup, tagging (AWS tags, potentially in Service Now) and begin mapping servers to applications. The BA will also need to define the data cleanup process, etc. While we use/prefer SN, the process can be tool agnostic. This contactor should have familiarity with Inventory/Asset Management, preferably in SN.We will want the contract BA to start as soon as possible (in 2 weeks, say around Nov 1st).I would prefer experience with SN since that’s the platform we’re on. However, any additional experience with any other systems will also be a plus (i.e., AWS, Rapid7, etc.).They must have experience with Asset Management.The University of California, one of the largest and most acclaimed institutions of higher learning in the world, is dedicated to excellence in teaching, research and public service. The University of California Office of the President is the headquarters to the 10 campuses, six academic medical centers and three national laboratories and enrolls premier students from California, the nation and the world. Learn more about the UC Office of the PresidentPOSITION SUMMARYWe are looking for a Business Systems Analyst that can help us on the current SN Asset Inventory / Rapid7 integration project as well as the upcoming Asset Management project (Phase 2). We are looking for an experienced Business Systems Analyst with experience in Asset Management and not a developer.This is a six-month contract with potential consideration position for a staff position if the candidate is in CA and has a green card or is a US citizen.ResponsibilitiesPerforms complex analysis of business and user needs - Evaluate business and user needs to translate into system and process requirements - Considers implications of applying technology and process changes - Investigate system and process defects to understand root causeLead cross-functional teams to analyze issues or evaluate changes - Complete risk analysis for requested system and process changes and enhancements - Facilitate mitigation of risks and remediationDocumentation: - Document business and user requirements - Create technical system and process specifications - Generate process flow diagrams of system and business processes - Document defects, issues, and risks for systems and processes - Complete necessary documentation for change management processDesign and Change: - Develop process changes to meet business and user requirements - Create integration plans for changes and enhancements - Generate acceptance testing plans and scenariosCreate or modify procedures to support business and system processes - Implement system changes to applications and processes - Adhere to change management proceduresSoliciting Information and Communication: - Interview business partners for requirements, challenges, and requests - Interact with vendors to manage integrations, changes, and issues - Facilitate meetings with other UCOP departments to gather requirements, troubleshoot issues, and implement changes - Participate in strategy sessions to alter or create policies, processes, and proceduresRequired Qualifications8+ years of advanced knowledge/experience of business and process analysis functions.Experience and skills managing data cleanups, tagging (AWS tags, potentially in ServiceNow) and begin mapping servers to applications.Experience defining the data cleanup process, etc. While we use/prefer SNOW, the process can be tool agnostic. This contactor should have familiarity with Inventory/Asset Management, preferably in SN.Demonstrated effective communication and interpersonal skills.Demonstrated ability to communicate technical information to technical and non-technical personnel at various levels in the organization.Interpersonal and communications skills to work with both technical and non-technical personnel at various levels in the organization.Self-motivated and works independently and as part of a team. Able to learn effectively and meet deadlines. Demonstrates problem solving skills.Demonstrated experience with process analysis, systems analysis, process architectures and systems analysis methodologies.Understanding and skill in complex process and systems requirement documentation standards, such as Use Case modeling, User Story creations, and narrative description.Experience interviewing people to gain information for systems and processes. Demonstrated ability to work with others from diverse backgroundsAdvanced skills and methodologies associated with process and software design, modification, and implementation.Experience in the Higher Education sector is preferred.Experience working in Agile, Agile SCRUM, and traditional Waterfall environments.",
        "source": "Email",
        "date_posted": "2024-10-18 08:57:58-05:00",
        "unique_id": "192a00c3bc057e62",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]