[
    {
        "company": "NAM Info Inc",
        "job_title": "Sr. Business Analyst with Material Master or Parts Master with Reltio",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Bachelor’s degree in business, Information Systems, Data Science, or a related field. Master’s degree is a plus.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12-24 Months Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Master Data Management (MDM)",
                "Reltio",
                "Data Governance"
            ],
            "primary": [
                "Data Integration",
                "Data Quality",
                "Project Management",
                "Analytical Skills",
                "Communication Skills"
            ],
            "secondary": [
                "Data Warehousing",
                "Certified Data Management Professional (CDMP)",
                "Asset Data Management",
                "Problem-Solving",
                "Stakeholder Management"
            ],
            "all": [
                "Business Analysis",
                "Master Data Management (MDM)",
                "Reltio",
                "Data Governance",
                "Data Integration",
                "Data Quality",
                "Project Management",
                "Analytical Skills",
                "Communication Skills",
                "Data Warehousing",
                "Certified Data Management Professional (CDMP)",
                "Asset Data Management",
                "Problem-Solving",
                "Stakeholder Management"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Venki R",
        "email": "venki@nam-it.com",
        "jd": "From: Venki, NAM INFO INC venki@nam-it.com Reply to: venki@nam-it.com Hi Greetings from NAM Info Inc!!! Please find the below immediate requirements from my client. Please revert me back with updated copy of resume, Visa status and contact details Note: Send resumes to Venki@nam-it.com for quick submittals. Job Role- Sr. Business Analyst with Material Master or Parts Master with ReltioLocation- RemoteDuration- 12-24 Months Contract We are seeking an experienced Senior Business Analyst to lead the design and development of our Asset Master Data Management (MDM) platform, utilizing Reltio as the primary tool. In this role, you will collaborate closely with cross-functional teams, including data architects, developers, and business stakeholders, to ensure the MDM platform aligns with business requirements and effectively manages asset data across the organization. Key Responsibilities:Lead the design, development, and implementation of an Asset MDM platform using Reltio, ensuring alignment with organizational goals and data governance standards.Work with business stakeholders to gather, analyze, and document data requirements, translating them into functional specifications for the MDM platform.Organize and lead workshops with key stakeholders to identify pain points, challenges, and opportunities, facilitating solution design discussions to optimize the MDM platform.Partner with technical teams to ensure the successful integration of Reltio with existing systems and data sources, providing guidance on data modeling, data mapping, and data transformation.Develop and maintain a comprehensive data dictionary, detailing data definitions, structures, and attributes to ensure consistency and clarity across the organization.Develop and maintain detailed project documentation, including business requirements, functional specifications, and user guides.Conduct gap analysis and recommend improvements to optimize data management processes, ensuring data accuracy, consistency, and compliance with industry standards.Act as a subject matter expert for asset data, providing insights on best practices for data governance, data quality, and data lifecycle management.Collaborate with IT teams to troubleshoot and resolve issues related to data integration, data quality, and platform performance.Drive user acceptance testing (UAT) and ensure stakeholders are trained and supported in the use of the Reltio MDM platform.Monitor and report on the performance and adoption of the MDM platform, recommending enhancements to maximize its effectiveness. Qualifications:Bachelor’s degree in business, Information Systems, Data Science, or a related field. Master’s degree is a plus.10+ years of experience in business analysis, with a strong focus on Master Data Management (MDM) and data governance.Proven experience with Reltio or similar MDM tools in designing and implementing MDM solutions.In-depth understanding of asset data management and familiarity with asset-intensive industries (e.g., manufacturing, utilities, oil & gas).Excellent analytical and problem-solving skills, with the ability to translate complex data requirements into actionable insights.Strong project management skills, with experience in leading cross-functional teams and managing stakeholder expectations.Excellent communication skills, with the ability to present complex information in a clear and concise manner.Knowledge of data integration tools and data warehousing concepts is preferred.Relevant certifications in data management, such as Certified Data Management Professional (CDMP), are a plus. Thanks & Regards...Venki RLead (Staffing)Nam Info Inc Email : Venki@nam-it.comWebsite - www.nam-it.com2525 US Highway 130, Building D, Suite 2-Cranbury, NJ-08512 “The harder you work, the luckier you get” Follow us on: USA | CANADA | INDIA MBE Certified Company , E Verify Company Note: This is not an unsolicited mail. Under Bill 1618 Title III passed by the 105th USA Congress this email cannot be considered as spam as long as we include our contact information and an option to be removed from our emailing list. If you have received this message in error, or are not interested in receiving our emails, please accept our apologies. To be removed from our mailing list, please reply with the subject line \"REMOVE\". All removal requests will be honored ASAP. We sincerely apologize for any inconvenience caused to you",
        "source": "Email",
        "date_posted": "2024-10-18 14:31:10-05:00",
        "unique_id": "192a1917346565f7",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]