[
    {
        "company": "Massachusetts Executive Office of Health and Human Services (EOHHS)",
        "job_title": "Senior Java Engineer",
        "location": "Quincy, MA, USA",
        "full_location": {
            "city": "Quincy",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Bachelor’s degree in computer science, Information Systems, Business Administration or other related field, or equivalent work experience.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "8 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Mulesoft",
                "Java/J2EE",
                "Oracle OSB 12c",
                "IBM Data Power",
                "AWS"
            ],
            "primary": [
                "XML",
                "JSON",
                "APIs",
                "JMS"
            ],
            "secondary": [
                "Strong attention to detail",
                "Good communication skills",
                "Organizational skills"
            ],
            "all": [
                "Mulesoft",
                "Java/J2EE",
                "Oracle OSB 12c",
                "IBM Data Power",
                "AWS",
                "XML",
                "JSON",
                "APIs",
                "JMS",
                "Strong attention to detail",
                "Good communication skills",
                "Organizational skills"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Rajesh Kumar",
        "email": "rajesh.kumar@pivotal-technologies.com",
        "jd": "From: Rajesh Kumar, Pivotal Technologies, Inc rajesh.kumar@pivotal-technologies.com Reply to: rajesh.kumar@pivotal-technologies.com Title: Senior Java EngineerLocation: Quincy, MA (Locals Only)Duration: 8 MonthsAny Visa but not H1B Must be local – provide proof of residency via licenseMust haveMulesoftJavaData powerOracleAwsApi Basic Company Info: The Massachusetts Executive Office of Health and Human Services (EOHHS) is the largest secretariat in MA state government, comprised of 16 agencies with over 20,000 employees statewide. EOHHS services directly touch the lives of slightly more than 1 in 4 residents in the Commonwealth — some of our most vulnerable children, youth, adults, and elders. EOHHS provides access to medical and behavioral health care, substance misuse treatment, long-term services and support, and nutritional and financial benefits to those with low incomes. We connect elders, individuals with disabilities, and veterans with employment opportunities, housing, and supportive services. We steer troubled youth towards a more successful path and do everything possible to keep children in our child welfare system safe. We support individuals who are developmentally disabled, mentally ill, blind, deaf, or hard of hearing. Location: 100 Hancock St, Quincy, MA 02171; The work schedule for this position is Monday through Friday, 8:00AM to 4:00PM EST. This position would be expected to follow a hybrid model of reporting to work that combines in-office workdays and work from home days as needed.Location Details: no onsite parking for contractors; public trans accessible Important SkillsTechnical – Mulesoft, Java/J2EE, XML, JSON, Oracle OSB 12c, JMS, IBM Data Power, AWS, APISoft – Strong attention to detail, good communication and organizational skills, Interview Process: TBDHours / Shift (if applicable): 37.5 hrs/week JOB DESCRIPTION: PROGRAM OVERVIEW: The Massachusetts Executive Office of Health and Human Services (EOHHS) is the largest secretariat in MA state government, comprised of 16 agencies with over 20,000 employees statewide. EOHHS services directly touch the lives of slightly more than 1 in 4 residents in the Commonwealth — some of our most vulnerable children, youth, adults, and elders. EOHHS provides access to medical and behavioral health care, substance misuse treatment, long term services and support, and nutritional and financial benefits to those with low incomes. We connect elders, individuals with disabilities, and veterans with employment opportunities, housing, and supportive services. We steer troubled youth towards a more successful path and do everything possible to keep children in our child welfare system safe. We support individuals who are developmentally disabled, mentally ill, blind, deaf, or hard of hearing. POSITION OVERVIEW: EOHHS is seeking to hire a well-organized, result driven Senior Integration Engineer with leadership qualities to join the Chief Technology Office. The incumbent of this role will help plan, architect, design and implement Integration solutions that are in alignment with policies and standards of the organization and optimization of EOHHS-wide IT systems and applications with a strong focus on the Local Public Health Project. The primary work location for this role will be at 100 Hancock St, Quincy, Massachusetts 02171. The work schedule for this position is Monday through Friday, 8:00AM to 4:00PM EST. This position would be expected to follow a hybrid model of reporting to work that combines inoffice workdays and work from home days as needed. DETAILED LIST OF JOB DUTIES AND RESPONSIBILITIES: Lead, design and implement the middleware solutions including installation & administration, utilizing best practices & provide recommendations to optimize system performance using Mulesoft, messaging, cloud, and several integration technologies. Design, implement, & maintain APIs (SOAP & REST) Lead and liaise with the application development teams to build API capability, including security and policy management. • Lead and assist with developing & maintaining a service/API registry. Lead, assist, & provide guidance in migrating & modernizing API/web service & integration components from current implementations: Weblogic (12c) OSB, ActiveMQ, IBM MQ, IBM DataPower & Java adapters. Perform code reviews, prepare, and document Unit Test results and deployment documents for code promotions. Participate and assist with project planning, design, development, and release management activities for various EHS shared service component developments and EHS application developments. Liaise with end users, development staff, system administrators, management, and staff from other organizations to ensure successful implementation and operation of application systems. Coordinate and solicit vendor support as necessary. Maintain the appropriate task lists, documents, design, and other artifacts in support of these APIs. Investigate new solutions, tools, and techniques to incorporate into standards. QUALIFICATIONS: Knowledge, Skills, and Abilities: Expert in Mulesoft and other integration technologies 10+ years of experience in software development. Strong technical expertise in Java/J2EE, Oracle OSB 12c Expert knowledge of MuleSoft & connectors • Experience with AWS offerings & services, including API Gateway & WAF Experience with XML and JSON schema Experience of JMS programming with IBM MQ & Active MQFamiliarity with IBM DataPower Strong knowledge of TLS/SSL and digital encryption/signatures Experience with Azure OAUTH & JWTWorking knowledge of development tools - SVN, Git, SOAPUI, Postman Able to translate business requirements to technical specifications. Able to work independently and mentor other technical team members as needed. Excellent design, debugging, and problem-solving skills. Excellent interpersonal, written, and verbal communication skills EDUCATION AND CERTIFICATION: Bachelor’s degree in computer science, Information Systems, Business Administration or other related field, or equivalent work experience. Minimum (8) eight years of IT experience in one or more technical roles. Mulesoft Certification is preferred.",
        "source": "Email",
        "date_posted": "2024-10-18 16:44:47-05:00",
        "unique_id": "192a21b92a0a0e11",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]