[
    {
        "company": "Sun-Itsolutions",
        "job_title": "Sr. Tech Lead",
        "location": "Wilmington, DE, USA",
        "full_location": {
            "city": "Wilmington",
            "state": "DE",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "8-12 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$50/hr"
        },
        "skills": {
            "core": [
                "Core Java",
                "Java 11",
                "Spring Boot",
                "Oracle SQL",
                "AWS"
            ],
            "primary": [
                "Angular 9",
                "Microservices",
                "REST API"
            ],
            "secondary": [
                "Mongo DB",
                "Distributed cache technology",
                "Application development"
            ],
            "all": [
                "Core Java",
                "Java 11",
                "Spring Boot",
                "Oracle SQL",
                "AWS",
                "Angular 9",
                "Microservices",
                "REST API",
                "Mongo DB",
                "Distributed cache technology",
                "Application development"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Revanth",
        "email": "revanth@sun-itsolutions.com",
        "jd": "From: Revanth, Sun-Itsolutions revanth@sun-itsolutions.com Reply to: revanth@sun-itsolutions.com Hi Partners, Please Check below position: Don't Send without filling submission format I will not consider profile Job Title: Sr. Tech Lead Bill Rate: >12 years exp: $60/hr 8-12 years exp: $50/hr Candidate experience should be greater than 8 years Wilmington, DE Hybrid (In a week - 3 days at Client’s Office, 2 days from Home) Mandatory Skills: 1. Core Java, Java 11, Spring Boot, Oracle SQL Hands-on Development experience 2. Hands-on extensive AWS experience is mandatory 3. Angular 9 4. Microservices/ Rest API Job Description: As a Software Engineer, you will work as part of a cross-functional team responsible for the end-to-end, full stack development of the application. While each team member has a primary skill set, they are also expected to learn and contribute to areas outside of their primary skill set. The team is highly collaborative and values continuous improvement and open communication. You will be expected to be a well-regarded and respected individual contributor; possess strong inter-personal skills, as well as proven track record of application development with skills in Java, distributed cache technology and building scalable robust systems. In return you will have opportunity to gain exposure to designing, developing and deploying applications to the internal/external cloud. This role requires a wide variety of strengths and capabilities, including: • Proficiency in one or more general purpose programming languages; Core Java • Java development experience with knowledge of Java 11 and above • Angular 9 and above • Spring Framework • RESTful micro services • Oracle PL/SQL, Mongo DB knowledge is mandatorily required • Extensive Hands-on Experience in AWS Development is mandatory • Advanced knowledge of application, data and infrastructure architecture disciplines • Understanding of architecture and design across all systems • Working proficiency in developmental toolsets • Ability to collaborate with high-performing teams and individuals throughout the firm to accomplish common goals Job Duties: 1. Develop Microservices with Spring Boot for the application 2. Develop API using Microservices Architecture using Java in AWS Cloud environment 3. Work with Business and Product Teams to gather requirements and translate to Design and Code 4. Work in Agile environment with regular Sprints Provide POC/Demo to Business Teams at the end of each Sprint If you're consultant has all the skills required, you will be notified when we will move forward. Please attach with DL& Visa copy Submission process format First Name Middle Name Last Name LinkedIn Contact Number Email Address Skype Id / Zoom ID Available Start Date Best time to call you in Working hours Your preferred Interview time Slot Work Authorization Visa expire date Highest Qualification Year of Passing University Comfortable working on Dayone onsite role Yes / No :- Last 4 Digits of SSN Total Years of Experience Total U.S.A. Years of Experience Current Location Willing to Relocate (Yes/No) Passport Number Pay Rate (W2/1099/C2C) Profile Sourced from Vendor/Partner company is Consultant on there W2/1099/H1b ?",
        "source": "Email",
        "date_posted": "2024-10-18 07:26:38-05:00",
        "unique_id": "1929fb8b265de27f",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]