[
    {
        "company": "State of VA - VDOT",
        "job_title": "Net/ERP Developer",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "748487",
            "experience_required": "15+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "8+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "C#",
                ".NET Core",
                "SQL Server",
                "Angular",
                "Blazor"
            ],
            "primary": [
                "jQuery",
                "CSS3",
                "HTML5",
                "Web API",
                "Agile SDLC"
            ],
            "secondary": [
                "Source Control using TFS",
                "Automated Builds using Microsoft Team Foundation",
                "Troubleshooting skills",
                "Understanding of SOAP Services",
                "Familiar with Azure Cloud Concepts",
                "Experience working in Oracle",
                "Experience with Power BI"
            ],
            "all": [
                "C#",
                ".NET Core",
                "SQL Server",
                "Angular",
                "Blazor",
                "jQuery",
                "CSS3",
                "HTML5",
                "Web API",
                "Agile SDLC",
                "Source Control using TFS",
                "Automated Builds using Microsoft Team Foundation",
                "Troubleshooting skills",
                "Understanding of SOAP Services",
                "Familiar with Azure Cloud Concepts",
                "Experience working in Oracle",
                "Experience with Power BI"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Vineela",
        "email": "vineela@diasoftwaresolutions.com",
        "jd": "From: Vineela, diasoftwaresolutions vineela@diasoftwaresolutions.com Reply to: vineela@diasoftwaresolutions.com Role: Net/ERP DeveloperWork Arrangement: Hybrid/LocalWork Location: Richmond, VAAgency Interview Type: In Person OnlyDuration of the Project: 8 MonthsExperience: 15+ Years Subject: State of VA - VDOT ERP Developer 4 Job Id: 748487 Hi, Job ID# 748487 Agency”: State of VA- VDOT ERP Developer 4 Work Arrangement: Hybrid Work Location: 1401 East Broad StreetRichmond, VA 23219 Agency Interview Type: In Person Only Max Submittals by Vendor:2 Duration of the Project: 8+ Months Notes: Please look for candidates who have more than 14+ years of experience and with prior State govt exp is huge plus! Ideally Virginia candidate is highly preferredComplete Description:**Mgr. requests vendors ONLY submit candidates who already live in Richmond, VA**ALL interviews ONSITE**Long-Term position requires onsite 3 days a week at 1401 East Broad Street, Richmond VA**Assignment to be extended beyond 6/30, possibly 24 months**Contractor will be responsible for purchasing parking through VDOT’s Parking Management Office or procuring their own parking VDOT-AMD is seeking a Developer with 14 yrs or more .Net Web application development. Experience and fluency with C#, Angular or Blazor, SQL Server, jQuery, CSS3 and HTML5 experience VDOT is seeking a Full Stack Senior ERP Developer/Programmer with .Net Applications Development experience who will be responsible for managing, programming, testing, debugging and analysing complex software requirements to design and develop high quality components using the .NET Core framework. The ERP Developer will be programming the current budget and spend plan tool that is used agency wide for financial and budget management for the Maintenance Program. The Senior Developer is expected to program using best practices, prioritize programming work effectively and write system documentation as required. The successful candidate should have strong programming and communication skills to be effective in both technical and business requirement discussions. Primary responsibilities include: Ability to develop, program and code in .NET Core environment applications and backend services using C#, Web API, Java Script, JQuery, Angular or Blazor and CSS. Design, develop and program using appropriate software design patterns to attain high reusability and maintainability. Write effective unit tests and integration tests to ensure high quality software delivery. In-depth knowledge and skills in programming, system design patterns, tiered architecture, and testing practices. Understanding of key business processes and competitive strategies related to the IT function. Work with project architect, project manager, business owner and system analysts to clarify the requirements and then implement them. Participate in Agile SDLC. Fill the above skills in the below box and have consultant to complete SKILLS MATRIXSkillRequiredAmount of ExperienceExperienceC#.NET Development experienceRequired / DesiredAmountof Experience Required 14 Years Angular or Blazor Development experience Required5 Years Strong Database development experience using SQL Server Required14 Years Experience with Web APIRequired5 Years Experience with CSS3 and HTML5 Required5 Years Experience with Source Control using TFSRequired 10 Years Experience with Automated Builds using Microsoft Team FoundationRequired5 Years Excellent Troubleshooting skillsRequired12 Years Experience with Agile SDLC best practicesRequired5 Years Experience working in OracleDesired 2 Years Understanding of SOAP ServicesDesired 5 Years Familiar with Azure Cloud ConceptsNice to have 1 Years Experience with Power BINice to have 1 Years",
        "source": "Email",
        "date_posted": "2024-10-18 11:15:58-05:00",
        "unique_id": "192a08a877dbf45f",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]