[
    {
        "company": "HMG America LLC",
        "job_title": "SAP Project Manager",
        "location": "Ewing, NJ, USA",
        "full_location": {
            "city": "Ewing",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified",
            "job_code": "",
            "contact_person": "sanjeev",
            "email": "sanjeev@hmgamerica.com"
        },
        "skills": {
            "core": [
                "Project Management",
                "ERP Ecosystem",
                "S4 HANA",
                "MDG",
                "GRC",
                "APO",
                "SCM"
            ],
            "primary": [
                "Risk Management",
                "Budget Management",
                "Stakeholder Management",
                "Team Leadership"
            ],
            "secondary": [
                "SDLC",
                "Project Documentation",
                "Integration Management"
            ],
            "all": [
                "Project Management",
                "ERP Ecosystem",
                "S4 HANA",
                "MDG",
                "GRC",
                "APO",
                "SCM",
                "Risk Management",
                "Budget Management",
                "Stakeholder Management",
                "Team Leadership",
                "SDLC",
                "Project Documentation",
                "Integration Management"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "jd": "From: sanjeev, HMG America LLC sanjeev@hmgamerica.com Reply to: sanjeev@hmgamerica.com SAP Project Manager Onsite Role: Ewing, NJ Only local Contract Please dont share the resume if already submitted to HCL before for any position in the last 3-4 Months The Project Manager for Project Catalyst to Modernize and rationalize ERP Ecosystem including S4 HANA, MDG, GRC, APO / SCM, and New Legal Entity. The Project Manager is the single point of accountability for the delivery of one or more business information technology projects. This includes the management of the day-to-day work activities of the project, ensuring the quality of the team’s work, managing project scope, issues, risk, resources (internal and external resources) and budget. This position also coordinates and manages the project’s integration with other local and Global IT initiatives. This position is dedicated to project management activities and is not responsible for functional management of an IT department or area. Role Accountabilities and Responsibilities Manages the day-to-day work activities of project team members on implementation of moderate to high complexity business information technology systems, including: structuring and estimating the project with the business sponsor and account manager, organizing the team, assigning and monitoring tasks, identifying and resolving project issues, identifying and mitigating project risks, managing scope and schedule changes, managing the project budget, and reporting status Sets direction and communicates a clear vision of the project’s objectives and motivates the project team to achieve them. Coordinates with Global IT team to ensure that appropriate timing, resources, and sequencing of the work efforts are aligned to produce the desired result according to the project schedule Builds a strong relationship with the business owner and key stakeholders of the project, ensures that the project is aligned with customer expectations, and facilitates project decision making Creating a project environment that enables peak performance by team members: open disclosure of issues, alignment to project goals, coaching to clarify deliverables, escalation procedures, etc. Reviewing quality of work and managing integration of team members’ work Completes project close activities: analyzing & sharing lessons learned, completing project documentation, and analyzing estimate against actual hours Administer and utilize PM tools to ensure appropriate key project documentation is prepared throughout the project lifecycle (charter, design input/output form, financial templates, etc.) Applies appropriate IT processes and methods (e.g. SDLC) and application, technical, development, and architecture policies and standards in the completion of project work.",
        "source": "Email",
        "date_posted": "2024-10-18 10:30:57-05:00",
        "unique_id": "192a062046d479af",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]