[
    {
        "company": "VDart",
        "job_title": "Decision Science Analyst (DSA) or Business Intelligence Analyst (BIA)",
        "location": "San Antonio, TX, USA",
        "full_location": {
            "city": "San Antonio",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "8 years",
            "degree_required": "Degree in Economics, Mathematics, Finance, Statistics, or any other quantitative discipline",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SQL",
                "SAS",
                "Tableau"
            ],
            "primary": [
                "statistical techniques",
                "mathematical techniques",
                "data manipulation",
                "data analysis",
                "data visualization"
            ],
            "secondary": [
                "business analytics",
                "report development",
                "dashboard development",
                "financial domain knowledge",
                "industry best practices"
            ],
            "all": [
                "SQL",
                "SAS",
                "Tableau",
                "statistical techniques",
                "mathematical techniques",
                "data manipulation",
                "data analysis",
                "data visualization",
                "business analytics",
                "report development",
                "dashboard development",
                "financial domain knowledge",
                "industry best practices"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Balaji Kumar",
        "email": "balaji.kumar@dimiour.io",
        "jd": "Hi Hope you are doing well. Greetings from VDart!!!Our Direct client is looking to fill the below position as soon as possible. So, I would like to know if you are looking for this opportunity at this point of time? Let me know your comments. Decision Science Analyst (DSA) / Business Intelligence Analyst (BIA)San Antonio TX (Onsite)Contract Job responsibilities:Apply statistical and mathematical techniques and provide decision support for business Gather, manipulate and synthesize data, models to draw conclusions and make recommendationsLeverage business/ analytical knowledge to participate in discussions with cross functional teamsDocument assumptions, methodology, validation and testing Present results and recommendations to wider audiences Use visualization techniques to support your argumentSupport identifying and gathering the relevant and quality data sources required through testing or exploratory data analysis (EDA).Utilize data & analytics to provide superior actionable business insights and recommendations Preferred Skills & Qualifications:Degree in Economics, Mathematics. Finance, Statistics, or any other quantitative discipline with 8 years of experience in Quantitative analytics fieldStrong Expertise and Experience in SQL, SAS, and Tableau.Demonstrate competency in mathematical and statistical techniques and approaches used to drive fact-based decision-making.Working knowledge of identifying, documenting and analyzing business and/or data requirementsKnowledge of industry best practicesExperience in developing reports and DashboardsExpertise in deriving insights from various analysis and present outcomes to different set of stakeholders.Working experience in financial domain in preferred RegardsBalaji KumarTeam Lead",
        "source": "Email",
        "date_posted": "2024-10-18 07:16:56-05:00",
        "unique_id": "1929fafdef4abc5d",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]