[
    {
        "company": "Vyze Inc.",
        "job_title": "SQL DBA",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "8-10 years",
            "degree_required": "Bachelor's degree in engineering and/or related experience",
            "visa_sponsorship": "GC or USC",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SQL Server",
                "Azure",
                "T-SQL",
                "Database Administration",
                "Database Migration"
            ],
            "primary": [
                "MySQL",
                "Oracle",
                "Postgres",
                "CosmosDB",
                "MongoDB",
                "MariaDB",
                "Clustering",
                "High Availability"
            ],
            "secondary": [
                "Data Security",
                "Backup & Recovery tools",
                "Windows Server",
                "Active Directory",
                "Excellent written and verbal communication",
                "Team player",
                "Mentoring"
            ],
            "all": [
                "SQL Server",
                "Azure",
                "T-SQL",
                "Database Administration",
                "Database Migration",
                "MySQL",
                "Oracle",
                "Postgres",
                "CosmosDB",
                "MongoDB",
                "MariaDB",
                "Clustering",
                "High Availability",
                "Data Security",
                "Backup & Recovery tools",
                "Windows Server",
                "Active Directory",
                "Excellent written and verbal communication",
                "Team player",
                "Mentoring"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Rahul Mishra",
        "email": "rmishra@vyzeinc.com",
        "jd": "From: Rahul Mishra, Vyzeinc rmishra@vyzeinc.com Reply to: rmishra@vyzeinc.com Job Title: SQL DBALocation: RemoteVisa: GC or USCMOI – Skype Job Description· REQUIRED skills: o 8-10 years Sr. SQL Server DBA experienceo Must have successfully migrated on prem into Azureo Strong SQL Server knowledge along with infrastructure knowledge within Azureo Past experience with database migrations and toolsets into Azureo Strong clustering and HA experience. · · Stay updated with new database technologies and analyze such technologies to bring into scope of existing infrastructure.· Able to switch between OLTP and OLAP environments.· Bachelor's degree in engineering and/or related experience of 8-10+ years as DBA experience, expert level experience in at least one database technology platform, multi-platform preferred: MySQL, SQL Server, Oracle, Postgres, CosmosDB, MongoDB, MariaDB. SQL Server Required.· The applicant will need to have a deep understanding of integrated security and be able to participate in troubleshooting activities.· The ability to discuss database related topics with both technical & business audiences.· Troubleshoot, investigate, offer and execute resolution to database issues.· Monitor and report on database storage utilization.· Experience writing T-SQL and the ability to understand what others have developed.· Monitor, tune and manage scheduled tasks, backup jobs, recover processes, alerts, and database storage needs in line with firm change control procedures.· Perform fault diagnosis, troubleshoot and correct problems at the database and application performance level.· Work well in a team environment within the database administration team as well as with other Technical Service Group teams and other departments within the Wolters Kluwer.· Provide regular reports on performance and stability of database environment, identifying coming needs proactively to ensure continued reliable service.· Document, develop, test and implement updates to database systems.· Enjoy constantly learning new technologies and contributing to the knowledge of others. · Work outside of regular business hours as required for project or operational work. Experience· Experienced Database professional with at least 6-8+ years of experience in Database Administration.· Experience with all aspects of setup, maintenance, troubleshooting, monitoring, and security.· Experience with Upgrade/Migration of database platforms of On-Prem to cloud solutions.· Self-motivated, with the proven ability to work independently.· Take ownership of and proactively seek to improve on existing systems. Technical Skillsets· Solid Database Administration.· Building cloud model servers end to end a plus.· On-premises to Cloud DB migrations.· Data Security, Backup & Recovery tools.· Experience working with Windows server, including Active Directory.· Excellent written and verbal communication.· Flexible, team player, “get-it-done” personality.· Ability to organize and plan work independently.· Ability to work in a rapidly changing environment.· Management of database environments in cloud solutions. Soft Skills· Past experience supervision staff preferred but not required.· Ability to work independently.· Team oriented and places the success of the team over their own.· Mentors and guides other DBA’s when there are improvement opportunities.· Drives their own development.",
        "source": "Email",
        "date_posted": "2024-10-18 19:57:16-05:00",
        "unique_id": "192a267c56b95754",
        "emp_type": [
            "third party"
        ],
        "tag": "Oracle DBA"
    }
]