[
    {
        "company": "Techgene Solutions",
        "job_title": "Business Analyst",
        "location": "New York, NY, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "8+ years",
            "degree_required": "Bachelor's Degree or greater in Information Technology/computer systems engineering or equivalent experience",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Contract 12+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "insurance industry experience",
                "requirements gathering",
                "SQL",
                "data analysis",
                "project management"
            ],
            "primary": [
                "exception analysis",
                "problem-solving",
                "work management/ticketing solutions (ex. Jira)",
                "communication skills",
                "organizational skills"
            ],
            "secondary": [
                "natural curiosity",
                "innovative improvements",
                "ability to define and implement strategic support processes",
                "comfort with rapidly changing priorities"
            ],
            "all": [
                "insurance industry experience",
                "requirements gathering",
                "SQL",
                "data analysis",
                "project management",
                "exception analysis",
                "problem-solving",
                "work management/ticketing solutions (ex. Jira)",
                "communication skills",
                "organizational skills",
                "natural curiosity",
                "innovative improvements",
                "ability to define and implement strategic support processes",
                "comfort with rapidly changing priorities"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Vinay Kumar Vennu",
        "email": "vinay.v@techgene.com",
        "jd": "From: Vinay Kumar Vennu, Techgene Solutions vinay.v@techgene.com Reply to: vinay.v@techgene.com Role: Business AnalystLocation: Hybrid / Mid-town NYC, Wilmington, DE, Morristown, NJ, or Hartford, CT (4 days a week).Duration: Contract 12+ months NOTE: We’re looking for candidate who have recently worked for the Insurance Agency OR Domains OR Clients. VISA: USC, H4EAD, GC. H1B is not accepted for this position. Job Description:Must come from insurance background and can be located in any of above mentioned locations: The IT Business Analyst will work closely with business stakeholders and support organizations to analyze, design, and implement technology solutions that enhance operational efficiency and support the business objectives.Candidates must have insurance industry experience to be considered for this roleRequirements Gathering and Analysis:Collaborate with stakeholders to understand business needs and gather requirementsConduct detailed analysis of business processes and workflowsTranslate business requirements into functional specifications for IT solutionsSolution Design and Development:Work with IT teams to design system solutions that meet business needsDevelop and document technical specifications and system architecturesEnsure solutions align with industry standards and best practicesImplementation and Support:Coordinate with development teams to implement system changes and enhancementsConduct system testing and validation to ensure quality and functionalityProvide training and support to end-users on new systems and processesProject Management:Manage projects from inception through completion, ensuring timely deliveryMonitor project progress, identify risks, and implement mitigation strategiesPrepare project documentation and reports for stakeholdersContinuous Improvement:Identify opportunities for process improvements and efficiency gainsStay updated on industry trends, technologies, and regulatory changesRecommend and implement enhancements to existing systems and processes Qualifications:Bachelor's Degree or greater in Information Technology/computer systems engineering or equivalent experience8+ years’ experience as a Business Analyst in the insurance industryAbility to define and implement strategic support processes and solutionsException analysis and problem-solving abilitySQL and data analysis skillsExperience with work management/ticketing solutions (ex. Jira)Comfort with rapidly changing priorities, business needs, and conditionsExceptional oral and written communication skills, a communication style flexible to the situation, and able to communicate clearly and with a purposeCalm under pressure, possessing excellent organizational skills, integrity, and follow-through on tasks, able to challenge the norms while working collaboratively with colleagues at all levels of the organizationA strong sense of accountability and ownershipNatural curiosity, a love of learning how things work and always on the lookout for innovative improvements",
        "source": "Email",
        "date_posted": "2024-10-18 13:24:54-05:00",
        "unique_id": "192a1009020be77c",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]