[
    {
        "company": "Convex Tech Inc",
        "job_title": "Data Center Project Manager",
        "location": "Dallas, TX, USA",
        "full_location": {
            "city": "Dallas",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6-12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Data Centre Operations",
                "Logistics Coordination"
            ],
            "primary": [
                "Communication Skills",
                "Organizational Skills",
                "Asset Tracking"
            ],
            "secondary": [
                "IT Infrastructure",
                "Vendor Management",
                "Travel Coordination"
            ],
            "all": [
                "Project Management",
                "Data Centre Operations",
                "Logistics Coordination",
                "Communication Skills",
                "Organizational Skills",
                "Asset Tracking",
                "IT Infrastructure",
                "Vendor Management",
                "Travel Coordination"
            ],
            "with_experience": [
                "Project Management",
                "Data Centre Operations"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Sarfaraz Khan",
        "email": "sarfaraz@convextech.com",
        "jd": "From: sarfaraz, convextech Inc sarfaraz@convextech.com Reply to: sarfaraz@convextech.com HiHope you are doing good.!!Please let me know if you are interested in the position below Title: Data Center Project ManagerLocation: Texas U.S. sites (with potential for future international travel)Duration: 6-12MonthsVISA:Only USC OR GC(Not GC EAD) Monday to Friday, approximately 40 hours per week, onsite at data centre---------------------------JOB DESCRIPTION---------------------------Job Description:We are seeking a highly skilled Data Center Project Manager to support our team of engineers at various data centre locations across the United States, with the potential for future international travel.This is a hands-on role that requires the PM to participate alongside engineers in lab training and site visits to gain a full understanding of the project scope and ensure successful project execution. Key Responsibilities:Project Coordination: Work closely with Data Centre engineers during weekly site visits and participate in lab training to gain a comprehensive understanding of the project’s technical scope.Communication & Reporting: Provide daily reports and updates on site activities. Serve as the point of contact for all project-related communications and escalate site issues as needed.Site Logistics: Manage the logistical aspects of the project, including coordinating with onsite personnel, arranging access, and ensuring all materials and equipment are delivered on time.Asset Tracking: Maintain accurate records of new and existing equipment, including serial numbers, asset tags, and other key data in a shared tracking spreadsheet. Oversee the asset lifecycle from deployment to decommission.Logistics Coordination: Work directly with partners to manage the shipment and return of data centre equipment (inbound and outbound logistics, including Return Merchandise Authorization (RMA) gear).Travel: Follow the same travel schedule as the engineering team, with weekly site visits across the U.S. Some international travel may be required in the future. Qualifications:Proven experience in project management, particularly in data centre or IT infrastructure projects.Strong communication and organizational skills, with an ability to manage multiple tasks in a fast-paced environment.Familiarity with logistics coordination, asset tracking, and working with third-party vendorsAbility to travel to various U.S. data centre locations and potentially international sites in the future.Experience working on Corp to Corp contracts, and eligible to work in the U.S.Thanks and RegardsSarfaraz KhanUS IT Recruiter | Convex Tech InEmail: sarfaraz@convextech.com",
        "source": "Email",
        "date_posted": "2024-10-18 16:50:00-05:00",
        "unique_id": "192a21ab57d4b03d",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]