[
    {
        "company": "KPG99",
        "job_title": "Project/Release Manager",
        "location": "Alpharetta, GA, USA",
        "full_location": {
            "city": "Alpharetta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party",
                "contract"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Agile"
            ],
            "primary": [
                "Strong communication",
                "Facilitation skills",
                "Experience preparing and leading quarterly planning sessions",
                "Experience coordinating releases",
                "Experience working with executive, development, product, and infrastructure teams",
                "Experience building agile and waterfall project plans",
                "Experience creating and tracking project performance metrics"
            ],
            "secondary": [
                "Agile/PM certifications",
                "Jira",
                "Confluence",
                "Clarity"
            ],
            "all": [
                "Project Management",
                "Agile",
                "Strong communication",
                "Facilitation skills",
                "Experience preparing and leading quarterly planning sessions",
                "Experience coordinating releases",
                "Experience working with executive, development, product, and infrastructure teams",
                "Experience building agile and waterfall project plans",
                "Experience creating and tracking project performance metrics",
                "Agile/PM certifications",
                "Jira",
                "Confluence",
                "Clarity"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Rama Kumari",
        "email": "rkumari@kpgtech.com",
        "jd": "From: Rama Kumari, KPG99 rkumari@kpgtech.com Reply to: rkumari@kpgtech.com Job Title: Project/Release Manager Job Location: Alpharetta, GA (100% Onsite) Employment Type: C2H Duration: Long Term Work Eligibility: USC/GC/GCEAD Key Technology: Project Management, Agile Job Responsibilities: Ensure project methodologies, project delivery processes, and implementation management processes are followed. Manage the project budget. This includes understanding and validating estimates, cost variance tracking, and managing project resources effectively. Provide Project/Program status i.e., Mission Critical Program Updates (weekly meeting) and Clarity Reporting. Provide clear and concise project communication - both written and verbal. Ensure adherence to and proper organization usage of project/program management practices in alignment with an agile methodology implementation. Facilitate/manage project communications and stakeholder, client, and project team expectations. Report on KPIs related to pipeline and execution portfolios, financials, and performance measures. Support Backlog & Capacity Management through the management of new project flow into development. Create and maintain project & capacity forecasting including allocations and variance. Maintain Clarity (PPM tool), JIRA Management and publish appropriate reports to create transparency. Skills and Experience Required: Required: Experience preparing and leading quarterly planning sessions with multiple delivery teams (PI Planning) Experience coordinating releases Experience working with executive, development, product, and infrastructure teams Strong communication, and facilitation skills Experience building agile and waterfall project plans Experience creating and tracking project performance metrics (preferably using Jira) Must be able to work in the office 5 days per week; and be flexible to working nights and weekends Desired: Agile/PM certifications Tools: Jira, Confluence, Clarity",
        "source": "Email",
        "date_posted": "2024-10-18 11:05:08-05:00",
        "unique_id": "192a0d242c5f5dcc",
        "emp_type": [
            "third party",
            "contract"
        ],
        "tag": "Project Manager"
    }
]