[
    {
        "company": "Source InfoTech Inc",
        "job_title": "Database Ops Support",
        "location": "Salt Lake City, UT, USA",
        "full_location": {
            "city": "Salt Lake City",
            "state": "UT",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "3+ years",
            "degree_required": "High School Diploma, Bachelor's Degree preferred",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Long Term Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "DB2",
                "Sybase ASE",
                "Sybase IQ",
                "Database Administration",
                "Red Hat Enterprise Linux"
            ],
            "primary": [
                "DB2 Replication",
                "Sybase Replication",
                "Performance Tuning",
                "Troubleshooting",
                "Analytical skills"
            ],
            "secondary": [
                "Banking experience",
                "Retail experience",
                "Healthcare experience",
                "Insurance experience",
                "Job scheduler bash",
                "Autosys",
                "Cron jobs"
            ],
            "all": [
                "DB2",
                "Sybase ASE",
                "Sybase IQ",
                "Database Administration",
                "Red Hat Enterprise Linux",
                "DB2 Replication",
                "Sybase Replication",
                "Performance Tuning",
                "Troubleshooting",
                "Analytical skills",
                "Banking experience",
                "Retail experience",
                "Healthcare experience",
                "Insurance experience",
                "Job scheduler bash",
                "Autosys",
                "Cron jobs"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Sweety",
        "email": "sweety@sourceinfotech.com",
        "jd": "From: Sweety, Source InfoTech Inc sweety@sourceinfotech.com Reply to: sweety@sourceinfotech.com Hi,Hope you all are doing well,Please find the job description below,Title: Database Ops SupportLocation: Salt Lake City, Utah/5 days a week onsite (only local candidates needed)Duration: Long Term Contract Visa: No H1B or CPT LinkedIn NeededBanking experience must Job Description:JOB DUTIES: Perform Database Administration Operational Support activities as part of the Firm's Technology Services Operations Team. Provide production support for Sybase Adaptive Server Enterprise, Sybase IQ, UDB DB2, Sybase Replication, UDB DB2 SQL Rep and Q Replication, Paraccel, Postgres, Hadoop, MSSQL, Mongo DB, Oracle database infrastructure globally. Support the following hardware: Sun v240/440/4800/420r, Dell r610/710, HP 385/585/480 Blades Administer and maintain an existing local / global Database infrastructure including implementation, operational support, and periodic upgrades of all infrastructure Database servers. Continually evaluate the operations of the environment and assist in the optimization and delivery of server infrastructure Schedule maintenance jobs using Autosys Perform root cause analysis on system failures and incidents and provide remediation solutions. Communicate and coordinate with application support and other IT support teams to provide timely responses for critical requests. Perform daily monitoring of Database infrastructure for Healthcheck, Application and Replication Alerts. Responsible for Provisioning activities, User requests and Resolution alerts. Involves in Business Continuity plan tests across all regions related to Database infrastructure... Adhere to company change management requirements and procedures. Create policies and procedures for regular operational activities. Manage small project initiatives within the Database team across large portions of the enterprise including datacenter migrations and End Of life Database software's and hardware's. Organize Database Trainings locally and globally for Database Team. Perform basic file system administration tasks including expansion and device carving using native Red Hat Enterprise Linux 5/6 multipath utilities Skills: MINIMUM YEARS EXPERIENCE REQUIRED: 3+ years of experience in the job offered or a related Database Administration role SPECIAL SKILLS AND/OR LICENSES REQUIRED TO PERFORM THE JOB: Must have 3+ years of experience with: For DB2 candidate:Supporting the following platforms: Red Hat Enterprise Linux v3/4/5/6 and Sun Solaris 5.8/10 Strong experience in UDB/DB2 database administration, maintenance and implementation in a complex system environment Extensive exposure to DB2 Replication including SQL Rep and Q replication. Strong knowledge DB2 HADR ( High Availability Disaster Recovery ) Strong knowledge of DB2 Version upgrades and DB2 Builds. Strong knowledge of DB2 Transportable Tablespaces. DB2 Database design, development and maintenance. For Sybase Candidate: Supporting the following platforms: Red Hat Enterprise Linux v3/4/5/6 and Sun Solaris 5.8/10 Database Platform: Sybase ASE, Sybase IQ, Sybase Replication. Extensive exposure to Sybase ASE 16.x,15.x, ASE 12.x database administration under Linux platform. Strong experience in Sybase database administration, maintenance and implementation in a complex system environment Strong Sybase Replication experience (Replication Server 15.x, 12.x) and knowledge on Distributed Database Management System Strong Knowledge in Performance Tuning for Databases. AND for both Strong working knowledge on DBA tasks, troubleshooting and analytical skills IT Experience with Solid understanding of Banking, Retail, healthcare and Insurance domains and its processes Flexible to work in weekend shifts. Good Interpersonal skills to interact with global Teams. Knowledge in job scheduler bash; Autosys, cron jobs etc... Ability to work and effectively prioritize in a highly dynamic work environment that includes a global focus. Strong team player, good communication and interpersonal skills. Results oriented and highly flexible. Education: High School DiplomaBachelor’s Degree preferred Thanks,SweetyIT RecruiterSource InfoTech Inc.,Voice: (609) 934-3545 Ext - 135Email: sweety@sourceinfotech.com Disclaimer: If you are not interested in receiving our e-mails then please reply with a \"REMOVE\" in the subject line at remove@sourceinfotech.com for automatic removal. And mention all the e-mail addresses to be removed with any e-mail addresses, which might be diverting the e-mails to you. We are sorry for the inconvenience",
        "source": "Email",
        "date_posted": "2024-10-18 10:00:12-05:00",
        "unique_id": "192a045cc571db49",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "DB Admin"
    }
]