[
    {
        "company": "Siri InfoSolutions Inc",
        "job_title": "Business Analyst-Hyperion",
        "location": "Des Moines, IA, USA",
        "full_location": {
            "city": "Des Moines",
            "state": "IA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Hyperion applications",
                "Integration management",
                "Change management"
            ],
            "primary": [
                "Customer discussions",
                "Technical support",
                "Application support"
            ],
            "secondary": [
                "Coordination with IT",
                "Performance Management applications",
                "System upgrades"
            ],
            "all": [
                "Hyperion applications",
                "Integration management",
                "Change management",
                "Customer discussions",
                "Technical support",
                "Application support",
                "Coordination with IT",
                "Performance Management applications",
                "System upgrades"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Rupender Sharma",
        "email": "rupender.shrama@siriinfo.com",
        "jd": "Hello,Trust this e-mail finds you in good cheer!!I'm Rupender from SiriInfo. I have an opportunity with me you might be interested, please review the Job specifications below and let me know if you may be interested in this opening or may refer someone to me for this. For you reference, please find Job Description as underJob Title – Business Analyst-HyperionLocation – Des Moines, IA (Onsite)Duration – 12+ Months Contract JOB DESCRIPTION:The Hyperion Analyst will work closely with business partners and coordinate with IT (offshore application support and Infrastructure team). Responsible for supporting the existing Hyperion applications as well as performing end to end coordination on any new enhancements, infrastructure updates, tech refresh etc.Administration and support of Hyperion applications and Integrations through incidents, requests and change management. Drive customer discussions independently and act as trusted advisor for solutions. Liaise with business users and technical offshore teams (application and infrastructure).Participate in the design and development of required changes to existing Enterprise Performance Management applications. Plan, coordinate and implement migrations and deployments related to system upgrades, improvements and maintenance of Oracle Hyperion Modules. Act as technical contact for Hyperion Application addressing key data and technical issues.",
        "source": "Email",
        "date_posted": "2024-10-18 09:05:54-05:00",
        "unique_id": "192a036f4dbacfdf",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]