[
    {
        "company": "tek inspirations",
        "job_title": "Product manager",
        "location": "Settle, WA, USA",
        "full_location": {
            "city": "Settle",
            "state": "WA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Bachelor's Degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "9 Month",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Full Stack .Net Product manager",
                "Microsoft Power Business Intelligence (BI)",
                "Project Management Office (PMO)",
                "Supply Chain Management (SCM)"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Full Stack .Net Product manager",
                "Microsoft Power Business Intelligence (BI)",
                "Project Management Office (PMO)",
                "Supply Chain Management (SCM)"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Shivani Sharma",
        "email": "shivani.sharma@tekinspirations.com",
        "jd": "From: shivani sharma, tek inspirations shivani.sharma@tekinspirations.com Reply to: shivani.sharma@tekinspirations.com Job Description -Product managerHybridSettle,Washington9 MonthDescription:Must Haves: Bachelor's Degree and 5 years experience as a Full Stack .Net Product manager Microsoft Power Business Intelligence (BI) (P3 - Advanced) Project Management Office (PMO) (P3 - Advanced) Supply Chain Management (SCM) (P3 - Advanced) Full Stack .Net Technical Product Manager (Hybrid)Overview: Lead the effort to design, build and configure applications, acting as the primary point of contact. Responsibilities: Developing a business process definition repository and implementing Business Activity Monitoring (BAM) for Supply Chain (SC) business operations. ?? Utilizing process mining for process optimization and providing a real-time transactional view across systems for Critical Service Operations (CSOs). ?? Improving monitoring capabilities, including Quality of Service (QoS) and BAM. ?? Creating structure through system definition and information architecture to support product usability ?? Crafting terminology, product and feature naming, and conducting research to optimize product experience and interface ??Influencing design to ensure the finished product meets user requirements and needs. ?? Collaborating to develop system guidelines and design features. ? Developing and implementing communication strategy to devise and support product. Qualifications: Bachelor's Degree and 5 years experience as a Full Stack .Net Product managerMicrosoft Power Business Intelligence (BI) (P3 - Advanced) Project Management Office (PMO) (P3 - Advanced) Supply Chain Management (SCM) (P3 - Advanced)",
        "source": "Email",
        "date_posted": "2024-10-18 11:01:09-05:00",
        "unique_id": "192a07cf407fb324",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]