[
    {
        "company": "Smart IT Frame",
        "job_title": "Sr. Java Tech Lead",
        "location": "Wilmington, DE, USA",
        "full_location": {
            "city": "Wilmington",
            "state": "DE",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Core Java",
                "Java 11",
                "Spring Boot",
                "Oracle PL/SQL",
                "AWS"
            ],
            "primary": [
                "Angular 9",
                "Microservices",
                "RESTful APIs",
                "Mongo DB"
            ],
            "secondary": [
                "Application Development",
                "Agile Methodologies",
                "Collaboration",
                "Cloud Deployment"
            ],
            "all": [
                "Core Java",
                "Java 11",
                "Spring Boot",
                "Oracle PL/SQL",
                "AWS",
                "Angular 9",
                "Microservices",
                "RESTful APIs",
                "Mongo DB",
                "Application Development",
                "Agile Methodologies",
                "Collaboration",
                "Cloud Deployment"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Vasanth G",
        "email": "vasanth@smartitframe.com",
        "jd": "From: Vasi, Smart IT Frame vasanth@smartitframe.com Reply to: vasanth@smartitframe.com Hi,Greetings from Smart IT Frame, Hope you are doing well!!!Smart IT Frame specializes in enabling you with your most critical line of resources. Whether it’s for permanent staffing, contract staffing, contract-to-hire or executive search, we understand the importance of delivering the most suitable talent; on time and within budget. With our Core focus in emerging technologies, we have provided global technology workforce solutions in North America, Canada & India. We take pride in delivering specialized talent, superior performance, and seamless execution to meet the challenging business needs of customers worldwide. Role: Sr. Java Tech LeadLocation: Wilmington, DE (Hybrid) JD:As a Software Engineer, you will work as part of a cross-functional team responsible for the end-to-end, full stack development of the application. While each team member has a primary skill set, they are also expected to learn and contribute to areas outside of their primary skill set. The team is highly collaborative and values continuous improvement and open communication. You will be expected to be a well-regarded and respected individual contributor; possess strong inter-personal skills, as well as proven track record of application development with skills in Java, distributed cache technology and building scalable robust systems. In return you will have opportunity to gain exposure to designing, developing and deploying applications to the internal/external cloud.This role requires a wide variety of strengths and capabilities, including:• Proficiency in one or more general purpose programming languages; Core Java• Java development experience with knowledge of Java 11 and above• Angular 9 and above• Spring Framework• RESTful micro services• Oracle PL/SQL, Mongo DB knowledge is mandatorily required• Extensive Hands-on Experience in AWS Development is mandatory• Advanced knowledge of application, data and infrastructure architecture disciplines• Understanding of architecture and design across all systems• Working proficiency in developmental toolsets• Ability to collaborate with high-performing teams and individuals throughout the firm to accomplish common goalsJob Duties:1. Develop Microservices with Spring Boot for the application2. Develop API using Microservices Architecture using Java in AWS Cloud environment3. Work with Business and Product Teams to gather requirements and translate to Design and Code4. Work in Agile environment with regular SprintsProvide POC/Demo to Business Teams at the end of each SprintMandatory Skills:1. Core Java, Java 11, Spring Boot, Oracle SQL Hands-on Development experience2. Hands-on extensive AWS experience is mandatory3. Angular 94. Microservices/ Rest APIThanks and RegardsVasanth GTalent Acquisition GroupEmail: vasanth@smartitframe.com",
        "source": "Email",
        "date_posted": "2024-10-18 10:05:29-05:00",
        "unique_id": "192a04a1f11ad024",
        "emp_type": [
            "full-time",
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]