[
    {
        "company": "State of VA",
        "job_title": ".Net Developer with ERP",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "748487",
            "experience_required": "14 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "C#",
                ".NET Development",
                "SQL Server",
                "Angular",
                "Blazor"
            ],
            "primary": [
                "Web API",
                "JavaScript",
                "jQuery",
                "CSS3",
                "HTML5"
            ],
            "secondary": [
                "Source Control using TFS",
                "Automated Builds using Microsoft Team Foundation",
                "Agile SDLC best practices",
                "Oracle",
                "SOAP Services",
                "Azure Cloud Concepts",
                "PowerBI"
            ],
            "all": [
                "C#",
                ".NET Development",
                "SQL Server",
                "Angular",
                "Blazor",
                "Web API",
                "JavaScript",
                "jQuery",
                "CSS3",
                "HTML5",
                "Source Control using TFS",
                "Automated Builds using Microsoft Team Foundation",
                "Agile SDLC best practices",
                "Oracle",
                "SOAP Services",
                "Azure Cloud Concepts",
                "PowerBI"
            ],
            "with_experience": [
                "C# (14 years)",
                "SQL Server (14 years)",
                "Angular or Blazor (5 years)",
                "Web API (5 years)",
                "CSS3 (5 years)",
                "JavaScript (5 years)",
                "Excellent Troubleshooting skills (12 years)",
                "Agile SDLC best practices (5 years)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Ramesh",
        "email": "ramesh@aspiredsolutions.com",
        "jd": "Hello,Hope you are doing great, If you are actively or passively searching for new opportunities, I would like to make you aware of a .Net Developer with ERP role within the State of VA located in Richmond, VA. I will be happy to discuss what you may be looking for in your next role and what this position will offer your career.Our client is targeting a start date on this role as soon as next week and they are currently scheduling interviews. A description of the position is included below, and I will be happy to discuss this role in greater detail and learn about your expertise in the area at your earliest convenience. To learn more, please do not hesitate to reach back out to me at 717-297-0570 Role.Net Developer with ERPLocationRichmond, VA (Locals Only)DurationLong Term ContractMode of InterviewIn-Person onlyNo New Submittals after 10/23/2024 Long Term Full Stack Developer with 14 years .NET experience **Mgr requests vendors ONLY submit candidates who already live in Richmond, VA**ALL interviews ONSITE**Long-Term position requires onsite 3 days a week at 1401 East Broad Street, Richmond VA**Assignment to be extended beyond 6/30, possibly 24 months**Contractor will be responsible for purchasing parking through VDOT’s Parking Management Office or procuring their own parkingVDOT-AMD is seeking a Developer with 14 yrs or more .Net Web application development. Experience and fluency with C#, Angular or Blazor, SQL Server, JQuery, CSS3 and HTML5 experienceVDOT is seeking a Full Stack Senior ERP Developer/Programmer with .Net Applications Development experience who will be responsible for managing, programming, testing, debugging and analyzing complex software requirements to design and develop high quality components using the .NET Core framework. The ERP Developer will be programming the current budget and spend plan tool that is used agency wide for financial and budget management for the Maintenance Program. The Senior Developer is expected to program using best practices, prioritize programming work effectively and write system documentation as required. The successful candidate should have strong programming and communication skills to be effective in both technical and business requirement discussions. Primary responsibilities include: •Ability to develop, program and code in .NET Core environment applications and backend services using C#, Web API, Java Script, JQuery, Angular or Blazor and CSS. •Design, develop and program using appropriate software design patterns to attain high reusability and maintainability. •Write effective unit tests and integration tests to ensure high quality software delivery. •In-depth knowledge and skills in programming, system design patterns, tiered architecture, and testing practices. •Understanding of key business processes and competitive strategies related to the IT function. •Work with project architect, project manager, business owner and system analysts to clarify the requirements and then implement them. •Participate in Agile SDLC. SkillRequiredYears UsedLast UsedC#.NET Development experience14 years Angular or Blazor Development experience5 years Strong Database development experience using SQL Server14 years Experience with Web API5 years Experience with CSS3 and HTML55 years Experience with Source Control using TFS10 years Experience with Automated Builds using Microsoft Team Foundation5 years Excellent Troubleshooting skills12 years Experience with Agile SDLC best practices5 years Experience working in Oracle2 years Understanding of SOAP Services5 years Familiar with Azure Cloud Concepts1 year Experience with PowerBI1 year",
        "source": "Email",
        "date_posted": "2024-10-18 09:23:40-05:00",
        "unique_id": "192a044080065b14",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]