[
    {
        "company": "Techgene Solutions LLC",
        "job_title": "AWS Platform Architect or Engineer or Infrastructure",
        "location": "New York, NY, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "12-15+ years",
            "degree_required": "Bachelor's degree in Computer Science or related field",
            "visa_sponsorship": "Any visa, expect OPT",
            "notice_period": "One Day’s notice",
            "duration": "1 year+",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "AWS Platform Architecture",
                "AWS services",
                "Kubernetes",
                "Terraform",
                "CI/CD"
            ],
            "primary": [
                "AWS certifications",
                "Architect/TOGAF certifications",
                "Excellent communication skills"
            ],
            "secondary": [
                "Git",
                "GitHub",
                "Git Actions",
                "Argo CD",
                "multi-region deployments",
                "networking concepts"
            ],
            "all": [
                "AWS Platform Architecture",
                "AWS services",
                "Kubernetes",
                "Terraform",
                "CI/CD",
                "AWS certifications",
                "Architect/TOGAF certifications",
                "Excellent communication skills",
                "Git",
                "GitHub",
                "Git Actions",
                "Argo CD",
                "multi-region deployments",
                "networking concepts"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Raj",
        "email": "raj.s@techgene.com",
        "jd": "From: Raj, Techgene raj.s@techgene.com Reply to: raj.s@techgene.com I tried to reach you for the below position AWS Platform Architect or Engineer or Infrastructure and Hybrid or NYC Midtown or TRI State I hope you are well. I am (Raj) with Techgene Solutions LLC. We’re AWS Platform Architect or Engineer or Infrastructure and I think your experience is a great fit for this role. If you’re interested in learning more, I’d love to connect with you. Please review the Job description below and let me know if you are comfortable. I look forward to hearing from you soon. Thank you! Please share your profiles to raj.s@techgene.com or you can reach me at 972-580-0247 Ext 253 CHECKPOINT Full Legal Name Contact Number Email ID Date of Birth (MM/DD) Last 4 Digit SSN Current Location with Zip Code Two LinkedIn references from their recent two projects Work Authorization/Visa Status Passport Number Corporation Name Open to relocate OR Travel LinkedIn Total Years of IT Experience Education DetailsUniversity, year: US Experience A very senior (12-15+ years) AWS Platform/Infrastructure Architect with extensive experience to: - Design, implement, and manage highly scalable and reliable cloud infrastructure solutions based on AWS services. - Deploy and manage Kubernetes clusters using best practices and industry standards. - Develop and maintain CI/CD pipelines utilizing Git, GitHub, and Git Actions for efficient and automated deployments. - Utilize Terraform to automate infrastructure provisioning and configuration management. **Requirements:** - Candidates must have: - AWS certifications. - Architect/TOGAF certifications. - Long project history and good tenure. - Excellent communication skills. - A state-issued ID (not bills) showing local residency. **Additional Notes:** - Candidates need to be within a two-hour commute to Midtown for occasional onsite events.- I want to see all qualified candidates even if they are over the target rate. The client is flexible. Position: AWS Platform Architect/Engineer/Infrastructure Location: Hybrid/NYC Midtown/TRI State Duration: 1 year+ Interview Required: Video.Visa: Any visa, expect OPTSub contracting: YesCandidates must be: LOCAL to the New York or New Jersey area and able to commute into the office a few times a quarter. No relocation considered. **Submission Guidelines:** - Please only send candidates in the NY/NJ area open to hybrid work (a few times a quarter).- Each submission must include: 1. Driver’s license or state ID. 2. Link to the candidate's LinkedIn account. 3. Below submission format. *** Candidate Must Have’s on a resume and for submittal: 1. How many years working with: AWS Platform Architecture2. How many years working with: AWS services, including EKS, S3, RDS, IAM, VPC3. How many years working with: Deploy and manage Kubernetes clusters4. How many years working with: Terraform5. How many years working with: AWS Certified Solutions Architect, Certified Kubernetes Administrator (CKA)*** Please provide all the below Submittal Format details with each submittal. It is required for the client Management system.· Full Name:· Rate: · Location: · Availability to Interview: One Day’s notice· Availability to Start: · Email Address: · Phone Number: · Visa Status:· Education - College/Year of graduation:· Link to LinkedIn? · Certifications (Please list)? **Requirements:** Bachelor's degree in Computer Science or related field, strong AWS experience (EKS, S3, RDS, IAM, VPC), proficiency in Git and CI/CD tools, hands-on with Argo CD, knowledge of multi-region deployments, and familiarity with networking concepts. Relevant certifications are a plus.",
        "source": "Email",
        "date_posted": "2024-10-18 11:58:33-05:00",
        "unique_id": "192a11280a5ea833",
        "emp_type": [
            "full-time",
            "contract",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]