[
    {
        "company": "InfoLogitech, Inc",
        "job_title": ".Net Developer",
        "location": "Little Rock, AR, USA",
        "full_location": {
            "city": "Little Rock",
            "state": "AR",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "749476",
            "experience_required": "2 years",
            "degree_required": "Bachelor of Science in Computer Science or a related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "8 Months",
            "rate": "$48/hour"
        },
        "skills": {
            "core": [
                ".NET Core",
                "Entity Framework Core",
                "C#",
                "RESTful web APIs",
                "REACT",
                "Next JS",
                "Material UI"
            ],
            "primary": [
                "Cloud-based application development",
                "JavaScript",
                "CSS",
                "HTML",
                "Version Control Systems",
                "AWS Services",
                "AWS Lambda"
            ],
            "secondary": [
                "Analytical skills",
                "Problem-solving skills",
                "Interpersonal skills",
                "Teamwork",
                "Ability to work under pressure",
                "Ability to learn new technologies"
            ],
            "all": [
                ".NET Core",
                "Entity Framework Core",
                "C#",
                "RESTful web APIs",
                "REACT",
                "Next JS",
                "Material UI",
                "Cloud-based application development",
                "JavaScript",
                "CSS",
                "HTML",
                "Version Control Systems",
                "AWS Services",
                "AWS Lambda",
                "Analytical skills",
                "Problem-solving skills",
                "Interpersonal skills",
                "Teamwork",
                "Ability to work under pressure",
                "Ability to learn new technologies"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Megha",
        "email": "mveeranki@infologitech.com",
        "jd": "Hi Greetings from Info Logitech, IncHere is our open requirement which can be filled immediately Kindly respond to this requirement with your resume, contact and current location info to speed up the interview process Job Position : AOC .Net Deveoper - 749476Job Location : Little Rock, ARJob Duration : 8 Months Job Description:The Developer will be part of a cross-functional team that is responsible for the full software development life cycle, from conception to deployment of a court management program. The court management program will be a cloud-based system. ON-SITE WORK ONLY. These positions are available for extensions. The Administrative Office of the Courts (AOC) is an agency within the judicial branch of government that works to support the state courts on behalf of the Arkansas Supreme Court. The Court Information Systems Division (CIS) is responsible for providing technological support to the state’s courts, making court information available to the public, and developing and implementing online, court-related services. CIS is a team-based organization using the Disciplined Agile framework. You may view our Statement of Core Values at https://www.arcourts.gov/modernization/statement-core-values.POSIPOSITION SUMMARY:The AOC Programmer is responsible for developing and supporting applications that support the Arkansas Judiciary. The Programmer will be part of a cross-functional team that is responsible for the full software development life cycle, from conception to deployment of a court management program. The court management program will be a cloud-based system. JOB DUTIES:Work on an Agile team that employs the Disciplined Agile MethodologyWork with the build new team to develop and integrate a veteran’s application with the new court management systemDesign, code, debug, and test application software and reports.Monitor, optimize, and tune applications and reports for maximum performance.Execute tasks conforming to formal techniques, standards, policies, and procedures.Troubleshoot user-reported application and report issues.Document and report on daily progress, procedures, and activities.Other duties as assigned QUALIFICATIONS:EducationA Bachelor of Science degree in Computer Science or a related fieldExperienceTwo years of experience in an application development role KNOWLEDGE, SKILLS, ABILITIES:Knowledge of DOTNET Core and Entity Framework Core frameworksKnowledge of, REACT, Next JS, Material UIKnowledge of and experience developing with the C# programming languageKnowledge of or experience developing solutions in the cloudKnowledge of database systems like Postgres and the integration of those databases into the development of system softwareKnowledge of and experience developing with JavaScript, CSS, and HTMLKnowledge of and experience working with version control systems like GITKnowledge of AWS servicesKnowledge of AWS lambdaAbility to develop visually appealing front-end websites including translating mock-ups into front-end codeAbility to design and implement automated testing including test driven developmentAbility to design and develop RESTful web APIsStrong analytical and problem-solving skillsStrong interpersonal skillsAbility to work as part of a team.Ability to work well under pressure and meet deadlines.Ability to learn new technologies and maintain technical currencyProgrammers/Software Engineers must be familiar with industry accepted business practices and computer application development and support methodologies.",
        "source": "Email",
        "date_posted": "2024-10-15 09:50:04-05:00",
        "unique_id": "19290c9c9ce752bb",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]