[
    {
        "company": "Yochana Solutions Inc.",
        "job_title": "QA Project Manager",
        "location": "Houston, TX, USA",
        "full_location": {
            "city": "Houston",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6-12 Months",
            "rate": "$60/HR on C2C"
        },
        "skills": {
            "core": [
                "root cause analysis",
                "technical assistance",
                "continuous improvement",
                "collaboration"
            ],
            "primary": [
                "customer issue resolution",
                "product feedback",
                "process improvement"
            ],
            "secondary": [
                "innovation",
                "automation",
                "efficiency enhancements"
            ],
            "all": [
                "root cause analysis",
                "technical assistance",
                "continuous improvement",
                "collaboration",
                "customer issue resolution",
                "product feedback",
                "process improvement",
                "innovation",
                "automation",
                "efficiency enhancements"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Madhulatha",
        "email": "madhulatha@yochana.com",
        "jd": "Hello,I’m a Technical Recruiter with Yochana Solutions Inc., a national IT staffing solutions provider with 14+ years of experience delivering value to leading companies across the U.S.A. and Canada,I'm currently staffing for QA Project Manager – Houston, TX - Onsite, Below you will find the job description, if you are qualified and interested, please send me your Updated Word Document Resume.I'm very sorry if this position is not an ideal fit, We'll keep you in mind for other suitable positions and referrals would be appreciated.Thank you so much for your attention and participation.Job Role: QA Project ManagerJob Location: Houston, TX - OnsiteProject Duration: 6-12 MonthsRate : 60/HR on C2CJob Description: To execute continuous improvement activities, work on root cause analysis, and provide technical assistance to resolve customer issues.(1.) To act as a point of escalation for complex and high-priority customer issues, ensuring timely resolution. (2.) To create the root cause analysis for critical issues and put in place necessary preventive measures to reduce future defects. (3.) To collaborate closely with product management, development, and QA teams to provide feedback on product improvements, influence product design, and ensure alignment with customer needs. (4.) To provide technical assistance to the team members in resolving customer issues.(5.) To drive continuous improvement initiatives for support processes, workflows and Identify opportunities for innovation, automation, and efficiency enhancements.",
        "source": "Email",
        "date_posted": "2024-10-15 10:10:10-05:00",
        "unique_id": "19291181fbb960cc",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]