[
    {
        "company": "StellarIT Solutions",
        "job_title": "Data Engineer(Gen AI)",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5-10 years",
            "degree_required": "Bachelor's degree in Computer Science or similar, advanced degree preferred",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Azure API",
                "Python",
                ".Net",
                "C#"
            ],
            "primary": [
                "Gen AI",
                "Azure Certifications"
            ],
            "secondary": [
                "Java",
                "Node.js",
                "API development",
                "Security and data protection",
                "Automated testing",
                "Documentation"
            ],
            "all": [
                "Azure API",
                "Python",
                ".Net",
                "C#",
                "Gen AI",
                "Azure Certifications",
                "Java",
                "Node.js",
                "API development",
                "Security and data protection",
                "Automated testing",
                "Documentation"
            ],
            "with_experience": [
                "Azure API (5-10 years)",
                "Python (5-10 years)",
                ".Net (5-10 years)",
                "C# (5-10 years)"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Usha Geethari",
        "email": "ushar@stellarit.com",
        "jd": "Hi , This is Usha form Stellar IT Solutions! You intrigued us in your profile; hence I have a Great Opportunity for you with our direct client so kindly view the below job description and let me know your interest to proceed further. Fully Remote, supporting EST hoursVideo Interview process ***When submitting profiles please share LinkedIn profiles and contact information Gen AI experience – must haveAzure API experience – must havePython, .Net, C# (Python most important here, followed by .Net and C#)Azure Certifications is a huge plus Job Description:Our AI & Digital Innovations teams bring the latest GenAI techniques plus a deep understanding of industry dynamics and corporate functions to help clients create the most value from data. Involved in specific engagements involving the building of new, bespoke advanced AI solutions for clients and internally. We are looking for a Web developer specialized in Azure API service.Skills: We are looking for a Mid-level, highly skilled, detail-oriented, Azure API service developer with a minimum of 5-10 years of experience. An ideal candidate will have the following qualifications:Proven work experience as a Software Developer, preferably with focus on Azure API services.Solid understanding of Microsoft Azure and knowledge of key services including Azure API Apps, Logic Apps & Functions.Develop, design and implement robust and scalable APIs using Azure API Apps.Proficient knowledge of a back-end programming language such as .NET, C#, Java, Python or Node.js.Implement security and data protection on APIs.Collaborate closely with the Data Engineer, Data Scientist, and stakeholders to ensure the system meets requirements and is scalable.Use Microsoft Azure and its services to design and deploy highly efficient applications that can scale.Troubleshoot and debug application codes to optimize performance.Write automated tests for system features to ensure system reliability, efficiency and prevent possible issues.Document every aspect of the system for future maintenance and updates.Azure certification would be a plusEducation: Bachelor's degree in Computer Science or similar, advanced degree preferred",
        "source": "Email",
        "date_posted": "2024-10-15 14:24:47-05:00",
        "unique_id": "19291dab58d53b62",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Azure Data Engineer"
    }
]