[
    {
        "company": "GVR Infotek",
        "job_title": "Workday Implementation Program Manager",
        "location": "Minneapolis, MN, USA",
        "full_location": {
            "city": "Minneapolis",
            "state": "MN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "6 months+",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Workday implementation",
                "Program management",
                "Change management",
                "Conflict resolution",
                "Data migration"
            ],
            "primary": [
                "ERP software implementation",
                "Project management",
                "Stakeholder management",
                "Risk management",
                "Communication"
            ],
            "secondary": [
                "Organizational change management",
                "Quality assurance",
                "Training development",
                "Analytical skills",
                "Problem solving"
            ],
            "all": [
                "Workday implementation",
                "Program management",
                "Change management",
                "Conflict resolution",
                "Data migration",
                "ERP software implementation",
                "Project management",
                "Stakeholder management",
                "Risk management",
                "Communication",
                "Organizational change management",
                "Quality assurance",
                "Training development",
                "Analytical skills",
                "Problem solving"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Tarun Pratap",
        "email": "tarun.pratap@gvrinfotek.com",
        "jd": "From: Tarun Pratap, GVR Infotek tarun.pratap@gvrinfotek.com Reply to: tarun.pratap@gvrinfotek.com Job Title: Workday Implementation Program ManagerLocation: Minneapolis, MN – Hybrid Visa: USC, GC onlyDuration: 6 months+ Must have LinkedIn and they MUST meet the specific requirements listed in the below Attachment B matrix and provide 3 professional references at the time of submitting Attachment BEVALUATION CRITERIAProvide specific details in the table below and include this in your submittal. These are mandatory requirements for your submittal to be considered. Based on the criteria, the City will select the resource that best fits the City’s needs. Add additional pages as needed. Criteria for Awarding Work OrderYes / NoProvide Specific Details / InformationYears / Months Experience 5 years of experience managing large software implementation projects impacting multiple departments across the enterprise.Select Yes or NoEnter TextEnter Text 2 years of experience as a PM for Workday implementation.Select Yes or NoEnter TextEnter Text Demonstrated experiences as Workday implementation PM for governmental organizations.Select Yes or NoEnter TextEnter Text Demonstrated experience in design and implementation of a program office.Select Yes or NoEnter TextEnter Text Demonstrated experience in organizational change management.Select Yes or NoEnter TextEnter Text Demonstrated experience in conflict resolution.Select Yes or NoEnter TextEnter Text Demonstrated experience in legacy system/3rd party application decommission, data migration and data archiving.Select Yes or NoEnter TextEnter Text Demonstrated ability to communicate clearly verbally and in written form to all stake holders.Select Yes or NoEnter TextEnter Text Position Description: The City has strategically decided to modernize its Human Resources, Performance Management, Hiring and Onboarding, Payroll, Finance, Procurement, Banking, Accounts Payable, Accounts Receivable, Cashiering, Asset Management, Budgeting, and other related business processes. As part of this transformation, the City plans to replace the current ERP system, PeopleSoft, to Workday, along with other related 3rd party applications. This position will lead the development and execution of the ERP Program Office on behalf of the City. This position will also act as the City’s point of contact for the implementation of Workday and other related software products. Primary Responsibilities: Program Leadership and Strategy:Program Planning and Governance:Develop and implement a plan to establish the ERP Program office.Establish governance structures, including steering committees and project management office (PMO), to oversee program execution.Define and manage the program's scope, schedule, and budget, ensuring alignment with organizational goals.Strategic Alignment:Align Workday project implementation and other related projects with organizational strategy and business objectives.Provide strategic guidance to senior leadership and stakeholders on program progress and adjustments.Program Planning and Management:Program Initiation:Define/refine the program charter, objectives, and scope.Define and document key milestones, deliverables, and timelines in collaboration with stakeholders.Project Coordination:Oversee the execution of all ERP related projects, including configuration, integration, and data migration.Coordinate with cross-functional teams to ensure timely and effective project delivery.Manage project timelines, deliverables, and dependencies.Project Planning:Create detailed project plans, including schedules, resource allocation, and budget forecasts.Establish, document, and maintain a project governance structure, including reporting lines and decision-making processes.Risk Identification:Proactively identify potential risks and issues related to all ERP related projects.Develop and implement risk mitigation strategies to address identified risks.Issue Resolution:Manage and resolve issues that arise during the implementation process.Escalate significant issues to the appropriate stakeholders and provide recommendations for resolution.Stakeholder Management:Communication:Develop and implement a communication plan to ensure consistent and effective information flow to all stakeholders including program progress, changes and key milestones. Facilitate regular status meetings, providing updates on project progress, risks, and issues.Engagement:Serve as the primary point of contact for all program-related inquiries and communications.Build and maintain strong relationships with key stakeholders, including executive leadership, department heads, and consultants.ERP Software Implementation:Project/Vendor Management:Manage and oversee the day-to-day execution of the ERP software implementation including Workday and other selected products.Ensure that project milestones and deliverables are met according to the agreed timeline and quality standards.Ensure quality assurance and quality control processes are followed.Ensure that the system(s) implementation complies with relevant legal, regulatory, security mandates and organizational standards.Change Management and Training:Develop and execute a change management plan to support the successful adoption of Workday.Address and manage resistance to change, ensuring smooth transition for end-users.Oversee the creation and delivery of training programs for end-users and supporting staff.Post-Implementation Support:Document lessons learned and best practices to inform future projects.Develop and execute a transition plan from project mode to operation mode. Monitor the performance of the Workday system to ensure optimal operation.Identify and implement opportunities for system improvements and process optimization.Experiences: At least five years of program management experience managing large software implementation projects impacting multiple departments across the organization within a formal project management environment with large financial impacts. At least two years of experience with Workday implementation in the public sector (governmental setting) as the project manager is required. Workday certifications are desired.Qualifications:Experience effectively leveraging relevant technology (including MS Office, Smartsheet, databases, etc.). Knowledge of the roles and business inter-relationships of each City Department function and the IT tool sets available for business solutions development and cost-effective business operations.City Departments Experience, knowledge, and ability to apply project/change management principles and methodologies. Skill in managing the design, evaluation, selection, and deployment of hardware, software, and network infrastructure. Proficient in preparation and facilitation of meetingsExcellent communication skills, including verbal, written and presentation. Excellent active listening skills. Able to communicate effectively at all levels in an organization. Strong problem solving and organizational skillsMust be a team player and able to work with and through others. Ability to understand other perspectives, influence others and move toward a common vision or goal. Ability to build and maintain productive working relationships with all stakeholders, at all levels of the organization.Excellent conflict resolution skillsAbility and willingness to be flexible and adaptable to changing priorities. Strong analytic and decision-making abilitiesERP Program office establishmentOrganizational change management Business process reengineeringWorkday implementationApplication decommission. Data cleansing, migration and archiving",
        "source": "Email",
        "date_posted": "2024-10-15 08:10:19-05:00",
        "unique_id": "192906d99784adb8",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]