[
    {
        "company": "Stellent IT",
        "job_title": ".Net Developer",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "14 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "8 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "C#",
                ".NET",
                "SQL Server",
                "Angular",
                "Blazor"
            ],
            "primary": [
                "Web API",
                "CSS",
                "JavaScript",
                "JQuery",
                "Automated Builds using Microsoft Team Foundation"
            ],
            "secondary": [
                "Oracle",
                "SOAP Services",
                "Azure Cloud Concepts",
                "PowerBI"
            ],
            "all": [
                "C#",
                ".NET",
                "SQL Server",
                "Angular",
                "Blazor",
                "Web API",
                "CSS",
                "JavaScript",
                "JQuery",
                "Automated Builds using Microsoft Team Foundation",
                "Oracle",
                "SOAP Services",
                "Azure Cloud Concepts",
                "PowerBI"
            ],
            "with_experience": [
                "C# (14 years)",
                ".NET (14 years)",
                "SQL Server (14 years)",
                "Angular (5 years)",
                "Blazor (5 years)",
                "Web API (5 years)",
                "CSS (5 years)",
                "JavaScript (5 years)",
                "JQuery (5 years)",
                "Automated Builds using Microsoft Team Foundation (5 years)"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Avnish Rao",
        "email": "avnish@stellentit.com",
        "jd": "Hi, We have urgent requirement of .Net Developer | Hybrid. Please revert if you are interested to apply. .Net Developer Location: Richmond, VADuration: 8 months Position Overview:The ERP Developer will have 14+ years of experience in .NET Web application development. The role involves programming, testing, and debugging complex software, specifically focusing on financial and budget management tools. The ideal candidate must be proficient in C#, Angular or Blazor, SQL Server, and .NET Core, and have strong communication skills for collaborating with technical and business stakeholders. This long-term position is onsite in Richmond, VA, with a possibility of extension beyond 24 months. Duties:Ability to develop, program and code in .NET Core environment applications and backend services using C#, Web API, Java Script, JQuery, Angular or Blazor and CSS. Design, develop and program using appropriate software design patterns to attain high reusability and maintainability. Write effective unit tests and integration tests to ensure high quality software delivery. In-depth knowledge and skills in programming, system design patterns, tiered architecture, and testing practices. Understanding of key business processes and competitive strategies related to the IT function. Work with project architect, project manager, business owner and system analysts to clarify the requirements and then implement them.Participate in Agile SDLC. Required Skills:14 years of C#.NET Development experience14 years of strong database development experience using SQL Server5 years of Angular or Blazor Development experience5 years of experience with Web API5 years of experience with CSS3 and HTML510 years of experience with Source Control using TFS5 years of experience with Automated Builds using Microsoft Team Foundation5 years of experience with Agile SDLC best practices Preferred Skills:2 years of experience working in Oracle5 years experience with an understanding of SOAP Services1 year of experience with Azure Cloud Concepts1 year of experience with PowerBI",
        "source": "Email",
        "date_posted": "2024-10-15 15:36:13-05:00",
        "unique_id": "19292319be41a6a2",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]