[
    {
        "company": "Noblis Group",
        "job_title": "SQL/DBA Developer",
        "location": "Irving, TX, USA",
        "full_location": {
            "city": "Irving",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "2+ years",
            "degree_required": "Bachelor’s degree in Computer Science or a related field",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Contract to hire",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SQL Server",
                "Azure SQL",
                "MySQL",
                "database architecture",
                "dimensional data modeling"
            ],
            "primary": [
                "data systems architecture",
                "data quality management",
                "database security",
                "program views",
                "stored procedures",
                "SQL queries"
            ],
            "secondary": [
                "Project Management",
                "AWS",
                "GCP",
                "data migrations",
                "customer service",
                "problem-solving",
                "communication"
            ],
            "all": [
                "SQL Server",
                "Azure SQL",
                "MySQL",
                "database architecture",
                "dimensional data modeling",
                "data systems architecture",
                "data quality management",
                "database security",
                "program views",
                "stored procedures",
                "SQL queries",
                "Project Management",
                "AWS",
                "GCP",
                "data migrations",
                "customer service",
                "problem-solving",
                "communication"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Vinita Singh",
        "email": "vinita.singh@tekinspirations.com",
        "jd": "Job Description -100% interview SQL/DBA Developer (F2F )Onsite -Irving, TXUSC/GC – Contract to hire- candidate must be willing to fulltime after contractClient – Noblis GroupInterview – 1st video 2nd onsite Need only local within 1 hr distanceNeed LINKEDIN HR NOTES:The hiring manager will review resume and assessment and determine whether they want to interview the candidate. I will let you know that there is a high failure rate of this assessment. It is part personality test and the work environments they thrive in and part logic mathematical and word problems.They also need a little Project Management abilities and solid Azure cloud experience, but if not Azure they are considering candidates with AWS/GCP. Job DescriptionJoin our dynamic Data and Analytics team as a SQL/DBA Developer, where you'll play a crucial role in both daily operations and long-term data strategy. We seek a candidate who brings a business-oriented approach to data architecture and has a proven track record of driving growth through data solutions.Key Responsibilities:Manage databases on both on-premises and cloud platforms, utilizing SQL Server and Azure SQL services.Oversee the operational aspects of data platform solutions in both cloud-native and on-premise environments.Engage in data systems architecture, modeling, and development efforts.Build and validate the stability and efficiency of databases.Create and optimize program views, functions, and stored procedures.Write efficient SQL queries for integration with various applications.Design database tables, dictionaries, and develop related scripts, procedures, and triggers.Maintain data quality, manage backups, and ensure database security.Qualifications:Strong prioritization and problem-solving skills.Detail-oriented with a focus on process and documentation.Excellent communication skills and a strong commitment to customer service.Ability to independently resolve issues.Education and Experience:Bachelor’s degree in Computer Science or a related field.2+ years of experience with SQL Server and Azure SQL DB development.2+ years of experience with MySQL/MariaDB support.2+ years of experience in database architecture and dimensional data modeling.Preferred Experience:Over 3 years of experience in designing and developing data systems (SQL Server, Cloud/on-premise, and Analytics).Experience in supporting transactional and analytics systems, including data modeling.Participation in Master Data Management and metadata management efforts.Experience with database migrations to Azure Cloud.This is an excellent opportunity to contribute to impactful data projects within a supportive and growth-oriented team environment. Let me know if you have any questions. Thanks and Regards, Vinita SinghTechnical RecruiterTEK Inspirations LLC | 13573 Tabasco Cat Trail, Frisco, TX 75035E: vinita.singh@tekinspirations.com Contact No-+ 469-205-(6817)",
        "source": "Email",
        "date_posted": "2024-10-15 16:29:05-05:00",
        "unique_id": "19292363907b7f05",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "DB Admin"
    }
]