[
    {
        "company": "Yochana Solutions INC",
        "job_title": "Lead Java or JBoss",
        "location": "Phoenix, AZ, USA",
        "full_location": {
            "city": "Phoenix",
            "state": "AZ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "1+ year",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "JBoss",
                "Application Management",
                "Architecture Documentation",
                "Technical Support"
            ],
            "primary": [
                "Opentext",
                ".NET",
                "Custom Web Services",
                "Message Bus",
                "Deployment and Troubleshooting",
                "Architecture Design",
                "Defect Tracking",
                "Agile Methodology",
                "Web/E-commerce Knowledge"
            ],
            "secondary": [
                "Communication",
                "Problem-Solving",
                "Leadership"
            ],
            "all": [
                "Java",
                "JBoss",
                "Application Management",
                "Architecture Documentation",
                "Technical Support",
                "Opentext",
                ".NET",
                "Custom Web Services",
                "Message Bus",
                "Deployment and Troubleshooting",
                "Architecture Design",
                "Defect Tracking",
                "Agile Methodology",
                "Web/E-commerce Knowledge",
                "Communication",
                "Problem-Solving",
                "Leadership"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "James Smith",
        "email": "smith@yochana.com",
        "jd": "From: James Smith, Yochana Solutions INC smith@yochana.com Reply to: smith@yochana.com Job Title- Lead Java or JBossLocation – Phoenix, Arizona- Onsite Day 1 Duration – 1+year Visa – US-Citizen or Green Card 2.Service Lead specializing in Java/JBoss role involves managing and maintaining critical applications within an ASM framework:-Application Management: Oversee the administration, maintenance, and support of Java-based applications running on JBoss application servers.Architecture Documentation: Manage and maintain application architecture documentation and procedures for installation and maintenance.Technical Support: Analyze, debug, support, and occasionally modify software enhancements and new products used in local, networked, or Internet-related computer programs.Team Leadership: Provide day-to-day direction to development teams, ensuring adherence to standard patterns, architectures, and best practices using open-source tools.Integration Solutions: Develop and support JMS-based integration solutions and APIs (based on REST principles) for internal applications and third-party system integration scenarios.Collaboration:Work closely with the technical team to determine systems planning, scheduling, and implementation timelines. Desired Skills:Java/JBoss,Opentext, .NET a.Proficiency in Java: As a Service Lead, you'll need a strong grasp of the Java programming language. Custom Web Services: You'll develop custom web services using Java, automate migration processes, and implement security features. Message Bus: Expertise in using custom Java-based data delivery buses for ultra-stable and high-performance inter-application communication.JBOSS: Application Server Expertise: JBOSS (now known as WildFly) is an open-source application server. Familiarization with its architecture, deployment, and configuration. Manage applications, resources, and security within JBOSS. Deployment and Troubleshooting: Familiarization to deploy applications on JBOSS, monitor performance, and troubleshoot issues effectively.Architecture Design: Expertise in application architecture design and business processes.Defect Tracking: Proficiency in using tools like Jira and JUnit for defect tracking.Agile Methodology: Experience with Agile methodology and optimizing software development processes. Web/E-commerce Knowledge: Familiarity with web and e-commerce architectures and technologies.Soft Skills: a.Communication: Excellent communication skills are crucial. You'll collaborate with cross-functional teams, interact with stakeholders, and lead discussions. Problem-Solving: Service Leads often encounter complex challenges. Develop strong problem-solving abilities and think critically when addressing issues. Leadership: As a lead, you'll guide and mentor team members. Effective leadership ensures successful project delivery. To architect, design and develop (through Team) solution for productorproject and sustenance delivery To support as an SME To ensure knowledge up-gradation and work with new technologies so that the solution is current and meets quality standards and the client requirements To train and develop team so as to ensure that there is an adequate supply of trained manpower in the said technology and deliver risks are mitigated To gather specifications and deliver solutions to the client organization based on understanding of a domain or technology To review project deliverables. To recommend client value creation initiatives and implement industry best practices (on specific technologyorproduct.",
        "source": "Email",
        "date_posted": "2024-10-15 08:47:42-05:00",
        "unique_id": "19290913c014df29",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]