[
    {
        "company": "Yochana IT Solutions",
        "job_title": "IaC (AWS) Architect-Only Local to NJ",
        "location": "Berkeley Heights, NJ, USA",
        "full_location": {
            "city": "Berkeley Heights",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "experience_required": "12+ years",
            "degree_required": "Bachelor's degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, MCA, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "AWS",
                "Terraform",
                "Python",
                "DevOps",
                "ECS",
                "EKS"
            ],
            "primary": [
                "AWS CloudFormation",
                "Infrastructure as Code (IaC)",
                "CI/CD tools",
                "Ansible",
                "Chef",
                "Puppet"
            ],
            "secondary": [
                "Shell scripting",
                "PowerShell",
                "Agile delivery framework",
                "Jenkins",
                "Team City",
                "Kubernetes"
            ],
            "all": [
                "AWS",
                "Terraform",
                "Python",
                "DevOps",
                "ECS",
                "EKS",
                "AWS CloudFormation",
                "Infrastructure as Code (IaC)",
                "CI/CD tools",
                "Ansible",
                "Chef",
                "Puppet",
                "Shell scripting",
                "PowerShell",
                "Agile delivery framework",
                "Jenkins",
                "Team City",
                "Kubernetes"
            ]
        },
        "job_type": [],
        "contact_person": "Padmavathi Vindeepu",
        "email": "padmavathi@yochana.com",
        "jd": "Hello,I hope you are doing great.This is Padmavathi from Yochana IT Solutions, we have an urgent requirement with one of our clients, please go through the requirement below and let me know your interest. You can forward this opportunity to your friends or colleagues; so that we can help someone who may be desperately looking for opportunities. I sincerely appreciate your time Role: IaC (AWS) Architect-Only Local to NJLocation: Berkeley heights, NJ Mandatory Skills: Skill SetProficiency [out of 10 where 1 is least and 10 is maximum]CommentsAWS7+Candidate should be proficient with native AWS services. Details given in JD Terraform7+Candidate should be above average in Terraform. Proficient enough to write Terraform code from scratch and not only editing existing code.Python5+Need someone average or average plus in python. Should be utilizing python to automate day to day taskDevOps7+Candidate should be proficient in native AWS DevOps toolsECS/EKS7+Should be proficient with containers and K8s Experience:Total Years of experience: 12+ yearsRelevant experience: 5+ yearsDescription:HCL AWS Cloud Capability Delivery Unit is looking for experienced customer-focused AWS Cloud Consultant/Engineer with technical depth and architecture skills. In this role, he/she will be responsible for managing and developing the AWS cloud platform. This includes working with the development team to deploy applications, managing and scaling the AWS infrastructure, and ensuring high availability of the platform. The engineer will also work closely with the operations team to troubleshoot and resolve issues with the platform.Specifically, you will be part of customer engaging team of technical PMs and engineers responsible for implementing new custom deployment pipelines and execute POCs and pilot migration projects with modernized approach. Ideally candidates with exposure in Global markets across US, UK, Continental Europe, APAC including Indian market will be preferred.o Position AWS Cloud Engineer/Consultanto Experience - A minimum of 9 12 years hands-on experience in infrastructure delivery, Designing and implementing solutions with proficiency in automation and devOps tools.Roles & Responsibilities: Automate solutions for repeatable problems. Work with clients to transform manual processes and deployments into DevOps automated pipelines using AWS native services. Develop test plan and test cases to demonstrate application/database readiness post migration. Work closely with application teams to ensure business functionality and SLAs are met. Develop innovative solutions to complex business and technology problems. Keeping up to date with market trends and competitive insights and maintain technical skills and knowledge. Advocate new features and solutions to bring operational efficiency and cost reduction. Key focus on Infrastructure as code (IaC) and automation Work with development team to deploy applications to AWS Manage and scale AWS infrastructure Ensure high availability of AWS platform Troubleshoot and resolve issues with AWS platform and applications Identify, troubleshoot and implement solutions to performance, scaling and availability issues across the platform Work with security team to ensure compliance standards are met Assist in provisioning AWS resources - Assist DevMandatory Skills: Bachelor s degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics, Physics, MCA, or a related field. Subject matter level expertise on AWS DevOps, AWS CloudFormation. AWS Compute (EC2) & Storage, Backup & DR, Monitoring Experience in any one programming languages like Python, Node.js etc. Infrastructure automation through DevOps scripting (E.g., shell, PowerShell, Ansible, Terraform, CloudFormation etc) Hands-on experience of automating the build and deployment of AWS resources, using Terraform, at both the platform level (e.g. Landing Zone) and across the compute, storage, network data and security services. CloudFormation deep expertise (cfn hup, cfn init, custom resources, stack sets etc.) From a development background, the individual will have experience of the Software Delivery Life Cycle (SDLC), preferably with hands-on experience working with Python, and be familiar with an agile delivery framework (e.g. Scrum) Strong hands-on experience on CI/CD tools like Jenkins, Team city etc. Configuration management using Ansible and/or Chef/Puppet. Strong verbal and written communication skills, with the ability to work effectively across internal and external organizations. Implementing experience with primary AWS services (EC2, ELB, ECS, RDS, Lambda, API Gateway, Route53 & S3) Experience in KubernetesThanks & Regards,Padmavathi Vindeepu,Resource Specialist,Farmington Hills, MI,Email Id: padmavathi@yochana.comhttps://www.linkedin.com/in/padmavathi-vindeepu-25b54026",
        "source": "Email",
        "date_posted": "2024-10-15 13:08:43-05:00",
        "unique_id": "192917ecb24b369f",
        "emp_type": [
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]