[
    {
        "company": "kk soft tech",
        "job_title": "Java Full Stack Developer",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "2+ years",
            "degree_required": "Bachelor’s degree in computer science, Information Systems, with 4+ years of relevant technical experience or Master’s degree in Computer Science, Information Systems with 2+ years of technical experience.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "AWS",
                "Kubernetes",
                "Graal VM",
                "Java Quarkus"
            ],
            "primary": [
                "Postman",
                "REST Assured",
                "Cypress",
                "Ready API",
                "Jenkins",
                "Circle CI",
                "ECS",
                "EKS",
                "S3",
                "Lambda",
                "SQS/SNS",
                "PostgreSQL",
                "Dynamo",
                "Sagemaker",
                "Athena"
            ],
            "secondary": [
                "Agile development",
                "VersionOne",
                "Agility",
                "AWS Certification",
                "DevOps",
                "Automation"
            ],
            "all": [
                "Java",
                "AWS",
                "Kubernetes",
                "Graal VM",
                "Java Quarkus",
                "Postman",
                "REST Assured",
                "Cypress",
                "Ready API",
                "Jenkins",
                "Circle CI",
                "ECS",
                "EKS",
                "S3",
                "Lambda",
                "SQS/SNS",
                "PostgreSQL",
                "Dynamo",
                "Sagemaker",
                "Athena",
                "Agile development",
                "VersionOne",
                "Agility",
                "AWS Certification",
                "DevOps",
                "Automation"
            ]
        },
        "job_type": [],
        "contact_person": "sushant kumar",
        "email": "sushant.s@kksoftwareassociates.com",
        "jd": "From: sushant kumar, kk soft tech sushant.s@kksoftwareassociates.com Reply to: sushant.s@kksoftwareassociates.com Java Full Stack Developer with AWS and Angular and Kubernetes Atlanta, GA, USA Non-Local is fine Need Immediate Joiners Who are we looking for?Looking for a Experienced in full stack Cloud-native development, AWS, Graal VM, Java Quarkus, Kubernetes.Specific Qualifications2+ years’ experience in Java, Full-stack, Graal VM, Java Quarkus development experience is requiredExperience in Kubernetes.Automation-minded: Hands on experience of designing and writing automated tests for backend applications and data flow, using tools such as Postman, REST Assured, Cypress, Ready API etc. Hands on experience of working with continuous integration tools such Jenkins, Circle CI. Broad hands on experience in AWS Cloud serverless components and ability to build and maintain cloud data processing systems (i.e. ECS, EKS, S3, Lambda, SQS/SNS, PostgreSQL, Dynamo, Sagemaker, Athena, etc.) Experience working in an agile development environment using workload management tools like VersionOne/Agility Excellent judgment and problem-solving skills; individual should be able to resolve urgent problems in a calm and quick manner and display a high degree of initiative and drive Ability to be effective in a high stress environment Be flexible and embrace challenges that are outside of your comfort zone WHAT WILL GIVE YOU A COMPETITIVE EDGE (PREFERRED QUALIFICATIONS) Bachelor’s degree in computer science, Information Systems, with 4+ years of relevant technical experience or Master’s degree in Computer Science, Information Systems with 2+ years of technical experience. AWS Certification is a plus DevOps and/or automation experience in code testing, building, and deployment a plus Knowledge and experience with the Airline Industry a plus.",
        "source": "Email",
        "date_posted": "2024-10-15 08:12:51-05:00",
        "unique_id": "1929086409a53723",
        "emp_type": [
            "third party"
        ],
        "tag": "Java developer"
    }
]