[
    {
        "company": "Schrill Tech",
        "job_title": "IT Project Coordinator",
        "location": "Houston, TX, USA",
        "full_location": {
            "city": "Houston",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified",
            "job_code": "",
            "contact_person": "Indra",
            "email": "indra@schrilltech.com"
        },
        "skills": {
            "core": [
                "Project Coordination",
                "MS Project",
                "Waterfall",
                "Agile"
            ],
            "primary": [
                "Organizational Skills",
                "Time Management",
                "Communication Skills",
                "Problem-Solving"
            ],
            "secondary": [
                "Team Collaboration",
                "Risk Management",
                "Documentation Management"
            ],
            "all": [
                "Project Coordination",
                "MS Project",
                "Waterfall",
                "Agile",
                "Organizational Skills",
                "Time Management",
                "Communication Skills",
                "Problem-Solving",
                "Team Collaboration",
                "Risk Management",
                "Documentation Management"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "jd": "From: indra, Schrill Tech indra@schrilltech.com Reply to: indra@schrilltech.com Job Title – IT Project Coordinator Location – Houston, TX (at least 4 days a week) Contract Job - Need someone who can come to the office from day 1. Key Responsibilities: Assist the Program Manager in executing administrative tasks and supporting the project team in daily operations. Create, update, and maintain project plans using MS Project to ensure timely delivery and project milestones are met. Support various project delivery methodologies, including both Waterfall and Agile approaches, ensuring alignment with project requirements. Organize and manage project meetings, take minutes, and follow up on action items as needed. Monitor project progress and communicate updates, risks, and issues to stakeholders. Coordinate resources, schedules, and information flow between team members. Assist in preparing project reports and presentations for project stakeholders. Manage and maintain project documentation, ensuring everything is up-to-date and easily accessible. Perform risk management tasks to minimize project risks. Collaborate with cross-functional teams to ensure smooth project delivery and facilitate open communication channels. Qualifications: Previous experience as a Project Coordinator, ideally in a technical or operational environment. Familiarity with both Waterfall and Agile project management methodologies. Proficiency in using MS Project for creating and maintaining project plans. Strong organizational and time management skills with the ability to handle multiple tasks simultaneously. Excellent written and verbal communication skills. Strong problem-solving abilities and attention to detail. A team player who is willing to collaborate and assist as needed.",
        "source": "Email",
        "date_posted": "2024-10-15 09:08:00-05:00",
        "unique_id": "19290a303242ffb8",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]