[
    {
        "company": "intellecttechsolutions",
        "job_title": "SQL Server DBA",
        "location": "Columbus, OH, USA",
        "full_location": {
            "city": "Columbus",
            "state": "OH",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "9+ years",
            "degree_required": "4-year college degree or equivalent technical study",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SQL Server",
                "Database Management",
                "Performance Tuning",
                "Capacity Planning",
                "Cluster Configuration"
            ],
            "primary": [
                "Ansible",
                "Jenkins",
                "Nexis",
                "Mavin",
                "Bitbucket",
                "Kony Mobile",
                "Nginx"
            ],
            "secondary": [
                "Technical Documentation",
                "Project Management",
                "Incident Resolution",
                "Database Security",
                "Risk Management"
            ],
            "all": [
                "SQL Server",
                "Database Management",
                "Performance Tuning",
                "Capacity Planning",
                "Cluster Configuration",
                "Ansible",
                "Jenkins",
                "Nexis",
                "Mavin",
                "Bitbucket",
                "Kony Mobile",
                "Nginx",
                "Technical Documentation",
                "Project Management",
                "Incident Resolution",
                "Database Security",
                "Risk Management"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Sbabu",
        "email": "sbabu@intellecttechsolutions.com",
        "jd": "From: Sbabu, intellecttechsolutions sbabu@intellecttechsolutions.com Reply to: sbabu@intellecttechsolutions.com Role: SQL Server DBA – Remote Location: Columbus OH Interview: Video Interview Years of Relevant Experience:9+ years’ experiencePreferred Education:4-year college degree or equivalent technical study Job Description: The SQL Server DBA will be responsible for managing Microsoft SQL Server Database environments including on the SQL Server databases virtual machine (VM) servers. They will ensure best practices in database planning, design, configuration, performance and capacity planning and growth ensuring our SQL databases offer the highest reliability and performance possible. They will work with the DBA ITM1 to ensure that team goals and metrics are met. Should be able to provide DBA support for distributed servers in a multi-datacenter environment. Monitor daily activities and performance of complex SQL environment, analyzes technical problems, recommend adjustments, creates, and implements approved solutions using established tools and techniques.Provide technical assistance to the application development area and co-workers about SQL design and programming.Configures SQL services (e.g. security, JDBC, clusters). Plans, installs, and coordinates SQL Server releases, migrations, upgrades, and maintenance. Build new environments as needed to support applications.Coordinating with the teams of network, IIS administrators and storage groups for SQL server-based configurations.Develop technical documents, project plans and tasks, interact with customers for proposed solutions.Provide non-production and production support for deploying code and assist in trouble shooting and resolving application issues.Support DevOps tools (Ansible, Jenkins, Nexis, Mavin, Bitbucket, Kony Mobile, Nginx etc.)Any other tasks assigned by the management team based on project/application needs.Provide technical Tier III support, develops project plans with project manager, or recommends approach through defining tasks.Leading meetings relating to design, implementation, operation, and ongoing maintenance of databases systems.Designs/plans of cluster nodes hardware selection and recommendations, configures/sets- up cluster nodes, sets-up interconnects, and configures cluster- aware storage; installs cluster and database management system (DBMS) software on all nodes.Monitoring load balance and tunes cluster parameters for high performance, configuring standby servers.Configuring and implements log shipping, configures, and implements replication etc.Provide technical leadership that fosters database innovation and champions automation.Support strategic planning for database architecture, resource management, and capacity planning and growth.Ensures best practices in database planning, design, configuration, performance, and resilience.Evaluate and proposes design and process improvements to achieve performance and cost optimization.Identify inefficiencies in current database designs and oversees the implementation of improved solutions.Plans and implements capacity and resource expansion to ensure scalability of databases.Implements effective risk management controls and owns adherence to all compliance related items (exceptions, waivers, risks, technical compliance, and access control)Leads incident resolution efforts and engages appropriate resources to complete corrective actions as quickly as possible.Conducts research and provides recommendations on database products, services, protocols, and standards in support of procurement and development efforts.Virtualized Infrastructure running various Unix, Linux, and AIX operating systems.Altering storage structures to meet the evolving needs of the Organization.Regularly updating the database security protocols, patching.Provides leadership and work guidance to less experienced personnel.. Will also work with project management to support and ensure timely and effective client communications about deployments and upgrades. Mandatory skillsSeeking an experienced SQL Server DBA with managing the MS SQL Server environments including the DB VM servers.Certifications or Desired skills if anySQL Server DBA certification is preferred",
        "source": "Email",
        "date_posted": "2024-10-15 12:13:46-05:00",
        "unique_id": "192914c7a344bd8e",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "DB Admin"
    }
]