[
    {
        "company": "iTech US, Inc.",
        "job_title": "Sr Java Fullstack Developer",
        "location": "Quincy, MA, USA",
        "full_location": {
            "city": "Quincy",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Kubernetes",
                "ReactJS",
                "Spring",
                "Hibernate"
            ],
            "primary": [
                "JSP",
                "GWT",
                "Struts",
                "RESTful Web Services",
                "SOAP",
                "SQL",
                "PL/SQL",
                "Azure Cloud",
                "Maven"
            ],
            "secondary": [
                "HTML5",
                "CSS3",
                "JavaScript",
                "NodeJS",
                "JUNIT",
                "MVC",
                "WebSphere",
                "RDBMS practices",
                "Financial Services"
            ],
            "all": [
                "Java",
                "Kubernetes",
                "ReactJS",
                "Spring",
                "Hibernate",
                "JSP",
                "GWT",
                "Struts",
                "RESTful Web Services",
                "SOAP",
                "SQL",
                "PL/SQL",
                "Azure Cloud",
                "Maven",
                "HTML5",
                "CSS3",
                "JavaScript",
                "NodeJS",
                "JUNIT",
                "MVC",
                "WebSphere",
                "RDBMS practices",
                "Financial Services"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Sowmyasri Sistla",
        "email": "sowmya.s@itechus.net",
        "jd": "From: Sowmyasri, ITECH sowmya.s@itechus.net Reply to: sowmya.s@itechus.net Hi,Greetings from iTech US,Please go through the below requirement and let me know your interest. Role : 1Position: Java Full Stack DeveloperLocation : Quincy, MA (Day One Onsite)12 Months Must: JAVA & Kubernetes Job Description:Responsible for design patterns, multi-threading, concurrency, error handling, streams and functional programming. Responsible for maintaining the code quality, coding and implementation standards by code reviews. Develop the presentation layer, which includes the development of user interactive web pages using JSP, GWT, Struts. Develop processing component to retrieve customer information from Oracle database, developed DAO layer using Hibernate as ORM and involved in configuring hibernate to access database. Integrate Struts with Hibernate to interact with the database. Use Web services (RESTful) for calling external services.Develop the presentation layer, which includes the development of user interactive web pages using JSP, Struts tag with HTML5, CSS3. Use JIRA to keep track of project, creating stories, subdividing tasks, keep track of our work and bugs. · Use Web services (SOAP) for transmission of XML data over HTTP. Built and deployed the application using Apache Maven. Responsible for creating JUNIT component class for testing business logic. Involve in writing SQL queries and PL/SQL procedures. Implement MVC architecture using struts frameworks. Core product installation and configuration. Includes browser installation, WebSphere server installation, Oracle SQL database administration. Multi App set up. Analyze the issues that arise in the Production Environment, Providing Root cause for the issue and proactively fixing the production issues. Optimize the performance of the system for higher efficiency. ROLE: 2Position:: Java Full Stack DeveloperLocation:: Princeton, NJ :: Onsite Role ::Duration:: Contract Role Must: Java with ReactJSRole Description: Candidate should have strong experience in Java Full Stack using Angular as frontend framework.Should have experience in Core java 11 or later version.Good experience in backend implementation using various spring frameworks like Spring core, Spring REST , Spring MVC , Spring AOP, etc.,Experience in integrating backed application with UI technologies like ReactJS, NodeJS, CSS, JavaScript ,etc.Excellent communication and teamwork skills.Should have experience in working with Azure Cloud and deploying the applications using Kubernetes or Helm frameworks.Understanding of good RDBMS practices.? Financial Services experience is a plus? Ability to multi-task and to take the initiative when needed.Please share your updated resume along with current location details:Thanks,Sowmyasri SistlaEmail : sowmya.s@itechus.netiTech US, Inc. https://www.linkedin.com/in/sri-s-8795a9168/",
        "source": "Email",
        "date_posted": "2024-10-15 12:53:28-05:00",
        "unique_id": "1929170d329b7067",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]