[
    {
        "company": "USG Inc",
        "job_title": "Healthcare Project Manager",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Eight plus years",
            "degree_required": "Bachelor’s degree in Health Care Administration, Business, Finance, Management, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Healthcare experience",
                "Communication skills",
                "Organizational skills",
                "Application integrations"
            ],
            "primary": [
                "PMP certification",
                "Smartsheet project management tools",
                "Google Suite",
                "ServiceNow for Project Management (SPM Module)"
            ],
            "secondary": [
                "Technical support",
                "Problem-solving skills",
                "Attention to detail",
                "Interpersonal skills",
                "Knowledge of computer hardware and software",
                "Knowledge of production processes",
                "Knowledge of business and management principles"
            ],
            "all": [
                "Project Management",
                "Healthcare experience",
                "Communication skills",
                "Organizational skills",
                "Application integrations",
                "PMP certification",
                "Smartsheet project management tools",
                "Google Suite",
                "ServiceNow for Project Management (SPM Module)",
                "Technical support",
                "Problem-solving skills",
                "Attention to detail",
                "Interpersonal skills",
                "Knowledge of computer hardware and software",
                "Knowledge of production processes",
                "Knowledge of business and management principles"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Jaya Kushwaha",
        "email": "jaya.k@usgrpinc.com",
        "jd": "Hello, Hope you are doing well !! We have an urgent Position of Project Manager with one of our Client. Let me know if you are interested in below mentioned position and share your updated resume and contact details to discuss further about the role. Position: Healthcare Project ManagerLocation: Remote (Must be from Central Time Zone)Contract Additional Note:Looking for a Project Manager that has Healthcare experience. Great communication and organizational skills must have. Some technical knowledge in application integrations would be good. Qualifications:Bachelor’s degree in Health Care Administration, Business, Finance, Management, or a related field.Eight plus years of Project Management experience.Project Management Professional (PMP) certification.Experience in medium to complex enterprise-wide project management.Experience implementing General Healthcare technology projects and/or ERP systems with additional focus on third-party products.Proficient in Smartsheet project management tools.Proficient in Google Suite (Calendar, Gmail, Meets, Docs, Sheets, Slides).Experience using ServiceNow for Project Management (SPM Module) is highly desired Job Summary: We are seeking a Project Manager with healthcare experience to manage ongoing and new projects. The role involves 90% project management and 10% non-project management tasks such as training. The ideal candidate will have excellent communication and organizational skills, and some technical knowledge in application integrations.Responsibilities:• Plan, direct, and coordinate activities in information systems, systems analysis, and computer programming.• Review project plans to plan and coordinate project activity.• Manage backup, security, and user help systems.• Operate smaller budget projects.• Consult with users, management, vendors, and technicians to assess computing needs and system requirements.• Meet with department heads, managers, supervisors, vendors, and others to solicit cooperation and resolve problems.• Provide users with technical support for computer problems.• Strategize and develop project goals, objectives, and schedules to align with defined business benefits.• Lead project resource matrix through the project lifecycle (validate scope of resource requirements, recruitment, onboarding, monitoring, and managing to ensure resources achieve project goals).• Develop, track, and document all aspects of the project.• Manage all aspects of the project budget; monitor and adjust plans as resource requirements and assets change.• Communicate and document project quality and progress metrics.• Address and resolve project issues to ensure the project remains on track.Skills/Experience:• Strong project management skills and knowledge.• Experience working with internal team members, extended partners, and third-party vendors.• Excellent communication skills.• Ability to influence and build respectful relationships.• Confidence in new environments.• Ability to quickly learn and effectively use project management tools in ServiceNow.• Verbal and written communication skills, problem-solving skills, attention to detail, and interpersonal skills.• Ability to work independently and manage one’s time.• Knowledge of computer hardware and software.• Knowledge of production processes, quality control, costs, and other techniques for maximizing the effective manufacture and distribution of goods.• Knowledge of business and management principles involved in strategic planning, resource allocation, and production methods.• Knowledge of computer software, such as Visual Basic, Java, SQL, etc.• PMI or PMP certification preferred.Preferred Qualifications:• Bachelor’s degree in Health Care Administration, Business, Finance, Management, or a related field.• Eight plus years of Project Management experience.• Project Management Professional (PMP) certification.• Experience in medium to complex enterprise-wide project management.• Experience implementing General Healthcare technology projects and/or ERP systems with additional focus on third-party products.• Proficient in Smartsheet project management tools.• Proficient in Google Suite (Calendar, Gmail, Meets, Docs, Sheets, Slides).• Experience using ServiceNow for Project Management (SPM Module) is highly desired. Additional Note:Looking for a Project Manager that has Healthcare experience. Great communication and organizational skills must have. Some technical knowledge in application integrations would be good.",
        "source": "Email",
        "date_posted": "2024-10-15 09:01:57-05:00",
        "unique_id": "192909db4cfbb8a5",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]