[
    {
        "company": "Technocraft solutions",
        "job_title": "Senior .NET Full Stack ERP Developer",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "748487",
            "experience_required": "14 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "C#.NET Development",
                "Angular",
                "Blazor",
                "SQL Server",
                "Web API",
                "CSS3",
                "HTML5",
                "Source Control using TFS",
                "Automated Builds using Microsoft Team Foundation"
            ],
            "primary": [
                "Troubleshooting skills",
                "Agile SDLC best practices",
                "Oracle"
            ],
            "secondary": [
                "Azure Cloud Concepts",
                "PowerBI"
            ],
            "all": [
                "C#.NET Development",
                "Angular",
                "Blazor",
                "SQL Server",
                "Web API",
                "CSS3",
                "HTML5",
                "Source Control using TFS",
                "Automated Builds using Microsoft Team Foundation",
                "Troubleshooting skills",
                "Agile SDLC best practices",
                "Oracle",
                "Azure Cloud Concepts",
                "PowerBI"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Jitendra Upreity",
        "email": "jitendra@technocraftsol.com",
        "jd": "From: Jitendra Upreity, Technocraft solutions jitendra@technocraftsol.com Reply to: jitendra@technocraftsol.com Job Title: Senior .NET Full Stack ERP Developer, Locals Only (14+ Yrs)Location: Richmond, VA (Hybrid)Duration: 12 Months Contract Note: ****Hybrid Schedule: **Mgr requests vendors ONLY submit candidates who already live in Richmond, VA**ALL interviews ONSITE**Long-Term position requires onsite 3 days a week at 1401 East Broad Street, Richmond VA**Assignment to be extended beyond 6/30, possibly 24 months**Contractor will be responsible for purchasing parking through VDOT’s Parking Management Office or procuring their own parking Responsibilities and Skills: Job ID: 748487 Location: Richmond, VA(VDOT)Duration: 8+ months Skills:C#.NET Development experience Required 14 YearsAngular or Blazor Development experience Required 5 YearsStrong Database development experience using SQL Server Required 14 YearsExperience with Web API Required 5 YearsExperience with CSS3 and HTML5 Required 5 YearsExperience with Source Control using TFS Required 10 YearsExperience with Automated Builds using Microsoft Team Foundation Required 5 YearsExcellent Troubleshooting skills Required 12 YearsExperience with Agile SDLC best practices Required 5 YearsExperience working in Oracle Desired 2 YearsUnderstanding of SOAP Services Desired 5 YearsFamiliar with Azure Cloud Concepts Nice to have 1 YearsExperience with PowerBI Nice to have 1 Years Job Description:VDOT-AMD is seeking a Developer with 14 yrs. or more .Net Web application development. Experience and fluency with C#, Angular or Blazor, SQL Server, jQuery, CSS3 and HTML5 experience VDOT is seeking a Full Stack Senior ERP Developer/Programmer with .Net Applications Development experience who will be responsible for managing, programming, testing, debugging and analyzing complex software requirements to design and develop high quality components using the .NET Core framework. The ERP Developer will be programming the current budget and spend plan tool that is used agency wide for financial and budget management for the Maintenance Program. The Senior Developer is expected to program using best practices, prioritize programming work effectively and write system documentation as required. The successful candidate should have strong programming and communication skills to be effective in both technical and business requirement discussions. Primary responsibilities include: •Ability to develop, program and code in .NET Core environment applications and backend services using C#, Web API, Java Script, jQuery, Angular or Blazor and CSS.•Design, develop and program using appropriate software design patterns to attain high reusability and maintainability.•Write effective unit tests and integration tests to ensure high quality software delivery.•In-depth knowledge and skills in programming, system design patterns, tiered architecture, and testing practices.•Understanding of key business processes and competitive strategies related to the IT function.•Work with project architect, project manager, business owner and system analysts to clarify the requirements and then implement them. •Participate in Agile SDLC.",
        "source": "Email",
        "date_posted": "2024-10-15 10:23:47-05:00",
        "unique_id": "19290e7c84113b2a",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]