[
    {
        "company": "BitFlow Innovative Group",
        "job_title": "Workday BA/ Data Analysis",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "3+ years",
            "degree_required": "Bachelor’s degree",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Data Warehousing",
                "Data Mapping",
                "Business Analysis",
                "Snowflake"
            ],
            "primary": [
                "Workday HCM",
                "HRIS systems",
                "Power BI"
            ],
            "secondary": [
                "UKG"
            ],
            "all": [
                "Data Warehousing",
                "Data Mapping",
                "Business Analysis",
                "Snowflake",
                "Workday HCM",
                "HRIS systems",
                "Power BI",
                "UKG"
            ],
            "with_experience": [
                "Data Warehousing",
                "Data Mapping",
                "Business Analysis"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Swagatika",
        "email": "swagatika.senapati@bitflowgroup.com",
        "jd": "From: swagatika, Bitflow swagatika.senapati@bitflowgroup.com Reply to: swagatika.senapati@bitflowgroup.com Hi,I hope you are doing well.This is Swagatika from BitFlow Innovative Group. I have an excellent Job opportunity for you.Please find the Job Description, please revert me with your updated resume if you are interested. Role: Workday BA/ Data AnalysisLocation: RemoteVisa: H1B, H4EAD, GCEAD, GA AND USCRelevent Experience: 10+JOB DESCRIPTIONMain responsibilities: Will focus on BA tasks related to Workday integration to the existing People Data Mart. Data mapping from legacy system to new system for transmission and representation in a Data Mart Building new Data Warehouse using Snowflake. Current Data Warehouse is built with MS SQL. Will mostly work alongside two other people Business SME focused on Power BI dashboard and reports Data Warehouse Manager / Developer who build their current Data Mart and will be building the new Data Warehouse Define scenarios of how data is coming from Workday to the Data Warehouse Legacy data mapping from existing Data Mart Will need to take ownership if these tasks from their Data Warehouse Manager This role will not be building anything, but rather define how data will be mapped between different systems Requirements: MUST HAVE Bachelor’s degree & 3+ years of relevant IT experience If no degree, 1 year of experience for each year of education AA & 5+ years of relevant IT experience HS Diploma or GED & 7+ years of relevant IT experience BA or Data Analysis experience with focus on Data Warehouses Strong data mapping skills from legacy systems to new systems Proven BA / Data Analysis experience in order of importance Data Warehouses – must have Snowflake – highly preferred Workday HCM or other HRIS systems – preferred UKG – nice to have",
        "source": "Email",
        "date_posted": "2024-10-15 10:02:33-05:00",
        "unique_id": "19290eec14fb6751",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]