[
    {
        "company": "Techrooted INC",
        "job_title": "Sr. Pega Engineer/Developer",
        "location": "Austin, TX, USA",
        "full_location": {
            "city": "Austin",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "5+ years",
            "degree_required": "Bachelor's in computer science related fields",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "PEGA",
                "JAVA"
            ],
            "primary": [
                "Splunk",
                "Dynatrace",
                "SQL"
            ],
            "secondary": [],
            "all": [
                "PEGA",
                "JAVA",
                "Splunk",
                "Dynatrace",
                "SQL"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Amandeep Kaur",
        "email": "amandeep@techrooted.com",
        "jd": "Hi, This is Aman, Technical Recruiter at Techrooted, we have an excellent job opportunity for you. Please let me know if you are interested then share your updated resume along with your contact details so that we can proceed further. Sr. Pega Engineer/DeveloperLocation: Austin, TX (clients 1st choice), Memphis, TN, Morris Plains, NJ or St Louis, MO – (Need Local to TX, TN, NJ or MO only; Hybrid 3 days per week onsite)USC GC GCEAD only. Notes and submission criteria for consultants:Solid with 500+ connections and with current location and profile picture LinkedIn profile is must.Last 5 digits of SSNMention Current & exact Location and visa while sharing the profile; otherwise i will not consider it.Please take the time to make sure they are giving you their direct, personal, established email that they have used the longest as well as their personal cell phone number (I cannot clear any candidates with disposable VoIP / Google phones ore marketing emails that are new and /or unused. They have to have the 5+ years of Pega Healthcare Management Suite and the 7 years of Java Job Description: Required Skills: PEGA, JAVA Skills: PEGA , JAVA , Splunk or any similar log analyzer , Dynatrace or any similar monitoring tool , SQL Education: Bachelors in computer science related fields MUST HAVES:5 + year of experience with Pega BPM 8.8.X including Pega Healthcare Management suite7+ years of Java development experience5+ years of experience working in a Test-Driven Development (TDD) Environment performing code reviews, design reviews, peer reviews Duties: Analyse, design and support implementation of business specific Pega solutions and/or frameworksResponsible for implementing technical solutions on Pega 8.8.X, and Pega Healthcare Management SuiteAbility to create reusable components that can be leveraged across the enterprise for providing top-notch customer experienceAbility to translate complex business requirement into functional technical requirements using Pega Systems BPM methodologyGood hands on implementing PEGA integration services, good understanding of PEGA new case management features.Perform regular code and design reviews.Assist with planning and execution of unit, integration and user acceptance testingProvide regular updates to product owners and management on project progress and outstanding issuesTakes responsibility for resolving escalations and reporting back to operations leadership as neededParticipates in peer-reviews of solution designs and related code and configurations.Supports packaging and deployment of releasesAnalyzes and resolves technical and application problems and monitors the performance of internal systemsAttends scrum ceremony meetings and design sessions.Maximize the efficiency (operational, performance, and cost) of the application assets.",
        "source": "Email",
        "date_posted": "2024-10-15 11:17:19-05:00",
        "unique_id": "1929118cc223cd79",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "PEGA Developer"
    }
]