[
    {
        "company": "Tek Inspirations LLC",
        "job_title": "Senior Java Full Stack Developer",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Bachelor’s or Master’s degree in Computer Science, Engineering, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Full Stack Development",
                "Frontend Engineering",
                "Backend Engineering",
                "Cloud Integration",
                "API development"
            ],
            "primary": [
                "React",
                "Vue.js",
                "Angular",
                "Node.js",
                "Python",
                "Java",
                "AWS",
                "Azure",
                "GCP"
            ],
            "secondary": [
                "UI/UX design",
                "Data management",
                "Modern web development practices",
                "Collaboration Skills"
            ],
            "all": [
                "Full Stack Development",
                "Frontend Engineering",
                "Backend Engineering",
                "Cloud Integration",
                "API development",
                "React",
                "Vue.js",
                "Angular",
                "Node.js",
                "Python",
                "Java",
                "AWS",
                "Azure",
                "GCP",
                "UI/UX design",
                "Data management",
                "Modern web development practices",
                "Collaboration Skills"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Ravi Duvey",
        "email": "ravi.duvey@tekinspirations.com",
        "jd": "From: Ravi Duvey, Tek Inspirations LLC ravi.duvey@tekinspirations.com Reply to: ravi.duvey@tekinspirations.com Job Description :Title : Senior Java Full Stack DeveloperType : 100% RemoteLocation : RemoteDuration : 6+ monthsMOI : Virtual Humble request, please don’t send fake candidates.LinkedIn needed Must pass a technical screening with strong GenAI experience in designing chatbots.We are seeking a highly skilled Full Stack Engineer with a keen eye for UI/UX design to take a leading role in developing next-generation Generative AI (GenAI) chatbots. This role is at the intersection of intuitive user interface design and robust backend architecture, aimed at crafting engaging and innovative conversational AI experiences. As a key member of our interdisciplinary team, which includes Product Managers, UX Designers, Data Scientists, and Machine Learning Engineers, you will play a crucial role in bringing our GenAI projects from concept to reality, ensuring they are not only technologically advanced but also user-friendly and impactful. Key Responsibilities : Full Stack Development: Contribute to both the frontend and backend of our GenAI applications, with the flexibility to focus on the area where you excel, whether building intuitive user interfaces or developing robust backend systems. Frontend Engineering: Build responsive, user-friendly interfaces using frameworks like React, Vue.js, or Angular, ensuring smooth user experiences across devices. Backend Engineering: Design and implement scalable backend systems, including APIs and data pipelines, using technologies like Node.js, Python, or Java. Cloud Integration: Deploy and maintain applications on cloud platforms like AWS, Azure, or GCP, ensuring they are scalable, secure, and resilient. Collaboration: Work closely with product managers, data scientists, and machine learning engineers to create seamless integrations between frontend, backend, and AI models. Performance & Optimization: Continuously improve the performance and scalability of both frontend and backend systems, ensuring a reliable user experience. Security & Best Practices: Ensure all development follows security best practices, optimizing both backend and frontend for secure data management and compliance with regulations. Qualifications : Bachelor’s or Master’s degree in Computer Science, Engineering, or a related field. Proven experience in Full Stack Development, with strong skills in either frontend or backend but a demonstrated ability to contribute across both. Proficiency in frontend frameworks like React, Vue.js, or Angular, as well as backend technologies like Node.js, Python, or Java. Familiarity with cloud platforms like AWS, Azure, or GCP and experience deploying scalable, secure applications. Strong understanding of API development, data management, and modern web development practices. Collaboration Skills: Ability to work in cross-functional teams to integrate systems and deliver cohesive GenAI products.",
        "source": "Email",
        "date_posted": "2024-10-15 10:27:36-05:00",
        "unique_id": "19290ededfe38b1d",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]