[
    {
        "company": "Vyze Inc",
        "job_title": "Oracle Database Administrator",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "6 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Must have existing work authorization",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle database design",
                "performance tuning",
                "database structures",
                "data analysis",
                "Agile methodology"
            ],
            "primary": [
                "Jira",
                "Oracle Certification",
                "Financial data warehouse applications",
                "database reporting features"
            ],
            "secondary": [],
            "all": [
                "Oracle database design",
                "performance tuning",
                "database structures",
                "data analysis",
                "Agile methodology",
                "Jira",
                "Oracle Certification",
                "Financial data warehouse applications",
                "database reporting features"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Rohit Singh",
        "email": "srohit@vyzeinc.com",
        "jd": "Hi,Hope you are doing well today! My name is Rohit Singh and I am a Technical Recruiter working with Vyze Inc. I have an exciting opportunity with one of our client. Below are the job details for your review. If interested send me your updated resume with contact details, expected pay rate along with below information.Job Description -Job Title : Oracle Database AdministratorDuration : Long Term Location : Anywhere in Texas. Remote ( Need local to Taxes ) Work Auth. : USC , GC Only Mode of Interview : Skype Please submit LinkedIn along with submission Client : State of Texas Only submit candidates with:- Jira experience- Oracle Certification- Experience with Financial data warehouse applications and/or database reporting featuresWe are seeking an Oracle Database Administrator with strong knowledge of Oracle programming, systems design, database structures, and current database technologies for a Financial Data Warehouse for a 10 month contract position working remotely from anywhere in Texas.Responsibilities include:1. Manage and monitor database performance2. Direct programmers and analysts to make system changes3. Review and correct programs4. Perform database tuning for improved performance5. Assist in planning and developing integrated database systems6. Evaluate and incorporate user requests for new data elements7. Ensure data integrity and controls redundancy8. Conduct data modeling and prototyping9. Implement security and recovery procedures10. Optimize database search strategies and storage11. Maintain data dictionary and sets standards12. Create test environments and manages database backups13. Assist with disaster recovery procedures14. Help select and install database software15. Ensure compliance with accessibility standards16. Provide user support for data retrieval and accessibility issuesRequirements: Yrs Experience : 6 Experience in Oracle database design, analysis, and performance tuning for a Financial Data Warehouse.6 Experience in Oracle database structures and data analysis6 Experience designing enterprise applications and/or services6 Experience creating technical and functional design documentation6 Experience within software development lifecycle using Agile methodology – (Scrum, for example)6 Experience with multi-tier system/application development – (SOA, Microservices, 3-Tier applications, for example)1 Jira experience1 Oracle Certification1 Experience with Financial data warehouse applications and/or database reporting featuresIf you have consultants meeting the requirements for this position, please carefully read below before you reply and attach their resumes with their availability and rate.PLEASE READ-before submitting any of your consultants : • ALWAYS provide your consultants full name-(What is on their Visa), resume, phone number, rate, email address, and location. • Client is a State Agency Client• Interviews by phone and Skype• Do not call as that will only slow down our ability to respond to you quickly.• Please provide Visa Status• An e-Verify report will be required when hiredOnce we have received your resumes we will contact you if there is a fit. Best RegardsRohit SinghUS Technical Recruiter |Vyze Inc.E-Mail: Srohit@vyzeinc.com",
        "source": "Email",
        "date_posted": "2024-10-15 16:26:55-05:00",
        "unique_id": "19292ac838144702",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Oracle DBA"
    }
]