[
    {
        "company": "Yochana IT Solutions",
        "job_title": "Scrum Master",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Scrum",
                "Agile",
                "Cloud-Native",
                "SAFe",
                "Quality Assurance"
            ],
            "primary": [
                "Collaboration",
                "Technical Guidance",
                "Code Reviews",
                "Performance Optimization",
                "Risk Control"
            ],
            "secondary": [
                "Metrics Delivery",
                "Project Scope Definition",
                "Stakeholder Collaboration",
                "Technical Discussions"
            ],
            "all": [
                "Scrum",
                "Agile",
                "Cloud-Native",
                "SAFe",
                "Quality Assurance",
                "Collaboration",
                "Technical Guidance",
                "Code Reviews",
                "Performance Optimization",
                "Risk Control",
                "Metrics Delivery",
                "Project Scope Definition",
                "Stakeholder Collaboration",
                "Technical Discussions"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Chandra Sekhar Prathipati",
        "email": "chandra@yochana.com",
        "jd": "From: Chandra Sekhar Prathipati, Yochana IT Solutions chandra@yochana.com Reply to: chandra@yochana.com Hi,This is Chandra from Yochana IT Solutions, I Recently found your resume in one of our Job portal and We are looking for “Scrum Master, Atlanta, GA//Frisco, TX(Onsite)” with one of our client, I have included the job information below, If you are interested, please share your updated resume.Job Description:Responsible for planning, designing, testing, and implementing computer and network security infrastructure design and implementation for project including Cloud-Native container as a service. Required skills Collaborating with implementation team to ensure completion of epic, story points and workstream tasks. Conducting Scrum team ceremonies to enhance efficiency and eliminate backlog. Promoting scaled Agile framework (SAFe) quality practices across teams, stakeholders, and projects. Administering the Scrum board to visualize and manage workflows. Removing impediments to progress. Holding one-on-one meetings for Agile coaching. Prior Experience in delivering key metrics for complex cloud implementation. Creates and drives quality metrics and targets. Upholds the organizational Issue Cap in all products. Drives the time taken for regressionhardening release-over-release toward 0. Drives combined percentage of work time spent on uncontained (leaked) defects each sprint to less than 10%. Drives combined percentage Sprint commitments being met to greater than 90%. Drives combined percent increase in velocity year-over-year by 5% per year. Enhanced Predictability Drives teams actuals to within 10% of estimates. Control Risk (1.) To be responsible for providing technical guidance to a team of developers, enhancing their technical capabilities and increasing productivity. (2.) To conduct comprehensive code reviews, establish and oversee quality assurance processes, performance optimization , implementation of best practices and coding standards to ensure succeful delivery of complex projects. (3.) To ensure process compliance in the assigned module, and participate in technical discussionsorreview as a technical consultant for feasibility study (technical alternatives, best packages, supporting architecture best practices, technical risks, breakdown into components, estimations). (4.) To collaborate with stakeholders to define project scope, objectives, deliverables and accordingly prepare and submit status reports for minimizing exposure and closure of escalations.",
        "source": "Email",
        "date_posted": "2024-10-15 07:13:42-05:00",
        "unique_id": "1929039fa7d0aff5",
        "emp_type": [
            "third party"
        ],
        "tag": "Scrum Master"
    }
]