[
    {
        "company": "QuikTrip",
        "job_title": "Sr. Software Developer (.Net) with Blazor",
        "location": "Tulsa, OK, USA",
        "full_location": {
            "city": "Tulsa",
            "state": "OK",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "7-8 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Must have existing work authorization",
            "notice_period": "Not specified",
            "duration": "12-24 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "C#",
                ".NET",
                "MS SQL",
                "JavaScript",
                "Blazor",
                "WPF",
                "SSIS"
            ],
            "primary": [
                "Azure DevOps",
                "Leadership"
            ],
            "secondary": [],
            "all": [
                "C#",
                ".NET",
                "MS SQL",
                "JavaScript",
                "Blazor",
                "WPF",
                "SSIS",
                "Azure DevOps",
                "Leadership"
            ]
        },
        "job_type": [
            "onsite",
            "hybrid"
        ],
        "contact_person": "Shashank Srivastava",
        "email": "shashank@vastika.com",
        "jd": "From: Shashank, Vastika shashank@vastika.com Reply to: shashank@vastika.com Hi,I hope you are doing well. I had a position; please go through it, and if you feel comfortable with the job description, then share with me your updated resume on shashank@vastika.com.Role: Sr. Software Developer (.Net) with BlazorLocation: Tulsa, OKDuration: 12-24 monthsMOI: F2F InterviewsVisa: US Citizen or Green Card Note: Onsite role – Hybrid possible (Most of the work needed onsite)....!Looking for a developer with at least 7-8 years of experience, Level III to work on the Retail Back Office project. This project will be focused on rewriting our legacy Back Office applications and websites. We will be rewriting them with WPF and Blazor. Ability to quickly understand our domain and start work with little or no oversight.Must Have:C# - 3+ years.NET - 3+ yearsMS SQL – 1+ yearJavaScript – 1+ yearBlazor - 1+ yearWPF - 1+ yearSSIS - 1+ yearNice to Have or Some Experience:Azure DevOpsLeadership ability to help lead Junior Developers if needed.Description: Perform development, testing, debugging, and documenting of programs for computer-based systems. Provide maintenance and support of computer-based systems. Product Development and Engineering (90%)Write, modify, extend and debug software based on QuikTrip’s Software Development Lifecycle (SDLC) process.Adheres to QuikTrip’s coding standards and best practices.Have extensive knowledge of development tools/environments utilized by QuikTrip.Utilize thorough understanding of complex database concepts and practices during development process.Possesses and apply working knowledge of multiple programming languages utilized by QuikTrip during development process.Resolve technical issues related to software problems utilizing excellent customer service skills, problem solving skills, and technical thinking/reasoning skills following established support process and metrics guidelines.Measure and analyze incoming software issues to determine root cause and develop technical and training solutions to minimize reoccurrences and severity; report results to management.Accurately document all customer issues, resolution steps, and gather feedback in support tracking software to enhance identifying and reporting trends leading to recurring technical problems.Develop and publish support documentation for internal users for troubleshooting, training and other areas as needed.Gather and forward customer feedback and suggestions for product improvement.May perform the following functions of a Product Technical Owner on occasion: Major functions for this position:Manages technical debt (backlog) of the product.Determine resource and skill sets requirements by sprint.Organize and plan technology roadmap advancements for assigned products.Alert any product related conflicts to the Product Portfolio Manager. Ensure that implementation plans for the product features and user stories are consistent with QuikTrip’s architecture, technology and development standards.Ensure that Quality and Security are carried throughout product development and product lifecycle management.Accountable for all aspects of technological performance of the product including software, hardware, database, nonfunctional requirements, etc.Plan product releases for rolling 12 months.Ensure consistency in design on various products within their portfolio by following reference architecture provided by enterprise architecture, and engage architecture whenever exceptions need to be made.Assist with User Story, Bug and other Work Item delivery and acceptance as well as technical documentation such as current state diagrams and process flows for use in driving architectural and procedural decisions.Be a contributor to the success of product development and delivery by facilitating working groups or directly contributing to coding efforts, code reviews, testing and/or other work when needed.Provide supporting information as needed for service management of assigned products including properly logging and prioritization of identified issues in the backlog.Coordinates delivery efforts across one or more development teams including arbitration of technical conflicts and decisions.Holds Development, Technical, Professional Services, Data, and other IT teams accountable within the framework of the product.",
        "source": "Email",
        "date_posted": "2024-10-15 09:51:55-05:00",
        "unique_id": "19290fc6b8d36d72",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]