[
    {
        "company": "Adventa tech inc",
        "job_title": "Sr. Pega Engineer/Developer",
        "location": "Austin, TX, USA",
        "full_location": {
            "city": "Austin",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "5+ years",
            "degree_required": "Bachelor's in computer science related fields",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "PEGA",
                "JAVA"
            ],
            "primary": [
                "Pega BPM 8.8.X",
                "Pega Healthcare Management Suite",
                "Test-Driven Development (TDD)",
                "code reviews",
                "design reviews"
            ],
            "secondary": [
                "Splunk",
                "Dynatrace",
                "SQL"
            ],
            "all": [
                "PEGA",
                "JAVA",
                "Pega BPM 8.8.X",
                "Pega Healthcare Management Suite",
                "Test-Driven Development (TDD)",
                "code reviews",
                "design reviews",
                "Splunk",
                "Dynatrace",
                "SQL"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "banani banojini das",
        "email": "banani@adventatech.com",
        "jd": "From: banani banojini das, Adventa tech inc banani@adventatech.com Reply to: banani@adventatech.com Title: Sr. Pega Engineer/DeveloperLocation: Onsite 3 days a week: Austin, TX (clients 1st choice), Memphis, TN, Morris Plains, NJ or St Louis, MO (Local Candidates Only with DL)Duration:6 monthVisa: CITIZEN,GREEN CARDMoi: Skype Must Have:I cannot use any old Pega developer for this role. They have to have the 5+ years of Pega Healthcare Management Suite and the 7 years of Java. PLEASE, NO candidates that do not meet these minimum requirements for this one.Sr. Pega Engineer/DeveloperNO VOIP NO. and Marketing email allowed please send candidates personal cell phone number.LinkedIn must Job Description -MUST HAVES:5 + year of experience with Pega BPM 8.8.X including Pega Healthcare Management suite7+ years of Java development experience5+ years of experience working in a Test-Driven Development (TDD) Environment performing code reviews, design reviews, peer reviewsDuties: Analyse, design and support implementation of business specific Pega solutions and/or frameworksResponsible for implementing technical solutions on Pega 8.8.X, and Pega Healthcare Management SuiteAbility to create reusable components that can be leveraged across the enterprise for providing top-notch customer experienceAbility to translate complex business requirement into functional technical requirements using Pega Systems BPM methodologyGood hands on implementing PEGA integration services, good understanding of PEGA new case management features.Perform regular code and design reviews.Assist with planning and execution of unit, integration and user acceptance testingProvide regular updates to product owners and management on project progress and outstanding issuesTakes responsibility for resolving escalations and reporting back to operations leadership as neededParticipates in peer-reviews of solution designs and related code and configurations.Supports packaging and deployment of releasesAnalyzes and resolves technical and application problems and monitors the performance of internal systemsAttends scrum ceremony meetings and design sessions.Maximize the efficiency (operational, performance, and cost) of the application assets.Required Skills: PEGA, JAVASkills: PEGA , JAVA , Splunk or any similar log analyzer , Dynatrace or any similar monitoring tool , SQLEducation: Bachelors in computer science related fields",
        "source": "Email",
        "date_posted": "2024-10-15 11:58:29-05:00",
        "unique_id": "192913e7dfaa7286",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "PEGA Developer"
    }
]