[
    {
        "company": "Adventa Tech Inc.",
        "job_title": ".NET Developer",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "14 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "C#",
                ".NET Development",
                "SQL Server",
                "Angular",
                "Blazor"
            ],
            "primary": [
                "Web API",
                "CSS3",
                "HTML5",
                "Source Control using TFS",
                "Automated Builds using Microsoft Team Foundation",
                "Agile SDLC best practices"
            ],
            "secondary": [
                "Oracle",
                "SOAP Services",
                "Azure Cloud Concepts",
                "Power"
            ],
            "all": [
                "C#",
                ".NET Development",
                "SQL Server",
                "Angular",
                "Blazor",
                "Web API",
                "CSS3",
                "HTML5",
                "Source Control using TFS",
                "Automated Builds using Microsoft Team Foundation",
                "Agile SDLC best practices",
                "Oracle",
                "SOAP Services",
                "Azure Cloud Concepts",
                "Power"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Aman Saxena",
        "email": "aman@adventatech.com",
        "jd": "Hi, Hope you are doing good. I have following requirement, please reply me back with profile along with rate expectation Job Description -Full Stack Developer with 14 years .NET experienceLocation : Richmond, VA 23219( Hybrid ) Must be localInterview Mode : In Person Interview OnlyVisa : No H1B/ CPT VDOT-AMD is seeking a Developer with 14 yrs or more .Net Web application development. Experience and fluency with C#, Angular or Blazor, SQL Server, JQuery, CSS3 and HTML5 experienceVDOT is seeking a Full Stack Senior ERP Developer/Programmer with .Net Applications Development experience who will be responsible for managing, programming, testing, debugging and analyzing complex software requirements to design and develop high quality components using the .NET Core framework. The ERP Developer will be programming the current budget and spend plan tool that is used agency wide for financial and budget management for the Maintenance Program. The Senior Developer is expected to program using best practices, prioritize programming work effectively and write system documentation as required. The successful candidate should have strong programming and communication skills to be effective in both technical and business requirement discussions. Primary responsibilities include: SkillsRequired / DesiredExperienceC#.NET Development experienceRequired14 YearsAngular or Blazor Development experienceRequired5 YearsStrong Database development experience using SQL ServerRequired14 YearsExperience with Web APIRequired5 YearsExperience with CSS3 and HTML5Required5 YearsExperience with Source Control using TFSRequired10 YearsExperience with Automated Builds using Microsoft Team FoundationRequired5 YearsExcellent Troubleshooting skillsRequired12 YearsExperience with Agile SDLC best practicesRequired5 YearsExperience working in OracleDesired2 YearsUnderstanding of SOAP ServicesDesired5 YearsFamiliar with Azure Cloud ConceptsDesired1 YearExperience with Power",
        "source": "Email",
        "date_posted": "2024-10-15 11:35:39-05:00",
        "unique_id": "192914641c07280a",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]