[
    {
        "company": "ZealHire",
        "job_title": "Lead Product Manager",
        "location": "New York City, NY, USA",
        "full_location": {
            "city": "New York City",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "More than seven (7) years of experience working on complex projects with 2 or more years in a leadership role as a Specialist",
            "degree_required": "Bachelor’s degree in Business, Computer Science, Engineering, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "28 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Product Management",
                "Agile Development",
                "Backlog Management",
                "User Stories",
                "Stakeholder Communication"
            ],
            "primary": [
                "Leadership",
                "User-Centric Design",
                "Performance Tracking",
                "Jira",
                "Confluence"
            ],
            "secondary": [
                "Scrum",
                "Kanban",
                "Project Management"
            ],
            "all": [
                "Product Management",
                "Agile Development",
                "Backlog Management",
                "User Stories",
                "Stakeholder Communication",
                "Leadership",
                "User-Centric Design",
                "Performance Tracking",
                "Jira",
                "Confluence",
                "Scrum",
                "Kanban",
                "Project Management"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Rajeev Kumar",
        "email": "rajeeve@zealhire.com",
        "jd": "Hello, My name is Rajeev Kumar and I am a Staffing Specialist at ZealHire. I am reaching out to you on an exciting job opportunity with one of our clients.Job Title - Lead Product ManagerLocation - Remote USC/GCDuration – 28 MonthsNote- USC/GC, need LinkedIn, VISA DL, Local to NY/NJ, IES form is required Job Description: The Product Manager will play a critical role in translating the company's vision into actionable product development plans. This position requires a deep understanding of user needs, market trends, and technology, along with the ability to prioritize features and drive product development from concept to launch. Product Vision & Roadmap: Collaborate with stakeholders to define product vision and roadmap, ensuring alignment with business goals and user needs,Backlog Management: Create, prioritize, and manage the product backlog, ensuring that the most valuable features are developed first.User Stories & Requirements: Write clear and actionable user stories, acceptance criteria, and product requirements that guide the development team.Stakeholder Communication: Serve as the main point of contact between the development team and stakeholders, ensuring transparency and alignment throughout the product lifecycle.Sprint Planning: Lead sprint planning sessions, working closely with the Scrum Master and development team to ensure the timely delivery of features.User-Centric Design: Advocate for the end user, ensuring that products deliver an exceptional user experience.Performance Tracking: Monitor product performance post-launch, gather user feedback, and iterate on the product to improve its value and effectiveness. Mandatory Qualification(PASS/FAIL)Level III- More than seven (7) years of experience working on complex projects with 2 or more years in a leadership role as a SpecialistTen or more years of experience in product management and in integrated or complex systems.Ten or more years' experience working with agile development processes and methodologies such as scrum or kanban Additional Qualifications:Seven or more years working experience in managing and prioritizing product backlogs.Seven or more years of experience in building technical products from ideation to launchSeven or more years of working experience, demonstrating the ability to manage multiple projects simultaneously and meet deadlinesThree or more years of working experience with tools such as Jira, Confluence, or similar project management software.Bachelor’s degree in Business, Computer Science, Engineering, or a related field.",
        "source": "Email",
        "date_posted": "2024-10-15 13:17:10-05:00",
        "unique_id": "1929186844ca5302",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]