[
    {
        "company": "ZealHire",
        "job_title": "Full Stack 14414",
        "location": "Chicago, IL, USA",
        "full_location": {
            "city": "Chicago",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "14414",
            "experience_required": "5+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java Development",
                "Front End Development",
                "AWS Development",
                "CI/CD deployment",
                "Unit testing"
            ],
            "primary": [
                "React",
                "Vue",
                "Spring Boot",
                "Docker",
                "GitHub Actions"
            ],
            "secondary": [
                "ELK Stack",
                "Google Analytics",
                "AppDynamics",
                "JUnit",
                "Mockito",
                "REST",
                "Pub/Sub Messaging",
                "Agile Development",
                "SonarQube",
                "Veracode",
                "Wiz"
            ],
            "all": [
                "Java Development",
                "Front End Development",
                "AWS Development",
                "CI/CD deployment",
                "Unit testing",
                "React",
                "Vue",
                "Spring Boot",
                "Docker",
                "GitHub Actions",
                "ELK Stack",
                "Google Analytics",
                "AppDynamics",
                "JUnit",
                "Mockito",
                "REST",
                "Pub/Sub Messaging",
                "Agile Development",
                "SonarQube",
                "Veracode",
                "Wiz"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Raman Arora",
        "email": "raman@zealhire.com",
        "jd": "Hello, My name is Raman Arora and I am a Staffing Specialist at ZealHire. I am reaching out to you on an exciting job opportunity with one of our clients. Job Title - Full Stack 14414 Location - Chicago, Illinois Job Description: USC/GC need LinkedIn - must be updated and no new LinkedIns VISA DL Previous Airlines exp Local to Chicago Job Description: This position is for onboarding an experienced Sr. full stack Java developer with extensive expertise in both back end and front end. This individual will be responsible for designing, developing, documenting, debugging, and testing secure software applications. The ideal candidate should have hands-on experience with the latest web UI platforms such as React, and Vue, be familiar with industry standards and best practices in UI development. Extensive experience working in a cloud environment is also necessary. Top 5 Skill sets 1. Java Development 2. Front End Development 3. AWS Development 4. CI/CD deployment 5 Unit testing Senior Java Developer This position is for onboarding an experienced Sr. full stack Java developer with extensive expertise in both back end and front end. This individual will be responsible for designing, developing, documenting, debugging, and testing secure software applications. The ideal candidate should have hands-on experience with the latest web UI platforms such as React, and Vue, be familiar with industry standards and best practices in UI development. Extensive experience working in a cloud environment is also necessary. Job Responsibilities Design, develop, document, test, and debug new and existing software systems and applications. Collaborate with UX professionals to evaluate, modernize, consolidate, and improve existing UIs, ensuring they meet user needs and company expectations. Develop applications using AWS services such as S3, SNS/SQS Event Driven Messaging, DynamoDB, and IAM. Write and execute unit tests using JUnit 5 and Mockito 5 to ensure robustness, including edge cases, usability, and general reliability. Use Docker for software packaging, allowing for efficiency and ease of deployment in production environments. Utilize GitHub Actions for continuous integration and continuous deployment strategies. Protect our systems by implementing and practicing secure software development techniques, standards and best practices Troubleshoot and debug issues that arise. Maintain technical documentation. Requirements and Skills: Proven work experience as a software engineer 5+ years of experience in design, development, documenting, testing, and debugging of new and existing software systems and applications with Java and Spring Boot 5+ years of hands-on experience implementing AWS technologies (ECS, SNS, SQS, DynamoDB, S3, CDK/CloudFormation) In-depth knowledge of various web-related technologies (such as Web applications, services, architectures etc.) Experience with AWS Cloud deployment and GitHub Actions workflows Experience with analytic tools such as ELK Stack, Google Analytics, or AppDynamics Experience with unit testing frameworks like Junit or Mockito Hands-on and proficient excellence in backend development of REST and Pub/Sub Messaging applications Experience working with high performance teams in an agile development environment where continuous integration and continuous delivery (CI/CD) are critical. Experience with secure software development life cycle framework Knowledge of security principles and familiar with code scanning tools like SonarQube, Veracode or Wiz. Demonstrate knowledge of software engineering best practices such as version control, software packaging and software release management Self-motivated with strong communication skills (verbal and written) and the ability to work in team-oriented environment. Strong analytical and problem-solving skills; attention to detail Should you be interested, please send me a copy of your resume in word format along with the following details ASAP. Full Name: Current Location: Hourly rate on C2C/W2: Work Authorization: Earliest Available date to start: Date and times available to interview: Two Professional References: (Preferably Supervisory references): Kind Regards, Raman Arora Technical Recruiter ZealHire Inc. Email: Raman@zealhire.com Direct: ​ (332) 287 8468 Ext. 112 https://www.linkedin.com/in/raman-arora-97b749211/ 14 Wall Street 20th Floor | New York, NY 10005 www.zealhire.com",
        "source": "Email",
        "date_posted": "2024-10-15 08:11:01-05:00",
        "unique_id": "192906e3c71f40d3",
        "emp_type": [
            "third party"
        ],
        "tag": "Java developer"
    }
]