[
    {
        "company": "Vyze Inc",
        "job_title": "Applications Development Analyst",
        "location": "Tallahassee, FL, USA",
        "full_location": {
            "city": "Tallahassee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "5+ years",
            "degree_required": "Bachelor’s or Master’s Degree in Computer Science, Information Systems, or other related field. Or equivalent work experience.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 Months+",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".NET",
                ".NET core",
                "T-SQL",
                "C#",
                "ASP.NET",
                "Blazor"
            ],
            "primary": [
                "Data mapping",
                "Application architecture",
                "Data integration",
                "Data analysis",
                "Testing complex data integration processes"
            ],
            "secondary": [
                "Microsoft Certification",
                "Azure Cloud",
                "DevOps practices",
                "Continuous integration",
                "Continuous delivery",
                "GitHub"
            ],
            "all": [
                ".NET",
                ".NET core",
                "T-SQL",
                "C#",
                "ASP.NET",
                "Blazor",
                "Data mapping",
                "Application architecture",
                "Data integration",
                "Data analysis",
                "Testing complex data integration processes",
                "Microsoft Certification",
                "Azure Cloud",
                "DevOps practices",
                "Continuous integration",
                "Continuous delivery",
                "GitHub"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Vishal Kumar",
        "email": "vishal@vyzeinc.com",
        "jd": "Job Description -Position: Applications Development Analyst Duration: 6 Months+ Location: Tallahassee, FL | Onsite Education• Bachelor’s or Master’s Degree in Computer Science, Information Systems, or other related field. Or equivalent work experience.Desired Certifications• Microsoft or Other Related CertificationRequired Experience • 5+ years of experience in .NET/.NET core application development (recent experience preferred),• 5+ years of experience in DDL, DML T-SQL skills, advanced stored procedure writing skills, tables, primary keys, foreign keys, constraints, indexes, transactions, process logging, and error handling.• 3+ years of experience with application design, including Data mapping.• 3+ years of experience in application architecture and data integration.• 3+ years of analyzing and interpreting large datasets, including cleaning, transforming, and visualizing data.• 3+ years of experience in testing high-volume of complex data integration processes.• 1+ years of experience using Blazor• Familiarity with system catalog views, and Azure CloudEducation: Bachelor’s or Master’s Degree in Computer Science, Information Systems, or other related field. Or equivalent work experience.Certifications: Microsoft or Other Related Certification (Desired)Responsibilities • Collaborate with business analysts, project managers, and stakeholders to understand the functional and non-functional requirements of the application.• Translate business requirements into architectural designs that align with business goals.• Design the overall system architecture and define how different components of the interact.• Design, develop, and implement software applications using the .NET framework and C#.• Utilize ASP.NET (or ASP.NET Core) for web application development, including MVC, Web API, and• Blazor for client-side and server-side programming.• Develop and optimize SQL queries, stored procedures, and functions.• Develop user interfaces and ensure the front end is responsive, accessible, and user- friendly.• Review code, architecture, and design to ensure they meet the standards.• Analyze and optimize the performance of the application.• Design strategies for scaling the application efficiently as user demand grows.• Ensure the application adheres to security best practices and compliance requirements.• Implement DevOps practices such as continuous integration and continuous delivery (CI/CD) via Azure DevOps and GitHub repositories.",
        "source": "Email",
        "date_posted": "2024-10-15 14:59:45-05:00",
        "unique_id": "1929256a33eb5b85",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]