[
    {
        "company": "Vyze Inc",
        "job_title": "SQL Server and Snowflake",
        "location": "Columbus, OH, USA",
        "full_location": {
            "city": "Columbus",
            "state": "OH",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SQL Server",
                "Snowflake",
                "Cosmos DB"
            ],
            "primary": [
                "Database Administration",
                "Database Optimization",
                "Documentation",
                "Collaboration",
                "Mentoring"
            ],
            "secondary": [
                "Security Hardening",
                "Troubleshooting",
                "Communication",
                "Teamwork",
                "Restaurant Industry Experience"
            ],
            "all": [
                "SQL Server",
                "Snowflake",
                "Cosmos DB",
                "Database Administration",
                "Database Optimization",
                "Documentation",
                "Collaboration",
                "Mentoring",
                "Security Hardening",
                "Troubleshooting",
                "Communication",
                "Teamwork",
                "Restaurant Industry Experience"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Rohit Singh",
        "email": "srohit@vyzeinc.com",
        "jd": "Hi,Hope you are doing well today! My name is Rohit Singh and I am a Technical Recruiter working with Vyze Inc. I have an exciting opportunity with one of our client. Below are the job details for your review. If interested send me your updated resume with contact details, expected pay rate along with below information. Job Description -Role: SQL Server and SnowflakeLocation: Hybrid 4days/wk in Columbus, OH (Need locals Only)Duration: 6+ MonthsVisa: No h1BLinkedin MustAbout this RoleWe are seeking an experienced Database Administrator (DBA) to join our dynamic team. This role will focus on managing and optimizing our database environments, including Microsoft SQL Server, Snowflake, and Cosmos DB. You will work closely with a team of DBAs and collaborate with BI developers to enhance our data infrastructure.Key Responsibilities:· Administer and manage Microsoft SQL Server, Snowflake, and Cosmos DB.· Document database environments, processes, and best practices.· Collaborate with business intelligence developers and application teams to optimize data usage and integration.· Mentor junior DBAs and provide guidance on database-related tasks.· Implement security hardening measures and ensure compliance with best practices.· Troubleshoot and resolve database performance issues.Benefits and Perks· Work with new technologies in a fast-paced and collaborative environment.· Make a lasting impact on our database design and practices.· Enjoy a culture that values growth, stability, and a positive work atmosphere.· Opportunities for personal and professional development.The Ideal Candidate· Strong experience with SQL Server database administration.· Expertise in Snowflake and Cosmos DB.· Excellent communication skills and an outgoing personality.· Ability to work collaboratively in a team environment.· Restaurant industry experience is a plusBest RegardsRohit SinghUS Technical Recruiter |Vyze Inc.E-Mail: Srohit@vyzeinc.com",
        "source": "Email",
        "date_posted": "2024-10-15 19:16:16-05:00",
        "unique_id": "19292e60b28339f3",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "DB Admin"
    }
]