[
    {
        "company": "Yochana IT Solutions",
        "job_title": "Java Solution Architect",
        "location": "San Antonio, TX, USA",
        "full_location": {
            "city": "San Antonio",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "15 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java Architecture (Java/J2EE)",
                "SOA Architecture (Restful API, SOAP)",
                "Microservices Architecture",
                "Docker/Contain/Kubernetes",
                "Spring Boot Framework"
            ],
            "primary": [
                "SRE principles",
                "Junit/Mockito",
                "React.JS/Redux",
                "AWS Services (AWS EKS, AWS S3 Bucket, EC2 Instances, RDS, Lambda Function)",
                "SQS",
                "SNS",
                "Dynamo DB"
            ],
            "secondary": [],
            "all": [
                "Java Architecture (Java/J2EE)",
                "SOA Architecture (Restful API, SOAP)",
                "Microservices Architecture",
                "Docker/Contain/Kubernetes",
                "SRE principles",
                "Spring Boot Framework",
                "Junit/Mockito",
                "React.JS/Redux",
                "AWS Services (AWS EKS, AWS S3 Bucket, EC2 Instances, RDS, Lambda Function)",
                "SQS",
                "SNS",
                "Dynamo DB"
            ],
            "with_experience": [
                "Java (15+ years)",
                "Spring Boot",
                "Cloud architectures (preferably AWS)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Malavika",
        "email": "malavika@yochana.com",
        "jd": "Hi,This is Malavika from Yochana IT Solutions, I Recently found your resume in one of our Job portal and We are looking for Java Solution Architect (Onsite) with one of our client, I have included the job information below, If you are interested, please share your updated resume. Role: Java Solution Architect Location: San Antonio, TX (Onsite) C2H Mandatory Skills: Java Architecture (Java/J2EE), SOA Architecture (Restful API, SOAP), Microservices Architecture, Docker/Contain/Kubernetes, SRE principles, Spring boot Framework, Junit/Mockito, React.JS/ Redux, Flux, AWS Services (AWS EKS, AWS S3 Bucket, EC2 Instances, RDS, Lambda Function), SQS, SNS, Dynamo DB, AWS EKS. Job description: Minimum of 15 years of experience in Java development, with a strong focus on Spring Boot and backend architecture. Prior experience in the financial sector is highly preferred. Strong understanding of cloud architectures, preferably with relevant certification (AWS). Expert knowledge of both SQL and NoSQL databases. Proven track record in designing and implementing complex system integrations. Strong background in test-driven development and automated testing frameworks. Responsibilities: Lead the design and development of robust, scalable, and maintainable backend systems, ensuring adherence to high and basic design principles. Collaborate with cross-functional teams to design and implement integration solutions, ensuring seamless data flow across systems. Apply SRE principles to enhance system reliability, performance, and availability. Utilize container technologies such as Docker, Kubernetes, and Open Shift to streamline deployment and orchestration of applications. Leverage Spring Boot to develop Microservices and backend applications, applying best practices and design patterns. Design and implement RESTful APIs, ensuring high performance and responsiveness to requests. Guide the creation of responsive and intuitive user interfaces using modern JavaScript frameworks, with a focus on React. Write unit and integration tests using JUnit, Mockito, or Power Mock, and ensure adherence to quality and security standards using tools like Sonar, Fortify, and Web Inspect. Produce comprehensive documentation for each Microservices, detailing architecture, design decisions, and implementation guidelines. Participate in Agile development processes, contributing to sprint planning, reviews, and retrospectives. Proactively identify and resolve bugs and performance issues in a timely manner. Engage in database design and optimization for integration systems, ensuring efficient data management and retrieval. Lead database architecture and optimization efforts, with a focus on performance and data integrity.",
        "source": "Email",
        "date_posted": "2024-10-15 13:18:24-05:00",
        "unique_id": "192922668651c8b2",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]