[
    {
        "company": "Pivotal Technologies, Inc",
        "job_title": "Business Analyst",
        "location": "Quincy, MA, USA",
        "full_location": {
            "city": "Quincy",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "4-5 years",
            "degree_required": "Bachelor’s Degree",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Content Management Solutions",
                "Eligibility Management",
                "Requirements Gathering",
                "Software Development Life Cycle"
            ],
            "primary": [
                "IT Applications Experience",
                "Stakeholder Management",
                "Process Redesign",
                "Testing",
                "Documentation"
            ],
            "secondary": [
                "Communication Skills",
                "Negotiation Skills",
                "Cross-Functional Team Coordination",
                "Trust Building",
                "Attention to Detail"
            ],
            "all": [
                "Business Analysis",
                "Content Management Solutions",
                "Eligibility Management",
                "Requirements Gathering",
                "Software Development Life Cycle",
                "IT Applications Experience",
                "Stakeholder Management",
                "Process Redesign",
                "Testing",
                "Documentation",
                "Communication Skills",
                "Negotiation Skills",
                "Cross-Functional Team Coordination",
                "Trust Building",
                "Attention to Detail"
            ],
            "with_experience": [
                "Business Analysis",
                "Content Management Solutions",
                "Eligibility Management"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Rajesh Kumar",
        "email": "rajesh.kumar@pivotal-technologies.com",
        "jd": "From: Rajesh Kumar, Pivotal Technologies, Inc rajesh.kumar@pivotal-technologies.com Reply to: rajesh.kumar@pivotal-technologies.com Title: Business Analyst Location: 100 Hancock St, Quincy, MADuration: 6+ Months Provide license as proof of residency No H1B Must have:Bachelor’s Degree 4-5 years of IT applications experience as a Business Analyst At least 2 years of experience supporting a benefits management program’s eligibility management processes Demonstrated understanding of complex information workflows through a Content Management Solution to publish sensitive information Demonstrated ability to analyze and synthesize business requirements JOB DESCRIPTION: PROGRAM OVERVIEW The Commonwealth of Massachusetts Executive Office for Health and Human Services (EOHHS) seeks to improve a constituent’s experience while interacting with eligibility and enrollment processes across its various agencies through more efficient and collaborative processes. This project will, through a series of iterative improvements, knit the various processes together into an Integrated Eligibility and Enrollment program to provide constituents with a unified view of applying, managing and being notified by Benefits programs. Position Summary: The Business Analyst will report to the program director and closely work with the IE&E PMO to support key programmatic initiatives ensuring deliverables are in line with the Program’s goals and meet the objectives of the various business stakeholders. The BA is an active member in all phases of the project including requirements gathering, design and development activities, testing, implementation, and ongoing operation. They serve as a liaison between the business community, the software quality assurance team, project management office and the technical development team and, as such, should have worked with Content Management Solutions, SaaS solutions, and are well-versed in operational concepts, and the Software Development Life Cycle. They are responsible for providing business systems analysis and process redesign expertise, interacting with business internal and external users to clearly define and document requirements. The candidate must have a strong working knowledge of eligibility and enrollment processes for Benefits management. DETAILED STATEMENT OF JOB DUTIES AND RESPONSIBILITIES: Stay current on stakeholder needs and the program visionServe as the custodian of program objectives and business requirements and assist in their realizationProduce a variety of high-quality documents within stipulated timelines that are complete, universally acceptable, and effectively communicate objectives. Participate in and contribute to JRM/JAD workshops with business SMEs, developers, testers, and BAs to analyze business processes, workflows, business policies, events, triggers, roles, integrated systems, data flows, etc. Develop user stories working closely with business SME’s in identifying/eliciting and documenting business requirements Publish/Review Business Requirements Documents, Requirements Traceability Matrix (RTM), mapping requirements, and test cases to ensure complete test coverage against in-scope requirements. Review test summary reports ensuring adequate testing coverage for key functional areas. Support stakeholders during each release/implementation. Closely co-ordinate with business stakeholders and track the deliverable submission, review and approval for supporting the ongoing enhancement release schedule.Support program director for tracking the enhancement resources capacity, assignment of weekly tasks, and utilization of the weekly hours. Learn the program's requirements management, change management, and defect management tools and track requirements/defect status throughout the project for the functional areas. Understand and proactively review existing processes, identify opportunities for improvement and make constructive suggestions for change that would benefit the Program Serve as an SME for the program and contribute to and review documents crafted by other teams. EDUCATION, EXPERIENCE, and QUALIFICATIONS Bachelor’s Degree 4-5 years of IT applications experience as a Business Analyst At least 2 years of experience supporting a benefits management program’s eligibility management processes Demonstrated understanding of complex information workflows through a Content Management Solution to publish sensitive information Demonstrated ability to analyze and synthesize business requirements Demonstrated ability to understand and negotiate the needs and expectations of multiple stakeholders. Excellent communication & negotiation skills and experience in supporting technical and non-technical staff Strong background in developing trust and confidence in relationships with stakeholders and cross-functional teams; experience coordinating and fulfilling requests for internal/external changes Demonstrated expertise in information systems, business operations, requirements analysis, and integration/design of solutions.The candidate must be process-oriented with sound judgment, attention to detail, accuracy, and follow-through including flexibility to perform in an ever",
        "source": "Email",
        "date_posted": "2024-10-15 10:51:56-05:00",
        "unique_id": "19291024062ea5e5",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]