[
    {
        "company": "Charles Hudson",
        "job_title": "Business Analyst",
        "location": "Wadsworth, OH, USA",
        "full_location": {
            "city": "Wadsworth",
            "state": "OH",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Stakeholder engagement",
                "UAT",
                "user acceptance testing",
                "ERP",
                "NetSuite",
                "Commerce"
            ],
            "primary": [
                "Ability to capture Requirements",
                "Ability to draw out requirements from business stakeholders",
                "Ability to document those requirements",
                "Ability to solicit feedback and produce updates to the requirements",
                "Excellent Communication"
            ],
            "secondary": [
                "Knowledge of the right people to engage within specific business areas",
                "Partner with business to write requirements for development work",
                "Drive decisions on Requirements",
                "Document and share decisions",
                "Understands overall business strategy",
                "Work with the Technology partners",
                "Partner with the Project Manager",
                "Partner with the Director of Software Development and CTO",
                "Develop Business Cases",
                "Work on Prioritizing efforts",
                "Ability to work with the business to create User Acceptance Test Cases and Test Scripts",
                "Build out the UAT test scripts",
                "Write applicable User Stories and Acceptance Criteria",
                "Define standard documentation for business processes post-Net Suite / Commerce launch",
                "Lead documentation of all Processes and Procedures impacted by the ERP",
                "Measure ROI on all Change Controls"
            ],
            "all": [
                "Stakeholder engagement",
                "UAT",
                "user acceptance testing",
                "ERP",
                "NetSuite",
                "Commerce",
                "Ability to capture Requirements",
                "Ability to draw out requirements from business stakeholders",
                "Ability to document those requirements",
                "Ability to solicit feedback and produce updates to the requirements",
                "Excellent Communication",
                "Knowledge of the right people to engage within specific business areas",
                "Partner with business to write requirements for development work",
                "Drive decisions on Requirements",
                "Document and share decisions",
                "Understands overall business strategy",
                "Work with the Technology partners",
                "Partner with the Project Manager",
                "Partner with the Director of Software Development and CTO",
                "Develop Business Cases",
                "Work on Prioritizing efforts",
                "Ability to work with the business to create User Acceptance Test Cases and Test Scripts",
                "Build out the UAT test scripts",
                "Write applicable User Stories and Acceptance Criteria",
                "Define standard documentation for business processes post-Net Suite / Commerce launch",
                "Lead documentation of all Processes and Procedures impacted by the ERP",
                "Measure ROI on all Change Controls"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Vikrama Rao",
        "email": "vrao@valiantiq.com",
        "jd": "From: Vikrama, Valiantiq vrao@valiantiq.com Reply to: vrao@valiantiq.com Title: Business AnalystClient: Charles HudsonLocation: Wadsworth, OH (Hybrid)Duration: 12+ Months Need local candidates in Ohio. Must Have Stakeholder engagement\" OR \"UAT\" OR \"user acceptance testing\" OR \"ERP\" OR \"NetSuite\" OR \"Commerce\" Business Analyst/Product ManagerKnowledge of the right people to engage within specific business areasAbility to capture Requirements Ability to draw out requirements from business stakeholdersAbility to document those requirementsAbility to solicit feedback and produce updates to the requirementsPartner with business to write requirements for development workDrive decisions on Requirements Get the right people engaged to make the right decisionsDocument and share those decisionsUnderstands overall business strategy and engages relevant stakeholders in ensuring all detailed requirements are documentedWork with the Technology partners to share and explain the requirements Partner with the Project Manager to ensure Excellent Communication across all appropriate areasPartner with the Director of Software Development and CTO on all development related activitiesDevelop Business Cases for every customization asked that is above and beyond the Out of Box functionalityWork on Prioritizing effortsAbility to work with the business to create User Acceptance Test Cases and Test ScriptsPartner with business on UAT efforts to build a structure to define success and roadmap for successful completionBuild out the UAT test scripts and provide the UAT accountable resources for each development effortWrite applicable User Stories and Acceptance Criteria for all requirements and Change ControlsDefine standard documentation for business processes post-Net Suite / Commerce launch, including format, repository, approval processLead documentation of all Processes and Procedures that are impacted by the ERP, working to define required processes, assignment of subject-matter experts, tracking and validation that format and approvals are obtainedMeasure ROI on all Change Controls to show realized benefitsBuild out the UAT test scripts and provide the UAT accountable resources for each development effort Thanks & Regards,Vikrama RaoRecruitment Executive- ValiantIQ Inc.\"Searching Best Minds ■ Searching Best Minds\"Email: vrao@valiantiq.com P. 18032918038 F. (302) 482-3672Disclaimer: If you are not interested in receiving our e-mails then please reply with a \"REMOVE\" in the subject line for automatic removal. And mention all the e-mail addresses to be removed with any e-mail addresses, which might be diverting the e-mails to you. We are sorry for the inconvenience.",
        "source": "Email",
        "date_posted": "2024-10-15 11:31:53-05:00",
        "unique_id": "1929126d164ad372",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]