[
    {
        "company": "AbsoluteIT",
        "job_title": "PL/SQL Developer",
        "location": "Houston, TX, USA",
        "full_location": {
            "city": "Houston",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Bachelor's degree in Data Science, Analytics, Mathematics, Statistics, Computer Science, or a related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SQL",
                "Data Visualization",
                "ETL",
                "Data Modeling",
                "Data Analysis"
            ],
            "primary": [
                "GCP",
                "PowerBI",
                "Tableau",
                "Python",
                "R"
            ],
            "secondary": [
                "Azure",
                "AWS",
                "Oracle Databases",
                "SAP HANA",
                "Google BigQuery",
                "Machine Learning",
                "Statistical Techniques",
                "Data Governance",
                "Project Management"
            ],
            "all": [
                "SQL",
                "Data Visualization",
                "ETL",
                "Data Modeling",
                "Data Analysis",
                "GCP",
                "PowerBI",
                "Tableau",
                "Python",
                "R",
                "Azure",
                "AWS",
                "Oracle Databases",
                "SAP HANA",
                "Google BigQuery",
                "Machine Learning",
                "Statistical Techniques",
                "Data Governance",
                "Project Management"
            ],
            "with_experience": [
                "SQL",
                "Data Visualization",
                "ETL",
                "Data Modeling",
                "Data Analysis",
                "GCP",
                "PowerBI",
                "Tableau",
                "Python",
                "R"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Bikash Kumar",
        "email": "bikash@absoluting.com",
        "jd": "From: Bikash, AbsoluteIT bikash@absoluting.com Reply to: bikash@absoluting.com Hi Hope you are doing well! Job Title: PL/SQL DeveloperLocation– Houston, TX (3 days onsite (M,T,W) /2 days remote (TH & F)Job Type: 6+ Months Contract to hireInterview Mode: Video Job Description: ETL & BIGQUERY SQUEL STATEMENTS (8-9/10)Understanding large data sets - go getter, roll up sleeves and ready to learn data & systems. Right now, they're generating AI - area that they want to go too.Communicate with stake holders.Project/Day to Day: This individual will be stepping into this project: creating score cards for leadership, give them guide on how they're doing (excel, sap is where the data is coming from) moving data to GCP. Working with big stakeholders and leadership to discuss how they can meet these goals. Needs a data expert in this role (ETL). GCP cloud experience - Preferably – they will extract data, using data modeling and need understand reporting, tableau, PowerBI, gathering requirements. FORMAL HR JOB DESCRIPTION: Our data analysts will leverage their knowledge of systems, business processes, regulatory requirements, and mathematical/statistical expertise to develop new datasets, provide oversight to processes and systems affecting data quality, and perform exploratory analysis to discover new insights. As a Senior Data Analyst, you will play a crucial role in supporting the organization's data and analytics strategy by working closely with the business to execute on data-driven initiatives. You will be responsible for developing data solutions, performing data analysis, and growing data awareness and literacy within the company. This role requires a strong foundation in data analytics with a good understanding of data science, data engineering, and data modeling skills. Essential Functions: Collaborate with business stakeholders to understand their data needs and requirements and translate them into actionable insights and data-driven solutions.Perform data analysis tasks, including data cleaning, data transformation, and data visualization, to uncover meaningful patterns and trends in large datasets.Partner with data engineering to develop and maintain data pipelines and workflows, ensuring efficient and accurate data extraction, transformation, and loading (ETL) processes.Apply statistical analysis techniques and machine learning algorithms to identify correlations, predict outcomes, and optimize business processes.Assist in the development and maintenance of data models, data dictionaries, and data documentation to ensure data integrity and consistency.Conduct exploratory data analysis to discover insights and provide recommendations for improving business performance and decision-making.Collaborate with data engineers and data scientists to identify opportunities for automation and optimization of data processes and workflows.Monitor data quality and proactively identify and resolve data discrepancies or anomalies.Participate in cross-functional teams to support data-related projects, providing expertise and guidance on data analysis, data management, and data visualization.Work on business case development, project value proposition, and help with workload prioritization.Stay updated with the latest industry trends and advancements in data analytics, data science, and data engineering, and apply this knowledge to enhance data capabilities within the organization.Constant, self-motivated pursuit of learning systems, organizational structure, processes, data sets, techniques, etc.Interpret and explain information to audiences who are not familiar with the subject matter, often requiring persuasion.Is required to review and recommend solutions to issues that involve a number of possible alternatives which may not be clearly defined.Serve as a project lead or task force member on projects and/or issues having a significant impact on functional and strategic goals.Provide guidance and training to others in the use of new technologies, theories, concepts, and techniques.Constant, self-motivated pursuit of learning systems, organizational structure, processes, data sets, techniques, etc.Operate with limited supervision, guidance, and direction from leadership and senior staff.Provide training and guidance to less experienced professionals.",
        "source": "Email",
        "date_posted": "2024-10-15 14:34:44-05:00",
        "unique_id": "19291cd889e5558a",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "GCP Data Engineer"
    }
]