[
    {
        "company": "Parin Technologies LLC",
        "job_title": "Senior Full Stack .NET Developer",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "14 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "8 months+ (with extensions)",
            "rate": "$70-75/hr on W2 OR $80-90/hr on C2C"
        },
        "skills": {
            "core": [
                "C#",
                ".NET",
                "SQL Server",
                "Angular",
                "Blazor"
            ],
            "primary": [
                "JQuery",
                "CSS3",
                "HTML5",
                "Web API",
                "Agile SDLC"
            ],
            "secondary": [
                "Source Control using TFS",
                "Automated Builds using Microsoft Team Foundation",
                "Troubleshooting skills",
                "Understanding of SOAP Services",
                "Familiar with Azure Cloud Concepts",
                "Experience with Power BI"
            ],
            "all": [
                "C#",
                ".NET",
                "SQL Server",
                "Angular",
                "Blazor",
                "JQuery",
                "CSS3",
                "HTML5",
                "Web API",
                "Agile SDLC",
                "Source Control using TFS",
                "Automated Builds using Microsoft Team Foundation",
                "Troubleshooting skills",
                "Understanding of SOAP Services",
                "Familiar with Azure Cloud Concepts",
                "Experience with Power BI"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Panchdev Pathak",
        "email": "panchdev@parintec.com",
        "jd": "From: Panchdev Pathak, Parin Technologoies LLC panchdev@parintec.com Reply to: panchdev@parintec.com Note: Don't send me less then 15+ Years consultant for this role. This is Panchdev from Parin Technologies LLC. Just came across your profile on one of the job portals and just wanted to check if you might be interested in the position below. In case you are available and interested please share your most recent resume and reply to me at your earliest.NOTE (FOR RECRUITERS)ONLY submit candidates who already live in Richmond, VAALL interviews ONSITELong-Term position requires onsite 3 days a week at 1401 East Broad Street, Richmond VAAssignment to be extended beyond 6/30, possibly 24 monthsContractor will be responsible for purchasing parking through VDOT’s Parking Management Office or procuring their own parkingSeeking a Developer with 14 yrs or more .Net Web application development. Experience and fluency with C#, Angular or Blazor, SQL Server, JQuery, CSS3 and HTML5 experienceRate: $70-75/hr on W2 OR $80-90/hr on C2CTitle: Senior Full Stack .NET DeveloperLocation: Richmond, VAHybrid 3 days onsite every weekDuration: 8 months+ (with extensions)Interview: : IN PERSON Interview Job Description:Seeking a Full Stack Senior ERP Developer/Programmer with .Net Applications Development experience who will be responsible for managing, programming, testing, debugging and analysing complex software requirements to design and develop high quality components using the .NET Core framework. The ERP Developer will be programming the current budget and spend plan tool that is used agency wide for financial and budget management for the Maintenance Program. The Senior Developer is expected to program using best practices, prioritize programming work effectively and write system documentation as required. The successful candidate should have strong programming and communication skills to be effective in both technical and business requirement discussions. Primary responsibilities include: •Ability to develop, program and code in .NET Core environment applications and backend services using C#, Web API, Java Script, JQuery, Angular or Blazor and CSS.•Design, develop and program using appropriate software design patterns to attain high reusability and maintainability.•Write effective unit tests and integration tests to ensure high quality software delivery.•In-depth knowledge and skills in programming, system design patterns, tiered architecture, and testing practices.•Understanding of key business processes and competitive strategies related to the IT function.•Work with project architect, project manager, business owner and systemanalysts to clarify the requirements and then implement them.•Participate in Agile SDLC. Skill Matrix: SkillRequiredyears reqYears UsedLast UsedC#.NET Development experienceRequired14 years Angular or Blazor Development experienceRequired5 Years Strong Database development experience using SQL ServerRequired14 years Experience with Web API Required5 Years Experience with CSS3 and HTML5Required5 Years Experience with Source Control using TFSRequired10 Years Experience with Automated Builds using Microsoft Team FoundationRequired5 Years Excellent Troubleshooting skillsRequired12 Years Experience with Agile SDLC best practicesRequired5 Years Experience working in Oracle Desired2 Years Understanding of SOAP ServicesDesired5 Years Familiar with Azure Cloud ConceptsNice to Have1 Years Experience with PowerBINice to Have1 Years",
        "source": "Email",
        "date_posted": "2024-10-15 15:01:32-05:00",
        "unique_id": "192925baf1bbab5e",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]