[
    {
        "company": "Tekinsiprations LLC",
        "job_title": ".Net Developer",
        "location": "Albany, NY, USA",
        "full_location": {
            "city": "Albany",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "7 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".Net",
                "C#",
                "ASP.NET",
                "Web API",
                "Oracle"
            ],
            "primary": [
                "Microsoft Visual Studio",
                "MVC Architecture",
                "JavaScript",
                "JSON",
                "Ajax",
                "HTML",
                "XML",
                "WCF",
                "Crystal Reports",
                "Tortoise SVN",
                "Visual SVN",
                "TFS",
                "GIT",
                "Service Oriented Architecture",
                "SOAP",
                "Restful APIs",
                "CI/CD"
            ],
            "secondary": [
                "jQuery",
                "Bootstrap",
                "Cascading Style Sheets",
                "UI/UX",
                "Business Analysts",
                "Architects",
                "Project managers",
                "Health Care data",
                "HIPAA",
                "HL7",
                "FHIR",
                "user provisioning",
                "authentication",
                "authorization",
                "OKTA",
                "LDAP",
                "RSA",
                "Access Manager"
            ],
            "all": [
                ".Net",
                "C#",
                "ASP.NET",
                "Web API",
                "Oracle",
                "Microsoft Visual Studio",
                "MVC Architecture",
                "JavaScript",
                "JSON",
                "Ajax",
                "HTML",
                "XML",
                "WCF",
                "Crystal Reports",
                "Tortoise SVN",
                "Visual SVN",
                "TFS",
                "GIT",
                "Service Oriented Architecture",
                "SOAP",
                "Restful APIs",
                "CI/CD",
                "jQuery",
                "Bootstrap",
                "Cascading Style Sheets",
                "UI/UX",
                "Business Analysts",
                "Architects",
                "Project managers",
                "Health Care data",
                "HIPAA",
                "HL7",
                "FHIR",
                "user provisioning",
                "authentication",
                "authorization",
                "OKTA",
                "LDAP",
                "RSA",
                "Access Manager"
            ],
            "with_experience": [
                ".Net",
                "C#",
                "ASP.NET",
                "Web API",
                "Oracle"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Shivansh Tiwari",
        "email": "shivansh.tiwari@tekinspirations.com",
        "jd": "From: Shivansh Tiwari, Tekinsiprations LLC shivansh.tiwari@tekinspirations.com Reply to: shivansh.tiwari@tekinspirations.com Job Title:- .Net Developer Location:- Albany, NY (Onsite)Duration:- 6 monthInterview Mode :- SkypeJob Description:Execute full software development life cycle (SDLC)Use Microsoft Visual Studio 2022 or higher and write code using MVC Architecture, .Net, JavaScript, JSON, Ajax, HTML, XML, dll, and WCF.Prepare scripts to create and modify existing Oracle tables, create indexes, constraints, triggers, views, etc., code stored procedures and packages, convert and migrate data when necessary.Diagnose and troubleshoot various rules, calculations, and data issues on application reports using Crystal Reports.Mentor and assist other programmers, both state and consultant, providing guidance for debugging, troubleshooting, securing and deploying applications, data access, data communications and system architecture configurations.Use a source code repository, such as Tortoise SVN or Visual SVN, or TFS or GIT for checking source code in and out, and branching off new versions of the source code. Work within the IT Service Management System to take in incidents and service requests for the application, as well as request services from other ITS groups. Coordinate service requests with various ITS Chief Operating Office personnel for releases and changes for the application. Diagnose and debug production issues reported via ITSM. Escalate critical calls as necessary and join bridge calls to assist in diagnosis.Report status of current tasks and outstanding issues to supervisor84 months experience using Microsoft Visual Studio to develop/maintain applications in C#, ASP.NET, Web API for n-tier web deployment. 84 months experience developing and maintaining web applications that utilize HTML, XML, JSON, AJAX, JavaScript, jQuery, Bootstrap and Cascading Style Sheets. 84 months experience with Oracle: Database design, PL SQL coding, stored procedures, packages, indexes, triggers, views, creating tables, etc., 84 Months experience with Service Oriented Architecture (SOA) application integration including development of secure .Net web-services using Windows Communication Foundation (WCF), SOAP/Restful APIs, message and queue processing, dynamic link library through package manager, and/or an Enterprise Service Bus. 72 Month experience using Team Foundation Server and GitLab including CI/CD for source code management. 72 months experience working with UI/UX team, Business Analysts, Architects, and Project managers to define requirements and timelines. 24 Months experience coding and maintaining applications which contain Health Care data that fall under HIPAA Protected Health Information (PHI), HL7 and/or FHIR. 24 Months experience with user provisioning, authentication and authorization using OKTA, LDAP, RSA, and Access Manager.",
        "source": "Email",
        "date_posted": "2024-10-15 12:50:05-05:00",
        "unique_id": "192916db8cc0c955",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]