[
    {
        "company": "Millennium Infotech",
        "job_title": "Business Analyst with Java Experience",
        "location": "Plano, TX, USA",
        "full_location": {
            "city": "Plano",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Bachelor's degree with specific coursework in computer science or an equivalent combination of education and experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Business Analysis",
                "Data Modeling",
                "System Life Cycle Activities"
            ],
            "primary": [
                "User Interface Design",
                "Application Development",
                "Documentation",
                "Testing"
            ],
            "secondary": [
                "Relational Programming",
                "Object-Oriented Programming",
                "Web Development",
                "GUI Development",
                "Interpersonal Skills",
                "Communication Skills"
            ],
            "all": [
                "Java",
                "Business Analysis",
                "Data Modeling",
                "System Life Cycle Activities",
                "User Interface Design",
                "Application Development",
                "Documentation",
                "Testing",
                "Relational Programming",
                "Object-Oriented Programming",
                "Web Development",
                "GUI Development",
                "Interpersonal Skills",
                "Communication Skills"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "bala",
        "email": "bala@mitiweb.com",
        "jd": "From: bala, Millennium Infotech bala@mitiweb.com Reply to: bala@mitiweb.com Hi Professional,Hope you are doing good.We are looking for Business Analyst with Java Experience at Plano, TexasThis is an Direct Client Requirement.Must have java experience. Candidate must have atleast 10+ years of experience. Characteristic Duties and Responsibilities:Collect, analyze, and document business and user requirements related to the new development or enhancement of critical business systems.Design, build and modify applications (including analysis and coding), using the appropriate programming language and tool set.Design and develop user-friendly interfaces to systems, applications, and databases.Recommend and develop modifications to third party software to meet user needs.Verify (test) programs and applications utilizing appropriate test plans, data, and procedures.Prepare and maintain system and user documentation and procedures.Provide ongoing support for production systems and assist with the resolution of production problems.Work with User Services and Networking & Operations personnel in understanding the functions and procedures of the supported systems; support user and technical staff training on developed applications.Develop and maintain documentation, including program operating procedures, program changes and other relevant information to accompany designs and changes to codes developed or modified.Complete work according to project plans and time frames.Perform other job-related duties as assigned.Qualifications:Two years of experience in Java Coding or ProgrammingTwo years analysis and design experience, with exposure to data modeling and full system life cycle activities.Bachelor's degree with specific coursework in computer science or an equivalent combination of education and experience from which comparable knowledge and abilities can be acquired.Experience working with functional user offices.Relational/object-oriented programming, web development experience, and GUI development desirable.Ability to interpret file record layout.Excellent interpersonal, listening, written and oral communication skills. Highly self-motivated and directed.",
        "source": "Email",
        "date_posted": "2024-10-15 12:13:45-05:00",
        "unique_id": "192914c789897ac5",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]