[
    {
        "company": "Gensigma",
        "job_title": ".Net Developer",
        "location": "Tallahassee, FL, USA",
        "full_location": {
            "city": "Tallahassee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Bachelor’s or Master’s Degree in Computer Science, Information Systems, or other related field. Or equivalent work experience.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".NET",
                ".NET Core",
                "C#",
                "SQL",
                "Blazor"
            ],
            "primary": [
                "ASP.NET",
                "MVC",
                "Web API",
                "Data mapping",
                "Application architecture",
                "Data integration",
                "Data analysis",
                "CI/CD",
                "Azure DevOps",
                "GitHub"
            ],
            "secondary": [
                "Microsoft Certification",
                "Customer support",
                "Quality assurance"
            ],
            "all": [
                ".NET",
                ".NET Core",
                "C#",
                "SQL",
                "Blazor",
                "ASP.NET",
                "MVC",
                "Web API",
                "Data mapping",
                "Application architecture",
                "Data integration",
                "Data analysis",
                "CI/CD",
                "Azure DevOps",
                "GitHub",
                "Microsoft Certification",
                "Customer support",
                "Quality assurance"
            ]
        },
        "job_type": [],
        "contact_person": "Rishabh",
        "email": "rishabc@gensigma.com",
        "jd": "From: Rishabh, Gensigma rishabc@gensigma.com Reply to: rishabc@gensigma.com Connect me on Linkedin for daily C2C roles- https://www.linkedin.com/in/rishabhchaturvedi9/ Project Scope: Client is seeking qualified candidates who will assist the Office of Information Technology (OITS) in their daily operations, support, and services. These positions are to provide technical guidance and expertise in supporting the department in developing, architecting, and maintaining systems, apis, data mappings, and monitoring high-volume complex data integration processes. Roles/Responsibilities: Collaborate with business analysts, project managers, and stakeholders to understand the functional and non-functional requirements of the application. Translate business requirements into architectural designs that align with business goals. Design the overall system architecture, and define how different components of the interact. Design, develop, and implement software applications using the .NET framework and C#. Utilize ASP.NET (or ASP.NET Core) for web application development, including MVC, Web API, and Blazor for client-side and server-side programming. Develop and optimize SQL queries, stored procedures, and functions. Develop user interfaces and ensure the front end is responsive, accessible, and user-friendly. Review code, architecture, and design to ensure they meet the standards. Analyze and optimize the performance of the application. Design strategies for scaling the application efficiently as user demand grows. Ensure the application adheres to security best practices and compliance requirements. Implement DevOps practices such as continuous integration and continuous delivery (CI/CD) via Azure DevOps and GitHub repositories. Mandatory Skills: 5+ years of experience in .NET/.NET core application development (recent experience preferred), 5+ years of experience in DDL, DML T-SQL skills, advanced stored procedure writing skills, tables, primary keys, foreign keys, constraints, indexes, transactions, process logging, and error handling. 3+ years of experience with application design, including Data mapping. 3+ years of experience in application architecture and data integration. 3+ years of analyzing and interpreting large datasets, including cleaning, transforming, and visualizing data. 3+ years of Experience in testing high-volume of complex data integration processes. 1+ years of Experience using Blazor Familiarity with system catalog views, and Azure Cloud Ability to provide excellent customer support; meticulous quality of work and work product. Education: Bachelor’s or Master’s Degree in Computer Science, Information Systems, or other related field. Or equivalent work experience. Desirable Skills: Certifications: Microsoft or Other Related Certification Other Requirements: Provide three (3) clients for which similar services were performed within the past three (3) years. Or if the candidate has performed services for DCF in the past three (3) years, each separate work effort may substitute for a client reference if the below information can be provided for each effort. References should include: Reference contact’s name Organization name Job title held by the candidate while employed or contracted Direct telephone number Email address",
        "source": "Email",
        "date_posted": "2024-10-15 09:32:11-05:00",
        "unique_id": "19290e6cf15fe2bf",
        "emp_type": [
            "third party"
        ],
        "tag": ".net developer"
    }
]