[
    {
        "company": "Absolute IT",
        "job_title": "Senior Software Programmer",
        "location": "Livoni, MI, USA",
        "full_location": {
            "city": "Livoni",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Minimum of 5 years",
            "degree_required": "Bachelor’s degree in Computer Science, Computer Engineering, or a related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 Month Contract to Hire",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Visual Studio",
                "C#",
                "C++",
                "ASP.NET",
                "Salesforce Sales or Service Cloud",
                "SQL Server 2019+",
                "T-SQL"
            ],
            "primary": [
                "Software architecture design",
                "Requirements gathering",
                "Software development",
                "Unit testing",
                "System testing",
                "Troubleshooting",
                "User interface design",
                "Project management"
            ],
            "secondary": [
                "WordPress CMS",
                "HTML",
                "CSS",
                "JavaScript",
                "JSON",
                "PHP",
                "VBScript",
                "Salesforce Platform Developer I or II Certification",
                "Microsoft Azure development services",
                "Microsoft Power Apps",
                "Power Automate",
                "Microsoft SharePoint",
                "Power BI",
                "Microsoft WinForms",
                "Web Services",
                "Console applications",
                "PowerShell",
                "iOS mobile app development",
                "IoT applications",
                "Software test automation"
            ],
            "all": [
                "Visual Studio",
                "C#",
                "C++",
                "ASP.NET",
                "Salesforce Sales or Service Cloud",
                "SQL Server 2019+",
                "T-SQL",
                "Software architecture design",
                "Requirements gathering",
                "Software development",
                "Unit testing",
                "System testing",
                "Troubleshooting",
                "User interface design",
                "Project management",
                "WordPress CMS",
                "HTML",
                "CSS",
                "JavaScript",
                "JSON",
                "PHP",
                "VBScript",
                "Salesforce Platform Developer I or II Certification",
                "Microsoft Azure development services",
                "Microsoft Power Apps",
                "Power Automate",
                "Microsoft SharePoint",
                "Power BI",
                "Microsoft WinForms",
                "Web Services",
                "Console applications",
                "PowerShell",
                "iOS mobile app development",
                "IoT applications",
                "Software test automation"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Preety Srivastava",
        "email": "preety@absoluting.com",
        "jd": "Hello I hope you are doing well.I am hiring a consultant for one of my client's requirements. I've written the Job Description for the same below. If you find yourself comfortable with the requirement please reply back with your updated resume. Job Title Senior Software Programmer Location N/A, Michigan Job Description Job Title: Senior Software ProgrammerLocation: Livoni,MIDuration: 6 Month Contract to HireJob Summary:We are seeking a passionate and innovative Senior Software Programmer to lead software development for projects with both internal and external customers. This role involves requirements gathering, software architecture design, development, and the support/troubleshooting/testing of software and systems related to customer products. Key Responsibilities:- Lead the software development process, including the architecture, design, development, testing, and deployment of software systems, user interfaces, business logic, databases, and system integrations.- Capture and document software requirements from customers and users, ensuring clarity and alignment with project goals.- Create and review software deliverables, including wireframes, user stories, process flows, test plans, reports, project planning documents, schedules, and user guides.- Conduct software development, unit testing, and system testing to ensure high-quality outputs.- Troubleshoot and resolve issues identified during unit, system, and user acceptance testing.- Provide ongoing support for production software and processes, ensuring they meet customer expectations for operational support.- Implement measures to protect software and proactively track, identify, and eliminate security threats. Qualifications:- U.S. citizenship required.- Bachelor’s degree in Computer Science, Computer Engineering, or a related field.- Minimum of 5 years of software development experience in Visual Studio, C#, C++, and ASP.NET (versions 5+).- At least 4 years of hands-on development experience with Salesforce Sales or Service Cloud.- Minimum of 2 years of database development experience with SQL Server 2019+ and T-SQL.- Excellent verbal and written communication skills, with the ability to convey technical information to diverse audiences and collaborate effectively in a team environment.- Strong troubleshooting skills and the ability to create intuitive and attractive user interfaces.- Capability to work independently and manage multiple assignments simultaneously.- Proficient in planning, estimating, scheduling, and coordinating technical project aspects.- Experience managing a small team of developers.- Knowledge of automotive and automotive services is preferred. Preferred Qualifications:- Minimum of 3 years of development experience with WordPress CMS platforms.- Familiarity with client-side development technologies, including HTML, CSS, JavaScript, JSON, PHP, and VBScript.- Salesforce Platform Developer I or II Certification.- Experience in software development across industries such as automotive, aerospace, defense, industrial, or manufacturing automation.- Knowledge of Microsoft Azure development services.- Experience with Microsoft Power Apps, Power Automate, Microsoft SharePoint, and Power BI.- Development experience with Microsoft WinForms, Web Services, and console applications.- Understanding of PowerShell, iOS mobile app development, and IoT applications.- Experience with software test automation.",
        "source": "Email",
        "date_posted": "2024-10-15 08:24:29-05:00",
        "unique_id": "1929094612f98790",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]