[
    {
        "company": "Veridian Tech Solutions, Inc",
        "job_title": "Tech Lead",
        "location": "New York, NY, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "5+ years",
            "degree_required": "Bachelor’s degree in Computer Science or related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".Net",
                "Angular",
                "software development",
                "technical leadership"
            ],
            "primary": [
                "Regulatory reporting applications",
                "web applications",
                "agile methodology",
                "analytical skills",
                "troubleshooting",
                "problem-solving",
                "communication skills",
                "project management"
            ],
            "secondary": [
                "team management",
                "multi-tasking",
                "organizational skills"
            ],
            "all": [
                ".Net",
                "Angular",
                "software development",
                "technical leadership",
                "Regulatory reporting applications",
                "web applications",
                "agile methodology",
                "analytical skills",
                "troubleshooting",
                "problem-solving",
                "communication skills",
                "project management",
                "team management",
                "multi-tasking",
                "organizational skills"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Sanket Rawat",
        "email": "sanket@veridiants.com",
        "jd": "From: Sanket Rawat, Veridian Tech Solutions, Inc sanket@veridiants.com Reply to: sanket@veridiants.com Hi,Hope you are doing great!I have an urgent requirement for the position of Tech Lead. Kindly review the job description below and if interested, share your most recent resume in word format. Role: Tech LeadContractLocation: NY/ NJ | HybridJob Description:Lead and manage a team of overseas software engineers, providing technical direction and guidance for development projectsOversee technical project plans and timelines, ensuring projects are completed on time Work closely with onsite client stakeholders from cross functional departments Provide technical expertise and guidance to ensure quality standards are metResearch, evaluate, and recommend new technologies, processes and tools to enhance development capabilities. Develop proof of concept and own development deliverablesAnalyze customer requirements and develop technical solutions to meet customer needsDevelop and document technical processes and proceduresPrepare and publish progress reports Skills:Understanding of Regulatory reporting applications related to Client onboarding, legal entity onboarding or Capital Market applications related to equity, underrating business etc. or Internal finance applicationsAbility to develop web applications in .Net , Angular in agile modeAbility to manage 10-15 team members from different timezone Bachelor’s degree in Computer Science or related field5+ years of experience in software development and technical leadershipDemonstrated knowledge of software development methodologies and techniquesStrong analytical, troubleshooting and problem-solving skills. Ability to analyze business requirements and understand objectivesExcellent verbal and written communication skillsAble to work independently and as part of a teamAble to multi-task and prioritize tasks effectivelyStrong organizational and project management skills Thank You & Best RegardsSanket RawatSanket@veridiants.com",
        "source": "Email",
        "date_posted": "2024-10-15 14:05:46-05:00",
        "unique_id": "19291b305623799d",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]