[
    {
        "company": "Smart IT Frame",
        "job_title": "Azure Data Engineer with Datastage Experience",
        "location": "Chicago, IL, USA",
        "full_location": {
            "city": "Chicago",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "contract",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Azure",
                "DataStage",
                "SQL",
                "Data Modeling",
                "Data Warehousing"
            ],
            "primary": [
                "Python",
                "Spark",
                "Airflow",
                "Kafka",
                "Data Governance",
                "Collibra"
            ],
            "secondary": [
                "PowerBI",
                "Continuous Integration",
                "GitHub",
                "Confluence",
                "NoSQL",
                "Oracle",
                "Postgres",
                "MongoDB"
            ],
            "all": [
                "Azure",
                "DataStage",
                "SQL",
                "Data Modeling",
                "Data Warehousing",
                "Python",
                "Spark",
                "Airflow",
                "Kafka",
                "Data Governance",
                "Collibra",
                "PowerBI",
                "Continuous Integration",
                "GitHub",
                "Confluence",
                "NoSQL",
                "Oracle",
                "Postgres",
                "MongoDB"
            ],
            "with_experience": [
                "Azure (10+ years)",
                "DataStage",
                "SQL",
                "Data Modeling",
                "Data Warehousing"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Vasanth G",
        "email": "vasanth@smartitframe.com",
        "jd": "From: Vasi, Smart IT Frame vasanth@smartitframe.com Reply to: vasanth@smartitframe.com Hi,Greetings from Smart IT Frame, Hope you are doing well!!!Smart IT Frame specializes in enabling you with your most critical line of resources. Whether it’s for permanent staffing, contract staffing, contract-to-hire or executive search, we understand the importance of delivering the most suitable talent; on time and within budget. With our Core focus in emerging technologies, we have provided global technology workforce solutions in North America, Canada & India. We take pride in delivering specialized talent, superior performance, and seamless execution to meet the challenging business needs of customers worldwide. Role: Azure Data Engineer with Datastage ExperienceLocation: Chicago, IL (Hybrid) JD: The candidate will be responsible for designing & building solutions for Analytics applications,analytics group. This role will cover multiple data technology stacks as well as cloud technologies.Responsibilities• Work with business owners and IT stakeholders to understand business and functionalrequirements to design data & integration solutions.• Develop conceptual and physical data models as well as flow diagrams illustrate current andfuture state data architecture.• Establish good data modelling principles and effective data quality standards.• Act as subject matter expert on all aspects of the data architecture, including Cloudadoption, data orchestration, large data processing, security & scalability.• Guide and mentor development teams on modern data engineering & design best practices• You have strong understanding of data modeling techniques and experience in designingdata models for cloud data warehouses and OLTP applications.• Evangelize modern data approaches & technologies as well as Cloud architecture across theAnalytics group.Required Skills• 10+ years of experience building data platforms & application architectures.• Proven experience building & deploying data warehouses with Azure platform is requiredwith AL/ML capabilities.• Azure certification is desirable.• Strong hands-on expertise in database & query performance tuning SQL queries anddatabase best practices with PowerBI Dashboard Exp.• Full understanding of ETL IBM DataStage concepts and Data Warehousing concepts• Strong experience with modern data engineering technologies such as python, Spark,Airflow.• You have experience with Kafka and CDC tools for real-time data synchronization.• Proven experience in Data modeling using Dimension modelling & Data vault methodologieswith Power BI reporting integration experience.• Strong Data Governance Tooling experience with Collibra.• Hands-on experience working with relational and NoSQL technologies (such as Oracle,Postgres, Mongo DB, etc.)• You have experience with continuous integration and collaboration tools like Azure ADO,GitHub and Confluence.• Experience in financial industry or banking is a plus Thanks and RegardsVasanth GTalent Acquisition GroupEmail: vasanth@smartitframe.com",
        "source": "Email",
        "date_posted": "2024-10-15 10:10:39-05:00",
        "unique_id": "19291188a479e49e",
        "emp_type": [
            "full-time",
            "contract",
            "third party"
        ],
        "tag": "Azure Data Engineer"
    }
]