[
    {
        "company": "Cox Communications",
        "job_title": "Project Manager",
        "location": "Raleigh, NC, USA",
        "full_location": {
            "city": "Raleigh",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "5+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "3 month assessment phase",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management Expertise",
                "Billing Systems Knowledge",
                "Stakeholder Communication",
                "Risk & Change Management",
                "Platform Familiarity"
            ],
            "primary": [
                "Salesforce",
                "Zuora",
                "Contract Life Cycle Management tools",
                "Malbek",
                "Docusign CLM",
                "Icertis",
                "Conga",
                "Agiloft",
                "Ironclad",
                "ContractSafe"
            ],
            "secondary": [
                "PMP Certification",
                "Agile Certification",
                "Financial compliance regulations",
                "Salesforce platform architecture",
                "MuleSoft",
                "Boomi"
            ],
            "all": [
                "Project Management Expertise",
                "Billing Systems Knowledge",
                "Stakeholder Communication",
                "Risk & Change Management",
                "Platform Familiarity",
                "Salesforce",
                "Zuora",
                "Contract Life Cycle Management tools",
                "Malbek",
                "Docusign CLM",
                "Icertis",
                "Conga",
                "Agiloft",
                "Ironclad",
                "ContractSafe",
                "PMP Certification",
                "Agile Certification",
                "Financial compliance regulations",
                "Salesforce platform architecture",
                "MuleSoft",
                "Boomi"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Ashok Kumar",
        "email": "ashok@ba-itconsult.com",
        "jd": "From: Ashok, Biztegy Analytics, Inc ashok@ba-itconsult.com Reply to: ashok@ba-itconsult.com Hi, Job DescriptionCompany: Cox Communications Location: Raleigh, NC (On-site 5 days a week, with potential flex schedule after project kick-off) Start Date: Tentative Kick-off (Pending SOW approval and laptop distribution) Interview Process: Internal, first round with -// Internal, second round with Solutions Architect Interview Times: Thursday: 8am-2pmFriday OPEN (minus kick off and 9:30-10am)Position Overview: We are seeking a highly organized and experienced Project Manager to lead a cross-functional team of Business Process Analysts for a critical project for our client. This role involves overseeing the assessment and optimization of current billing platforms and processes, ensuring seamless integration and alignment across the operations, and technology teams. The successful candidate will be responsible for ensuring the timely delivery of project goals, managing stakeholder expectations, and providing leadership throughout the duration of the project. Key Responsibilities: Project Leadership: Ensuring that project objectives are met within scope, budget, and timeline. Cross-functional Collaboration: Coordinate between sales, operations, and technology teams, ensuring alignment and clear communication across all project stakeholders. Process Optimization: Manage the assessment and evaluation of platforms and processes related to the entire revenue lifecycle, including contract generation, billing, and service management. Stakeholder Management: Work closely with internal leadership, including the Rapid Scale team and acquired Cox Communications group, to ensure objectives are met. Risk Management: Identify potential project risks, including delays, integration challenges, or stakeholder misalignment, and develop mitigation strategies. Project Documentation: Oversee the creation and maintenance of comprehensive project documentation, including process maps, reports, and platform evaluations. Platform Integration: Ensure seamless integration between Salesforce, Zuora, Malbek, and other platforms, addressing any system or process bottlenecks. Workshops and Reviews: Lead workshops and meetings to evaluate current workflows and propose optimization strategies. Performance Tracking: Monitor project KPIs, providing regular updates to stakeholders and ensuring continuous improvement recommendations are executed. Must-Have Skills & Experience: Project Management Expertise: 5+ years of experience in managing projects involving Contract Management System implementations, with a strong understanding of billing, and technology processes. Billing Systems Knowledge: Experience overseeing assessments of billing platforms, tools, and processes, particularly in SaaS or subscription-based business models. Stakeholder Communication: Excellent interpersonal and communication skills to manage both technical and non-technical stakeholders. Risk & Change Management: Expertise in identifying project risks, developing contingency plans, and managing changes in project scope or direction. Platform Familiarity: Understanding of Salesforce (Sales Cloud, Service Cloud), Zuora (subscription billing) MOST IMPORTANT!!! , Contract Life Cycle Management tools and integration challenges. o Malbek (CLM) would be a nice to have. § Similar tools to Malbek · Docusign CLM · Icertis · Conga (formerly Apttus) · Agiloft · Ironclad · ContractSafe o Platform Evaluation: Partner with Solutions Architect to manage platform effectiveness, functionality gaps, and integration issues. Oversee documentation on how billing models and processes can be adapted, optimized, or rearchitected with recommendations. Process Documentation: Ability to oversee detailed documentation of project workflows, process maps, and integration points. Nice-to-Have: PMP or Agile Certification Experience with platform migrations or rearchitecting billing systems in large organizations Familiarity with financial compliance regulations such as ASC 606 Knowledge of Salesforce platform architecture, including Sales Cloud, Service Cloud, and integration tools such as MuleSoft or Boomi. Day-to-Day Responsibilities: Manage daily activities of the project, ensuring alignment with the project goals throughout the 3 month assessment phase. Collaborate closely with Business Process Analysts to ensure comprehensive platform evaluation and process mapping. Act as the main point of contact for project-related updates, escalations, and reporting. Drive project progress by maintaining schedules, tracking milestones, and coordinating meetings with cross-functional teams. Ensure that the project remains on track and deliverables are met according to the established timeline.",
        "source": "Email",
        "date_posted": "2024-10-15 12:05:53-05:00",
        "unique_id": "192914545ab42fff",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]