[
    {
        "company": "Quantum World Technologies Inc.",
        "job_title": "Java Developer",
        "location": "McLean, VA, USA",
        "full_location": {
            "city": "McLean",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "5+ years",
            "degree_required": "Bachelor's or Master's degree in Information Technology, Computer Science, Engineering or related field or equivalent combination of education and work experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "ReactJS",
                "Unix"
            ],
            "primary": [
                "Java/J2EE",
                "Apache",
                "Tomcat",
                "Spring Boot",
                "UNIX Shell",
                "Jenkins",
                "GIT",
                "Bitbucket",
                "Artifactory",
                "MongoDB",
                "SQL Server",
                "Oracle",
                "LDAP",
                "certificates",
                "public key encryption",
                "SSH",
                "access credentials"
            ],
            "secondary": [],
            "all": [
                "Java",
                "ReactJS",
                "Unix",
                "Java/J2EE",
                "Apache",
                "Tomcat",
                "Spring Boot",
                "UNIX Shell",
                "Jenkins",
                "GIT",
                "Bitbucket",
                "Artifactory",
                "MongoDB",
                "SQL Server",
                "Oracle",
                "LDAP",
                "certificates",
                "public key encryption",
                "SSH",
                "access credentials"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Gaurav Kumar",
        "email": "gaurav.kumar@quantumworldit.com",
        "jd": "From: Gaurav kumar, Quantum World Technologies Inc. gaurav.kumar@quantumworldit.com Reply to: gaurav.kumar@quantumworldit.com Greeting, I hope all is well with youFor the following, Quantum World IT is seeking the best consultant profile.Please respond with your most recent resume if you are considering new opportunities. Looking On-site (Face to Face Interview )|| Java Developer || McLean, VA (Onsite) Face to Face Interview Key Skills; Java, ReactJS, Unix.Bachelor s or Master s degree in Information Technology, Computer Science, Engineering or related field or equivalent combination of education and work experience5+ years of experience in developing applications using Java/J2EE technologies, preferably in Unix environment.Excellent understanding of typical multi-tier architectures: web servers, caching, application servers, & load balancersHands-on experience on multiple technologies such as:Java/J2EE & middleware (Apache, Tomcat, Spring Boot, etc.) technologies in UNIX environment and Scripting languages such as UNIX ShellBuild automation / CICD pipeline integration tools (Jenkins, GIT, Bitbucket, Artifactory, etc.)Databases (MongoDB, SQL Server, Oracle)Information and application security including LDAP, certificates, public key encryption, SSH, access credentials, etc. Please enter the following information is needed for submission and share VISA Copy and Photo id Position Applied for Candidate Full Name [As per Passport] Contact Number Primary & Secondary Email Current Location Work Authorization Total years of Experience Had ever worked with TCS in Past (Required filed) Have you gotten covid Vaccination does LinkedIn ID Are you comfortable for on-site Rate Gauarv KumarPhone: +1 805 749 5070Email: Gaurav.kumar@quantumworldit.com Quantum World Technologies Inc. 4281 Katella Ave, Suite #102 Los Alamitos CA 90720 USA",
        "source": "Email",
        "date_posted": "2024-10-15 09:11:03-05:00",
        "unique_id": "19290a582fb1da4f",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]