[
    {
        "company": "Tek Inspirations",
        "job_title": "IT Project Manager/software implementation Project Manager",
        "location": "Los Angeles, CA, USA",
        "full_location": {
            "city": "Los Angeles",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "College degree, preferably in IT related field; minor or advanced degree in business or IT related subject is a plus.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Budget Management",
                "Software Implementation",
                "Vendor Management"
            ],
            "primary": [
                "Government Sector Experience",
                "Formal Project Management Methodology",
                "PMP® Certification",
                "Project Charter Creation",
                "Risk Management"
            ],
            "secondary": [
                "Coaching and Mentoring",
                "Stakeholder Coordination",
                "Change Management",
                "Software Development Collaboration",
                "Testing and Training Coordination"
            ],
            "all": [
                "Project Management",
                "Budget Management",
                "Software Implementation",
                "Vendor Management",
                "Government Sector Experience",
                "Formal Project Management Methodology",
                "PMP® Certification",
                "Project Charter Creation",
                "Risk Management",
                "Coaching and Mentoring",
                "Stakeholder Coordination",
                "Change Management",
                "Software Development Collaboration",
                "Testing and Training Coordination"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Mohit Kumar",
        "email": "kumar.mohit@tekinspirations.com",
        "jd": "Job Description -IT Project Manager/software implementation Project Manager candidate will have State, Government or City School District experience.Government sector experience is needed. Location: Los Angeles, CA (Onsite) ( need only local candidate to Los Angelas )Duration: 12+ months Interview mode: video The Project Manager leads software implementation projects, defines scope, manages resources, and oversees documentation. They coordinate with stakeholders, handle budgets, and provide project updates. This role requires 5+ years of project management experience and expertise in budget and vendor management. Responsibilities:Prepare Scope of Work for software replacement/upgrades.Represent the District in Source Selection committees.Manage project software/development implementations.Lead blueprint sessions with relevant stakeholders to identify and document detailed requirements.Develop project plan including project schedules and project costs.Prepare Project Charters, Risk Assessments, and present at various committees.Prepare project budget estimates.Provide project updates to ITS PMO on QuickBase and as required by ITS PMO.Manage project document collection repositories like SharePoint, MS Teams, and other project management applications.Coach and mentor district staff in project management practices.Create and manage work orders for enhancements, bug fixes, incident change requests, etc.Identify and coordinate resources required to implement project plans.Work with developers to ensure applications are developed as planned.Ensure process and procedures meet ITS security protocols.Coordinate and review testing, training, change management and rollout for new portals or applications.Manage vendors implementing/developing various outsourced projects.Provide other services as needed related to cyber-attack response or resulting organizational change management. Must have Skills: Minimum 5 years Project Management experienceGovernment/public sector experience needed.Minimum 5 years of experience in software/applicationCollege degree, preferably in IT related field; minor or advanced degree in business or IT related subject is a plus.PMP® certification and/or other industry and project management certifications is a plus.Minimum 5 years’ experience in using formal project management methodology, techniques, and tools.Minimum 1 year of experience providing project management software implementation services.Demonstrated expertise in creating and maintaining project deliverables such as project charter, project plan, status reports, project timesheets, estimates, communication plan, reports, risk management plan, budget (work hours and cost), milestone/deliverable charts.Budget management skills: Ability to prepare, analyze, and review financing plans and related budgetary information required for estimating projects.Experiences with software vendor and remote resources management.",
        "source": "Email",
        "date_posted": "2024-10-15 12:44:13-05:00",
        "unique_id": "19291685a480cfef",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]