[
    {
        "company": "Parin Technologies",
        "job_title": "Senior Project Manager - PMP Certified",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "15+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "8 months+",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "PMP Certification",
                "Scaled Agile",
                "Project Management"
            ],
            "primary": [
                "IT Project Management",
                "Budget Management",
                "Team Coordination",
                "Risk Management",
                "Stakeholder Communication"
            ],
            "secondary": [
                "Contract Management",
                "Vendor Collaboration",
                "Documentation",
                "Test Planning",
                "Training Support"
            ],
            "all": [
                "PMP Certification",
                "Scaled Agile",
                "Project Management",
                "IT Project Management",
                "Budget Management",
                "Team Coordination",
                "Risk Management",
                "Stakeholder Communication",
                "Contract Management",
                "Vendor Collaboration",
                "Documentation",
                "Test Planning",
                "Training Support"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Rehana Remo",
        "email": "rehana@parintec.com",
        "jd": "From: Rehana, Parin Technologies rehana@parintec.com Reply to: rehana@parintec.com HiPlease share your Updated Resumerehana@parintec.com Title: Senior Project Manager - PMP CertifiedDuration: 8 months+Exp: 15+ yearsLocation: Richmond, VAHybrid - 3 days onsite every weekInterview: In Person Only PMP CERTIFICATION REQUIRED with experience in Scaled Agile environment. Client Asset Management Division is seeking a senior technical Project Manager to manage and deliver complex IT Project(s) with multiple teams and work streams coordinated to an aggressive delivery schedule. Project Manager is responsible for the outcome of the assigned projects. The Project Manager leads the team through the Commonwealth Standard for Project Management for successful completion of the project phases:PreselectInitiation PlanningExecution and ControlCloseout. The selected candidate willServe as a hands-on technical project manager with development staff and business groupsCoordinate and communicate with Information Technology Division management and staff to coordinate work staff and resourcing.Communicate timelines and expectations to technical and business staffFacilitate multi-functional technical team collaboration.Collaborate with vendors, consultants, and contractors in the execution of projects, including contract management, and work with procurement office(s).Adhere to project management practices and governance requirements.Coordinate with project management offices.Maintain project budget, plans, tasks, schedules, risks, and status and disseminate information to team members and customers as defined in the communication plan.Ensure documentation of requirements and use cases, facilitate design workshops for assigned project.Ensure preparation of test objectives, test plans and test cases for assigned project.Provide the management of project milestones and deliverables for on-time and on-budget delivery.Define, measure, and clearly communicate progress with project metrics.Support system and application training efforts.",
        "source": "Email",
        "date_posted": "2024-10-15 08:08:47-05:00",
        "unique_id": "192907dae302a7b2",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]