[
    {
        "company": "Technocraft Solutions LLC",
        "job_title": "Data Engineer (Redshift)",
        "location": "Saint Louis, MO, USA",
        "full_location": {
            "city": "Saint Louis",
            "state": "MO",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "12+ Years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Redshift",
                "ANSI SQL",
                "AWS",
                "Unix Scripting"
            ],
            "primary": [
                "Hive",
                "Amazon Redshift",
                "HDFS",
                "Spark"
            ],
            "secondary": [
                "Data Governance",
                "Performance Tuning",
                "Technical Documentation",
                "Mentoring"
            ],
            "all": [
                "Redshift",
                "ANSI SQL",
                "AWS",
                "Unix Scripting",
                "Hive",
                "Amazon Redshift",
                "HDFS",
                "Spark",
                "Data Governance",
                "Performance Tuning",
                "Technical Documentation",
                "Mentoring"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Juhi Upadhyay",
        "email": "juhi.upadhyay@technocraftsol.com",
        "jd": "Hello,Hope you are doing well!My name is Juhi and I'm Technical Recruiter at Technocraft solutions. We provide IT Consulting Services to our customers’ immediate and long-term resource needs. I am contacting you either because your resume has been posted to one of the internet job sites to which we subscribe or you had previously submitted your resume to Technocraft solution.Job Title: Data Engineer (Redshift) Duration: Long Term Contract Location: Saint Louis, MO (Onsite) Experience: 12+ Years Mush Have: Redshift Certification or AWS Cloud Architect certifications. Job Description:Required Skills: ANSI SQL, Hive, Amazon Redshift, HDFS, Spark, AWS, Unix ScriptingWe are seeking an experienced data engineer with 10 plus of experience in IT Data Warehousing.Candidate should 5 plus years’ experience in Redshift cloud environment.The ideal candidate will have a strong background in SQL and Amazon Redshift.The candidate should be good in Spark, HDFS, Hive, AWS, Unix Scripting.This role requires a deep understanding of data architecture and the ability to design and implement scalable solutions. Responsibilities:Lead the design and implementation of data architecture solutions using Redshift.Oversee the development and maintenance of scalable data pipelines and workflows.Provide technical expertise in Unix Scripting and ANSI SQL to optimize data processing tasks.Collaborate with cross-functional teams to gather and analyze requirements for data solutions.Ensure data integrity and security by implementing best practices and standardsDevelop and maintain documentation for data architecture and processes.Monitor and troubleshoot data systems to ensure optimal performance and reliability.Implement data governance policies to ensure compliance with industry standards.Mentor and guide junior team members in best practices and technical skills.Conduct performance tuning and optimization of data systems to enhance efficiency.Evaluate and recommend new technologies and tools to improve data architecture.Work closely with stakeholders to understand business needs and translate them into technical solutions.Provide regular updates and reports on project status and progress.",
        "source": "Email",
        "date_posted": "2024-10-15 17:09:51-05:00",
        "unique_id": "192925b8b6c05d11",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]