[
    {
        "company": "Tanisha Systems, Inc.",
        "job_title": "Azure Security Architect with Azure Certification",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Contract to Hire",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Microsoft Defender For Cloud",
                "Azure Cloud Security Posture Management",
                "ITSM Integration to Azure Defender",
                "CSPM",
                "Microsoft Defender Suite"
            ],
            "primary": [
                "Azure security architecture",
                "Microsoft Defender for Cloud",
                "Azure AD",
                "Azure Key Vault",
                "Azure Policy",
                "Azure Security Center",
                "identity and access management (IAM)",
                "multi-factor authentication (MFA)",
                "role-based access control (RBAC)",
                "Azure Sentinel",
                "Azure Firewall",
                "network security",
                "GDPR",
                "HIPAA",
                "PCI-DSS",
                "infrastructure-as-code (IaC)",
                "Terraform",
                "ARM templates",
                "PowerShell",
                "Python",
                "Bash",
                "DevSecOps"
            ],
            "secondary": [
                "Excellent communication skills",
                "security best practices",
                "risk assessments",
                "threat modeling",
                "security reviews",
                "security monitoring solutions",
                "security policies",
                "governance frameworks",
                "technical security controls",
                "incident response activities",
                "security investigations"
            ],
            "all": [
                "Microsoft Defender For Cloud",
                "Azure Cloud Security Posture Management",
                "ITSM Integration to Azure Defender",
                "CSPM",
                "Microsoft Defender Suite",
                "Azure security architecture",
                "Microsoft Defender for Cloud",
                "Azure AD",
                "Azure Key Vault",
                "Azure Policy",
                "Azure Security Center",
                "identity and access management (IAM)",
                "multi-factor authentication (MFA)",
                "role-based access control (RBAC)",
                "Azure Sentinel",
                "Azure Firewall",
                "network security",
                "GDPR",
                "HIPAA",
                "PCI-DSS",
                "infrastructure-as-code (IaC)",
                "Terraform",
                "ARM templates",
                "PowerShell",
                "Python",
                "Bash",
                "DevSecOps",
                "Excellent communication skills",
                "security best practices",
                "risk assessments",
                "threat modeling",
                "security reviews",
                "security monitoring solutions",
                "security policies",
                "governance frameworks",
                "technical security controls",
                "incident response activities",
                "security investigations"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Deepank Bansal",
        "email": "deepank@tanishasystems.com",
        "jd": "Greetings for the day! My name is Deepank and I'm an IT recruiter at Tanisha Systems Inc. Our records show that you are an experienced IT professional. This experience is relevant to one of my current openings. Please review the job description and let me know if you are interested. Job Title: Azure Security Architect with Azure Certification Location: Remote Duration: Contract to Hire Job Description MUST HAVE SKILLS Microsoft Defender For Cloud Azure Cloud Security Posture Management ITSM Integration to Azure Defender CSPM. Microsoft Defender Suite - Endpoints, Identity, Applications. Qualifications We are seeking a highly skilled and experienced Azure Security Architect to lead the design, implementation, and management of secure cloud solutions on Microsoft Azure 5+ years of experience in cloud security with a specifically on Azure security architecture and design; and Microsoft Defender for Cloud Strong understanding of Azure services and security capabilities, including Azure AD, Azure Key Vault, Azure Policy, and Azure Security Center Experience with identity and access management (IAM), multi-factor authentication (MFA), and role-based access control (RBAC) in Azure Proficiency in implementing security tools, such as Azure Sentinel, Microsoft Defender for Cloud, and Azure Firewall Deep knowledge of network security, including firewalls, VPNs, and encryption protocols Strong understanding of compliance frameworks such as GDPR, HIPAA, PCI-DSS, and other industry-specific standards Excellent communication skills with the ability to articulate complex security concepts to non-technical stakeholders Experience with infrastructure-as-code (IaC) tools like Terraform, ARM templates, or Azure Resource Manager Knowledge of scripting and automation languages such as PowerShell, Python, or Bash Familiarity with DevSecOps practices and integrating security into CI/CD pipelines Experience with hybrid cloud security and securing multi-cloud environments Responsibilities As an Azure Security Architect, you will be responsible for ensuring the security of cloud-based applications and services, implementing security best practices, and mitigating risks across the Azure environment You will collaborate with cross-functional teams, including IT, DevOps, and development teams, to design and enforce security policies, frameworks, and solutions Design and implement secure cloud architectures for Microsoft Azure environments Define security standards, best practices, and policies to ensure cloud systems meet compliance and regulatory requirements (e.g., GDPR, HIPAA) Develop and maintain Azure security policies, governance frameworks, and technical security controls Perform security assessments, identify vulnerabilities, and lead remediation efforts to address risks and threats within the Azure environment Architect and implement identity and access management (IAM), encryption, and security monitoring solutions Collaborate with DevOps and development teams to integrate security into the CI/CD pipeline Conduct risk assessments, threat modeling, and security reviews for cloud-based solutions Stay current with Azure security technologies and industry best practices and recommend improvements or new tools as necessary Ensure the security of Azure-based services such as Azure AD, Azure Key Vault, Azure Security Center, and Azure Sentinel Provide guidance and mentorship to team members on security best practices Assist in incident response activities and security investigations Thanks & best regards, Deepank Bansal Tanisha Systems, Inc. An Information Technology Company. Mob: (908)666-1508 Email: deepank@tanishasystems.com Web : www.tanishasystems.com Tanisha Systems Inc. | 99 Wood Ave South | 350 5th Avenue | Suite # 308 | Iselin, NJ 08830",
        "source": "Email",
        "date_posted": "2024-10-15 13:29:11-05:00",
        "unique_id": "19291918705f478c",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Azure Data Engineer"
    }
]