[
    {
        "company": "Vyze",
        "job_title": "Senior Sap Project Manager",
        "location": "Jackson, MS, USA",
        "full_location": {
            "city": "Jackson",
            "state": "MS",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Bachelor’s degree or higher in Business, Computer Science or related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6-month project",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SAP",
                "Project Management",
                "S/4 implementation",
                "Communication",
                "Risk Management"
            ],
            "primary": [
                "Planning",
                "Coordination",
                "Time Management",
                "Documentation",
                "Reporting"
            ],
            "secondary": [
                "PMP certification",
                "Problem Solving",
                "Negotiation",
                "Smartsheet"
            ],
            "all": [
                "SAP",
                "Project Management",
                "S/4 implementation",
                "Communication",
                "Risk Management",
                "Planning",
                "Coordination",
                "Time Management",
                "Documentation",
                "Reporting",
                "PMP certification",
                "Problem Solving",
                "Negotiation",
                "Smartsheet"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Abhiram Rout",
        "email": "arout@vyzeinc.com",
        "jd": "From: Abhiram Rout, Vyze arout@vyzeinc.com Reply to: arout@vyzeinc.com Title: Senior Sap Project ManagerLocation: Jackson, MississippiOther Requirements:On-site will be required for up to 5 days a week (Mon-Fri) in Jackson, MS. Local preferred!! but we open to relocate candidatesAbout the jobwe are looking for a Senior SAP Project Manager with S/4 implementation experience for a 6-month project starting ASAP. The Project Manager will plan and manage the execution of the discovery Initiative for Phases 2 and 3 of our client's S/4 project. The objective of this Initiative is to gather and document the business processes and requirements for Phases 2 and 3 so that scoping and budgeting for those phases can be completed. The PM will work closely with the Program Management Office to ensure the Discovery Initiative objectives are met on time, within the budget established, and within scope. The PM will work closely with a Business Analyst and Client IT resources to ensure that the expected deliverables are completed with quality and on schedule.Key Responsibilities:Planning – A detailed plan will need to be developed to track progress of project deliverables.Communication: Facilitating communication among stakeholders, team members, and other relevant parties to ensure everyone is informed and aligned.Coordination – A high level of coordination will be required to ensure that meetings are scheduled, rooms are booked, and participants are available to participate as required to meet Discovery Phase objectives. Time Management – Meetings will require facilitation to ensure that goals are reached each day.Risk & Issue Management – Risks and Issues will need to be tracked and as needed, reported to the Polaris PMO for mitigation or resolution.Documentation and Reporting: Meeting Notes will need to be taken and distributed, along with any action items. Status reports will be expected on a regular basis.Position Qualifications:Bachelor’s degree or higher in Business, Computer Science or related field and at least 5 years project management experience within IT software application experience. Experience managing an SAP project is a plus.Certified Project Management Professional (PMP) preferred.Strong problem solving and negotiation abilities.Significant experience with proven ability to manage, execute, control andachieve closure of complex projects.Excellent planning and organization, project management and time management skills.Excellent interpersonal, verbal, written and presentation communication skills.Smartsheet experience/expertise a plus.",
        "source": "Email",
        "date_posted": "2024-10-15 19:39:38-05:00",
        "unique_id": "19292f11bcab9946",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]