[
    {
        "company": "NAM Info Inc",
        "job_title": "AWS Databricks Architect",
        "location": "Bostan, MA, USA",
        "full_location": {
            "city": "Bostan",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Databricks",
                "PowerBI",
                "ETL methodologies",
                "SQL",
                "Python"
            ],
            "primary": [
                "Data Lakehouse concepts",
                "Data engineering",
                "Data and analytics design",
                "Dev lead for junior developers/support",
                "Jira experience"
            ],
            "secondary": [
                "Experience in G&A data domains, such as finance, HR, compliance, etc."
            ],
            "all": [
                "Databricks",
                "PowerBI",
                "ETL methodologies",
                "SQL",
                "Python",
                "Data Lakehouse concepts",
                "Data engineering",
                "Data and analytics design",
                "Dev lead for junior developers/support",
                "Jira experience",
                "Experience in G&A data domains, such as finance, HR, compliance, etc."
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Venki R",
        "email": "venki@nam-it.com",
        "jd": "Hi Greetings from NAM Info Inc!!! Please find the below immediate requirements from my Client. Please revert me back with updated copy of resume, Visa status and contact details Note: Send resumes to Venki@nam-it.com for quick submittals. As per client policy video call discussion is mandatory before submitting profile to client Position: AWS Databricks ArchitectLocation: Hybrid-Bostan-MADuration: 12 Months Contract Description Lead development team for ongoing data and analytics enhancements and development projects. Will be primary developer, including both developing directly but also coordinating with offshore developers, including both core dev/support team, but also additional developers for projects.Responsible for detailed design based on project direction from Alnylam leads and breaking down efforts to assign to individual developers including confirming their results. Will also assist support escalations as needed. Expertise Areas:Databricks (Required)PowerBI (Required)ETL methodologies (e.g. Boomi)Data Lakehouse conceptsData engineering, include SQL and/or PythonData and analytics designDev lead for junior developers/supportJira experienceExperience in G&A data domains, such as finance, HR, compliance, etc. (nice to have) Thanks & Regards...Venki RSenior Executive (Staffing)Nam Info Inc Email : Venki@nam-it.comWebsite - www.nam-it.com2525 US Highway 130, Building D, Suite 2-Cranbury, NJ-08512 “The harder you work, the luckier you get” Follow us on: USA | CANADA | INDIA MBE Certified Company , E Verify Company Note: This is not an unsolicited mail. Under Bill 1618 Title III passed by the 105th USA Congress this email cannot be considered as spam as long as we include our contact information and an option to be removed from our emailing list. If you have received this message in error or, are not interested in receiving our emails, please accept our apologies. To be removed from our mailing list, please reply with the subject line \"REMOVE\". All removal requests will be honored ASAP. We sincerely apologize for any inconvenience caused to you",
        "source": "Email",
        "date_posted": "2024-10-15 11:06:33-05:00",
        "unique_id": "1929164018ee88ff",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]