[
    {
        "company": "Vyzeinc",
        "job_title": "Business Process Consultant",
        "location": "Tallahassee, FL, USA",
        "full_location": {
            "city": "Tallahassee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "7 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "IT business analysis",
                "business process engineering",
                "strategic planning",
                "process management",
                "business systems requirements definition"
            ],
            "primary": [
                "Microsoft Visio",
                "SharePoint",
                "Microsoft 365 Office Suite",
                "business analyst software tools",
                "analytical skills",
                "problem-solving skills"
            ],
            "secondary": [
                "communication skills",
                "mentoring",
                "coaching",
                "data collection",
                "data analysis",
                "project management",
                "teamwork",
                "independent work",
                "organizational skills"
            ],
            "all": [
                "IT business analysis",
                "business process engineering",
                "strategic planning",
                "process management",
                "business systems requirements definition",
                "Microsoft Visio",
                "SharePoint",
                "Microsoft 365 Office Suite",
                "business analyst software tools",
                "analytical skills",
                "problem-solving skills",
                "communication skills",
                "mentoring",
                "coaching",
                "data collection",
                "data analysis",
                "project management",
                "teamwork",
                "independent work",
                "organizational skills"
            ],
            "with_experience": [
                "IT business analysis (7+ years)",
                "business process engineering (4+ years)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Vyzeinc",
        "email": "sharma@vyzeinc.com",
        "jd": "Job Description -Title: Business Process ConsultantVisa: USC and GCClient: Agency for Health Care Administration (FL AHCALocation: Tallahassee, FLCandidate must have Finance Industry Experience.Preferences will be given to candidates with the following:• Experience with the Florida Accounting Information Resource (FLAIR) application.• Candidates are required to attend in-person project meetings.ReferencesProvide three (3) clients for which similar services were performed within the past three (3) years for each proposed Business Process Consultant.References should include:1. Reference contact’s name2. Organization name3. Job title held by the candidate while employed or contracted4. Direct telephone number5. Email addressKnowledge, Skills & AbilitiesA minimum of 7 years of IT business analysis experience and 4 years of business process engineering experience.Knowledge of leveraging both IT solutions and business process improvements. Must demonstrate expertise in strategic planning, tactical execution, process management, and business systems requirements definition. Knowledge of advanced management principles and practices, methods of data collection and analysis.Knowledge of process engineering principles and practices.Proven communication skills, both orally and in writing, with technical and non-technical staff, and all levels of management.Skilled with Microsoft Visio, SharePoint, the Microsoft 365 Office Suite, and familiar with business analyst software tools.Skilled in working on one or more projects as a project lead. Must be able to mentor and coach junior staff.Must possess strong analytical and problem-solving skills. Ability to communicate complex ideas to technical and non-technical staff, as well as all levels of management, both orally and in writing. Ability to elicit requirements using interviews, document analysis, requirements workshops, surveys, and site visits. Ability to map business processes, use cases, tasks, and workflows.Ability to establish and maintain effective working relationships with others. Ability to work independently and in a team to meet deadlines. Ability to plan, organize, and coordinate multiple projects and work assignments. Ability to organize data into logical formats for presentation in reports, documents, and other written materials. Ability to conduct fact finding research. Ability to collect, evaluate, and analyze data to develop alternative recommendations, solve problems, document workflows, and other activities relating to the continuous improvement of processes. Goal oriented, action focused, pragmatic, and self-disciplined.",
        "source": "Email",
        "date_posted": "2024-10-15 16:15:26-05:00",
        "unique_id": "19292bc54b3fb797",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]