[
    {
        "company": "SibiTalent Corp",
        "job_title": ".NET Application Developer",
        "location": "Tallahassee, FL, USA",
        "full_location": {
            "city": "Tallahassee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "5+ years",
            "degree_required": "Bachelor’s or Master’s Degree in Computer Science, Information Systems, or other related field. Or equivalent work experience.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".NET",
                "C#",
                "ASP.NET",
                "SQL",
                "Blazor"
            ],
            "primary": [
                "MVC",
                "Web API",
                "DevOps",
                "Azure DevOps",
                "GitHub"
            ],
            "secondary": [
                "Data mapping",
                "Data integration",
                "Data visualization",
                "Customer support",
                "Quality assurance"
            ],
            "all": [
                ".NET",
                "C#",
                "ASP.NET",
                "SQL",
                "Blazor",
                "MVC",
                "Web API",
                "DevOps",
                "Azure DevOps",
                "GitHub",
                "Data mapping",
                "Data integration",
                "Data visualization",
                "Customer support",
                "Quality assurance"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Sapna Thakur",
        "email": "sapnathakur@sibitalent.com",
        "jd": "From: Sapna Thakur, SibiTalent Corp sapnathakur@sibitalent.com Reply to: sapnathakur@sibitalent.com .NET Application Developer,Onsite position Tallahassee, FLVisa :: Green Card & US CitizenExperience :: 5+ year Duration :: 12 months Note – *Prior Department of Children and Families client experience will receive preference* Responsibilities: Collaborate with business analysts, project managers, and stakeholders to understand the functional and non-functional requirements of the application. Translate business requirements into architectural designs that align with business goals. Design the overall system architecture, and define how different components of the interact. Design, develop, and implement software applications using the .NET framework and C#. Utilize ASP.NET (or ASP.NET Core) for web application development, including MVC, Web API, and Blazor for client-side and server-side programming. Develop and optimize SQL queries, stored procedures, and functions. Develop user interfaces and ensure the front end is responsive, accessible, and user friendly. Review code, architecture, and design to ensure they meet the standards. Analyze and optimize the performance of the application. Design strategies for scaling the application efficiently as user demand grows. Ensure the application adheres to security best practices and compliance requirements. Implement DevOps practices such as continuous integration and continuous delivery (CI/CD) via Azure DevOps and GitHub repositories. Experience: 5+ years of experience in .NET/.NET core application development (recent experience preferred), 5+ years of experience in DDL, DML T-SQL skills, advanced stored procedure writing skills, tables, primary keys, foreign keys, constraints, indexes, transactions, process logging, and error handling. 3+ years of experience with application design, including Data mapping. 3+ years of experience in application architecture and data integration. 3+ years of analyzing and interpreting large datasets, including cleaning, transforming, and visualizing data. 3+ years of Experience in testing high-volume of complex data integration processes. 1+ years of Experience using Blazor Familiarity with system catalog views, and Azure Cloud Ability to provide excellent customer support; meticulous quality of work and work product.Education: Bachelor’s or Master’s Degree in Computer Science, Information Systems, or other related field. Or equivalent work experience. (Required) Certifications: Microsoft or Other Related Certification (Desired)Candidate must be presented with 3 manager/client references from the past 3 years Reference contact’s name Organization name Job title held by the candidate while employed or contracted Direct telephone number Thanks & RegardsSapna Thakur | Sr. Technical Recruiter",
        "source": "Email",
        "date_posted": "2024-10-15 12:12:14-05:00",
        "unique_id": "192914b15a61ed4e",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]