[
    {
        "company": "Tek Inspirations",
        "job_title": "Project Manager",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Licensed architect",
                "Connecticut State Building Code",
                "ICC A117.1-2009 standard for accessibility",
                "Project management",
                "Construction administration"
            ],
            "primary": [
                "Experience managing State of Connecticut public works project",
                "ADA corrective action projects"
            ],
            "secondary": [
                "Licensure as a state building official"
            ],
            "all": [
                "Licensed architect",
                "Connecticut State Building Code",
                "ICC A117.1-2009 standard for accessibility",
                "Project management",
                "Construction administration",
                "Experience managing State of Connecticut public works project",
                "ADA corrective action projects",
                "Licensure as a state building official"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Mohit Kumar",
        "email": "kumar.mohit@tekinspirations.com",
        "jd": "From: Mohit Kumar, Tek Inspirations kumar.mohit@tekinspirations.com Reply to: kumar.mohit@tekinspirations.com Project ManagerRemoteState of CTState exp required, State of CT exp is preferredProject Description:Intent:The client is seeking the services of a durational project manager to assist with ADA improvements at various court facilities throughout the State of Connecticut. Qualifications: Must Have: Be a licensed architect demonstrating a strong background in the 2018 Connecticut State Building Code and the ICC A117.1-2009 standard for accessibility.Demonstrate experience in the design of ADA corrective action projects along with associated project management and construction administration requirements. Background: The client currently has custody and control of thirty-eight (38) court facilities comprising over three (3) Million gross square feet. It is preferred that individuals have the following skills and meet the requirements noted below: Experience managing State of Connecticut public works projectLicensure as a state building official will be considered an additional benefit but not a requirement. Scope Of Services: The scope of services includes but is not limited to the following: Completion of ADA Evaluations per the existing deficiency reportsDevelopment of simple sketches and directives for in-house property management to complete ADA Improvements.Completion of plans and specifications consistent with Judicial Branch requirements for the competitive bidding of ADA improvements.Coordination with OSBI and OSFM on code related issues potentially impacted by ADA Improvements.Completion of Monthly progress reports to Judicial Branch Facilities Unit",
        "source": "Email",
        "date_posted": "2024-10-21 15:11:15-05:00",
        "unique_id": "192b0d5f7ea14584",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]