[
    {
        "company": "Nukasanigroup Inc.",
        "job_title": "Business Analyst 4",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "5 years",
            "degree_required": "Bachelor's in computer science or closely related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Up to 6 months",
            "rate": "Best competitive rate"
        },
        "skills": {
            "core": [
                "Software Development Life Cycle",
                "Business Systems Analysis",
                "Procurement Processes",
                "Contract Management Systems",
                "Analytical Techniques"
            ],
            "primary": [
                "M365 apps – Word, Excel, PowerPoint, SharePoint",
                "Web-based systems",
                "IT security standards"
            ],
            "secondary": [
                "Problem-solving",
                "Communication",
                "Team collaboration",
                "Documentation"
            ],
            "all": [
                "Software Development Life Cycle",
                "Business Systems Analysis",
                "Procurement Processes",
                "Contract Management Systems",
                "Analytical Techniques",
                "M365 apps – Word, Excel, PowerPoint, SharePoint",
                "Web-based systems",
                "IT security standards",
                "Problem-solving",
                "Communication",
                "Team collaboration",
                "Documentation"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Bhavani",
        "email": "recruitment@nukasanigroup.com",
        "jd": "Dear Partner, Good Morning, Greetings from Nukasanigroup Inc!, We have below urgent long-term contract project immediately available for Business Analyst 4, Richmond, VA, Hybrid need submissions you please review the below role, if you are available, could you please send me updated word resume, and below candidate submission format details, immediately. If you are not available, any referrals would be greatly appreciated. Interviews are in progress, urgent response is appreciated. Looking forward for your immediate response and working with you. Candidate Submission Format - needed from you Full Legal Name Personal Cell No (Not google phone number) Email Id Skype Id Interview Availability Availability to start, if selected Current Location Open to Relocate Work Authorization Total Relevant Experience Education./ Year of graduation University Name, Location Last 4 digits of SSN Country of Birth Contractor Type DOB: mm/dd Home Zip Code Assigned Job Details Job Title: Business Analyst Location: Richmond, VA, Hybrid Rate: Best competitive rate ON SITE REQUIRED: 2 days in (Tuesday and Wednesday in office each week required) with other 3 days remote. *Parking is not provided for contractors ABOUT THE ROLE The Virginia Retirement System (VRS) is seeking an experienced business analyst to assist with documenting current and future state requirements, developing test cases, testing the system, documenting users guides and standard operating procedures for a procurement and contract management system. As a Business Analyst, the ideal candidate brings proven leadership experience in the procurement and contract management domain and thrives in a highly collaborative, fast-paced work environment. This position is hybrid, requiring onsite presence on Tuesdays, Wednesdays and other days as required. Essential Duties and Responsibilities include the following (other duties may be assigned as needed): Analysis Independently and proactively lead/facilitate efforts to identify opportunities to leverage technology to enable business success and alignment with strategic vision. Collaborate with all stakeholders to gather, evaluate, and document requirements for new systems or system enhancements based on business user input, technical requirements and constraints. Document requirements using Structured Analysis Techniques such as Use Cases, Entity Relationship Diagrams, Process Decomposition Diagrams, Workflows and Wireframes. Analyze proposed system and process changes to identify strategies for meeting business objectives and impacts, including assessing costs and implementation efforts. Develop innovative strategies to meet business requirements by leveraging the capabilities of existing technology tools or acquiring/developing new ones. Present strategies and findings in meetings and presentations with key users and agency executives. Serve as a liaison between business partners and technical staff. Coordinate with business users and technical staff to develop test data and test procedures to verify application functionality and oversee testing within projects. Technical Expertise and Guidance Apply a broad range of expertise of technology principles, best practices and procedures to complex assignments across multiple functional areas. Ensure security best practices in accordance with VRS Security policies. Utilize comprehensive technical knowledge of software solutions analysis and design to oversee significant assignments, escalating only the most complex technology issues to higher levels. Develop and document technology processes and methodologies. Promote and adhere to the Systems Development Life Cycle (SDLC) methodology and recommend changes when appropriate. Collaborate with both business partners and technical staff to ensure adherence to the SDLC methodology, ensuring high-quality project deliverables. Skills and Abilities Demonstrated ability to: Work effectively and independently in a fast-paced team environment where priorities can rapidly change. Prioritize task with minimal guidance and coaching. Solve complex problems through discovery and analysis with minimal guidance. Communicate effectively orally and in writing with users at all levels within VRS. Expert knowledge and experience in the following: The Software Development Life Cycle Business Systems Analysis and Design Techniques General understanding of procurement processes, systems and best practices Demonstrated ability to: Analyze complex processes and understand intricate materials and documentation. Research and gather data, compile results and solve problems. Define user requirements and document user stories. Use of various analytical techniques including process flows and use cases. Prepare complex documents, including general and detail design specifications. Successfully interact in a team environment. Demonstrated working knowledge of the following tools/technologies: Web-based systems and business support tools such as procure-to-pay systems and contract management systems. M365 apps – Word, Excel, PowerPoint, SharePoint. General IT security standards and practices.",
        "source": "Email",
        "date_posted": "2024-10-21 07:24:17-05:00",
        "unique_id": "192af29616502d2b",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]