[
    {
        "company": "Nitya Software Solution",
        "job_title": "IT Project Manager",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "8+ years",
            "degree_required": "Bachelor's degree in Business Management, Computer Science, Information Systems or equivalent relevant work experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Agile methodologies",
                "Waterfall methodologies",
                "Hybrid methodologies"
            ],
            "primary": [
                "ERP management",
                "Budget analysis",
                "Stakeholder communication",
                "Risk mitigation",
                "Resource management"
            ],
            "secondary": [
                "SCRUM",
                "PMP Certification",
                "Information Technology",
                "Business Management",
                "Innovation process"
            ],
            "all": [
                "Project Management",
                "Agile methodologies",
                "Waterfall methodologies",
                "Hybrid methodologies",
                "ERP management",
                "Budget analysis",
                "Stakeholder communication",
                "Risk mitigation",
                "Resource management",
                "SCRUM",
                "PMP Certification",
                "Information Technology",
                "Business Management",
                "Innovation process"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Nitya",
        "email": "ryan@nityainc.com",
        "jd": "From: Nitya, Nitya software solution ryan@nityainc.com Reply to: ryan@nityainc.com IT Project Manager -USC and GC only-Need only local to GADate Issued: 10/21/2024Position Type: ContractLocation: Atlanta, GA, United StatesDescription: The IT Project Manager functions independently to manage multiple large projects related to internal information systems, effectively communicating and coordinating the activities of the project team. These projects are highly complex, have senior level business manager sponsorship, and require the coordination of project activities across functional areas within the organization. The IT Project Manager works with internal customers to determine project definition and business requirements. They provide budget analysis and coordination of project activities ensuring that project steps are in alignment with business objectives, on-time, and within budget. In some cases, the IT Project Manager will play the solution delivery manager role for a business-sponsored project.Responsibilities: Manage the IT components of our client's ERP, infrastructure and operations projects.Lead the planning and implementation of projects in the Information Technology sector.Facilitate the definition of project mission, goals, tasks, and resource requirements.Independently manage project scope, schedule, resources, status reporting, communication, costs, issues, risk mitigation, integration, and implementation.Effectively communicate project status to stakeholders, and appropriately escalate issues to management attention.Develop and maintain detailed project plans to monitor and track progress.Coordinate internal resources and third parties for flawless execution of projects.Ensure all projects are delivered on time, within scope and budget, and at the required level of quality.Manage changes to project scope, schedule, and costs.Follow the Veritiv project management guidelines, practices, and procedures. Interprets business/customer needs and demands and translates into executable solutions for IT to implement.Works with financial leadership on annual IT budgets and forecastsHelps evaluate IT project objectives and analyzes new business initiatives.Facilitates ideation through a defined innovation process and engages the \"appropriate” stakeholders to support assessment, prioritization, and development of innovative technologies.Qualifications: Bachelor's degree in Business Management, Computer Science, Information Systems or equivalent relevant work experienceStrong working knowledge of waterfall, Agile, and hybrid methodologies for management of large, complex software and infrastructure projects.8+ years Project Management experience in the information technology sector.Agile/SCRUM or Project Management Institute PMP Certification",
        "source": "Email",
        "date_posted": "2024-10-21 14:32:21-05:00",
        "unique_id": "192b0b2e7e2c0521",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]