[
    {
        "company": "Stellar IT Solutions",
        "job_title": "Business Analyst",
        "location": "Washington, DC, USA",
        "full_location": {
            "city": "Washington",
            "state": "DC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "onsite",
                "third party"
            ],
            "experience_required": "12+ years",
            "degree_required": "Master's degree plus required industry certificates; or bachelor's degree and 12+ years of relevant experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Financial Services",
                "Data Warehouses",
                "Data Management"
            ],
            "primary": [
                "Data Analysis",
                "Data Mapping",
                "Reporting Requirements",
                "Data Quality",
                "Data Lineage",
                "Data Lifecycle",
                "Master/Reference Data Management",
                "Metadata Management",
                "PL/SQL",
                "Power BI",
                "SAP BO",
                "Tableau",
                "Agile Methodologies",
                "Project Management"
            ],
            "secondary": [
                "Analytic Skills",
                "Problem-Solving",
                "Logical Reasoning",
                "Attention to Detail",
                "Multi-tasking",
                "Communication Skills",
                "Stakeholder Management"
            ],
            "all": [
                "Business Analysis",
                "Financial Services",
                "Data Warehouses",
                "Data Management",
                "Data Analysis",
                "Data Mapping",
                "Reporting Requirements",
                "Data Quality",
                "Data Lineage",
                "Data Lifecycle",
                "Master/Reference Data Management",
                "Metadata Management",
                "PL/SQL",
                "Power BI",
                "SAP BO",
                "Tableau",
                "Agile Methodologies",
                "Project Management",
                "Analytic Skills",
                "Problem-Solving",
                "Logical Reasoning",
                "Attention to Detail",
                "Multi-tasking",
                "Communication Skills",
                "Stakeholder Management"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Aravind",
        "email": "aravindr@stellarit.com",
        "jd": "Hi, This is Aravind form Stellar IT Solutions! You intrigued us in your profile; hence I have a Great Opportunity for you with our direct client so kindly view the below job description and let me know your interest to proceed further.Role: Business Analyst (12+ years)Location: Onsite - Washington, DCJob description:REQUIRED SKILLS:Business Analysis, Financial Services, Data Warehouses, Data Management, Business AnalystJob Description:Scope of work: Capture data, reporting and analytic requirements for financial data sets which include Financial investment Operations Data, loan and equity accounting data sets, financial expenses and revenue data, treasury data, and other financial data sets.Perform data analysis, data lineage, and profiling of data from the source system to data repositories and reports. Responsible for data mapping to any “to-be” data structures. Create specifications for Reporting requirements and work with business users to elicit hidden requirements and clarify vague requirements, as well as ensure sign-offs on requirements.Interact with technical teams and guide offshore development resources to help translate requirements into solutions. Responsible for providing functional and technical guidance to the development team.Coordinate user acceptance testing of reports and data-driven solutions by working with the business users.Assist the Program Managers with tracking work program deliverables using the appropriate SDLC methodologies including agile scrum.Manage daily technical challenges and communicate to management any risks or issues.Develop, manage, and maintain processes, procedures, and documentation for handover to application support. Skills/Experience Required:Minimum 8+ yrs. of relevant experience and master's degree plus required industry certificates; or bachelor's degree and 12+ years of relevant experience.Experienced IT professional working on large data and reporting applications as well a strong understanding of Operational data stores, Data Warehouses, and/or Data Marts.Should have participated in data implementation efforts with exposure to relational database concepts, ETL fundamentals, transaction processing, and testing protocols.Shows an understanding of data management concepts – data quality, data lineage, data lifecycle, master/reference data management, and metadata management.Ability to understand the meaning of the data and work cohesively with the business to leverage it for better and advanced insights. Domain knowledge of accounting and financial data sets is essential.Has strong analytic, problem-solving and logical reasoning skills with high attention to detail and the ability to multi-task.Proficient in the use of PL/SQL and the ability to read data models, infer data flows, and write complex queries.Hands-on experience with reporting tools (like Power BI, SAP BO, and Tableau).Excellent skills in analyzing data, gathering requirements, and working with clients and technical teams to translate requirements into solutions.Familiarity with using agile tools such as Azure DevOps. Strong project management skills with a process orientation (understand problems, do analysis, interview stakeholders, write requirements, get sign off, hand off to dev, coordinate UAT etc.) and ability to leverage Agile concepts.Excellent oral and written communication skills and experience interacting with both business and IT individuals.",
        "source": "Email",
        "date_posted": "2024-10-21 07:40:31-05:00",
        "unique_id": "192af383d79eebc7",
        "emp_type": [
            "onsite",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]