[
    {
        "company": "Digitaldhara",
        "job_title": "S4 Project Manager",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "7-10 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "S4 HANA implementation",
                "project management",
                "planning",
                "communication skills"
            ],
            "primary": [
                "SAP Source to pay functional knowledge",
                "project management certifications"
            ],
            "secondary": [
                "excellent planning",
                "project tracking"
            ],
            "all": [
                "S4 HANA implementation",
                "project management",
                "planning",
                "communication skills",
                "SAP Source to pay functional knowledge",
                "project management certifications",
                "excellent planning",
                "project tracking"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Mahender Singh",
        "email": "mahender@digitaldhara.com",
        "jd": "From: Mahender Singh, Digitaldhara mahender@digitaldhara.com Reply to: mahender@digitaldhara.com S4 Project Manager Remote (USA)Long Term We are looking for an experienced project manager with a track record of managing Source to pay S4 HANA implementation projects in multiple-partner environment. This role will be part of Source to Pay Digital Technologies team responsible for Digital Core program delivery as part of our Enterprise in the center, collaborating with our Segments to deliver S4 implementation. Key Responsibilities: Define work breakdown structure and milestone plan for Digital Technologies scope of delivery for S2P workstream. Work with program Transformation office, business PMOs, BIs, SIs and Mars Segments to coordinate plans and ensure alignment of activities. Collaborate with S2P DT team to collect input on the work that needs to be accomplished, duration, complexity of tasks and x-functional alignment requirements. Responsible to maintain Risks, issues, dependencies logs, report status scorecards whenever necessary. Track project plan execution with respective tasks owners, escalate delays and roadblocks for resolution to Program leadership. Host and facilitate the cadence of meetings as necessary - project status reporting, Digital Core leadership Board meetings, partner alignment and others. Key requirements: 7-10 years of experience of S4 HANA implementation projectsSAP Source to pay functional/technical knowledge is a plusExperience of successful implementations in multiple-partner settingProject management certificationsExcellent planning, project tracking, communication skills mahender@digitaldhara.comPh:609-759-2687 EXT 102",
        "source": "Email",
        "date_posted": "2024-10-21 08:21:41-05:00",
        "unique_id": "192af5deb2afbf05",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]