[
    {
        "company": "Comtech Global",
        "job_title": ".NET DEVELOPER",
        "location": "Columbus, OH, USA",
        "full_location": {
            "city": "Columbus",
            "state": "OH",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "experience_required": "10 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".NET",
                "C#",
                "ASP.NET Core MVC",
                "SQL Server",
                "Entity Framework"
            ],
            "primary": [
                "Java",
                "RESTful APIs",
                "WCF",
                "TFS",
                "AJAX",
                "SSRS",
                "Visual Studio",
                "Azure DevOps"
            ],
            "secondary": [
                "SQL Server Integration Services (SSIS)",
                "Azure",
                "AWS",
                "ETL development",
                "MCPD certification",
                "Power BI",
                "JQuery",
                "JavaScript"
            ],
            "all": [
                ".NET",
                "C#",
                "ASP.NET Core MVC",
                "SQL Server",
                "Entity Framework",
                "Java",
                "RESTful APIs",
                "WCF",
                "TFS",
                "AJAX",
                "SSRS",
                "Visual Studio",
                "Azure DevOps",
                "SQL Server Integration Services (SSIS)",
                "Azure",
                "AWS",
                "ETL development",
                "MCPD certification",
                "Power BI",
                "JQuery",
                "JavaScript"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Pradeep Kumar",
        "email": "bpk@comtechglobal.com",
        "jd": "Hi We are excited to announce a fantastic opportunity for .Net Developer you will find all the details about this position and how you can join our team. We look forward to your application Role:.Net DeveloperLocation: Columbus OhioInterview Mode: F2F DIRECT CLIENT - .NET DEVELOPER, COLUMBUS, OH – FACE TO FACE INTERVIEW – LOCALS ONLY The selected Consultants will work closely with the designated I.T. supervisor, project managers and other developers in an agile development environment. The work scope of the consultant will include requirements gathering, application design, application development, testing, deployment and technical support.The Consultants, in working with ODPS staff, will be responsible for new application development and supporting legacy applications utilizing .NET, C#, Java, ASP.NET Core MVC, Web API, SQL Server and other technologies. The consultants will be required to port Java code samples and libraries to C#.This is canned statement with hours, background check and interview date/time. During the interview process with the ODPS staff, the resource consultant must demonstrate competence/experience in their specific area(s) of project assignment. The resource’s experience must also be documented for review and verification. Offered resources not showing technical or functional competence/experience will be sufficient reason to reject the Offeror’s proposal. It is the responsibility of the Offeror to pre-screen their candidates to ensure compliance. Resource will have a background check conducted by ODPS.Soft Skills1. Strong communication/ leadership skills. 2. Strong influence, collaboration and negotiation experience. 3. Ability to collaborate with supporting resources across business and/or functional lines. 4. Have excellent oral and written skills/possess strong meeting and work session facilitation skills. 5. Have the ability to work independently and as part of a team, the ability to manage time and resources to meet assigned deadlines. 6. Have strong understanding of prioritization stemming from the elicitation of system and/or user requirements. 7. Have excellent organizational skills, proven analytical, planning, problem solving, and decision-making skills. 8. Must be knowledgeable in the English language/speak clearly and understandably use the English language.9. Provides technical guidance and mentoring to technical staff.Mandatory Requirements:1. 10 years of verifiable experience as a .NET Web Developer developing ASP.NET Core MVC applications at least 4 years.2. 10 years of verifiable ASP.NET experience developing with the C–Sharp (C#) language. 3. 2 years of verifiable experience with the Java language.4. 2 years of verifiable experience with Microsoft C# .NET Core or .NET 8.5. 10 years of verifiable experience with SQL Server Database Design and development including optimization of queries, creating tables, views, stored procedures, and functions.6. 10 years of application experience developing applications using Entity Framework (EF) 4.0 or later.7. 5 years of experience creating design mock-ups and wireframes into front-end code8. 5 years of experience with consuming RESTful APIs.9. 10 years of verifiable Service Oriented Architecture (SOA) experience developing and securing Windows Communication Foundation (WCF).10. 10 years of experience or a demonstrable understanding of N-tier environments as it relates to development and deployment.11. 10 years of experience or a demonstrable understanding of code repository strategies, code promotion strategies and recovery using Team Foundation Server (TFS).12. 5 years of verifiable experience implementing Asynchronous JavaScript and XML (AJAX) enabled controls within Active Server Pages (ASP).NET Web applications.13. 5 years of verifiable experience developing reports in SQL Server Reporting Services (SSRS) and making them accessible within an MVC web application.14. A demonstrable understanding of implementing secure coding practices for an ASP.NET MVC application.15. 2 years of experience in Test Driven Development (TDD) or a verifiable experience implementing a testing strategy for applications developed.17. 5 years of experience developing with Visual Studio; 2 year with Visual Studio 2019.18. 5 years of experience with TFS/Azure DevOps including git, boards and CI/CD pipelines. Desired Skills:1. Experience developing SQL Server Integration Services (SSIS).2. Experience with Azure and/or AWS cloud computing, containers, Kubernetes.3. 3 years of experience ETL development experience.4. MCPD certification will be highly advantageous.5. Experience developing reports using Microsoft Power BI 6. Experience with JQuery and JavaScript",
        "source": "Email",
        "date_posted": "2024-10-21 12:20:01-05:00",
        "unique_id": "192b0772358ee02b",
        "emp_type": [
            "third party"
        ],
        "tag": ".net developer"
    }
]