[
    {
        "company": "Gtech",
        "job_title": "SAP Project manager",
        "location": "Clark, NJ, USA",
        "full_location": {
            "city": "Clark",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "At least 8+ years’ experience with SAP and large project implementations, preferred.",
            "degree_required": "Bachelor’s degree in business management information technology, or related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SAP",
                "Project Management",
                "Microsoft Office",
                "MS Excel",
                "Power BI"
            ],
            "primary": [
                "Project Management certification (PMP)",
                "Agile project management",
                "Communication skills",
                "Customer-facing skills",
                "Business process acumen"
            ],
            "secondary": [
                "Fluency in French",
                "Service Now experience",
                "Cutover experience",
                "Testing experience",
                "Data Migration experience"
            ],
            "all": [
                "SAP",
                "Project Management",
                "Microsoft Office",
                "MS Excel",
                "Power BI",
                "Project Management certification (PMP)",
                "Agile project management",
                "Communication skills",
                "Customer-facing skills",
                "Business process acumen",
                "Fluency in French",
                "Service Now experience",
                "Cutover experience",
                "Testing experience",
                "Data Migration experience"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Durgesh Kumar Jha",
        "email": "dkjha@greattechglobal.com",
        "jd": "From: Durgesh Kumar Jha, Gtech dkjha@greattechglobal.com Reply to: dkjha@greattechglobal.com HelloHope you are doing well. Position: SAP Project managerLocation: Clark, NJ (Hybrid)Job type: Contract Job description: -Key Responsibilities:Your main person you will be collaborating will be the Business Process Owner. You will be their “right-hand” person whereas you will act as their stand-in and manage requests.Create and maintain a very detailed project plan for the workplan that encompasses all the Business Flow activities, incorporate the Data Migration milestones and activities needed to be executed by the Business Team, Test milestones and all relevant activities the Business Team needs to participate. Each activity should have assigned resources and defined timeline that is in alignment to the overall project plan.Drive execution within the Business Team on all activities/Deliverables, with diligent communication and escalation as needed. Take ownership by leading, guiding, and motivating the Domain team, driving results, providing appropriate support to the teams when needed, involving the BPOs, Leads and/or Program Directors.Consult on detailed plans for each phase, including forward looking activities and milestones of the workstream as it relates to the overall project with the BPO and the domain resources to ensure they are aware of what is next and are planning for these upcoming activities. Actively prepare executive summaries in PPT with fact driven content to support Domain status; performance tracking (Planned VS Actuals) against the established plans/milestones by using Power BI. (Ability to perform VLOOKUPs, and Pivot tables required.) Plan and schedule pre-meetings to ensure the messaging is in alignment with your BPO prior to presenting final version. Include talk track for the presentation. Proactively escalate any potential delays to the BPO and Project Leadership team along with possible mitigation plans both verbally during internal meetings and in documented emails. Propagating the Wipro/Rizing culture and the Values through actions and be a role model for the others in the project team to follow. Desired Qualifications:Excellent project planning skills at a high, medium, and very detailed level. (Appreciation of complex implementation of an integrated application).SAP Functional or Technical background is beneficial in R2R, O2C Commerce, O2C Operations.Exposure to the Fashion and Lifestyle Industry.Must have led projects with 10+ team members.Fluent in English with fluency in French being an added advantage.Experience working with international clients / teams.Excellent communication skills - verbal and written. Ability to articulate ideas and opinions to all stakeholders in an organized, concise and professional manner. Excellent customer-facing skills, highly engaging and able to spar with the client to have lively conversations about what is best, having a recommendation ready to share. Qualifications:1Bachelor’s degree in business management information technology, or related field.Project Management certification (PMP) preferred.At least 8+years’ experience with SAP and large project implementations, preferred.4+ full life cycle SAP implementations, preferred. Proven experience in agile project management and project leadership.Excellent communication both verbal and written to all levels and stakeholder management skills.Ability to work effectively in a fast-paced and dynamic environment with multicultural teams, on a global project with flexibility for work hours to support global meetings.Strong business process acumen for retail, manufacturing, supply chain, Cost Center/ WBS and D2C business models.Experience in Cutover, Testing and Data Migration a plus. This is a very complex global project with multiple consultant companies working together for the success of the client. This role will be more focused on the internal processes and activities to support the delivery of the SAP S4 Domain. Additional Skills:Expert Microsoft Office, and general PC knowledge.Expert level MS Excel, ability to perform VLOOKUP, Pivot Tables, produce executive summaries based on analysis of data to be able to tell the story in a concise manner of what the data is telling or the trends are showing.Strong Power Point skills, including the ability to present to leadership.Service Now experience.Power BI reporting and navigating. Internal travel is limited, yet possible, please share work travel restrictions/visa. Requirements:This is an on-site in Clark, NJ role, 3 days a week minimum.Virtual meetings such as MS Team meetings are on-camera. This is a global project; the candidate may need to be available in the early mornings (6am ET) to participate in meetings as needed. All meetings must have meeting agenda/goals/decisions listed and meeting recaps to be issued within 24 hours of all meetings including actions, owners, and deadlines. Fluent in English and local language (Spoken + written). French is very helpful.Internation travel will be necessary thus the proper travel documentation such as a passport and work visa will be necessary.",
        "source": "Email",
        "date_posted": "2024-10-21 16:44:48-05:00",
        "unique_id": "192b167556b82b75",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]