[
    {
        "company": "Smart IT Frame",
        "job_title": "Sr. Dot Net Tech Lead",
        "location": "Chicago, IL, USA",
        "full_location": {
            "city": "Chicago",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "9+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "ASP .Net Framework 4.8",
                ".Net Programming-VB .Net",
                "ANSI SQL",
                ".NET",
                "SQL Server",
                ".Net Core"
            ],
            "primary": [
                "Quartz Scheduler",
                "Oracle PLSQL",
                "API development REST",
                "API development SOAP",
                "React"
            ],
            "secondary": [
                "Technical development expertise in web-based applications",
                "Proficiency in writing unit tests",
                "Using testing frameworks such as Cucumber",
                "Selenium"
            ],
            "all": [
                "ASP .Net Framework 4.8",
                ".Net Programming-VB .Net",
                "ANSI SQL",
                ".NET",
                "SQL Server",
                ".Net Core",
                "Quartz Scheduler",
                "Oracle PLSQL",
                "API development REST",
                "API development SOAP",
                "React",
                "Technical development expertise in web-based applications",
                "Proficiency in writing unit tests",
                "Using testing frameworks such as Cucumber",
                "Selenium"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Boopathy Rajan",
        "email": "boopathy@smartitframe.com",
        "jd": "From: Boopathy, Smart IT Frame boopathy@smartitframe.com Reply to: boopathy@smartitframe.com HiGreetings from Smart IT Frame, Hope you are doing well!!! Smart IT Frame specializes in enabling you with your most critical line of resources. Whether it’s for permanent staffing, contract staffing, contract-to-hire or executive search, we understand the importance of delivering the most suitable talent; on time and within budget. With our Core focus in emerging technologies, we have provided global technology workforce solutions in North America, Canada & India. We take pride in delivering specialized talent, superior performance, and seamless execution to meet the challenging business needs of customers worldwide. Role: Sr. Tech LeadLocation: Chicago, IL(Hybrid)Experience: 9+Mode of Hiring – ContractShift timing: 9AM – 6PM Job Description:We are looking for a highly skilled computer programmer, with at least 8 years of experience and a maximum of 12 years, who is comfortable with both front and back-end programming as .Net Developers are responsible for developing and designing architecture ensuring the responsiveness of applications and working alongside graphic designers for web design features among other duties..Net Developer is required to see out a project from conception to final product requiring good organizational skills and attention to detail Responsibilities Developing front end website architecture Designing user interactions on web pages Developing back end website applications Creating servers and databases for functionality Ensuring responsiveness of applications Seeing through a project from conception to finished product Designing and developing APIs Meeting both technical and consumer needs Staying abreast of developments in web applications and programming languages.Skillset required• ASP .Net Framework 4.8, .Net Programming-VB .Net, ANSI SQL,.NET• Expertise in Net web-based application data and infrastructure architecture discipline• Experience working in Quartz Scheduler• Expertise in Oracle PLSQL and SQL Server• Must have hands-on experience in .NET frameworks 4.8 and NET Core• Must have hands-on experience in API development REST and SOAP• Preferred Skillset: React experience• Technical development expertise in web-based applicationsProficiency in writing unit tests and using testing frameworks such as Cucumber SeleniumMandatory Skills:1. ASP .Net Framework 4.8, Quartz Scheduler2. SQL Server3. .Net Core4. React --Thanks and RegardsBoopathy Rajan STalent Acquisition GroupEmail: boopathy@smartitframe.comSmart IT Frame LLC.",
        "source": "Email",
        "date_posted": "2024-10-21 11:57:43-05:00",
        "unique_id": "192b023b3f573015",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]