[
    {
        "company": "UST",
        "job_title": "Technical Delivery Manager",
        "location": "Bellevue, WA, USA",
        "full_location": {
            "city": "Bellevue",
            "state": "WA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Must have existing work authorization",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Delivery",
                "Stake Holder Management",
                "RFI",
                "RFP",
                "Risk Management",
                "Java/J2EE Development"
            ],
            "primary": [
                "Application Development",
                "DevOps",
                "Knowledge on Cloud"
            ],
            "secondary": [
                "Telco Domain Experience",
                "Agile Scrum",
                "AWS",
                "Azure",
                "API Gateways",
                "API Security products",
                "Enterprise Data Services"
            ],
            "all": [
                "Delivery",
                "Stake Holder Management",
                "RFI",
                "RFP",
                "Risk Management",
                "Java/J2EE Development",
                "Application Development",
                "DevOps",
                "Knowledge on Cloud",
                "Telco Domain Experience",
                "Agile Scrum",
                "AWS",
                "Azure",
                "API Gateways",
                "API Security products",
                "Enterprise Data Services"
            ]
        },
        "job_type": [
            "onsite",
            "hybrid"
        ],
        "contact_person": "Dharani K",
        "email": "dharani.k@vdartinc.com",
        "jd": "Hello, Hope you are doing well,Please find the job description below; if you are interested, kindly let me know. Title: Technical Delivery ManagerDuration: ContractLocation: Bellevue, WA 98006 (Hybrid)Client: USTLocals Required.Except OPT and H1T, All Work Authorization is WorkableWhile sharing the resume, Please do mention the candidate location and Work Authorization.Job Description :Mandatory AreasMust Have Skills –Delivery – 10+ Yrs of ExpStake Holder Management –10+ Yrs of ExpRFI, RFP –10+ Yrs of Exp –Risk Management –8+ Yrs of ExpJava/J2EE Development – 5+ Years Good To have Skills –Application Development – 5+ Yrs of Exp – DevOPS – Yrs of Exp – Knowledge on Cloud–8+ Yrs of Exp – Skill 4 – Yrs of Exp – Mandatory if Applicable Domain Experience (If any) – Telco Preferred Client is looking for a Technical Delivery Manager to be part of Telecommunications vertical, to manage the delivery of a US based Telco customer engagements. Client customer engagements includes Application development, DevOps, Operations across Internal facing applications (custom build and Third party), Wireless customer applications, Enterprise Data Services. The technology landscape involved are primarily on Java microservices, AWS and Azure Cloud services, Data services on Azure and Snowflake, API Gateways, API Security products, enterprise tools. Ideal candidate needs to have a good engineering mindset, understanding and strong command on these technology landscape to manage the delivery of these engagements working closely with the Client Agile Scrum team and with the customer on a daily basis. • Single Point of contact for customer for any Client Delivery related matters. • Point contact for the respective Client Project leads for any Delivery related suggestions, guidance • Ensure delivery excellence, technical thought leadership to the customer • Work with customer and Client Leads on a daily basis, reviewing the daily progress of the engagement, suggest course corrections, bring in innovative ideas, mitigate risks and issues. • Prepare customer status reports and present it on a weekly, monthly and quarterly basis. • Develop and track metrics/KPIs to detect the project health and trends and drive corrective measures • Should be able to articulate the business outcome delivered to the customer. • Monitor the delivery processes being followed in each of the engagement, take measures to address any gaps. • Identify revenue growth opportunities and responsible for the expansion of the assigned portfolios • Provide technical thought leadership, creative solutioning ideas for RFI, RFP response • Drive innovation, best practices • Collaborate with Client internal teams and ecosystem to bring in the necessary help for the development team and to address the customer needs. • Excellent communication skills and interpersonal skills • Establish strong connect with customer and be the trusted person Waiting for your response. Please share your available time so I can contact you directly by phone.",
        "source": "Email",
        "date_posted": "2024-10-21 12:55:31-05:00",
        "unique_id": "192b0589e0499427",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]