[
    {
        "company": "InsourceTechsolutions",
        "job_title": "Sr. Data Engineer",
        "location": "Denver, CO, USA",
        "full_location": {
            "city": "Denver",
            "state": "CO",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "2+ years",
            "degree_required": "BS or MS in Computer Science or similar relevant field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "relational SQL databases",
                "NoSQL databases",
                "AWS cloud services",
                "stream-processing systems",
                "data pipeline and workflow management tools"
            ],
            "primary": [
                "Postgres",
                "Cassandra",
                "in-memory processing",
                "Avro",
                "Parquet",
                "Json",
                "EC2",
                "MSK",
                "S3",
                "RDS",
                "SNS",
                "SQS",
                "Storm",
                "Spark-Structured-Streaming",
                "Kafka consumers",
                "Python",
                "Java",
                "Scala",
                "R",
                "SQL",
                "AWS Data Pipeline",
                "Apache Airflow",
                "Argo",
                "Hadoop",
                "Spark",
                "Kafka",
                "Github",
                "VSCode",
                "CI/CD"
            ],
            "secondary": [],
            "all": [
                "relational SQL databases",
                "NoSQL databases",
                "AWS cloud services",
                "stream-processing systems",
                "data pipeline and workflow management tools",
                "Postgres",
                "Cassandra",
                "in-memory processing",
                "Avro",
                "Parquet",
                "Json",
                "EC2",
                "MSK",
                "S3",
                "RDS",
                "SNS",
                "SQS",
                "Storm",
                "Spark-Structured-Streaming",
                "Kafka consumers",
                "Python",
                "Java",
                "Scala",
                "R",
                "SQL",
                "AWS Data Pipeline",
                "Apache Airflow",
                "Argo",
                "Hadoop",
                "Spark",
                "Kafka",
                "Github",
                "VSCode",
                "CI/CD"
            ],
            "with_experience": [
                "relational SQL databases",
                "NoSQL databases",
                "AWS cloud services",
                "stream-processing systems",
                "data pipeline and workflow management tools"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "venkat",
        "email": "venkatk@insourcetechsolutions.com",
        "jd": "From: venkat, InsourceTechsolutions venkatk@insourcetechsolutions.com Reply to: venkatk@insourcetechsolutions.com Job Title: Sr. Data EngineerLocation: Denver, CO (Day 1 onsite)Duration: 12+ MonthsJob Description:Looking for a highly technical, hands-on Data Engineer for Client's Data Lake Team that can independently lead data engineering projects and strive to proactively improve process efficiency, making recommendations for process and system improvements where applicable. The Data Engineer role will be responsible for not only understanding data pipelines but, event streaming applications, and how to build systems that handle massive amounts of data while making it consumable by other application teams, users and data scientists.You will also be assisting in the design and architecture of highly scalable, fault tolerant infrastructure capable of processing millions of operations per minute coming from millions of TVs, efficiently store petabytes of data and provide fast insights from the data. You will also be working with teams across the Client's enterprise to bring their data into our Big Data ecosystem, monitor data quality for cleanliness and fix discrepancies. Ensure data accuracy through validation tasks, perform root cause analysis and implement solutions for data prep and cleanliness, review data at all granular/aggregate levels, and versioning.About YouYou have a BS or MS in Computer Science or similar relevant fieldYou work well in a collaborative, team-based environmentYou are an experienced engineering with 2+ years of experienceYou have a passion for big data structuresYou possess strong organizational and analytical skills related to working with structured and unstructured data operationsYou have experience implementing and maintaining high performance / high availability data structuresYou are most comfortable operating within cloud based eco systemsYou enjoy leading projects and mentoring other team members Specific Skills:Experience or knowledge of relational SQL and NoSQL databases, including Postgres and Cassandra.Strong understanding of in-memory processing and data formats (Avro, Parquet, Json etc.)Experience or knowledge of AWS cloud services: EC2, MSK, S3, RDS, SNS, SQSExperience or knowledge of stream-processing systems: i.e., Storm, Spark-Structured-Streaming, Kafka consumers.Experience or knowledge of object-oriented/object function scripting languages: i.e., Python, Java, Scala, R, SQL.Experience or knowledge of data pipeline and workflow management tools: i.e., AWS Data Pipeline, Apache Airflow, Argo.Experience or knowledge of big data tools: i.e., Hadoop, Spark, Kafka.Experience or knowledge of software engineering tools/practices: i.e., Github, VSCode, CI/CDHands-on experience in designing and maintaining data schema life-cycles.",
        "source": "Email",
        "date_posted": "2024-10-21 06:59:52-05:00",
        "unique_id": "192af130397c5574",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]