[
    {
        "company": "Dimiour",
        "job_title": "Technical Project/Program Manager with modem testing",
        "location": "Mountain View, CA, USA",
        "full_location": {
            "city": "Mountain View",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Modem Testing",
                "Quality Assurance"
            ],
            "primary": [
                "Cross-Functional Collaboration",
                "Process Optimization"
            ],
            "secondary": [],
            "all": [
                "Project Management",
                "Modem Testing",
                "Quality Assurance",
                "Cross-Functional Collaboration",
                "Process Optimization"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Santhosh",
        "email": "santhosh.mohan@dimiour.io",
        "jd": "From: Santhosh, Dimiour santhosh.mohan@dimiour.io Reply to: santhosh.mohan@dimiour.io Role Title: Technical Project/Program Manager with modem testingHiring Mode: Contract (TP)Location: Mountain View, CA (On-Site) Responsibilities: Project Management:Lead and manage all phases of modem testing projects, from planning through execution and closure.Develop comprehensive project plans, timelines, and budgets that align with organizational goals.Track project progress and performance, implementing corrective actions as needed. Modem Testing & Quality Assurance:Oversee the entire modem testing lifecycle, ensuring adherence to industry standards and regulatory requirements.Collaborate with engineering teams to define testing strategies, including functional, performance, and interoperability testing.Analyze testing results, identify defects, and drive resolution to improve product quality and reliability. Cross-Functional Collaboration:Serve as the main point of contact for internal teams and external stakeholders, ensuring clear communication throughout the project lifecycle.Facilitate discussions between technical teams, product management, and vendors to ensure project alignment and success. Process Optimization:Identify and implement process improvements to enhance testing efficiency and project delivery.Stay updated on industry trends and best practices in modem technology and testing methodologies.",
        "source": "Email",
        "date_posted": "2024-10-21 09:15:00-05:00",
        "unique_id": "192afb374dfc0113",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]