[
    {
        "company": "ATVS",
        "job_title": "Core Banking Business Analyst",
        "location": "Coral Springs, FL, USA",
        "full_location": {
            "city": "Coral Springs",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "18 to 20 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Core Banking Systems",
                "Retail Banking Operations",
                "Requirements Gathering",
                "Documentation"
            ],
            "primary": [
                "Stakeholder Collaboration",
                "System Enhancements",
                "Testing & Validation",
                "Change Management",
                "Project Support"
            ],
            "secondary": [
                "Data Migration",
                "Digital Transformation",
                "Regulatory Compliance",
                "Agile Methodologies",
                "Communication Skills",
                "Analytical Skills",
                "Problem-Solving Skills",
                "Microsoft Excel",
                "Visio",
                "JIRA",
                "Confluence"
            ],
            "all": [
                "Business Analysis",
                "Core Banking Systems",
                "Retail Banking Operations",
                "Requirements Gathering",
                "Documentation",
                "Stakeholder Collaboration",
                "System Enhancements",
                "Testing & Validation",
                "Change Management",
                "Project Support",
                "Data Migration",
                "Digital Transformation",
                "Regulatory Compliance",
                "Agile Methodologies",
                "Communication Skills",
                "Analytical Skills",
                "Problem-Solving Skills",
                "Microsoft Excel",
                "Visio",
                "JIRA",
                "Confluence"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Jaffar",
        "email": "shaik.jaffar@atvsllc.com",
        "jd": "From: Jaffar, ATVS shaik.jaffar@atvsllc.com Reply to: shaik.jaffar@atvsllc.com Title: Core Banking Business AnalystLocation: Coral Springs, FL (5 Days Onsite) Job Description:The Core Banking Business Analyst will be responsible for analyzing and documenting business requirements for the development, enhancement, and support of core banking systems. This role involves working closely with stakeholders from various departments, understanding their needs, and translating them into technical requirements that align with the core banking platform. The ideal candidate will have strong knowledge of Retail banking operations, core banking systems, and experience in business analysis within the financial services industry. Experience:18 to 20 years of experience in business analysis, with at least 8+ years working in the banking or financial services industry.Proven work experience in Core banking Transformation/Migration and Upgrade projectsProven work experience in Analysis of Legacy core banking systems and mapping Legacy products with new age core banking systemsSolid experience with any of the core banking platforms such as Temenos, Finacle, FIS Products or Oracle FLEXCUBE.Knowledge of banking operations and processes, including retail banking, lending, payments, and customer onboarding.Familiarity with project management methodologies (Agile, Scrum, Waterfall). Technical Expertise:Strong understanding of business analysis frameworks and best practices.Ability to create detailed business and functional documentation.Proficiency in tools such as Microsoft Excel, Visio, JIRA, and Confluence. Soft Skills:Excellent communication and interpersonal skills, with the ability to interact with stakeholders at all levels.Strong analytical and problem-solving abilities.Ability to work independently and manage multiple priorities in a fast-paced environment.High attention to detail and organizational skills. Preferred Skills:Experience with data migration projects and digital transformation initiatives.Knowledge of regulatory compliance in banking, such as PCI-DSS, KYC, and AML.Certification in business analysis (CBAP, PMI-PBA) or Agile methodologies (Scrum Master, Product Owner) is a plus.This role is ideal for a detail-oriented, analytically minded professional who enjoys bridging the gap between business needs and technical solutions in the banking industry. Key Responsibilities:Requirements Gathering: Work with business stakeholders, end-users, and IT teams to gather, analyze, and document business requirements for core banking projects.Business Process Analysis: Analyze current banking processes, workflows, and systems to identify opportunities for optimization, improvement, and automation.Documentation: Create comprehensive business requirement documents (BRD), functional specifications, and use cases for core banking features, enhancements, and integrations.Stakeholder Collaboration: Act as a liaison between business users, development teams, and external vendors to ensure alignment between business needs and technical solutions.System Enhancements: Work with technical teams to design, test, and implement system enhancements, ensuring they meet business objectives and regulatory requirements.Testing & Validation: Collaborate with quality assurance (QA) teams to develop test plans, support user acceptance testing (UAT), and ensure that delivered solutions meet the defined requirements.Change Management: Assist in managing changes to core banking systems, including impact analysis, risk assessment, and communication of changes to relevant stakeholders.Project Support: Provide support to project managers in defining project scope, timelines, and deliverables. Track and monitor progress against business requirements.Reporting & Analytics: Assist in generating reports, dashboards, and analysis to support business decision-making and monitor the performance of core banking systems.Compliance & Risk Management: Ensure that business processes and system changes comply with regulatory requirements and risk management protocols, including banking standards (e.g., PCI-DSS, GDPR).",
        "source": "Email",
        "date_posted": "2024-10-21 14:36:41-05:00",
        "unique_id": "192b0b57f2fe9e66",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]