[
    {
        "company": "IDC Technologies",
        "job_title": "Sr. Java Developer",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "12+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Spring MVC",
                "Hibernate",
                "SQL",
                "RESTful Web Services"
            ],
            "primary": [
                "JQuery",
                "HTML5",
                "JavaScript",
                "XML",
                "Angular",
                "Apache Struts",
                "GIT",
                "Maven",
                "Apache Tomcat",
                "Spring Boot"
            ],
            "secondary": [
                "Apache Kafka",
                "Apache Spark",
                "ActiveMQ",
                "Oracle",
                "SQL Server",
                "CI/CD pipelines",
                "Business Objects",
                "Oracle Discoverer",
                "Electronic Health Records",
                "HL7 solutions",
                "5010 EDI X12 healthcare claims processing"
            ],
            "all": [
                "Java",
                "Spring MVC",
                "Hibernate",
                "SQL",
                "RESTful Web Services",
                "JQuery",
                "HTML5",
                "JavaScript",
                "XML",
                "Angular",
                "Apache Struts",
                "GIT",
                "Maven",
                "Apache Tomcat",
                "Spring Boot",
                "Apache Kafka",
                "Apache Spark",
                "ActiveMQ",
                "Oracle",
                "SQL Server",
                "CI/CD pipelines",
                "Business Objects",
                "Oracle Discoverer",
                "Electronic Health Records",
                "HL7 solutions",
                "5010 EDI X12 healthcare claims processing"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "John Joseph",
        "email": "john.joseph@idctechnologies.com",
        "jd": "From: John Joseph, IDC Technologies john.joseph@idctechnologies.com Reply to: john.joseph@idctechnologies.com HI, Hope you are doing well. We have an urgent opening for the below role with Contract position for our clients, kindly Check the below job description and let me know your interest. Position – Sr. Java DeveloperLocation – Lansing, MI, 48933-Hybrid\"Position Summary(Detail Position Summary in Bullet Point or Descriptive Statement)\" \"• Write well-designed, testable code using spring MVC, Hibernate framework for entity object mapping, JQuery/HTML5, JavaScript, HTML, XML, Angular• Develop business application components using Object Oriented java/JEE technologies, design principles .• Design and develop RESTful Web Services using Spring Web MVC framework.• Design, Develop and maintain applications using Apache Struts framework.• Ability to implement design patterns like Intercepting Filter, Front Controller, Session Façade, DAO, Singleton, and Service Locator• Execute full software development life cycle (SDLC) including experience in gathering requirements and writing functional/technical specifications for complex projects.• Excellent knowledge in designing both logical and physical database model• Develop database objects including stored procedures, functions,• Troubleshoots issues using SQL, PL/SQL scripts• Experience tuning SQL queries and scripts• Hands on experience Integrating software components into a fully functional software system• Extensive knowledge on source control tools such as GIT• Experience on Build Frameworks like Maven, maintain source code using source control, and baseline software versions and build war files for deployments• Experience developing with application servers Apache Tomcat, JBOSS, Web Sphere, Openshift Container• Develop software design documents and work with stakeholders for review and approval.• Experience developing, prototypes, mockup for users review and approval.• Exposure to flowcharts, screen layouts and documentation to ensure logical flow of the system requirements• Experience working on large agile projects.• Experience with Java 8, SOAP Web-Services and Java Messaging Service (JMS) API.• Experience with Spring Boot Projects, Spring Data, Spring Batch, Spring Security frameworks.• Good to have knowledge of Apache Kafka, Apache Spark and ActiveMQ broker.• Experience in Database Design in Oracle and SQL server.• Experience or Knowledge on creating CI/CD pipelines using Azure Devops• Design, develop and maintain BI reporting solutions using Business Objects and Oracle Discoverer.• Extensive experience in Oracle database logical and physical design.• Develop PL/SQL Procedures, Functions, Packages and Job Scheduling.• Experience in Electronic Health Records(EHR) HL7 solutions.• Experience in 5010 EDI X12 healthcare claims processing solutions.• Experience in SIGMA payment processing type solutions.\" \"Skill Descriptions(8-10 or more Required/Desired/Nice to Have skills in Bullet Points identified by their ranking)\"\"• 12+ years developing complex computer systems using Java.• 12+ years developing complex computer systems using java IDEs such as Eclipse, STS• 12+ years programming in SQL and/or PL/SQL.• 8+ years programming using Java JEE Struts Framework• 8+ years programming using Java JEE Spring/SpringBoot Framework 3.0.• 8+ years of development using Hibernate/JPA framework.• 5+ years experience with AWS, Databricks, and Elastic search.• 5+ years in project development using Angular/React JS, JavaScript framework.• 5+ years programming in the JBOSS Enterprise SOA environment including JBOSS Workflow .• 5+ years using CMM/CMMI Level 3 methods and practices.• 5+ years implemented agile development processes including test driven development.• 3+ years Experience or Knowledge on creating CI/CD pipelines using Azure Devops- Nice to have",
        "source": "Email",
        "date_posted": "2024-10-21 12:38:23-05:00",
        "unique_id": "192b048ef60973c0",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]