[
    {
        "company": "VBeyond Corporation",
        "job_title": "Salesforce Business Analyst",
        "location": "Franklin, TN, USA",
        "full_location": {
            "city": "Franklin",
            "state": "TN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "8-10 years",
            "degree_required": "Bachelor's degree in business or information systems preferred",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Salesforce",
                "Business Analysis"
            ],
            "primary": [
                "Excellent verbal and written communication skills",
                "Excellent interpersonal skills",
                "Strong customer focus",
                "Strong business acumen",
                "Knowledge of business processes and CRM best practices"
            ],
            "secondary": [
                "Salesforce.com administrator certification",
                "Operational experience with Salesforce.com"
            ],
            "all": [
                "Salesforce",
                "Business Analysis",
                "Excellent verbal and written communication skills",
                "Excellent interpersonal skills",
                "Strong customer focus",
                "Strong business acumen",
                "Knowledge of business processes and CRM best practices",
                "Salesforce.com administrator certification",
                "Operational experience with Salesforce.com"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Shanmuga Priya S.",
        "email": "shanmugapriyas@vbeyond.com",
        "jd": "Greetings from VBEYOND,I hope you are doing well. I am Shanmuga Priya S. from VBeyond Corp. We are a global recruitment company with a specialization in the hiring of IT professionals. One of our clients is looking for an Salesforce Business Analyst | Franklin – Tennessee | Onsite . You feel this requirement is not suitable for you, kindly share the same with your circle or reply REMOVE. Role : Salesforce Business AnalystLocation : Franklin – Tennessee Mode: OnsiteContract Job Description:Excellent verbal and written communication skills requiredExcellent interpersonal skills with a demonstrated ability to work in a cross functional team environment requiredStrong customer focus ability to probe customer needs and translate customer requirements into system specifications required8-10 years of business analyst experience requiredStrong business acumen superb knowledge of business processes and CRM best practice required1 years of strong operational experience with SalesForcecom preferredSalesforcecom administrator certification a strong plusBachelors degree in business or information systems preferred ResponsibilitiesManage the collection and implementation of business process requirements for SalesForcecomWork in a cross functional environment with various business groups IT and end users to identify document and communicate business processesCreate Requirements for maintaining and enhancing visual layouts workflow rules and business logic layer to streamline and enhance business processes and improve user experienceWork with the development teams to implement and integrate thirdparty products applications on the forcecom platformWork with IT and Salesforcecom and other 3rd party vendors to maintain smooth operation and performance of the platformCoordinate and lead user acceptance tests with the business units and end users against business requirementsMaintain key system metrics to track trends in usage adoption and data integrityTrain end users prepare related documentation requirements training materials process and data flows use cases functional design etc participate in crossfunctional teams communicate key messages or address critical questions from the user base involving the CRMPerform system administrator function of the Salesforcecom CRM application Responsible for maintaining functional areas of contacts relationship accounts opportunities dashboards and reportsCreate and execute queries and reports maintain user roles security and profiles SkillsSalesforce-business/Functional Analysis Thanks and RegardsShanmuga Priya SVBeyond Corporation || PARTNERING FOR GROWTH Hillsborough, New Jersey, USAEmail ID : Shanmugapriyas@vbeyond.comContact : (908)589-4031Website: www.vbeyond.com",
        "source": "Email",
        "date_posted": "2024-10-21 13:55:38-05:00",
        "unique_id": "192b0900c9298441",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]