[
    {
        "company": "Source Infotech Inc",
        "job_title": "Systems Analyst-4",
        "location": "Bangor, ME, USA",
        "full_location": {
            "city": "Bangor",
            "state": "ME",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ months contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Gathering Requirements",
                "Writing User Stories",
                "UAT Testing",
                "Communication with technical and non-technical staff",
                "Knowledge of MS Power Platform"
            ],
            "primary": [
                "Analyzes user requirements",
                "Automates processing",
                "Improves existing computer systems",
                "Technical assistance and support",
                "Design and development of computer applications"
            ],
            "secondary": [
                "Cost/benefit analysis",
                "Prepares charts, diagrams, tables, and flowcharts",
                "Formulating logical descriptions of problems",
                "Creativity and initiative"
            ],
            "all": [
                "Gathering Requirements",
                "Writing User Stories",
                "UAT Testing",
                "Communication with technical and non-technical staff",
                "Knowledge of MS Power Platform",
                "Analyzes user requirements",
                "Automates processing",
                "Improves existing computer systems",
                "Technical assistance and support",
                "Design and development of computer applications",
                "Cost/benefit analysis",
                "Prepares charts, diagrams, tables, and flowcharts",
                "Formulating logical descriptions of problems",
                "Creativity and initiative"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Abhisek Kumar",
        "email": "abhisek.k@sourceinfotech.com",
        "jd": "From: abhisek, source infotech inc abhisek.k@sourceinfotech.com Reply to: abhisek.k@sourceinfotech.com Title: Systems Analyst-4Location: Bangor or Freeport, Maine (Hybrid Onsite)(Locals only)Duration: 6+ months contractIV: Phone and VideoVisa: No H1b/CPT Notes:Top 3 Skills:Gathering Requirements and Writing User StoriesUAT Testing and good Communication with technical and non-technical staffKnowledge of MS Power Platform Client is having a new Microsoft Power Platform system built for them. They are looking for someone who can assist identifying and documenting user requirements, map out processes/ workflows, assist with user acceptance testing and be the conduit for communication between client's business and Vendor technical staff. Top 3 Skills: Gathering Requirements and Writing User StoriesUAT Testing and good Communication with technical and non-technical staffKnowledge of MS Power Platform Required Skills: Understands business objectives and problems, identifies alternative solutions, performs studies and cost/benefit analysis of alternatives.Analyzes user requirements, procedures, and problems to automate processing or to improve existing computer system: Confers with personnel of organizational units involved to analyze current operational procedures, identify problems, and learn specific input and output requirements, such as forms of data input, how data is to be summarized, and formats for reports. Writes detailed description of user needs, program functions, and steps required to develop or modify computer program. Reviews computer system capabilities, specifications, and scheduling limitations to determine if requested program or program change is possible within existing system.Provides technical assistance and support for applications and hardware problems and for information sharing with external entities in a customer service environment. Determines operational, technical, and support requirements for the location, installation, operation, and maintenance of various office equipment and systems. Prepares charts, diagrams, tables, and flowcharts. Details input and output record formats for computer programs.Assists in formulating logical descriptions of problems and devising optimum solutions. Assists in the design, development, and maintenance of various computer applications. May provide support and make recommendations for information technology systems processes associated with software technology planning, development, implementation, system security, and interfaces.Familiar with standard concepts, practices, and procedures within a particular field. Relies on limited experience and judgment to plan and accomplish goals. A certain degree of creativity and latitude is required. Works under limited supervision with considerable latitude for the use of initiative and independent judgmentRelies on experience and judgment to plan and accomplish goals, independently performs a variety of complicated tasks, a wide degree of creativity and latitude is expectedThanks & RegardsAbhisek kumarSource Infotech IncP.O Box 577, EDISON, NJ 08818-0577Email: abhisek.k@sourceinfotech.comPhone: 609-934-3412 | | Hangout: abhishekchoudhary0948",
        "source": "Email",
        "date_posted": "2024-10-21 13:00:43-05:00",
        "unique_id": "192b05d6061c3e3d",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]