[
    {
        "company": "Source Infotech",
        "job_title": "Senior Program Manager",
        "location": "New York City, NY, USA",
        "full_location": {
            "city": "New York City",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Bachelor’s degree in a technical field or equivalent professional experience",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Agile Methodologies",
                "SCRUM",
                "Project Management",
                "Software Development Life Cycle",
                "Communication Skills"
            ],
            "primary": [
                "Problem-solving",
                "Analytical Skills",
                "Planning Skills",
                "Organizational Skills",
                "Interpersonal Skills"
            ],
            "secondary": [
                "CSM Certification",
                "SSM Certification",
                "PSM Certification",
                "SASM Certification",
                "CSP Certification",
                "SPS Certification"
            ],
            "all": [
                "Agile Methodologies",
                "SCRUM",
                "Project Management",
                "Software Development Life Cycle",
                "Communication Skills",
                "Problem-solving",
                "Analytical Skills",
                "Planning Skills",
                "Organizational Skills",
                "Interpersonal Skills",
                "CSM Certification",
                "SSM Certification",
                "PSM Certification",
                "SASM Certification",
                "CSP Certification",
                "SPS Certification"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Khushank Chauhan",
        "email": "khushank@sourceinfotech.com",
        "jd": "From: KhushankChauhan, Source Infotech khushank@sourceinfotech.com Reply to: khushank@sourceinfotech.com Senior Program ManagerExperience leading Enterprise Retail/e-commerce – Online shopping experience projects. Candidates need to be coming out of Large Retail Enterprises and have experience with Online Shopping Cart experience (Think Amazon) and improving the customers experience including Loyalty rewards and Fast Check Out. **Candidates must have Long Projects/Good Tenure, Excellent communication skills and a State issued ID (Not Bills) showing they are Local. **** CANDIDATES MUST HAVE RETAIL/ECOMMERCE EXPERIENCE WITH SHOPPING CARTS. Required Location: Hybrid/Midtown New York City Once a Quarter. Candidates can be within a 2 hour commute.Contract status: C-C preferred Candidate Visa’s Accepted: No Opt CPT H1BExp 10+Candidates must be LOCAL to the NEW YORK or NEW JERSEY area and COMMUTE into the office Once a Quarter. NO RELOCATION CONSIDERED. *** Please send candidates even if they are over the target rate. The Client is flexible.Job Description:Key Responsibilities:• Promote empowerment of the team, ensure that each team member is fully engaged and making a meaningful contribution, and encourage a sustainable pace with high-levels of quality for the team• Manage risks and issues; correct deviations from plans; and perform delivery planning for assigned initiatives• Support the Product Owner in managing customer expectations for project deliverables, managing stakeholder communications, and helping to implement an effective system of governance• Establish cadence and facilitate team ceremonies• Assist in team development while holding teams accountable for their commitments and removing roadblocks to their work• Leveraging organizational resources to improve capacity for initiatives• Mentoring and developing team members• Be a voice of reason and authority, while enabling the team to self-organize and innovate• Actively participates in product planning sessions, risk management processes and change management/communication• Track and report on team and project KPIs - Velocity, Burndown, Cycle time, Lead time, capacity, SPI, EV, rate of change requests, errors etc.• Partners with shared service teams such as EDS, EID• Ensure that all representatives have an environment conducive to openly and honestly sharing information for Team success• Communicate clearly, professionally, and regularly with clients, partners and vendorsNeeded Skills:• Problem-solving approach with the ability to focus on details while maintaining the “big picture” view• Solid understanding of software development life cycle models as well as expert knowledge of both Agile and traditional project management principles• Prior experience with SCRUM/Agile methodologies with enterprise-level application development initiatives• Experience managing and delivering large, complex initiatives in a high-tech development environment with multi-function teams• Experience overseeing multi-function project teams with at least 10-15 team members• Ability to lead software development initiatives and ensure objectives, goals, and commitments are met• Strong analytical, planning, and organizational skills with an ability to manage competing demands• Effective communication skills• Sufficient level of technical background to provide highly-credible leadership to development teams• Energetic, enthusiastic and a proven ability to work and lead in a team based environment• Be able to accurately and objectively evaluate complex project risks and issues• Effective interpersonal skills including mentoring, coaching, collaborating, and team buildingQualifications:• Experience with Agile Methodologies• CSM, SSM or PSM certification required• SASM, CSP, SPS or other advanced certification preferred• Bachelor’s degree in a technical field or equivalent professional experience• Prior experience in software development as an analyst, tester, developer, or project manager",
        "source": "Email",
        "date_posted": "2024-10-21 09:03:25-05:00",
        "unique_id": "192af87d7f40318e",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]