[
    {
        "company": "Millennium Infotech",
        "job_title": ".NET Developer",
        "location": "Princeton, NJ, USA",
        "full_location": {
            "city": "Princeton",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "10 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "C#",
                "ASP.NET MVC",
                ".Net Core",
                "JavaScript",
                "jQuery",
                "SQL Server"
            ],
            "primary": [
                "LINQ-to-objects",
                "LINQ-to-entity",
                "Entity Framework core",
                "Agile methodologies"
            ],
            "secondary": [
                "Creating technical documentation",
                "Razor pages",
                "CSS",
                "Bootstrap",
                "Restful API",
                "Crystal Reports"
            ],
            "all": [
                "C#",
                "ASP.NET MVC",
                ".Net Core",
                "JavaScript",
                "jQuery",
                "SQL Server",
                "LINQ-to-objects",
                "LINQ-to-entity",
                "Entity Framework core",
                "Agile methodologies",
                "Creating technical documentation",
                "Razor pages",
                "CSS",
                "Bootstrap",
                "Restful API",
                "Crystal Reports"
            ],
            "with_experience": [
                "C# (10 years)",
                "ASP.NET MVC (10 years)",
                ".Net Core (10 years)",
                "JavaScript (5 years)",
                "jQuery (5 years)",
                "SQL Server (5 years)",
                "LINQ-to-objects (3 years)",
                "LINQ-to-entity (3 years)",
                "Entity Framework core (3 years)",
                "Agile methodologies (3 years)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "bala",
        "email": "bala@mitiweb.com",
        "jd": "From: bala, Millennium Infotech bala@mitiweb.com Reply to: bala@mitiweb.com Hi Professional,Hope you are doing well.Kindly please find the below job description for .NET Full Stack Developer.Location: Princeton, NJ (Local Candidates Only) Job Description & Responsibilities:Must have extensive experience working as Full stack .Net MVC/.Net Core/ jQuery / SQL Server in a fast-paced environment.Work with application end-users to determine and document functional requirements for application software and translates those requirements into use cases in Azure DevOps Boards.Performs comprehensive technical analysis of development and programming solutions for all ABC applications. Independently Code and Unit Test the complex modules according to IT industry best practices.Ensure each module satisfies the requirements of the software at the conclusion of integration testing. Performs quality review of all developer work for completeness, accuracy and fulfillment of requirements.Works with management to provide ongoing updates and challenges and effectively communicates (verbal, written) with colleagues, end-users.Recent and extensive experience with production support work. Expertise in ‘Manually’ debugging of web based .Net MVC and .Net Core applications that are in production and going into production.Experience performing maintenance and enhancements of existing applications built in .Net MVC, .Net Core, jQuery and SQL ServerStrong SQL experience in writing complex queries to pull data to meet end-user needs.Fast learning ability to learn and understand the current applications and databases to provide data reports for production support.Demonstrated expertise in all the required qualification skill set below. Required /Desired Skills SkillRequired /DesiredAmountof ExperienceGeneral application development using any language(s)Required10Years Highly skilled senior C#, ASP.NET MVC, .Net Core developerRequired10YearsJavaScript, JQueryRequired5Years SQL ServerRequired5YearsDesign and develop web software solutions using agile methodologies and techniquesRequired3Years Proficiency of LINQ-to-objects and LINQ-to-entityRequired3YearsEntity Framework coreRequired3Years Creating technical documentationHighly desired3YearsExperience with Razor pagesHighly desired2Years CSS, BootstrapHighly desired2YearsRestful API experienceHighly desired2Years Crystal Reports and/or any reporting services on SQL Server databaseHighly desired2Years",
        "source": "Email",
        "date_posted": "2024-10-21 04:50:40-05:00",
        "unique_id": "192ae9cbd00fbbb1",
        "emp_type": [
            "third party"
        ],
        "tag": ".net developer"
    }
]