[
    {
        "company": "Metasis",
        "job_title": "Lead Automation Tester",
        "location": "Issaquah, WA, USA",
        "full_location": {
            "city": "Issaquah",
            "state": "WA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "8+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "QA Automation",
                "API Testing",
                "C#",
                ".Net",
                "Soap",
                "Rest",
                "XML"
            ],
            "primary": [
                "Selenium WebDriver",
                "Java",
                "TestNG",
                "JUnit",
                "Cucumber"
            ],
            "secondary": [
                "Agile testing methodologies",
                "Communication skills",
                "Collaboration skills",
                "Analytical skills",
                "Problem-solving skills"
            ],
            "all": [
                "QA Automation",
                "API Testing",
                "C#",
                ".Net",
                "Soap",
                "Rest",
                "XML",
                "Selenium WebDriver",
                "Java",
                "TestNG",
                "JUnit",
                "Cucumber",
                "Agile testing methodologies",
                "Communication skills",
                "Collaboration skills",
                "Analytical skills",
                "Problem-solving skills"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Lokesh Kumar",
        "email": "lokeshk@sparinfosys.com",
        "jd": "Hello,Greetings for the day.Please go through the requirement and share me some suitable resume with contact details. Email is the best way to reach me. I may missed your call (due to high volume of call flow). Role: Lead Automation Tester with C#, .Net expLocation: Issaquah, WA (Onsite from Day1)Duration: Long Term Must Have Skills – QA AutomationSkill 1 – 8+ Years of Exp in QA AutomationSkill 2 – 6+ Years of Exp in API TestingSkill 3 – 6+Years of Exp in C#, .Net in the test automation Process.Skill 4 – 5+ Year of Exp in Soap, Rest, XML Concepts. Client is looking for a talented, experienced, and creative Quality Automation Engineer. The QA Engineer will be working with one of the leading Wholesale retailers in the US. The ideal candidate should have the ability to work creatively and analytically in a problem-solving environment. The ideal candidate must possess excellent written and verbal communication skills with the ability and know-how to collaborate effectively with domain experts and the IT leadership team. Responsibilities: • Defines the testing strategy and approach to validate new or enhanced functionality implemented by teams. • Collaborates with team members to decompose functional and non-functional requirements into test scripts and scenarios. • Determines test dependencies including QA test environment, QA tools, training, build and deployment plans, intra-team dependencies, and communication processes. • Creates and executes manual and automated test scripts to validate the acceptance criteria defined within the epics and user stories implemented by team members. • Develops manual test cases for all functional and non-functional requirements and collaborates with development team members to identify candidates for test case automation. • Identifies risks impacting the timely delivery of a given product and collaborates with team members to prepare mitigation strategies. • Executes smoke, functional, integration, and non-functional test scripts as part of the product/application delivery lifecycle. • Creates defects with detailed information pertaining to the failed test case/scenario with supporting documentation (screenshots, environment details, log files, etc.). • Collaborates with team members to identify existing manual and automated test scripts that will be impacted through the development of new features and capabilities. • Manages the remediation of defects raised throughout the development lifecycle and creates supporting quality reports that are shared with stakeholders. • Collaborates with product team members (e.g., Product Owners, System Analysts) to define the automating testing approach / strategy for a given product / application. • Creates test data to support the execution of functional and non-functional testing activities. • Develops and executes automated test scripts to accelerate team velocity through the reduction of manual testing efforts. • Maintains the automated testing suite and accompanying framework for a given product. • Collaborates with team members (e.g., DevOps Engineers, Systems Architects) to incorporate new automated test scripts into the continuous integration pipeline. • Develops functional test plans for complex systems. • Designs and develops high quality test automation, from which others can create repeatable automated tests. • Generates API Level Automation using various technologies and tools. Requirements: Must-Have • 4+ years of current and demonstrable experience as an SDET in API/UI • 4+ years of experience in Selenium WebDriver, Java, and other programming languages • Knowledge of automated testing tools like TestNG, JUnit, and Cucumber • 4+ years of automation and testing experience with XML and web-based SOAP/RESTful services. • 4+ years of current design and development experience in Java or C#. • Proficient with Agile testing methodologies and best practices in an SDET role. • Excellent communication, collaboration, reporting, analytical, and problem-solving skills. • Must have proven ability to follow priorities and timelines.",
        "source": "Email",
        "date_posted": "2024-10-21 09:05:41-05:00",
        "unique_id": "192af896c0e105a0",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]