[
    {
        "company": "Stellar IT Solutions",
        "job_title": "Sr. Data Engineer",
        "location": "Durham, NC, USA",
        "full_location": {
            "city": "Durham",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "10 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle",
                "PL/SQL",
                "SQL",
                "data migrations",
                "data cleansing"
            ],
            "primary": [
                "DB2",
                "ETL processes",
                "Salesforce",
                "Talend",
                "GIT",
                "Jira",
                "Java",
                "Python",
                "cloud platforms",
                "AWS",
                "Azure",
                "Azure Synapse",
                "Azure Databricks",
                "Cloud Computing",
                "Power BI"
            ],
            "secondary": [],
            "all": [
                "Oracle",
                "PL/SQL",
                "SQL",
                "data migrations",
                "data cleansing",
                "DB2",
                "ETL processes",
                "Salesforce",
                "Talend",
                "GIT",
                "Jira",
                "Java",
                "Python",
                "cloud platforms",
                "AWS",
                "Azure",
                "Azure Synapse",
                "Azure Databricks",
                "Cloud Computing",
                "Power BI"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Arpitha S",
        "email": "arpithas@stellarit.com",
        "jd": "From: Arpitha S, Stellar IT Solutions arpithas@stellarit.com Reply to: arpithas@stellarit.com Sr. Data Engineer- Hybrid, Durham, NC (Locals only)Position: NC FAST Data EngineerLocation: Research Triangle Park, Durham NC 27709 HybridDuration: 10 MonthsShort Description:DHHS-ITD requires the services of Specialists in the roles of Data Engineers that will analyze, map, build, test, and maintain database pipeline architectures using Oracle and DB2 for Child Welfare Data Conversion efforts.Skills: SkillRequired / DesiredAmount of ExperienceConsultant’s ExperienceExperience with OracleRequired10YearsExperience with PL/SQLRequired5YearsExperience with SQLRequired7YearsExperience with data migrations from legacy systemsRequired5YearsExperience with data cleansingRequired1YearsExperience with DB2Highly desired1YearsExperience with ETL processes involving SalesforceHighly desired1YearsExperience with TalendHighly desired1YearsExperience with GITHighly desired1YearsExperience with JiraHighly desired1YearsExperience with JavaHighly desired5YearsExperience with PythonHighly desired3YearsExperience with cloud platforms (e.g. AWS and Azure) and associated services for data processing and storageHighly desired1YearsExperience with Azure SynapseHighly desired2YearsExperience with Azure DatabricksNice to have1YearsExperience with Cloud ComputingNice to have1YearsExperience with Power BINice to have1Years Question 1: Please list all Professional Certifications and the year they were received. The certifications will be validated. Question 2: Please provide a brief description of recent professional development work in a data conversion effort. Regards, Arpitha STechnical Recruiter Email: arpithas@stellarit.comRockville, MD | McLean, VA | Palo Alto, CAStellarIT.com | StellariDeaLabs.com",
        "source": "Email",
        "date_posted": "2024-10-21 15:31:06-05:00",
        "unique_id": "192b12d5a37d7ccc",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]