[
    {
        "company": "VSB Tech",
        "job_title": "Senior Business Analyst",
        "location": "Montgomery, AL, USA",
        "full_location": {
            "city": "Montgomery",
            "state": "AL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "7 years",
            "degree_required": "Bachelor’s Degree in Computer Science, Information Systems, Business Administration, or other related field. Or equivalent work experience.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "11/18/2024 - 09/30/2025",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Contract Monitoring",
                "Project Management",
                "Stakeholder Management",
                "Requirements Gathering"
            ],
            "primary": [
                "Interpersonal Skills",
                "Analytical Skills",
                "Problem Solving",
                "Data Analysis",
                "Business Process Modelling"
            ],
            "secondary": [
                "Communication Skills",
                "Research Skills",
                "Team Collaboration",
                "Time Management",
                "Technical Writing"
            ],
            "all": [
                "Business Analysis",
                "Contract Monitoring",
                "Project Management",
                "Stakeholder Management",
                "Requirements Gathering",
                "Interpersonal Skills",
                "Analytical Skills",
                "Problem Solving",
                "Data Analysis",
                "Business Process Modelling",
                "Communication Skills",
                "Research Skills",
                "Team Collaboration",
                "Time Management",
                "Technical Writing"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Mounika",
        "email": "mounika@vsbtech.com",
        "jd": "Hello,Visa : Independent visasNeed Locals Title: Senior Business AnalystRequisition ID: 892Duration: 11/18/2024 - 09/30/2025 ( Funded for Fiscal year and may go longer)Worksite Address: 501 Dexter Ave, Montgomery, AL, 36104 - OnsiteRequired Details: Please fill this below details & share me your updated resumeFull Legal Name:Passport Number:DOB(MM/DD):Employer Details:Position DescriptionThe Alabama Medicaid Agency (AMA) is preparing for a major transition from a monolithic system with 14 different business functions to an interoperable, modular system based on a Service Oriented Architecture (SOA). This multi-year “Modularity” project will include working with multiple vendors and may include multiple project methodologies. The project must comply with the Federal standards and regulations such as: Medicaid Information Technology Architecture (MITA), CMS Seven Conditions and Standards, Outcomes- Based Certification (OBC), 21st Century Cures Act (Cures Act), Health Information Technology for Economic and Clinical Health act (HITECH act). There are two vendors already in the program and there are three more contracts being actively worked on. The first Vendor to join the project was the Program Management Office (PMO) vendor who is responsible for managing the project, defining the AMA enterprise architecture, defining requirements, and leading the organizational change management effort. The AMA is moving away from custom software development to procuring software that is configured to meet the business needs. This will require the Business Analyst to be very comfortable understanding the contract, the business, and the requirements. To support this effort, the AMA is seeking an experienced Business Analyst to be a member of the Medicaid Enterprise Systems (MES) team. The Business Analyst will be working collaboratively with a team of dynamic individuals working in a fast-paced environment. The Business Analyst will be responsible for reviewing and approving artifacts related to the program, project, or software. The Business Analyst must also understand the contract and be able to verify the contract requirements are met. The Business Analyst will be working directly with the business areas to support them and ensure their understanding of the vendor proposed solutions. This position will work closely with the business areas, vendors, and Project Management Office (PMO) vendor. This position is 100% on site. The employee is expected to work at the Central Medicaid facility in Montgomery AL.Skills RequiredUnderstand contract monitoring for development, configuration, and operational activities • Review and follow the processes and procedures defined to support a program with multiple vendors. • Work with multiple vendors and multiple in-person or virtual teams. • Review program, project or software artifacts developed by multiple vendors and comment or approve • Interact professionally with a diverse group of executives, managers, and subject matter experts. • Perform standard project functions such as creating documents or presentations, schedule meetings, produce meeting minutes, disburse reports, track artifacts, issues, and action items, etc. • Provide business and requirements oversight • Understand all phases of a project management and software development life cycle. • Support multiple software development methodologies or software configuration activities • Assist with CMS reporting and certification process • Maintain project assets, communications, and track items to completion. • Identify and report on abnormalities or variances • Excellent and effective stakeholder management skills - comfortable speaking and discussing requirements and scope with users and senior stakeholders. • Excellent written and verbal communications and presentation skills. • A team player with strong interpersonal skills to build team rapport • Excellent research capabilities • Ability to multitask in an environment that has multiple conflicting priorities • Strong analytical, problem solving, data and business process analysis and design skills. • Ability to adapt and work in a fast- paced and dynamic group environment. • Ability to manage complexity well and demonstrated experience managing across functions to accomplish large scale goals. • Understand all phases of a project management and software development life cycle. Have knowledge of multiple project management methodologies. • A result-driven, independent thinker and initiative individual that is detail oriented, meticulous, and able to handle loads of information. • Ability to work independently with minimal direction from State or other team members. • Experience using and working with virtual and in house team memberSkills PreferredStrong interpersonal skills to build team rapport • Excellent verbal and written communication skills • Ability to work independently with minimal direction from State or other team members. • Ability to work under pressure / to a deadline. • Strong analytical and critical thinking skills. • Exceptional research and reporting skills.Experience Required7 years of experience as a Senior Business Analyst with 3 years working on business process modelling and management. • 3 years of experience supporting provider management (This is critical for this position. If they have not worked with provider management in prior positions, please do not respond.) • 5 years of experience in MMIS or domain knowledge of Medicare, Medicaid or with a major health care payer • 2 years of experience with multi-vendor project • Expert/Advance experience in using Visio, MS Project, Office 365, Webex/TeamsExperience Preferred10+ years of experience as a Senior Business Analyst with 3 years working on business process modelling and management. • 3 years of experience supporting provider management (This is critical for this position. If they have not worked with provider management in prior positions, please do not respond.) • 5+ years of experience in MMIS or domain knowledge of Medicare, Medicaid or with a major health care payer • 2+ years of experience at large multi contractor organizations, including leading centralized or matrixed teams. • 3+ years of experience as a technical writer • Expert/Advanced knowledge of all Microsoft Office products including MS Project and SharePoint.Education RequiredBachelor’s Degree in Computer Science, Information Systems, Business Administration, or other related field. Or equivalent work experience.Additional Information:Vetting questions are required. Submit in resume 1. Rate your knowledge of Provider Enrollment from 1 – 10 with 10 being an expert: 2. Rate your knowledge of Decision Support System (Data Warehouse) from 1 – 10 with 10 being an expert: 3. Rate your knowledge of Claims Adjudication (Claims Processing) from 1 – 10 with 10 being an expert: 4. Rate your knowledge of Payment and Reporting (Financial) from 1 – 10 with 10 being an expert: 5. Rate your knowledge of Authorization Determination (Prior Authorization) from 1 – 10 with 10 being an expert: 6. Rate your knowledge of Health Benefits Administration (Reference/Rates/Contracts) from 1 – 10 with 10 being an expert: 7. Rate your knowledge of Health Benefits Administration (Reference/Rates/Contracts) from 1 – 10 with 10 being an expert:",
        "source": "Email",
        "date_posted": "2024-10-21 14:35:28-05:00",
        "unique_id": "192b0b69fa57c3e2",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]