[
    {
        "company": "Yochana Solutions Inc.",
        "job_title": "Scrum master",
        "location": "El Segundo, CA, USA",
        "full_location": {
            "city": "El Segundo",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6-12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "WMS background",
                "Scrum framework",
                "coaching",
                "mentoring"
            ],
            "primary": [
                "logistics",
                "conflict resolution",
                "user stories",
                "team discussions"
            ],
            "secondary": [
                "stakeholder management",
                "performance assessment",
                "process improvement",
                "team efficiency"
            ],
            "all": [
                "WMS background",
                "Scrum framework",
                "coaching",
                "mentoring",
                "logistics",
                "conflict resolution",
                "user stories",
                "team discussions",
                "stakeholder management",
                "performance assessment",
                "process improvement",
                "team efficiency"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Pallavi Boola",
        "email": "pallavi@yochana.com",
        "jd": "Hello,I’m a Technical Recruiter with Yochana Solutions Inc., a national IT staffing solutions provider with 14+ years of experience delivering value to leading companies across the U.S.A. and Canada,I'm currently staffing for Scrum master – El Segundo, CA (onsite), Below you will find the job description, if you are qualified and interested, please send me your Updated Word Document Resume.I'm very sorry if this position is not an ideal fit, We'll keep you in mind for other suitable positions and referrals would be appreciated.Thank you so much for your attention and participation.Job Role: Scrum masterJob Location: El Segundo, CA (onsite)Project Duration: 6-12 MonthsJob Description:Must have WMS background in logistics area.Must have WMS background in logistics area.Assist the team as a coach and mentor, providing help and guidance to help them improve their Scrum practices. Work with the product owner and other stakeholders to ensure that the team's efforts align with the organization's goals. Ensure the team follows the Scrum framework and carries out the Scrum ceremonies. Responsibilities Create and maintain a Scrum Master responsibilities list, and Scrum Master tasks list to ensure that all duties are being performed. Follow the team's progress and provide feedback and direction as needed. Help with team discussions and conflict resolution. Assist the team in identifying and removing any impediments to the team's progress. Assist the product owner in creating and prioritizing user stories. Ensure that the team is following the Scrum framework and that all scrum ceremonies are being conducted. Act as an intermediary between the team and other stakeholders, such as management, to ensure that the team's efforts align with the organization's goals. Collaborate with other Scrum Masters within the organization to share knowledge and best practices and to improve the Scrum process. Assess the team's performance and adapt the Scrum Master responsibilities list, Scrum Master duties, and Scrum Master tasks. Improve the scrum process and install changes to increase the efficiency and effectiveness of the team. Assist the team in improving their skills and delivering high-quality products.",
        "source": "Email",
        "date_posted": "2024-10-21 11:20:35-05:00",
        "unique_id": "192b0039f5a670cf",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Scrum Master"
    }
]