[
    {
        "company": "Virginia Department of Transportation",
        "job_title": "Business Analyst II",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "748993",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Agile Methodologies",
                "Scrum",
                "Requirements Gathering",
                "User Stories"
            ],
            "primary": [
                "Microsoft Office",
                "Application Lifecycle Management (ALM)",
                "Quality Assurance",
                "Wireframing",
                "Prototyping"
            ],
            "secondary": [
                "CBAP Certification",
                "CSPO Certification",
                "Team Foundation Server",
                "Automated Testing Tools",
                "Power Platform"
            ],
            "all": [
                "Business Analysis",
                "Agile Methodologies",
                "Scrum",
                "Requirements Gathering",
                "User Stories",
                "Microsoft Office",
                "Application Lifecycle Management (ALM)",
                "Quality Assurance",
                "Wireframing",
                "Prototyping",
                "CBAP Certification",
                "CSPO Certification",
                "Team Foundation Server",
                "Automated Testing Tools",
                "Power Platform"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Swapna J",
        "email": "swapnaj@cyber-resource.com",
        "jd": "From: Swapna, Cyber-resources swapnaj@cyber-resource.com Reply to: swapnaj@cyber-resource.com Role: VDOT Business Analyst (748993)Job Id : 748993Positions : 2Location: Richmond, VAWork mode: HybridInterview: Both Web Cam and In Person InterviewDUE : 10/22Experience : 10+Client : -VDOT (Virginia Department of Transportation)Client State: Virginia*Local candidates only please*Candidate must also be able to work onsite 2-3 days/week.*Contractor will be responsible for purchasing parking through VDOT’s Parking Management Office or procuring their own parkingThe Virginia Department of Transportation (VDOT) Information Technology Division (ITD) is seeking a Business Analyst to work as a key member of Business Analytics and Testing Support Team for IT projects. This analyst will support teams working in Agile (Sprint) as well as traditional Waterfall methodologies for Software Development Lifecycle (SDLC).Responsibilities include analyzing problems; documenting business processes; developing requirements, user stories and acceptance criteria; and managing requirements traceability and testing. VDOT is a fast-paced organization with very high standards for work quality and efficiency. This position is expected to handle multiple projects, and remain flexible and productive, despite changing priorities and processes. Ongoing improvement and efficiency is a part of our culture and each team member is expected to proactively contribute to process improvements. Responsibilities:• Work with the Project team members and business stakeholders to understand business processes and pain points• Develop expertise in the customers’ business applications• Conduct Root Cause Analysis to identify system gaps and deficiencies that require a business, technical or blended approach for resolution• Diagram current processes and proposed modifications using process flows, context diagrams and data flow diagrams• Discover and document requirements and user stories with a focus on improving both business and technical processing• Decompose requirements into Epics and Features and create clear and concise user stories that are easy to understand and implement by technical staff• Utilize progressive elaboration; map stories to technical design specifications to be used by internal staff to develop the system modifications• Identify and group related user stories into Themes, document the dependencies and associated business processes• Assist Product Owner in maintaining the product backlog• Create conceptual prototypes and mock-ups• Propose alternative solutions that balance cost and benefit, and adequately test a solution’s feasibility for business and technical compatibility• Collaborate with staff, vendors, consultants, and contractors as they are engaged on tasks to formulate, detail and test potential and implemented solutions.• Perform Quality Analyst functions such as defining test objectives, test plans and test cases, and executing test cases (including regression testing)• Coordinate and Facilitate User Acceptance Testing with Business and ensure Project Managers/Scrum Masters are informed of the progress Qualifications Required:• The candidate must have a minimum of 10 years of experience delivering business and systems analysis artifacts.• 5+ years of experience as an Agile Business Analyst; strong understanding of Scrum concepts and methodology• Experience organizing and maintaining Product and Sprint backlogs• Experience translating client and product strategy requirements into application requirements and user stories• Proficient with defining acceptance criteria and managing acceptance process with development• Experience with large, multi-module systems• Expertise with Microsoft Office products (Word, Excel, Access, Outlook, Visio, PowerPoint, Project Server)• Experience with Application Lifecycle management (ALM)• The candidate must have exceptional written and oral communications skills and have the proven ability to work well with a diverse set of peers and customers Preferred:• CBAP and/or CSPO Certification• Experience using Team Foundation Server for agile software development and work item tracking• Experience with automated testing tools such as TestComplete SkillRequired / DesiredAmountof ExperienceDelivering business and systems analysis artifacts such as Business Requirements Documentation (BRD), Requirements Traceability Matrix (RTM)Required 10YearsAgile Business Analyst; strong understanding of Scrum concepts and methodologyRequired 5YearsExperience translating business and product strategy requirements into application requirements and user storiesRequired 10YearsProficient with defining acceptance criteria and managing acceptance process with developmentRequired 10YearsExperience creating wireframes and prototypes (using applications such as Balsamiq)Required 10YearsExperience with large, multi-module systemsRequired 5YearsExpertise with Microsoft Office products (Word, Excel, Access, Outlook, Visio, PowerPoint, Project Server)Required 10YearsExperience with Application Lifecycle management (ALM)Required 5YearsExceptional written and oral communications skills and have the proven ability to work well with a diverse set of peers and customersRequired 10YearsCertified Business Analysis Professional (CBAP) or Certified Scrum Product Owner (CSPO) CertificationDesired Experience using Team Foundation Server for agile software development and work item trackingDesired Experience with automated testing tools such as TestCompleteDesired Expertise with Power platformDesired 2Years Question 1Commonwealth of Virginia security policies prohibit the use of offshore IT contractors. Do you attest to the fact that your candidate will physically reside within the US for the duration of the assignment?Question 2Please list candidate's email address.Question 3In what city/state does your candidate PERMANENTLY reside?Question 4Does your candidate agree to attend an onsite interview, if requested? This is REQUIRED.Question 5Does your candidate agree to work onsite 2-3 days/wk? This is REQUIRED.Question 6How soon after an offer can your candidate start?Thanks & RegardsSwapna JOfficial Partner to State of Virginia / D.C. / Indiana / Georgia / Idaho / Florida / IowaEmail: Swapnaj@cyber-resource.com |12240 Manor Crossing Dr, Glen Allen, Virginia 23059http://www.cyber-resource.com/",
        "source": "Email",
        "date_posted": "2024-10-21 16:18:25-05:00",
        "unique_id": "192b1125fb9e4cca",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]