[
    {
        "company": "Techrooted INC",
        "job_title": ".NET Developer",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "experience_required": "Intermediate or 5 years for senior level as .Net developer",
            "degree_required": "Bachelors or equivalent degree in related fields",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".NET Framework 3.5 and above",
                ".NET Core",
                "C#",
                "SQL Server",
                "Microservice architecture"
            ],
            "primary": [
                "ASP.NET Core",
                "RESTful Architecture",
                "LINQ",
                "Entity Framework",
                "Client server models",
                "Object-oriented programming"
            ],
            "secondary": [
                "Service Bus Frameworks (nServicebus, Mass Transit)",
                "Elastic Search",
                "SOLR",
                "Messaging queues (MSMQ, RabbitMQ, Kafka)",
                "Design and architectural patterns",
                "Angular",
                "JavaScript",
                "Typescript",
                "MongoDB",
                "Oracle",
                "DB2",
                "Java",
                "Python",
                "Azure",
                "AWS",
                "Docker",
                "Kubernetes",
                "DevOps",
                "Performance management and monitoring tools (App Dynamics, App Insights, Grafana)"
            ],
            "all": [
                ".NET Framework 3.5 and above",
                ".NET Core",
                "C#",
                "SQL Server",
                "Microservice architecture",
                "ASP.NET Core",
                "RESTful Architecture",
                "LINQ",
                "Entity Framework",
                "Client server models",
                "Object-oriented programming",
                "Service Bus Frameworks (nServicebus, Mass Transit)",
                "Elastic Search",
                "SOLR",
                "Messaging queues (MSMQ, RabbitMQ, Kafka)",
                "Design and architectural patterns",
                "Angular",
                "JavaScript",
                "Typescript",
                "MongoDB",
                "Oracle",
                "DB2",
                "Java",
                "Python",
                "Azure",
                "AWS",
                "Docker",
                "Kubernetes",
                "DevOps",
                "Performance management and monitoring tools (App Dynamics, App Insights, Grafana)"
            ],
            "with_experience": [
                "C# (5+ years)",
                ".NET Framework (3.5 and above)",
                ".NET Core",
                "SQL Server",
                "Microservice architecture"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Amandeep Kaur",
        "email": "amandeep@techrooted.com",
        "jd": "From: Amandeep Kaur, Techrooted INC amandeep@techrooted.com Reply to: amandeep@techrooted.com Hi, This is Aman, Technical Recruiter at Techrooted, we have an excellent job opportunity for you. Please let me know if you are interested then share your updated resume along with your contact details so that we can proceed further. C#/ .NET Developer Location: REMOTE But need from EST or CST only (Client’s Location: Pittsburgh PA)GCEAD H4 EAD onlySolid LinkedIn profile is must.Photo ID, Resume & Work Authorization Documents attached. Passport # may be required Mention Current Location and visa while sharing the profile; otherwise i will not consider it.Job Description:We are actively seeking an Intermediate, Senior .NET developer(s), responsible for building high quality, lean, scalable and performance driven n-tier web applications using Microsoft.NET with C#, SQL Server, micro services architecture. The primary responsibility of the individual is to design, build, test and deploy REST APIs using .NET core with micro service architecture, fix bugs and maintain legacy applications. The individual is also expected to work in a cross functional team environment and expand horizons to assist in UI, QA etc. Proficient in analyzing and converting requirements into a scalable and performant software. Self-driven, self-organized and motivated individual with strong analytical and problem-solving skills who will work in a collaborative team environment and strive to build and deploy scalable and efficient web applications.Responsibilities:Build and maintain clean, efficient, reusable, testable and reliable code.Ensure the best possible performance, quality, and responsiveness of applications.Identify bottlenecks and bugs, and devise solutions to mitigate and address these issues.Help maintain code quality and organization.Innovate and contribute to improve the collective skillset and knowledge of the team.Functional knowledge in CI/CD, deployments and releasing software all the way to production.Devise and document technical specifications and procedures.Proactively seek opportunities to improve and innovate SDLC (Software Development Life Cycle).Requirements:Advanced Proficiency in .NET Framework 3.5 and above, .NET Core, ASP.NET Core, RESTful Architecture.Proficient in C#, LINQ, Entity Framework, SQL Server (Stored procedures, views etc.,) with a good knowledge of their ecosystems.Proficiency in client server models and object-oriented programming.Proficiency and solid foundation in Microservice architecture.Proficient in writing clean, readable, and easily maintainable code.Proficient in designing and building scalable relational databases using SQL server or any other relational models.Must possess solid troubleshooting and performance tuning skill.Working knowledge with Service Bus Frameworks such as nServicebus, Mass Transit, etc.Working knowledge with Elastic Search, SOLR – full text indexing and searching libraries.Working knowledge with messaging queues such as MSMQ, RabbitMQ, Kafka etc.Working knowledge with various design and architectural patterns.Familiarity with Angular or any similar platform and frameworks.Possess Strong verbal and communication skillsQualifications:C#NET Framework 3.5 and above, .NET Core, WebAPILINQ, Entity FrameworkMessage Brokers (RabbitMQ, Kafka)JavaScript, Angular, TypescriptMS SQL, MongoDB, Oracle, DB2 (any relational and/or non-relational DB)Qualifications (Nice to have)Java, PythonAzure, AWS, Docker, and KubernetesContainerization (Dockers) with Orchestration (Kubernetes or OpenShift)DevOps – Build and Pipelines, YAMLFamiliarity with performance management and monitoring tools such as App Dynamics, App Insights, Grafana etc.Experience in healthcare domain Qualifications:Bachelors or equivalent degree in related fields (or) Minimum of 3 years for Intermediate or 5 years for senior level as .Net developer.",
        "source": "Email",
        "date_posted": "2024-10-21 13:21:59-05:00",
        "unique_id": "192b070d8f390692",
        "emp_type": [
            "third party"
        ],
        "tag": ".net developer"
    }
]