[
    {
        "company": "Blue Ocean Ventures",
        "job_title": "Pharmacy Security Program Manager",
        "location": "Bloomfield, CT, USA",
        "full_location": {
            "city": "Bloomfield",
            "state": "CT",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "10 years",
            "degree_required": "Bachelor's degree",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "program/project management",
                "information technology",
                "security",
                "network technology",
                "ICS/OT"
            ],
            "primary": [
                "communication",
                "collaboration",
                "cross-functional team management",
                "project management tools"
            ],
            "secondary": [
                "waterfall methodology",
                "agile methodology",
                "Jira",
                "Rally",
                "Confluence",
                "SharePoint",
                "PowerPoint",
                "Outlook"
            ],
            "all": [
                "program/project management",
                "information technology",
                "security",
                "network technology",
                "ICS/OT",
                "communication",
                "collaboration",
                "cross-functional team management",
                "project management tools",
                "waterfall methodology",
                "agile methodology",
                "Jira",
                "Rally",
                "Confluence",
                "SharePoint",
                "PowerPoint",
                "Outlook"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Abhilash s h",
        "email": "abhilash.sh@blue-oceanventures.com",
        "jd": "From: Abhilash s h, Blue ocean ventures abhilash.sh@blue-oceanventures.com Reply to: abhilash.sh@blue-oceanventures.com Role: Pharmacy Security Program ManagerLocation: Bloomfield, CT; Denver, CO; St. Louis MO; Bloomington, MN – On-Site – Only Local candidatesJob Summary: We are seeking an experienced program leader to join our Information Protection organization to lead a high-profile cyber security track of work to mature our Pharmacy Security. As a Delivery Program Leader, you will be responsible for managing program oversight for key application and OT security implementations and driving the rollout of network segmentation in close partnership with our infrastructure network engineering and technology partners. You will be responsible for maintaining detailed project schedules, status reports, and project financials. You will facilitate recurring status meetings with our Information Protection executive leadership team and host weekly program leadership meetings with owners of other tracks of work. The ideal candidate will have a deep understanding of waterfall and agile project management methodologies and tools. Responsibilities: Define and maintain program objectives, scope, timelines, budgets, and deliverables, ensuring alignment with contractual commitmentsCommunicate program progress, risks, and issues to executive leadership and stakeholders, providing on-time updates and status reportsFacilitate meetings and manage cross-functional project teams, providing leadership and guidance to ensure successful program deliveryDevelop and manage program budgets, track progress against milestones, and manage program risks and issuesDrive individual project components for network segmentation where necessary Qualifications: Bachelor's degreeMinimum of 10 years of experience in program/project management with information technology and/or security experience; network technology and ICS/OT experience is a plusExceptional communication and collaboration skills, with the ability to work effectively with cross-functional teams and executive leadershipExperience managing large, highly visible IT programs and initiatives with cross-functional teamsThe ability, willingness, and flexibility to take on a variety of tasks to ensure that all project teams are meeting schedule and delivery commitmentsExpertise with communication, project and program management, and tools such as Jira, Rally, Confluence, SharePoint, PowerPoint, Outlook",
        "source": "Email",
        "date_posted": "2024-10-21 09:48:11-05:00",
        "unique_id": "192afb1a50ce3fb5",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]