[
    {
        "company": "Kovan Technology Solutions",
        "job_title": "IVR Developer",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "4 years",
            "degree_required": "Bachelor’s degree in Computer Science, Information Technology, or a related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "VXML",
                "GDF",
                "IVR",
                "Java",
                "SQL"
            ],
            "primary": [
                "Cyara",
                "Avaya",
                "Genesys",
                "Amazon connect",
                "Watson",
                "Nuance"
            ],
            "secondary": [
                "Speech recognition",
                "Text-to-speech",
                "Call flow design",
                "Problem-solving",
                "Analytical skills",
                "Communication skills",
                "Interpersonal skills"
            ],
            "all": [
                "VXML",
                "GDF",
                "IVR",
                "Java",
                "SQL",
                "Cyara",
                "Avaya",
                "Genesys",
                "Amazon connect",
                "Watson",
                "Nuance",
                "Speech recognition",
                "Text-to-speech",
                "Call flow design",
                "Problem-solving",
                "Analytical skills",
                "Communication skills",
                "Interpersonal skills"
            ],
            "with_experience": [
                "IVR Developer (4 years)",
                "VXML",
                "GDF",
                "Java",
                "Cyara",
                "Avaya",
                "Genesys",
                "Amazon connect",
                "Watson",
                "Nuance"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Naveen R",
        "email": "naveen@kovantech.com",
        "jd": "From: Naveen, Kovan Technology Solutions naveen@kovantech.com Reply to: naveen@kovantech.com Hi Professionals, Naveen here from Kovan Tech, kindly find the below job description and please send me the suitable profiles. Job Title: IVR Developer with Java Duration: Contract Location: Remote Java exp is must Job Description: We are seeking a skilled IVR Developer with expertise in few or more of IVR development technologies VXML, GDF, IVR, Cyara, Avaya, Genesys, Amazon connect, Watson and Nuance. The successful candidate will be responsible for designing, developing, and maintaining interactive voice response (IVR) systems to enhance customer experience and streamline operations. Key Responsibilities: Design and Development: Design and develop IVR applications using VXML and GDF. Integrate IVR solutions with backend systems and databases using Java and SQL. Develop call flows for inbound and outbound IVR systems. Testing and Deployment: Perform unit, functional and integration testing of IVR applications. Use Cyara for automated testing and monitoring of IVR systems. Deploy IVR applications on Avaya and Genesys platforms. Integration and Maintenance: Integrate speech recognition and text-to-speech technologies using GDF. Monitor and maintain IVR systems to ensure high availability and performance. Troubleshoot and resolve issues related to IVR applications and infrastructure. Collaboration: Work closely with cross-functional teams, including business analysts, QA engineers, and project managers. Provide technical support and training to other team members and stakeholders. Qualifications: Technical Skills: Proficient in VXML, GDF, and IVR application development. Expertise in few or more of IVR technologies/products like GDF, Avaya, Genesys, Amazon connect, Watson and Nuance, Avaya and Genesys platforms. Familiarity with Cyara for IVR testing and monitoring. Strong understanding of inbound and outbound call flow design. Experience with speech recognition and text-to-speech technologies. Experience: Minimum of 4 years of experience in IVR development. Experience in deploying and maintaining IVR systems in a production environment. Knowledge of telephony protocols and standards. Education: Bachelor’s degree in Computer Science, Information Technology, or a related field. Soft Skills: Excellent problem-solving and analytical skills. Strong communication and interpersonal skills. Ability to work independently and as part of a team. SKILL MATRIX: Skills Required Years of Experience Overall Experience IVR Developer 4 years of experience in IVR development Design and develop IVR applications using VXML and GDF. Google Dialogflow (GDF) Experience in Avaya Experience in VXML Experience in JAVA Experience in Nuance Experience in Amazon connect Experience in Watson Experience in Cyara for IVR testing and monitoring. Experience in Genesys Experience in deploying and maintaining IVR systems in a production environment. Experience with speech recognition and text-to-speech using GDF Experience in inbound and outbound call flow design. Candidate details: Full Legal Name Work Authorization (Visa Status) Valid till LinkedIn URL Best number to reach you Email address Present Location SSN Number Passport Number Available date and time for Client Interview for next 2 days Current Project Situation (On bench or In the Project) Degree and Passed Out Year Year came to USA and in which Visa? US Experience Total Years of experience Availability to join the project Reason for job change Interviews or any offer letter in pipeline. Thanks & Regards, Naveen R Sr. US IT Recruiter Kovan Technology Solutions Certified Minority Business Enterprise (MBE) Email: naveen@kovantech.com| www.kovantech.com",
        "source": "Email",
        "date_posted": "2024-10-21 09:54:35-05:00",
        "unique_id": "192afb78385441f3",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]