[
    {
        "company": "ARK Infotech Spectrum",
        "job_title": "IT Business Partner - Finance",
        "location": "Greenville, NC, USA",
        "full_location": {
            "city": "Greenville",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "12+ years",
            "degree_required": "Bachelor's Degree in the field of information technology, engineering, computer science and / or business administration (required)",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SAP",
                "FICO",
                "SAC",
                "Hyperion"
            ],
            "primary": [
                "Finance applications",
                "Project Management",
                "Interpersonal skills",
                "Communication skills",
                "Leadership"
            ],
            "secondary": [
                "Pharmaceuticals",
                "Life Sciences",
                "Matrix team leadership",
                "Vendor management",
                "Influencing skills"
            ],
            "all": [
                "SAP",
                "FICO",
                "SAC",
                "Hyperion",
                "Finance applications",
                "Project Management",
                "Interpersonal skills",
                "Communication skills",
                "Leadership",
                "Pharmaceuticals",
                "Life Sciences",
                "Matrix team leadership",
                "Vendor management",
                "Influencing skills"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Sandeep Siliveru",
        "email": "siliveru@arkinfotechspectrum.com",
        "jd": "From: sandeep, ARK Infotech Spectrum siliveru@arkinfotechspectrum.com Reply to: siliveru@arkinfotechspectrum.com Hi,This is Sandeep from Ark Infotech Spectrum and please find the job description below which suits your profile and let us know your interest for this positionPP Num (Except USC) & LinkedIN Mandotary for Submission Job Title: - IT Business Partner - FinanceClient: Implementation: Duration: 6+ MonthsExperience level: 12+ yearsLocation: Greenville, NC, USA (Hybrid) POSITION OVERVIEW: The Finance IT Business Partner is responsible for understanding the business overall goals, requirements and objectives, assisting in the prioritization of Finance and ERP technology projects for Pharma business, ensuring that projects align with the technology that best provides maximum return on investment, and linking IT strategy in support of the overall business/service line strategy. POSITION GENERAL DUTIES AND TASKS:Self-motivated with the ability to work autonomously in a fast-paced environment. Building strong relationships; excellent interpersonal skills and communication skills, including written, verbal and presentation skills.Requires experience in a finance department of a manufacturing organization (preferably biopharma or med device) and has in-depth understanding of local financial processes at the manufacturing site and global financial processes at corporate level.Requires strong knowledge of SAP, FICO, SAC and Hyperion. Requires good knowledge of company functions globally and a deep understanding of the relationships and processes integration among departments within the business.Requires ability to actively and successfully use a range of influencing and leadership styles dependent on situation.Requires ability to lead effectively during challenging times and periods of change.Requires ability to speak, listen and write in a clear, concise, thorough and timely manner using appropriate and effective communication tools and techniques.Requires ability to influence internal and external contacts on services including but not limited to, Finance, technology, and vendor management groups.Requires ability to manage competing priorities.Prefer deep understanding in Project Management principles Requires ability to overcome obstacles and achieve key outcomes and follow through to get things done and deliver what is promised.Navigating a large IT department with a high number of technologies and technical disciplines facilitating innovation in business process and technical solution delivery.Experience leading a matrix team of professionals and communicating with various levels of management is highly desired. Ability to work with all levels of the organization, both technical and non-technical.More than 10 years working experience developing and supporting Finance applications and large More than 5 years working in the Pharmaceuticals or Life Sciences industry (preferred) Bachelor's Degree in the field of information technology, engineering, computer science and / or business administration (required)Proven ability in a high growth business and developing teams to scale and deliver on commitments Advanced degree in business or technology, such as an MBA (preferred). CPA (preferred).Travel 20%Disclaimer:: We're currently in the process of reviewing all applications thoroughly. If your profile matches what we're looking for, we'll reach out to discuss the next steps in the hiring process. However, if you do not hear from us, please understand that we are unable to move forward with your application at this time. Sandeep SiliveruSr. US IT Specialist| ARK InfoTech Spectrum Inc.,: linkedin.com/in/sandeep-siliveru-✪-5759b023b (Primary): linkedin.com/in/siliveru-sandeep-6a6120185 (Secondary)𝙽𝚘𝚝𝚎 : Our Solution. Your Success !",
        "source": "Email",
        "date_posted": "2024-10-21 11:37:35-05:00",
        "unique_id": "192b012834eecf3a",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]