[
    {
        "company": "Exaways Corporation",
        "job_title": "Full Stack Java Developer",
        "location": "Philadelphia, PA, USA",
        "full_location": {
            "city": "Philadelphia",
            "state": "PA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "9+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "REST APIs",
                "MySQL",
                "Spring Framework",
                "Maven"
            ],
            "primary": [
                "JavaScript",
                "Linux",
                "Problem Solving",
                "Critical Thinking"
            ],
            "secondary": [
                "Team Player",
                "Excellent Communication",
                "Project Responsibility",
                "Multi-tasking",
                "Incident Reporting"
            ],
            "all": [
                "Java",
                "REST APIs",
                "MySQL",
                "Spring Framework",
                "Maven",
                "JavaScript",
                "Linux",
                "Problem Solving",
                "Critical Thinking",
                "Team Player",
                "Excellent Communication",
                "Project Responsibility",
                "Multi-tasking",
                "Incident Reporting"
            ],
            "with_experience": [
                "Java (9+ years)",
                "Full Stack Development (9+ years)",
                "Multi-tier Software Applications (9+ years)",
                "LDAP (7+ years)",
                "Secure Development Lifecycle (SDL)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Kaviarasan",
        "email": "kavi@exaways.com",
        "jd": "Hi, I am Kaviarasan from Exaways Corporation! Exaways Corporation. (https://www.exaways.com/), is an Equal Opportunity Employer, is an IT consulting firm headquartered in Fremont, CA servicing clients nationwide. We provide services in IT, Telecom, Finance & Accounting and Engineering categories. If you are interested, kindly send me your updated resume, contact details and a convenient time to talk to you Role: Full Stack Java Developer ( Candidate need to come for F2F interview, so look for local) Location: Philadelphia, PA Job description: Technical Skills: Excellent Java skills and prior experience working with frameworks, building REST APIs and other backend/frontend components Ability to write well-documented, clean Java code Technical proficiency with MySQL/MariaDB database design/administration Experience with Linux operating system. Including scripting and common tools and utilities Excellent problem solving and critical thinking skills. Proficient in spring framework and Maven Professional Skills: Ability to take responsibility for completing projects with the least amount of oversight. Ability to apply judgment, implement solutions, and avoid conflicts in a multi-tasked environment. Excellent communication skills in all areas including procedural documentation, incident reporting and information relaying. Team player with the ability to maintain a pleasant personality and a professional demeanor in stressful situations. Experience: 9+ years in a Full Stack Developer role 9+ years in Java 9+ years of experience developing multi-tier software applications 7+ years and JavaScript LDAP experience Experience in the SDL (Secure Development Lifecycle) process with strong security focus Thanks, Kaviarasan Exaways Corporation kavi@exaways.com LinkedIn :linkedin.com/in/kavi-arasan-707a69209",
        "source": "Email",
        "date_posted": "2024-10-21 11:07:52-05:00",
        "unique_id": "192aff7b153dd97d",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]