[
    {
        "company": "Soni Talent Corp. Inc.",
        "job_title": "Oracle Financials Techno Functional",
        "location": "Jamesburg, NJ, USA",
        "full_location": {
            "city": "Jamesburg",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Bachelor’s degree (or equivalent) in information technology or computer science",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "ERP Financials",
                "Accounting",
                "SQL",
                "PL/SQL",
                "Excel"
            ],
            "primary": [
                "Business analysis",
                "Project management",
                "Data visualization",
                "Microsoft applications",
                "Process improvement"
            ],
            "secondary": [
                "Communication",
                "Collaboration",
                "Analytical skills",
                "Documentation",
                "User testing"
            ],
            "all": [
                "ERP Financials",
                "Accounting",
                "SQL",
                "PL/SQL",
                "Excel",
                "Business analysis",
                "Project management",
                "Data visualization",
                "Microsoft applications",
                "Process improvement",
                "Communication",
                "Collaboration",
                "Analytical skills",
                "Documentation",
                "User testing"
            ],
            "with_experience": [
                "ERP Financials (5 years)",
                "Business analysis",
                "Project management"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Sonam Gupta",
        "email": "sonam.gupta@sonitalentcorp.com",
        "jd": "From: Sonam, Sonitalent sonam.gupta@sonitalentcorp.com Reply to: sonam.gupta@sonitalentcorp.com Hi, Please have a look at the description below. Job Title- Oracle Financials Techno FunctionalLocation- Hybrid Jamesburg, NJ (Need Local) Job Description – Note: Candidate must be local to the tri-state NJ area. ERP Financials Technical analyst:Business analysts are the drivers of our continued growth and success. We are currently searching for an experienced business analyst to help guide our organization to the future. With their commitment to innovation, these analysts seek, develop, and help implement strategic initiatives for improved efficiency and productivity. From researching progressive systems solutions to evaluating their impacts, the ideal candidate will be a detailed planner, expert communicator, and top-notch analyst.Objectives of this role:Drive awareness of requirements in Finance ERP operations across business units and identify substandard systems processes through evaluation of real-time data and design better system processes to overcome deficiencies.• Serve as thoughtful leader for technical business processes, developing systems prototypes that promote increased efficiency and productivity on multiple levels.• Create and implement precise management plans for every project, with attention to transparent communication at all levels.• Perform, evaluate, and communicate thorough quality assurance at every stage of systems development.• Gather user requirements and design and coordinate system development and implement in production to ensure maximum usability.Responsibilities• Partner with stakeholders across business units (ex: Business Operations, Customer Service, Sales & Finance) to develop analysis and documentation in a collaborative way, communicating effectively and efficiently with production, managerial, and executive teams.• Evaluate, analyze, and communicate systems requirements on a continuing basis, and maintain systems processes, including the delivery of monthly status reports to all appropriate parties.• Author and update internal and external documentation, and formally initiate and deliver requirements and documentation.• Conduct daily systems analytics to maximize effectiveness and troubleshoot problems.• Develop meaningful and lasting relationships with partners for optimized systems integration and respond to questions and concerns from managers and executives with supporting research and recommendations.Required skills and qualifications:• Experience in ERP Financials (Order to Cash, Accounts Receivable, Credit Collections, Revenue Recognition, Taxation and General Ledger) highly desirable• Experience in Accounting (Revenue, Cost and Deferral) is highly desirable• Experience with ERP systems Process specifically in Finance/Supply chain Logistics preferred.• High proficiency in Excel, Word, and PowerPoint. Above average skills in SQL & PL/SQL• Accounting foundation knowledge to understand business processes and to interpret reports.• Strong working knowledge of relevant Microsoft applications, including Visio.• Proven ability to manage projects and user testing.• Extensive experience with data visualization• Ability to use analytical skills to divide and simplify complex business problems into simple and manageable ones.• Strong business analyst skills and ability to collaborate in person and virtual environments• Ability to document and present problems and solutions.• Proven ability to manage projects and user testing.• Self-starter, detail oriented and ability to learn new applications, tools and business processes.• 5 years prior business process design experience, focusing on process improvement.• Bachelor’s degree (or equivalent) in information technology or computer science Thanks And Regards,Sonam Gupta( Sr. Technical Recruiter)Soni Talent Corp. Inc.Email:- sonam.gupta@sonitalentcorp.com",
        "source": "Email",
        "date_posted": "2024-10-21 12:11:30-05:00",
        "unique_id": "192b0304e6503c39",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]