[
    {
        "company": "Incom Technologies Inc",
        "job_title": "Business Analyst – Records Analyst",
        "location": "Baton Rouge, LA, USA",
        "full_location": {
            "city": "Baton Rouge",
            "state": "LA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Proven experience as a Business Analyst or similar role",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$60/hr on c2c"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Records Management",
                "Business Process Reengineering",
                "Document Digitization",
                "Oracle Document Repository"
            ],
            "primary": [
                "Data Gathering",
                "Cost-Benefit Analysis",
                "Project Management",
                "Stakeholder Communication",
                "Procurement Laws"
            ],
            "secondary": [
                "ITBs",
                "RFIs",
                "RFRs",
                "RFPs",
                "Content Management Systems"
            ],
            "all": [
                "Business Analysis",
                "Records Management",
                "Business Process Reengineering",
                "Document Digitization",
                "Oracle Document Repository",
                "Data Gathering",
                "Cost-Benefit Analysis",
                "Project Management",
                "Stakeholder Communication",
                "Procurement Laws",
                "ITBs",
                "RFIs",
                "RFRs",
                "RFPs",
                "Content Management Systems"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "komal",
        "email": "komal@incom-tech.net",
        "jd": "From: komal, Incom Technologies Inc komal@incom-tech.net Reply to: komal@incom-tech.net Hi Role: Business Analyst – Records AnalystClient :State of LALocation : OnsiteRate :$60/hr on c2c NOTE : CANDIDATES SHOULD BE LOCAL TO LOUISIANAIn an effort to digitize the agency’s file rooms, LA Dept. of Energy and Natural Resources is looking for consulting services to perform an assessment of their current practices and develop an actionable roadmap to effectively digitize the paper files and store the documents into a repository that will allow users throughout the agency to have access. Data gathering sessions will need to be performed with multiple agency departments and regional offices. The current process involves desktop scanning, indexing and storing documents into the Oracle document repository. After scanning, documents are available for public viewing using the Sunrise application. Physical documents are boxed and shipped to La. State Archives after scanning. A small portion of the documents that need to be scanned require an oversize scanner. LDENR wants to set up a centralized scanning location for all paper documents to get processed. The centralized scanning will be to process the file room documents as well as any new documents that the agency needs to archive.Duties/Responsibilities• Define and document business functions and processes.• Analyze the integration of business functions with technology.• Maintain a working knowledge of accounting, procurement, finance or contract management.• Assist with business case development and business process reengineering.• Consult with management and personnel to identify, define and document business needs and objectives, current operational procedures, problems, input and output requirements.• Recommend new processes that yield operational efficiencies.• Conduct cost-benefit analysis.• Develop or assist with project work plans, project timelines.• Develop or assist with ITBs, RFIs, RFRs, RFPs, and contracts.Required Experience• Proven experience as a Business Analyst or similar role with a focus on records management and business process reengineering.Familiarity with document digitization projects and knowledge of best practices in document scanning, indexing, and storage.• Experience with Oracle document repository systems or similar content management systems (CMS).• Strong knowledge of State and Federal procurement laws, particularly within the context of IT and consulting contracts.• Demonstrated ability to conduct data gathering sessions and develop actionable business and technical roadmaps.• Experience with developing ITBs, RFIs, RFRs, and RFPs in the public sector, with a focus on digitization and data management.• Proficiency in conducting cost-benefit analysis and recommending operational efficiencies.• Ability to communicate with multiple stakeholders across departments and at various organizational levels.• Experience in project management support, including timeline development, tracking, and reporting.• Strong analytical and problem-solving skills, with an ability to interpret data and make informed decisions.",
        "source": "Email",
        "date_posted": "2024-10-21 09:58:50-05:00",
        "unique_id": "192afbad5c39d736",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]