[
    {
        "company": "Avance",
        "job_title": "Senior Technical Lead",
        "location": "Cedar Rapids, IA, USA",
        "full_location": {
            "city": "Cedar Rapids",
            "state": "IA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Angular",
                "Java",
                "Spring Boot"
            ],
            "primary": [
                "nestJS",
                "TerraForm",
                "AWS",
                "Jenkins",
                "GitHub",
                "Jira"
            ],
            "secondary": [],
            "all": [
                "Angular",
                "Java",
                "Spring Boot",
                "nestJS",
                "TerraForm",
                "AWS",
                "Jenkins",
                "GitHub",
                "Jira"
            ],
            "with_experience": [
                "Angular (10+ years)",
                "Java (10+ years)",
                "Spring Boot (10+ years)"
            ]
        },
        "job_type": [],
        "contact_person": "Bhavya Rapelli",
        "email": "bhavya.r@avanceservices.com",
        "jd": "From: Bhavya Rapelli, Avance bhavya.r@avanceservices.com Reply to: bhavya.r@avanceservices.com Senior Technical Lead Cedar Rapids, IAKey Skills - Angular, Java, Spring BootAt least 10+ years of Information Technology experience.Tech skills – Angular, nestJS, Stringboot/Spring Framework, TerraForm, AWS, Jenkins, GitHub, JiraProvide User Interface and User Experience Design and Development for our productsComplete development stories from requirement with minimal guidanceCoordinate with other developers to implement application changes.Provide support of all environment through productionAssist Product Owner with user interface and user experience design At least 8+ years of Information Technology experience.Tech skills Angular, nestJS, StringbootSpring Framework, TerraForm, AWS, Jenkins, GitHub, JiraProvide User Interface and User Experience Design and Development for our products Complete development stories from requirement with minimal guidanceCoordinate with other developers to implement application changes.Provide support of all environment through productionAssist Product Owner with user interface and user experience designTeam should be available till 9 PM IST (1.) To be responsible for providing technical guidance to a team of developers, enhancing their technical capabilities and increasing productivity. (2.) To conduct comprehensive code reviews, establish and oversee quality assurance processes, performance optimization , implementation of best practices and coding standards to ensure succeful delivery of complex projects. (3.) To ensure process compliance in the assigned module, and participate in technical discussionsorreview as a technical consultant for feasibility study (technical alternatives, best packages, supporting architecture best practices, technical risks, breakdown into components, estimations). (4.) To collaborate with stakeholders to define project scope, objectives, deliverables and accordingly prepare and submit status reports for minimizing exposure and closure of escalations.--",
        "source": "Email",
        "date_posted": "2024-10-21 19:15:29-05:00",
        "unique_id": "192b1e498c6b74c6",
        "emp_type": [
            "third party"
        ],
        "tag": "Java developer"
    }
]