[
    {
        "company": "Maintec Technologies Inc.",
        "job_title": "SRE GCP Technical Architect/PM",
        "location": "Nashville, TN, USA",
        "full_location": {
            "city": "Nashville",
            "state": "TN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Month",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SRE",
                "DevOps",
                "CI/CD pipelines",
                "GCP"
            ],
            "primary": [
                "Terraform"
            ],
            "secondary": [],
            "all": [
                "SRE",
                "DevOps",
                "CI/CD pipelines",
                "GCP",
                "Terraform"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Reetti Mendratta",
        "email": "reeti@maintec.com",
        "jd": "Hello Partners, Greetings for the day, We are hiring for SRE GCP Technical Architect/PM. Please share Independent Visa Holders only for remote. Job Title: SRE GCP Technical Architect/PM. Location: Nashville, TN (Remote ok, but local candidates are highly preferred). Duration: 12+ Month. Must have skills: SRE, DevOps, CI/CD pipelines, GCP. Job description: Should have extensive work experience with GCP. Technical knowledge Work experience on DevOps Good Knowledge using Terraform Experience in CICD Pipeline creation Ability to identify new SRE initiatives, Automation etc (1.) To manage the customer delivery or expectations and the technical team. (2.) To design and develop solution for product or project and sustenance delivery. (3.) To gather specifications and deliver solutions to the client organization based on understanding of a domain or technology. (4.) To guide and mentor a team of developers for successful delivery of project. (5.) To ensure knowledge up-gradation and work with new technologies so that the solution is current and meets quality standards and the client requirements. Skills Expectation from the person will be to work on the list of activities identified by client for SRE and also identify areas of expansion of SRE within client engineering teams. He will be the key SPOC who will expand SRE within client engineering and integrate all the SRE teams. Having experience with SRE, DevOps, Terraform, has worked on creating CI/CD pipelines, is GCP certified and can drive the engagement with little to no involvement from client side.",
        "source": "Email",
        "date_posted": "2024-10-21 11:19:13-05:00",
        "unique_id": "192b001d7712270e",
        "emp_type": [
            "third party"
        ],
        "tag": "GCP Data Engineer"
    }
]