[
    {
        "company": "Virginia Information Technology Agency",
        "job_title": "DMAS - Senior Java Programmer",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Project-based, approximately 7 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java EE",
                "Core Java",
                "OOP Design",
                "Multi-Threading",
                "Generics",
                "Exception Handling",
                "Collections",
                "Java Reflection",
                "Annotation",
                "Oracle"
            ],
            "primary": [
                "Git Workflows",
                "CI/CD pipelines",
                "Azure DevOps",
                "Selenium",
                "Cucumber",
                "Playwright",
                "JUnit",
                "IBM SOA products",
                "Node.js",
                "Angular"
            ],
            "secondary": [
                "Test Left approach",
                "ITX",
                "MQ"
            ],
            "all": [
                "Java EE",
                "Core Java",
                "OOP Design",
                "Multi-Threading",
                "Generics",
                "Exception Handling",
                "Collections",
                "Java Reflection",
                "Annotation",
                "Oracle",
                "Git Workflows",
                "CI/CD pipelines",
                "Azure DevOps",
                "Selenium",
                "Cucumber",
                "Playwright",
                "JUnit",
                "IBM SOA products",
                "Node.js",
                "Angular",
                "Test Left approach",
                "ITX",
                "MQ"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Sameer Kumar",
        "email": "sameer@globalitfamily.com",
        "jd": "From: SAM, Global IT Family sameer@globalitfamily.com Reply to: sameer@globalitfamily.com Requisition Class: 2022SAAPP : PROGANAV1 : PROGANA4 : Region 1: VirginiaRegion Name: Virginia Information Technology AgencyTitle/Role: DMAS - Senior Java Programmer - IN PERSON IVs ONLY Start Date: 11/01/2024End Date: 06/30/2025Worksite Address: 600 E Broad St, Richmond, VA 23219Agency Interview Type: In Person OnlyWork Arrangement: Hybrid Before submitting: Only IN PERSON Interviews!! Team will only conduct in person interviews. No web-based interviews will be accepted. No Exceptions.DMAS - Sr Java Prog AnalystHybrid 2 days a week on site required (parking is NOT provided for contractors) ABOUT THE ROLEThis position will serve as a senior BACK-END application developer for the DMAS Information Management Division in the design, development, and maintenance of Java/ JEE based applications.Extensive practical experience in building enterprise applications using Java EE technologies.Expertise in Core Java concepts, such as OOP Design, Multi-Threading, Generics, Exception Handling, Collections, Java Reflection, Annotation.Understanding of relational database concepts with experience in Oracle.Experience developing with Git Workflows.Experience developing CI/CD pipelines and automation.Experience using Azure DevOps.Experience with Testing Frameworks such as Selenium, Cucumber, Playwright, JUnit and an understanding of Test Left approach to development.Experience with IBM SOA products like IIB/ACE, ODM, WAS, MQ, and ITXExperience with Front End Development using Node.js and Angular SkillRequired / DesiredAmountof ExperienceExtensive practical experience in building enterprise applications using Java EE technologiesRequired5YearsExpertise in Core Java concepts, such as OOP Design, Multi-Threading, Generics, Exception Handling, Collections, Java Reflection, Annotation,Required5YearsUnderstanding of relational database concepts with experience in OracleRequired5YearsExperience developing with Git WorkflowsRequired5YearsExperience developing CI/CD pipelines and automationRequired3YearsExperience using Azure DevOpsHighly desired2YearsExperience with Testing Frameworks such as Selenium, Cucumber, Playwright, JUnit and an understanding of Test Left approach to developmentHighly desired2YearsExperience with IBM SOA products like IIB/ACE, ODM, WAS, MQ, and ITXHighly desired2YearsExperience with Front End Development using Node.js and AngularNice to have1Years Question 2Please list candidate's email address.Question 3In what city and state does your candidate currently reside?Question 4If selected, interviews will be ON SITE, IN PERSON ONLY (NO Exceptions). Before you submit please confirm your candidate will willing to come to DMAS for an IN PERSON Interview if selected.Question 5If selected, role requires the candidate to be ON SITE 2 days a week. Does your candidate agree to this arrangement? Thanks & Regards,Sameer KumarGlobal IT FamilyEmail: sameer@globalitfamily.com www.globalitfamily.comSkype: sameer.satapathyLinkedIn : https://www.linkedin.com/in/sameer-satapathy-10ab0318/ (Open to connect in Linkedin)Connect with us!",
        "source": "Email",
        "date_posted": "2024-10-21 06:35:44-05:00",
        "unique_id": "192aefced72a16c6",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]