[
    {
        "company": "Adventa Tech",
        "job_title": "Project/Program Manager IT",
        "location": "Chicago, IL, USA",
        "full_location": {
            "city": "Chicago",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "6+ years",
            "degree_required": "Master of Science in engineering, computer science, or related disciplines or Bachelor's in engineering, computer science, or related disciplines with 8+ years of direct Project Management experience",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Scheduling",
                "Planning",
                "Communication",
                "Team Leadership"
            ],
            "primary": [
                "Agile",
                "PMP certification",
                "Certified Scrum Master (CSM)",
                "Azure DevOps",
                "Confluence",
                "Power BI",
                "Excel",
                "MS PowerPoint",
                "MS Project"
            ],
            "secondary": [
                "Interpersonal skills",
                "Analytical skills",
                "Organizational skills",
                "Presentation skills"
            ],
            "all": [
                "Project Management",
                "Scheduling",
                "Planning",
                "Communication",
                "Team Leadership",
                "Agile",
                "PMP certification",
                "Certified Scrum Master (CSM)",
                "Azure DevOps",
                "Confluence",
                "Power BI",
                "Excel",
                "MS PowerPoint",
                "MS Project",
                "Interpersonal skills",
                "Analytical skills",
                "Organizational skills",
                "Presentation skills"
            ],
            "with_experience": [
                "Project Management",
                "Agile",
                "Azure DevOps"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Subhra Mallick",
        "email": "subhra@adventatech.com",
        "jd": "Hope you are doing well please find the requirement below and kindly let me know if you have right candidates. Title: Project/Program Manager IT Location: Hybrid in Chicago IL Office (Need Local Candidates Only) Duration: 12+ Months Visa: CITIZEN, GREEN CARD, GC EAD, H4 EAD, OPT EAD No H1B/CPT MOI: 1 round interview via MS Teams Need Linkedin and Local Candidates Only Job Description The principal responsibility of the Project Manager is to manage the planning and execution of project team members. The incumbent will be responsible for managing the project charter, communications, metrics, reporting, and the overall project plan and budget. Interaction with team Resource will be working very closely with the business, but in the WD team, as of right now, there is 1 team member. spans across multiple functional areas within business unit and across other business units within Caterpillar Work environment: Remote ok, but will need to be able to go into office (Chicago ideally) when asked. Candidate Requirements The position requires a Master of Science degree in engineering, computer science, or related disciplines with 6+ years of direct Project Management experience The position requires a Bachelor of Science in engineering, computer science, or related disciplines with 8+ years of direct Project Management experience Technical Skills (Required) Proven experience with project management concepts including project charters, scheduling and planning projects and successful completion Excellent interpersonal skills are required in order to deal with sensitive issues, develop others, or influence others inside and outside the department to take specific actions. Should have strong project management skills, team leadership skills, excellent communication skills, ability to multitask effectively, strong analytical and organizational skills. Previous agile training (spring planning, daily scrums, sprint, retrospective) (Desired) PMP certification preferred Certified Scrum Master (CSM) preferred Working knowledge Azure DevOps (formerly VSTS) highly desirable Knowledge of Confluence preferred Knowledge of Power BI is highly desirable Advance knowledge of Excel, MS PowerPoint, and MS Project Soft Skills (Required) Strong communication and presentation skills Disqualifiers/Red Flags: NO experience with Azure DevOps, if that is not clear and present on the resume, they will be DQ.",
        "source": "Email",
        "date_posted": "2024-10-21 20:42:35-05:00",
        "unique_id": "192b20648fca2455",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]