[
    {
        "company": "Avance consultancy",
        "job_title": "Project Manager",
        "location": "Santa Clara, CA, USA",
        "full_location": {
            "city": "Santa Clara",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "15+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "project program management",
                "enterprise level software application development",
                "Agile Scrum Master Certified",
                "CRM system implementation",
                "Agile traits and techniques"
            ],
            "primary": [
                "communication skills",
                "problem solving",
                "conflict resolution management",
                "time management",
                "interpersonal skills",
                "ServiceNow platform knowledge"
            ],
            "secondary": [
                "scrum of scrum principles",
                "Lean design",
                "customer involvement",
                "cross-functional team guidance",
                "risk management"
            ],
            "all": [
                "project program management",
                "enterprise level software application development",
                "Agile Scrum Master Certified",
                "CRM system implementation",
                "Agile traits and techniques",
                "communication skills",
                "problem solving",
                "conflict resolution management",
                "time management",
                "interpersonal skills",
                "ServiceNow platform knowledge",
                "scrum of scrum principles",
                "Lean design",
                "customer involvement",
                "cross-functional team guidance",
                "risk management"
            ],
            "with_experience": [
                "project program management",
                "enterprise level software application development",
                "CRM system implementation",
                "Agile traits and techniques"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Nandini",
        "email": "nandini.s@avanceservices.com",
        "jd": "From: Nandini, Avance consultancy nandini.s@avanceservices.com Reply to: nandini.s@avanceservices.com In order to be successful in this role, we need someone who has: SHOULD HAVE: 15+ years of project program management experience. SHOULD HAVE: at least 5 years dedicated to managing enterprise level software application development programs Demonstrated program management experience in implementing business support systems at enterprise level. Experienced in implementing CRM system for Enterprise Sales team. Should guide extended groups of senior professionals in a matrixed organization. Experienced in managing multiple scrums teams applying scrum of scrum principles and best practices. Extensive experience with Agile traits and techniques: Lean design, accommodating changing requirements, iterations, feedback loop with customer involvement. Should guide Steering Committee meetings, with executive management, with solid experience in decision making. Excellent communication skills, problem solving, conflict resolution management, active listening, time management and interpersonal skills. Demonstrate consistent ability to guide cross-functional teams and deliver technical solutions while mitigating or removing obstacles. Agile Scrum Master Certified. Knowledge and experience working in ServiceNow platform and technologies is a big plus. (1.) To drive value creation in the engagement, proactively identify and implement process enhancements, optimizing program efficiency through streamlined workflows. (2.) To build strong relationships with key Program Partners or Stakeholders and manage their interests for smooth integration and implementation of the program and achievement of its objectives. (3.) To optimize engagement profitability, strategically managing diverse variables, pinpointing improvement opportunities, and implementing targeted strategies to elevate overall project profitability. (4.) To proactively engage with the client to understand the business engagements (5.) To lead and inspire cross-functional teams, offering guidance and fostering collaboration for high-performance outcomes. (6.) To proactively identify, assess, and address risks, issues, and escalations by developing robust mitigation and contingency plans, ensuring seamless program delivery.",
        "source": "Email",
        "date_posted": "2024-10-21 15:01:18-05:00",
        "unique_id": "192b14b6e1c1449d",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]