[
    {
        "company": "Intelligenz",
        "job_title": "Supply Chain IT Business Analyst",
        "location": "Pittsburgh, PA, USA",
        "full_location": {
            "city": "Pittsburgh",
            "state": "PA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "5 to 10 years",
            "degree_required": "Bachelor's Degree in a related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Supply Chain Systems",
                "Transportation systems",
                "SQL scripting",
                "MS Office",
                "Jira"
            ],
            "primary": [
                "Manhattan TLM version 2014 or newer",
                "Confluence",
                "Linux OS",
                "IIBA Certification"
            ],
            "secondary": [
                "Visio",
                "gap analysis",
                "stakeholder engagement",
                "business requirements",
                "functional requirements",
                "non-functional requirements",
                "process improvements",
                "user training",
                "vendor management",
                "presentation skills"
            ],
            "all": [
                "Supply Chain Systems",
                "Transportation systems",
                "SQL scripting",
                "MS Office",
                "Jira",
                "Manhattan TLM version 2014 or newer",
                "Confluence",
                "Linux OS",
                "IIBA Certification",
                "Visio",
                "gap analysis",
                "stakeholder engagement",
                "business requirements",
                "functional requirements",
                "non-functional requirements",
                "process improvements",
                "user training",
                "vendor management",
                "presentation skills"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Mounika",
        "email": "mounika@intelligenzit.com",
        "jd": "From: Mounika, Intelligenz mounika@intelligenzit.com Reply to: mounika@intelligenzit.com Supply Chain IT Business AnalystLocation: Pittsburgh, PA (100% Onsite)Duration: 6 Months (Contract-To-Hire - Prefer GC/Citizens)Job SummaryAs a Sr. IT Business Analyst, Supply Chain Systems, you will be responsible for working with business units to determine and document the scope and requirements for new initiatives and oversee the work of other analysts assigned to the initiative. You will work with business unit Team Members and leadership to understand key business processes and develop, document and approve scope document and requirements. Job DescriptionExperience Required: 5 to 10 years Technology Business Analyst experience;Min of 5+ years as a Sr. BA;Experience managing small teams or project teamsExperience Needed: Supply Chain Systems experience, specifically Transportation systems (Manhattan TLM version 2014 or newer).Education Desired: Bachelors Degree in a related fieldCertification or Licensing Required: IIBA CertificationTechnical skills required: MS Office including Visio, and or Lucid, SQL scripting, Jira, Confluence and familiarity with Linux OS Job ResponsibilitiesCreate and document Business Requirements, gap analysis and support documents for projects related to the Supply Chain systems, specifically Transportation systems. (Manhattan TLM)Analyze and synthesize business and IT stakeholder requirements into actionable items.Facilitate stakeholder engagement through interviews, workshops, meetings, and/or training.Act as a liaison between business and technology groups, and at times, vendor partners.Provide initiative documentation as deemed necessary.Ensure business and system requirements are documented in the form of detailed functional and non-functional requirements and business designs, which meet industry best practices and are consumable for business teams, development, and testing.Provide operational support following the Client’s change management process.Research existing policies, procedures, methodologies and systems that support the current state and identify changes needed to support revised processes. Work with business and process engineering to identify and build process improvements into design.Utilize creative thinking to modify or select the most suitable procedure/approach that results in providing Pharmacy with optimum solutions to business, technology, and customer challengesLead requirement gathering and other sessions with Stakeholders, to capture the requirements and specifications.Using negotiating and facilitation skills, resolve issues across competing segments and channels to arrive at solutions that meet the needs of all stakeholders. Actively manage business teams expectations on the work package and the initiative overall where providing support.Work with the technology and business teams to ensure understanding of the business requirements, use cases and business designs, and obtain sign off on the various elements to ensure solution delivery is appropriate and meets the needs of the business.Support the work packages for the Development, Testing, Communication, Learning, and Implementation teams by conducting walkthroughs, providing clarification and facilitating issue resolution. Conduct user training.Meet business requests within budget, on time, and within acceptable quality levels. Manage assigned work packages against timelines and within scope and budget; make recommendations on corrective actions if work package deliverables are in jeopardy. Create change requests as required. Document and raise issues for resolution encountered during the requirements definition process.Work for consensus and contribute to achievement of team/group goals.Provide support in RFP process and vendor management.Work to provide continuous improvement of and ensure high level of quality in all deliverables, processes, and procedures.Create organized and professional presentation material for stakeholders, presenting recommendations in a logical, articulate, and influential manner. Facilitate and lead discussions as required, preparing documentation to record discussion and follow-up actions.",
        "source": "Email",
        "date_posted": "2024-10-21 09:31:16-05:00",
        "unique_id": "192afcd4c4d62568",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]