[
    {
        "company": "USG Inc.",
        "job_title": "Technical Project Manager",
        "location": "New York, NY, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "IBM Mainframe",
                "AWS",
                "Azure",
                "GCP",
                "COBOL",
                "Assembler",
                "JCL",
                "CICS",
                "Db2",
                "IMS"
            ],
            "primary": [
                "Project Management",
                "Agile",
                "Waterfall",
                "Azure DevOps",
                "Client Management"
            ],
            "secondary": [
                "Java",
                "C#",
                "Risk Management",
                "KPI Development",
                "PMP Certification"
            ],
            "all": [
                "IBM Mainframe",
                "AWS",
                "Azure",
                "GCP",
                "COBOL",
                "Assembler",
                "JCL",
                "CICS",
                "Db2",
                "IMS",
                "Project Management",
                "Agile",
                "Waterfall",
                "Azure DevOps",
                "Client Management",
                "Java",
                "C#",
                "Risk Management",
                "KPI Development",
                "PMP Certification"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Gaurav Sharma",
        "email": "gaurav.ks@usgrpinc.com",
        "jd": "From: Gaurav Sharma, USG Inc. gaurav.ks@usgrpinc.com Reply to: gaurav.ks@usgrpinc.com Hi, Hope you are doing great. Please go through the job description given below and if you are interested do share an updated word copy of your resume and best time to reach you over the phone. Position: Technical Project Manager Locations: New York, NY 10282 Duration: Contract Job Description: Lead and direct the migration project team as well as consulting and supporting the partner and client teams Lead and manage migrations from the mainframe to AWS, Azure, GCP, and Oracle Present information and demonstrate knowledge about IBM mainframe environments including COBOL, Assembler, copybooks, JCL, CICS, Db2, and IMS Deliver large scale 2+ year engagements with revenue exceeding $10M Build and nurture team, client, and partner relationships Expertly communicate and present information to Astadia, clients, and partners Follow and apply project methodology standards including Agile, Waterfall, and hybrid of Use Azure DevOps and similar tools for managing large project Qualifications: Superior client/partner consultative skills and experience in managing large-scale projects Superior communication and presentation skills Excellent leadership and relationship management skills and experience Planning and strategic – have developed programs that can accomplish a business's larger goal Risk management - the ability to recognize, measure, and mitigate the many risks that come KPIs - Be able to define metrics to track the quality, maintainability, and ways to improve metrics Experience working with large, Fortune 500-class companies Strong Technical Aptitude 10+ years of technical IBM Mainframe experience working on project/program management that aligns with the responsibilities of the position 3-5 years working in mainframe modernization to the cloud 2-5 Years working with AWS or Azure cloud environments Solid knowledge of legacy systems, programs, software, and environments Understanding and have worked with programming languages such as Cobol, Java, C#, and others Ability to assess and analyze the complexity of the technical design and guide the teams Experience in project management methodologies, preferably with a PMP/Agile/Waterfall Be able to pass background, credit, and drug tests based on Astadia, client, and partner policies and standards Desired Skills/Years of Experience: Project Management Professional (PMP) Certification Hands on Java Platform Thanks with regards, Gaurav Sharma | Sr. Technical Recruiter Email ID: gaurav.ks@usgrpinc.com",
        "source": "Email",
        "date_posted": "2024-10-21 15:47:32-05:00",
        "unique_id": "192b117f2af4d4f4",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]