[
    {
        "company": "Siriinfo",
        "job_title": "Project Manager with SAP Domain",
        "location": "Clark, NJ, USA",
        "full_location": {
            "city": "Clark",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "8+ years",
            "degree_required": "Bachelor’s degree in business management information technology, or related field.",
            "visa_sponsorship": "Must have existing work authorization",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SAP S/4HANA",
                "Project Management",
                "Communication",
                "Project Planning",
                "Stakeholder Management"
            ],
            "primary": [
                "Agile Project Management",
                "Data Migration",
                "Power BI",
                "VLOOKUPs",
                "Pivot Tables"
            ],
            "secondary": [
                "Fluency in French",
                "Experience in Fashion and Lifestyle Industry",
                "Customer-facing Skills",
                "Multicultural Team Collaboration",
                "Cutover and Testing Experience"
            ],
            "all": [
                "SAP S/4HANA",
                "Project Management",
                "Communication",
                "Project Planning",
                "Stakeholder Management",
                "Agile Project Management",
                "Data Migration",
                "Power BI",
                "VLOOKUPs",
                "Pivot Tables",
                "Fluency in French",
                "Experience in Fashion and Lifestyle Industry",
                "Customer-facing Skills",
                "Multicultural Team Collaboration",
                "Cutover and Testing Experience"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Dhirendra deo",
        "email": "dhirendra@siriinfo.com",
        "jd": "Job Description for PMO US NEO supporting SAP DomainAs a Project Manager for our complex global SAP S/4HANA project, you will play a critical role in ensuring the successful execution of this transformational initiative. We are seeking a mature, self-disciplined, and highly organized professional with SAP S4 Global Transformation experience (preferred) who is driven to deliver results. Your responsibilities will encompass various aspects of project management, including planning, execution, internal operational task management, and stakeholder communication and be a sparring partner with the Business Process Owner (BPO) for your domain (R2R, O2C Commerce, O2C Operations). This is a very complex global project with multiple consulting companies working together for the success of the client. This role will be more focused on the internal processes and activities to support the delivery and administrative activities to keep the project on track to the master plan. This is a heavy administrative focused role and requires a detailed person to keep activities on track to the master plan. This is a full-time role and travel is expected 3 days a week to Clark, NJ (EWR). In additional there may be a need to travel to Paris hence the candidate must have a passport and be able to obtain a work visa as travel to Paris will be required (about twice a year).Must currently live in the US, preferably the East Coast. Must be in possession of all relevant work Visas that do not expire within the next 3 years. Key Responsibilities:Your main person you will be collaborating will be the Business Process Owner. You will be their “right-hand” person whereas you will act as their stand-in and manage requests.Create and maintain a very detailed project plan for the workplan that encompasses all the Business Flow activities, incorporate the Data Migration milestones and activities needed to be executed by the Business Team, Test milestones and all relevant activities the Business Team needs to participate. Each activity should have assigned resources and defined timeline that is in alignment to the overall project plan.Drive execution within the Business Team on all activities/Deliverables, with diligent communication and escalation as needed. Take ownership by leading, guiding, and motivating the Domain team, driving results, providing appropriate support to the teams when needed, involving the BPOs, Leads and/or Program Directors.Consult on detailed plans for each phase, including forward looking activities and milestones of the workstream as it relates to the overall project with the BPO and the domain resources to ensure they are aware of what is next and are planning for these upcoming activities. Actively prepare executive summaries in PPT with fact driven content to support Domain status; performance tracking (Planned VS Actuals) against the established plans/milestones by using Power BI. (Ability to perform VLOOKUPs, and Pivot tables required.) Plan and schedule pre-meetings to ensure the messaging is in alignment with your BPO prior to presenting final version. Include talk track for the presentation. Proactively escalate any potential delays to the BPO and Project Leadership team along with possible mitigation plans both verbally during internal meetings and in documented emails. Propagating the Wipro/Rizing culture and the Values through actions and be a role model for the others in the project team to follow. Desired Qualifications:Excellent project planning skills at a high, medium, and very detailed level. (Appreciation of complex implementation of an integrated application).SAP Functional or Technical background is beneficial in R2R, O2C Commerce, O2C Operations.Exposure to the Fashion and Lifestyle Industry.Must have led projects with 10+ team members.Fluent in English with fluency in French being an added advantage.Experience working with international clients / teams.Excellent communication skills - verbal and written. Ability to articulate ideas and opinions to all stakeholders in an organized, concise and professional manner. Excellent customer-facing skills, highly engaging and able to spar with the client to have lively conversations about what is best, having a recommendation ready to share. Qualifications:Bachelor’s degree in business management information technology, or related field.Project Management certification (PMP) preferred.At least 8+years’ experience with SAP and large project implementations, preferred.4+ full life cycle SAP implementations, preferred. Proven experience in agile project management and project leadership.Excellent communication both verbal and written to all levels and stakeholder management skills.Ability to work effectively in a fast-paced and dynamic environment with multicultural teams, on a global project with flexibility for work hours to support global meetings.Strong business process acumen for retail, manufacturing, supply chain, Cost Center/ WBS and D2C business models.Experience in Cutover, Testing and Data Migration a plus. This is a very complex global project with multiple consultant companies working together for the success of the client. This role will be more focused on the internal processes and activities to support the delivery of the SAP S4 Domain.",
        "source": "Email",
        "date_posted": "2024-10-21 13:19:32-05:00",
        "unique_id": "192b06e993039118",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]