[
    {
        "company": "Pullskill Technologies Inc",
        "job_title": "Product Analyst Mid-Level",
        "location": "Marlborough, MA, USA",
        "full_location": {
            "city": "Marlborough",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5-10 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 months +",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Jira",
                "Confluence",
                "Analytical skills",
                "Strong interpersonal skills",
                "Verbal communication skills",
                "Written communication skills"
            ],
            "primary": [
                "Presentation skills",
                "Ability to drive conversations with cross-functional teams"
            ],
            "secondary": [
                "SAFe framework",
                "Agile delivery method",
                "Loss Prevention applications",
                "Genetec",
                "Appriss",
                "Retail industry knowledge",
                "Vendor management",
                "3rd party solutions"
            ],
            "all": [
                "Jira",
                "Confluence",
                "Analytical skills",
                "Strong interpersonal skills",
                "Verbal communication skills",
                "Written communication skills",
                "Presentation skills",
                "Ability to drive conversations with cross-functional teams",
                "SAFe framework",
                "Agile delivery method",
                "Loss Prevention applications",
                "Genetec",
                "Appriss",
                "Retail industry knowledge",
                "Vendor management",
                "3rd party solutions"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Tim Patten",
        "email": "tim@pullskill.com",
        "jd": "From: Tim Patten, Pullskill Technologies Inc tim@pullskill.com Reply to: tim@pullskill.com Job Title: Product Analyst Mid-Level Location: Marlborough/MA Duration: 12 months + What you’ll do The Loss Prevention (LP) Global Solution Delivery Team is responsible for managing solutions and technology that delivers capabilities to keep our associates and customers safe, preserve company assets, and provide business value. What you’ll need Our team is looking for people with a passion for delivering solutions, intellectual curiosity, and willingness to try new things.? We are a collaborative culture and looking for somebody who enjoys meeting with and learning about how technology solves problems for our retail business. Key Responsibilities Work to determine detailed requirements from key stakeholders for the team Contribute to the Loss Prevention team’s backlog refinement, including user story point estimation and testing considerations Articulate context around requirements and solutions, and work to build consensus within a stakeholder group Work with and support the product team to achieve iteration goals and objectives Ensure the functional integrity of the product/solution Minimum Qualifications (Requirements) 5-10 years’ experience as a Product Analyst and Business Analyst (no more than 10 years overall experience out of college) Jira and Confluence (required) Strong interpersonal, verbal, and written communication skills Presentation skills Analytical skills Ability to drive conversations with cross-functional teams Preferred Qualifications 1-3 years’ experience SAFe framework/Agile delivery method knowledge Experience in the Loss Prevention field Knowledge and experience with Loss Prevention applications oGenetec, Appriss or other Loss prevention software platforms Familiarity with the retail industry & best practices Experience working with vendors and 3rd party solutions Experience working in a retail environment is desirable Product Analyst vs Business Analyst: Scope and Focus: Business analysts are concerned with the business as a whole, while product analysts focus on the business's products. Role and Responsibilities: Business analysts collect customer requirements and help define actions, requirements, and designs. Product managers meet the needs of external customers. Skills: Business analysts have technical and statistical knowledge and documentation skills, while product managers act as a bridge between customers and the company.",
        "source": "Email",
        "date_posted": "2024-10-21 12:14:06-05:00",
        "unique_id": "192b058b2b605675",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]