[
    {
        "company": "Smart IT Frame",
        "job_title": "AWS Data Engineer",
        "location": "Newark, NJ, USA",
        "full_location": {
            "city": "Newark",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Bachelor's degree in Computer Science, Information Technology, or a related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Flask Python",
                "AWS EC2",
                "AWS Code Deploy",
                "Python 3.x",
                "AWS ECS",
                "AWS S3"
            ],
            "primary": [],
            "secondary": [
                "AWS Certified Solutions Architect",
                "AWS Certified Developer",
                "Python Certification"
            ],
            "all": [
                "Flask Python",
                "AWS EC2",
                "AWS Code Deploy",
                "Python 3.x",
                "AWS ECS",
                "AWS S3",
                "AWS Certified Solutions Architect",
                "AWS Certified Developer",
                "Python Certification"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Boopathy Rajan",
        "email": "boopathy@smartitframe.com",
        "jd": "From: Boopathy, Smart IT Frame boopathy@smartitframe.com Reply to: boopathy@smartitframe.com HiGreetings from Smart IT Frame, Hope you are doing well!!! Smart IT Frame specializes in enabling you with your most critical line of resources. Whether it’s for permanent staffing, contract staffing, contract-to-hire or executive search, we understand the importance of delivering the most suitable talent; on time and within budget. With our Core focus in emerging technologies, we have provided global technology workforce solutions in North America, Canada & India. We take pride in delivering specialized talent, superior performance, and seamless execution to meet the challenging business needs of customers worldwide. Role: AWS Data EngineerLocation: Newark, NJ(Hybrid)Experience: 10+Mode of Hiring – ContractShift timing: 9AM – 6PM Job summary : We are seeking a highly skilled Business Analyst with 10 years of experience to join our dynamic team. The ideal candidate will have strong technical expertise in Python 3.x, Flask Python, AWS S3, AWS ECS, AWS EC2, and AWS CodeDeploy. This hybrid role requires a proactive individual who can analyze business needs and translate them into technical solutions. The position operates on a day shift with no travel required. Required Skills : Flask Python, AWS EC2, AWS Code Deploy, Python 3.x, AWS ECS, AWS S3 Responsibilities : - Analyze business requirements and translate them into technical specifications. - Collaborate with stakeholders to gather and document business needs. - Develop and maintain Python scripts to automate business processes. - Utilize Flask Python to build and deploy web applications. - Manage and maintain AWS S3 buckets for data storage and retrieval. - Deploy and manage containerized applications using AWS ECS. - Oversee the configuration and management of AWS EC2 instances.- Implement continuous integration and deployment pipelines using AWS CodeDeploy. - Provide technical support and troubleshooting for deployed applications.- Conduct data analysis to identify trends and insights that drive business decisions. - Create detailed documentation of technical solutions and processes. - Ensure that all solutions adhere to best practices and industry standards. - Collaborate with cross-functional teams to deliver high-quality solutions. -Qualifications - Possess strong analytical and problem-solving skills. - Demonstrate proficiency in Python 3.x and Flask Python. - Have hands-on experience with AWS services including S3, ECS, EC2, and CodeDeploy. - Exhibit excellent communication and documentation skills.- Show ability to work effectively in a hybrid work model. - Display a proactive and self-motivated attitude. - Hold a Bachelors degree in Computer Science, Information Technology, or a related field. - Nice to have experience with other AWS services and DevOps practices. - Show capability to work collaboratively in a team environment.- Demonstrate strong organizational and time management skills.- Have a keen eye for detail and a commitment to quality.- Be adaptable to changing business needs and priorities. - Possess a continuous learning mindset and stay updated with industry trends. Certifications Required : AWS Certified Solutions Architect, AWS Certified Developer, Python Certification --Thanks and RegardsBoopathy Rajan STalent Acquisition GroupEmail: boopathy@smartitframe.comSmart IT Frame LLC.",
        "source": "Email",
        "date_posted": "2024-10-21 10:54:32-05:00",
        "unique_id": "192afecebc9bf43f",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]