[
    {
        "company": "Comcast Corporation",
        "job_title": "Java/DevOps Engineer",
        "location": "Philadelphia, PA, USA",
        "full_location": {
            "city": "Philadelphia",
            "state": "PA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "8+ years",
            "degree_required": "B.Sc. in Computer Science or related Engineering",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long-term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "DevOps",
                "SaaS",
                "PaaS",
                "CI/CD",
                "IoT",
                "Agile"
            ],
            "primary": [
                "Python",
                "AWS",
                "Microservices",
                "Distributed Systems",
                "Network Security"
            ],
            "secondary": [
                "Golang",
                "JavaScript (NodeJS)",
                "Relational Databases",
                "No-SQL Solutions",
                "Technical Communication"
            ],
            "all": [
                "Java",
                "DevOps",
                "SaaS",
                "PaaS",
                "CI/CD",
                "IoT",
                "Agile",
                "Python",
                "AWS",
                "Microservices",
                "Distributed Systems",
                "Network Security",
                "Golang",
                "JavaScript (NodeJS)",
                "Relational Databases",
                "No-SQL Solutions",
                "Technical Communication"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Fahad Ali",
        "email": "fahad.ali@panzersolutions.com",
        "jd": "From: Fahad Ali, Panzer Solutions fahad.ali@panzersolutions.com Reply to: fahad.ali@panzersolutions.com Job Title: Java/DevOps Engineer Duration: Long-term Contract Location: Philadelphia, PA - Onsite Client: Comcast Corporation THE RESUME MUST CLEARLY DEMONSTRATE PROVEN EXPERIENCE IN Java, DevOps, SaaS, PaaS, CI/CD, IoT, and Agile, With These Keywords Mentioned Multiple Times. IF THESE SKILLS ARE NOT PRESENT IN THE RESUME, PLEASE DON’T SEND THE RESUME! Responsibilities:• Creation, management and operation of a diverse set of Dev-Ops-related tools, processes, paradigms and technologies that enable the creation and ongoing operation of the Signify IoT Platform.• Focus on the creation of horizontal tools, technologies and best-practices that enable and support all the IoT Platform engineering teams to build, debug, test, release, manage and secure the IoT Platform’s modern, microservices-based cloud infrastructure.• Collaborate in defining the methodologies and ways-of-working that will enable our fast-paced engineering teams to flourish as we collectively build-out the IoT Platform. You will help promote and implement best practices and supporting tools/technologies for source control management, CI and CD architectures, performance, SLAs, security, audit and monitoring that will be used by every engineer within the IoT Platform organization.• Define common frameworks and software libraries, in various programming languages, that support the creation of efficient, scalable and highly available microservice-based architectures.• Support with the management of the running IoT Platform system architecture. You will troubleshoot issues and identify areas for continuous improvement with a particular emphasis on quality, performance and security.• Work closely with architects and technical product managers and other members of your team to translate overall system architecture and product requirements into well-designed, implemented and tested software solutions.• Work in an Agile environment to deliver high-quality software in an incremental manner.• Help promote the adoption of best-in-class software engineering practices, frameworks, and tools. You are providing guidance and feedback to other software developers. Experience:• B.Sc. in Computer Science or related Engineering is required, a Master’s degree is desirable• 8+ years of proven, hands-on track-record as a software engineer, focused on cloud-based systems • Mastery of a variety of programming languages – at least Java, Python, but knowledge of Golang or JavaScript (NodeJS) are desirable. You must have strong Java Development skills, preferably with Ver. 1.8 • Proven track record developing cloud-based services (SaaS) and platforms (PaaS) • Proven hands-on in-depth experience of AWS is required, both in terms of traditional technologies (e.g. EC2, S3, DynamoDB, RDS, …) as well as more recent cutting-edge paradigms (e.g. Lambda, API Gateway, Fargate, …).• Proven experience of developing microservices and complex microservice-based platform architectures • Excellent understanding of distributed systems, designing for scalability, performance and availability • Experience of establishing non-functional best-practices and deploying supporting technologies for improving platform security (including audit) and reliability (latency, availability, scalability) • Knowledge of distributed network architectures and network security is required • Good knowledge of data persistence technologies including relational databases and no-SQL solutions • Excellent interpersonal and technical communication with peers, and non-peers alike, with a can-do attitude • 3+ years in teams applying modern agile software development practices #LI-FM Fahad Ali Talent Acquisition Specialist | www.panzersolutions.com E: fahad.ali@panzersolutions.com A: Panzer Solutions LLC, 50 Washington St 9th Floor, Norwalk, CT 06854",
        "source": "Email",
        "date_posted": "2024-10-21 15:58:05-05:00",
        "unique_id": "192b0ffc39eaa938",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]