[
    {
        "company": "CareFirst- BCBS",
        "job_title": "Product Owner / Business Analyst (Generative AI)",
        "location": "Reston, VA, USA",
        "full_location": {
            "city": "Reston",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "4 years",
            "degree_required": "Bachelor's degree in Computer Science is preferred, not required",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Generative AI",
                "Agile Scrum",
                "Product Backlog Management",
                "User Stories",
                "Data Analysis"
            ],
            "primary": [
                "AI concepts",
                "Machine Learning",
                "Software Development Lifecycle (SDLC)",
                "Product Lifecycle Management (PLM)",
                "Jira"
            ],
            "secondary": [
                "Chat GPT experience",
                "Healthcare Payor domain experience",
                "Scrum certifications",
                "Product Owner certifications",
                "Jira Align"
            ],
            "all": [
                "Generative AI",
                "Agile Scrum",
                "Product Backlog Management",
                "User Stories",
                "Data Analysis",
                "AI concepts",
                "Machine Learning",
                "Software Development Lifecycle (SDLC)",
                "Product Lifecycle Management (PLM)",
                "Jira",
                "Chat GPT experience",
                "Healthcare Payor domain experience",
                "Scrum certifications",
                "Product Owner certifications",
                "Jira Align"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "praveen kumar",
        "email": "praveenk@largeton.us",
        "jd": "From: praveen kumar, Largeton inc praveenk@largeton.us Reply to: praveenk@largeton.us Title- Product Owner / Business Analyst (Generative AI)Client- CareFirst- BCBSLocation- Hybrid (1-2x per month, Reston office)Duration- 6+ Months Visa- USC, GC Candidates ONLY from Wash DC, MD, VA with local id or dl Our client has an immediate job opportunity for a Product Owner/Business Analyst who has a minimum of 1 year of Generative AI experience. The selected candidate will be working with the scrum team, scrum master, external and internal project stakeholders, and management team on their digital AI Chat GBT product development effort. The selected candidate will drive value to the business by building, managing, and maintaining a Product Backlog in collaboration with IT teams. Represents the business to the team, and defines business purpose and value for them. Defines the details of what is to be done and the overall scope of the project for the product offering. Ensures that acceptance criteria are well-defined. Plays a key role in shaping the product direction, creating the feature(s), writing user stories, and innovating collaboratively through Joint Application Development (JAD) and other brainstorming sessions.ESSENTIAL FUNCTIONS:-- 25% Develops and aligns the Product Roadmap to strategic goals by working with customers, both internal and external, as well as Stakeholders to analyze and document both business and technology needs.-- 25% Engages with the Agile development team in defining and maintaining Product Backlog epics and breaking them into features, user stories and acceptance criteria.-- 10% Informs business decisions by drafting key objectives and results, strategies, and ensures appropriate levels of data is optimized by and through the product.-- 10% Partners with product management and senior management to create, implement, and adjust the product to fit the company portfolio; represents the team while managing business with clients, users, and stakeholders.-- 10% Communicates the business' product needs to technologists, internal and external business partners, and is held accountable for the functionality and the adoption of the created product.-- 10% Articulates the value proposition to clients, internal and external business partners, and key stakeholders.-- 5% Researches and analyzes product roadmap, market, and users.-- 5% Helps advocate for and broaden team understanding of Agile methods, knowledge of new technologies and trends.Required SkillsRequired Skills- Bachelors degree in Computer Science is preferred, not required- 4 years as a Product Owner supporting a digital product within an Agile Scrum environment- 1+ years experience with Generative AI (secondarily can be standard AI / Machine Learning).- Knowledge of AI concepts, machine learning models, and data analysis to effectively communicate with technical teams and understand the product's capabilities and limitations.- Familiarity with data sourcing, curation, and ethical considerations in using data for training AI models, ensuring compliance with regulations and best practices.- Strong Software Development Lifecycle (SDLC) and Product Lifecycle Management (PLM) knowledge- Able/willing to create/write/maintain Jira stories in support of Business Analysis functions.- Jira Align - Big Plus-Must have outstanding writing and verbal communications skills for BA related functions and leading product team conversationsPreferred:-Chat GPT experience-Healthcare Payor domain experience-Any sort of Scrum and/or Product Owner related certifications",
        "source": "Email",
        "date_posted": "2024-10-17 08:41:45-05:00",
        "unique_id": "1929ad93a13bae7b",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]