[
    {
        "company": "Atvsllc",
        "job_title": "SAP project manager",
        "location": "San Antonio, TX, USA",
        "full_location": {
            "city": "San Antonio",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "5-7 years",
            "degree_required": "Bachelor’s degree in information technology, Business Administration, Project Management, or a related field. A master’s degree is a plus.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SAP SuccessFactors",
                "Project Management",
                "Cloud-based ERP solutions",
                "Risk Management",
                "Communication Skills"
            ],
            "primary": [
                "PMP",
                "PRINCE2",
                "SAP Activate",
                "Planview PPM Pro",
                "Microsoft Project",
                "JIRA",
                "GitHub",
                "Zephyr",
                "HP Quality Center"
            ],
            "secondary": [
                "Organizational Change Management",
                "Analytical Skills",
                "Adaptability",
                "Interpersonal Skills",
                "Leadership Skills"
            ],
            "all": [
                "SAP SuccessFactors",
                "Project Management",
                "Cloud-based ERP solutions",
                "Risk Management",
                "Communication Skills",
                "PMP",
                "PRINCE2",
                "SAP Activate",
                "Planview PPM Pro",
                "Microsoft Project",
                "JIRA",
                "GitHub",
                "Zephyr",
                "HP Quality Center",
                "Organizational Change Management",
                "Analytical Skills",
                "Adaptability",
                "Interpersonal Skills",
                "Leadership Skills"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Pavankalyan",
        "email": "pavankalyan.p@atvsllc.com",
        "jd": "From: Pavankalyan, Atvsllc pavankalyan.p@atvsllc.com Reply to: pavankalyan.p@atvsllc.com JD;Job Title: SAP project manager Location: San Antonio TX -Onsite Job Description: Skills and Qualifications for Project Manager: 1. Educational Background: o bachelor’s degree in information technology, Business Administration, Project Management, or a related field. A master’s degree is a plus. o PMP, PRINCE2, or similar project management certification preferred. 2. Experience: o Minimum of 5-7 years of experience in IT project management, focus on SAP technology implementations. o Proven experience leading at least one full-cycle SAP SuccessFactors implementation. o Experience working with system integrators in a project management capacity highly desirable. o Experience with SAP Activate or other SAP implementation methodologies. o Experience in the public sector or a highly regulated environment a plus. 3. Technical Skills: o In-depth knowledge of SAP SuccessFactors modules, particularly Employee Central, Employee Central Service Center, Work Zone, and Learning Management o Strong understanding of cloud-based ERP solutions and integration with other enterprise systems (e.g., SAP ECC, payroll systems). o Proficiency in project management tools (e.g., Planview PPM Pro, Planview Project Place, Microsoft Project, JIRA, or equivalent). o Proficiency in testing tools (i.e. GitHub, Zephyr, HP Quality Center ) 4. Project Management Skills: o Excellent planning, organizational, and leadership skills, with the ability to manage multiple tasks and priorities. o Strong risk management and problem-solving abilities. o Experience in managing large project budgets and resource allocation. 5. Communication and Interpersonal Skills: o Excellent verbal and written communication skills, with the ability to communicate complex technical concepts to non-technical stakeholders. o Strong interpersonal skills, with the ability to build relationships and influence stakeholders at all levels of the organization. o Ability to facilitate meetings and workshops with diverse stakeholders. 6. Change Management: o Familiarity with Organizational Change Management principles and practices. o Experience in supporting change management efforts during technology implementations. 7. Analytical and Problem-Solving Skills: o Ability to analyze complex problems, identify root causes, and develop effective solutions. o Strong attention to detail and commitment to delivering high-quality results. 8. Adaptability: o Ability to adapt to changing project requirements and manage ambiguity. o Demonstrated ability to work in a fast-paced, dynamic environment.",
        "source": "Email",
        "date_posted": "2024-10-17 10:14:03-05:00",
        "unique_id": "1929b2c68ce1b7fc",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]