[
    {
        "company": "Vyzeinc",
        "job_title": "C# MOBILE DEVELOPER WITH REACT",
        "location": "West Palm Beach, FL, USA",
        "full_location": {
            "city": "West Palm Beach",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "2-3 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Must have existing work authorization",
            "notice_period": "Not specified",
            "duration": "6 Months Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "C#",
                ".NET framework",
                "React",
                "RESTful APIs",
                "HTML",
                "CSS",
                "JavaScript",
                "TypeScript"
            ],
            "primary": [
                "Mobile Application Development",
                "SQL Server",
                "Oracle",
                "Git"
            ],
            "secondary": [
                "Cloud environment (preferably Azure)",
                "CI/CD pipelines",
                "DevOps practices",
                "Problem-solving",
                "Communication",
                "Teamwork"
            ],
            "all": [
                "C#",
                ".NET framework",
                "React",
                "RESTful APIs",
                "HTML",
                "CSS",
                "JavaScript",
                "TypeScript",
                "Mobile Application Development",
                "SQL Server",
                "Oracle",
                "Git",
                "Cloud environment (preferably Azure)",
                "CI/CD pipelines",
                "DevOps practices",
                "Problem-solving",
                "Communication",
                "Teamwork"
            ],
            "with_experience": [
                "C# (2-3 years)",
                ".NET framework",
                "React",
                "Mobile Application Development"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Jayashree Biswal",
        "email": "jbiswal@vyzeinc.com",
        "jd": "From: Jayashree Biswal, Vyzeinc jbiswal@vyzeinc.com Reply to: jbiswal@vyzeinc.com Title: C# MOBILE DEVELOPER WITH REACT Duration: 6 Months Contract Location: WEST PALM BEACH, FL(Hybrid)(Need Local) Visa: USC/GC Need LinkedIn(Must) C# MOBILE DEVELOPER WITH REACT (NOT ANGULAR). MUST ALREADY BE LOCAL TO S. FLORIDA, NO RELO PLEASE SEND WITH CURRENT LOCATION 2-3 year contract!!! Job Description: We are seeking a highly skilled and experienced Full Stack .NET Developer who is proficient in developing applications using the React framework. The ideal candidate will have extensive experience in developing and deploying both web and native mobile applications for iOS and Android platforms. This role requires a passion for developing innovative software solutions, a deep understanding of full stack development, and the ability to work in a dynamic and collaborative environment. Key Responsibilities: Full Stack Development: Design, develop, and maintain scalable web applications using .NET framework and React. Work on both front-end (React, HTML, CSS, JavaScript, Typescript) and back-end (.NET, C#) components of the application, ensuring seamless integration, high performance, and scalability. Mobile Application Development: Develop, test, and deploy native mobile applications for iOS and Android platforms. Optimize mobile applications to achieve maximum performance, scalability, and an excellent user experience. Experience managing the process of deploying mobile applications to the Apple App Store and Google Play Store, including understanding of app submission guidelines and requirements. API Integration: Design, develop, and maintain RESTful APIs to support both web and mobile applications. Ensure seamless integration of third-party services and APIs into applications. Testing & Debugging: Write unit, integration, and end-to-end tests to ensure code quality and application reliability across web and mobile platforms. Identify and fix bugs and performance bottlenecks across applications. Documentation: Create and maintain comprehensive documentation for both technical and non-technical stakeholders. Provide technical support and training to internal development teams as needed. Qualifications: Technical Skills: Proficient in C# and .NET framework. Strong experience with the React framework for building responsive and dynamic web applications. Experience in developing native mobile applications for iOS and Android using .Net Framework or React Native. Strong understanding of RESTful APIs and web services integration. Proficiency with front-end technologies such as HTML, CSS, JavaScript, and TypeScript. Experience with databases such as SQL Server and Oracle. Familiarity with version control, Preferably Git. Experience: Proven track record of developing and deploying successful web and mobile applications for a mid to large organization. Soft Skills: Strong problem-solving skills and ability to work independently. Excellent communication and teamwork abilities. Ability to manage multiple tasks and projects simultaneously. Preferred Qualifications: Experience with deploying and managing applications in a cloud environment, preferably Azure. Knowledge of CI/CD pipelines and DevOps practices, particularly in the context of both web and mobile application development.",
        "source": "Email",
        "date_posted": "2024-10-17 18:17:27-05:00",
        "unique_id": "1929ce6118ddd76e",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]