[
    {
        "company": "Nukasani Group",
        "job_title": "Sr Java developer with Python, Go experience",
        "location": "Richardson, TX, USA",
        "full_location": {
            "city": "Richardson",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "BS/MS degree in Computer Science/Computer Engineering or equivalent engineering discipline/experience",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Best competitive rate"
        },
        "skills": {
            "core": [
                "Java",
                "Python",
                "Go",
                "Linux",
                "Microservices"
            ],
            "primary": [
                "Software Development",
                "Distributed Systems",
                "REST",
                "Docker",
                "Kubernetes",
                "Agile Development"
            ],
            "secondary": [
                "Kafka",
                "MongoDB",
                "Elasticsearch",
                "Grafana",
                "Splunk"
            ],
            "all": [
                "Java",
                "Python",
                "Go",
                "Linux",
                "Microservices",
                "Software Development",
                "Distributed Systems",
                "REST",
                "Docker",
                "Kubernetes",
                "Agile Development",
                "Kafka",
                "MongoDB",
                "Elasticsearch",
                "Grafana",
                "Splunk"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Bhavani",
        "email": "recruitment@nukasanigroup.com",
        "jd": "Dear Partner,Good Morning ,GreetingsfromNukasanigroupInc!,Wehavebelowurgentlongtermcontractprojectimmediatelyavailable for**Sr Java developer, with Python, Go experience Richardson, TX** need submissions you please review the below role, if you are available, could you please send me updated word resume, and below candidate submission format details, immediately. If you are not available, any referrals would be greatly appreciated.Interviews are in progress, urgent response is appreciated. Looking forward for your immediate response and working with you. **Candidate Submission Format - needed from you**Full Legal NamePersonal Cell No ( Not google phone number)Email IdSkype IdInterview AvailabilityAvailability to start, if selectedCurrent LocationOpen to RelocateWork AuthorizationTotal Relevant ExperienceEducation./ Year of graduationUniversity Name, LocationLast 4 digits of SSNCountry of BirthContractor Type DOB: mm/dd Home Zip CodeAssigned Job DetailsJob Title : Sr Java developer with Python, Go experienceLocation: Richardson, TXRate : Best competitive rateReq: Sr Java developer with Python, Go exp mustLocation: San Jose, CA, Richardson, TX, Irving, TX, Basking Ridge, NJ, Bedminster, NJ, and Branchburg, NJVisa: H1B, H4 EAD, GC, USC, GC EAD & H1B Transfers. Note: Please share your resume as per JD and skill, if some skills missing, request the consultant to update which helps the resume to get shortlisted easily. JOB DESCRIPTION:The SDN Planning group under the Client Network Technology and Planning organization is looking for a self-motivated and innovative-thinking senior software engineering consultant in support of client SDN architecture and technology development and deployment. As a software consultant, you will be interacting with software engineers, network/system operations staff, and network/system architects to keep our service relevant in the marketplace in the fast-moving and quickly evolving networking industry. Proactive technology research, software development, problem-solving mindset, developing next-generation network architecture using modern networking technology (e.g., Software Defined Networking), and providing production deployable solutions are key functions of the team.MUST HAVE SKILLS:• 10+ years of hands on software development experience including design, development, debugging and support, building scalable software systems and software infrastructure.• Experience with programming languages (Java, Python,Go) and software debugging tools ( jdb, jmx)• In-depth understanding of scale out infrastructure, distributed systems and web services technologies.• Experienced in designing and applying data structures, algorithms, and object-oriented concepts to solve challenging problems• Experience working with ODL, REST, RESTCONF and RPC services and other client/server models• Building and delivering mission critical, 24x7 production quality software systems• Transforming the monolithic software systems into micro service-oriented software systems• Experience in Linux environments with Linux automation scripting and/ or software development (Ansible, Python, Bash)• Experience with Linux networking & virtualization environments/technologies (KVM, containers) and container scheduling/management platforms (Docker, Kubernetes)• Open Source tools development, implementation, and/or collaboration experience• Strong problem-solving skills, ability to analyze and implement enhancements to existing applications/code• Strong written & verbal communication skillsDESIRED SKILLS:• Experience using source code tracking and version control systems (Stash/GIT/GitLab)• Experience in an agile development environment as part of a team of engineers, developers and testers• Experienced in integrating and developing messaging infrastructures (kafka, thrift, proto-buf)• Experience with open source logging and reporting solutions (Logstash, Elasticsearch, Kibana, Grafana, Splunk)• Database development experience (MongoDB, Redis, Cassandra, SQL/NoSQL)• Open API (REST/RESTCONF/NETCONF) and data modeling (YANG) verification and development• New technology validation, prototyping and integration experience• Multi-vendor system integration experience• Developing applications using microservice architecture• High Availability and distributed software architecture development & design• ODL (Open-Day-Light) controller internals and experience in developing ODL applications• Understanding of SDN architecture and technology (control plane, data plane, management plane, orchestration, etc.)EDUCATION/CERTIFICATIONS:• BS/MS degree in Computer Science/Computer Engineering or equivalent engineering discipline/experience",
        "source": "Email",
        "date_posted": "2024-10-16 23:41:02-05:00",
        "unique_id": "19298e7fda855565",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]