[
    {
        "company": "Vyze1 inc",
        "job_title": "Senior WebSphere & Portal Java Developer",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "8 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "8 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "WebSphere",
                "Portal Development",
                "JSF",
                "Myfaces",
                "Struts",
                "HCL Portal Server 9.5",
                "IBM WebSphere Application Server 9.x",
                "Hibernate",
                "Spring Framework",
                "Java",
                "J2EE"
            ],
            "primary": [
                "SQL",
                "PLSQL",
                "JavaScript frameworks",
                "Dojo",
                "jQuery",
                "HTML",
                "CSS",
                "Ajax",
                "RESTful services"
            ],
            "secondary": [
                "SQL Development",
                "Oracle database development"
            ],
            "all": [
                "WebSphere",
                "Portal Development",
                "JSF",
                "Myfaces",
                "Struts",
                "HCL Portal Server 9.5",
                "IBM WebSphere Application Server 9.x",
                "Hibernate",
                "Spring Framework",
                "Java",
                "J2EE",
                "SQL",
                "PLSQL",
                "JavaScript frameworks",
                "Dojo",
                "jQuery",
                "HTML",
                "CSS",
                "Ajax",
                "RESTful services",
                "SQL Development",
                "Oracle database development"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Sam",
        "email": "slenka@vyzeinc.com",
        "jd": "Job Description -Senior WebSphere / Portal Java Developer Gov CLient: Real Time Visa Must have active linkedIn with Profile photoOur client, a leading Government Systems Integrator, is in need of a Senior WebSphere / Portal Java Developer for an initial 8 month remote contract opportunity. The Senior WebSphere / Portal Java Developer will be supporting an enterprise development initiative within the Dept. of Education. They will be responsible for reviewing and understanding the existing IBM portal Themes and Skins, designing, developing and testing new HCL portal Themes and Skins, reviewing the existing IBM JSF1.x implementation of portals, designing and migrating IBM JSF1.X portlets to Myfaces (Apache), integrating Myfaces with new HCL portal Themes and Skins, review existing Struts Implementation, develop a POC for migrating Struts1 / Struts2 applications to the latest version and integrating with new Themes and Skins, as well as help to deploy applications to HCL Portal Server 9.5 and WebSphere Application Server 9.x Required Skills:Minimum of 8 years of experience in enterprise software development.Prior experience supporting enterprise government programs.Experience as a Portal Developer with a focus on Portlets, Themes and Skins.Experience designing and developing web applications using JSF, Myfaces and Struts.Experience designing and developing web applications using HCL Portal Server 9.5 / IBM WebSphere Application Server 9.x.Experience with Web Application Migration of Struts, JSF and Portlets to the latest version.Working knowledge of WebSphere Portal Server, WebSphere Content Management and Portlets JSR168 and JSR286.Experience with Hibernate and Spring Framework.Experience with Java and J2EE development using IBM Rational Application Developer for WebSphere (RAD).Knowledge of SQL, PLSQL 7.Proficient in JavaScript frameworks, Dojo and jQuery. Experience with HTML, CSS, Ajax, including developing or working with services, specifically RESTful.Desired Skills:SQL Development experience or exposure to Oracle database development.",
        "source": "Email",
        "date_posted": "2024-10-17 14:47:01-05:00",
        "unique_id": "1929cfd022875171",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]