[
    {
        "company": "Resource Logistics",
        "job_title": "Java backend Developer",
        "location": "Irving, TX, USA",
        "full_location": {
            "city": "Irving",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "12+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Spring Boot",
                "API development",
                "MongoDB",
                "Cassandra"
            ],
            "primary": [
                "Object-Oriented Design",
                "Object-Oriented Analysis",
                "Object-Oriented Programming",
                "SOAP",
                "Restful web services",
                "Oracle",
                "DB2",
                "SQL Server",
                "Agile methodologies"
            ],
            "secondary": [
                "Good Communication skills",
                "Stakeholder management",
                "Technical guidance",
                "Code reviews",
                "Quality assurance",
                "Performance optimization"
            ],
            "all": [
                "Java",
                "Spring Boot",
                "API development",
                "MongoDB",
                "Cassandra",
                "Object-Oriented Design",
                "Object-Oriented Analysis",
                "Object-Oriented Programming",
                "SOAP",
                "Restful web services",
                "Oracle",
                "DB2",
                "SQL Server",
                "Agile methodologies",
                "Good Communication skills",
                "Stakeholder management",
                "Technical guidance",
                "Code reviews",
                "Quality assurance",
                "Performance optimization"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Shayista Sultan",
        "email": "shayista@resource-logistics.com",
        "jd": "From: shayista sultan, resource logistics shayista@resource-logistics.com Reply to: shayista@resource-logistics.com Java backend DeveloperLocation: Irving, TX Hybrid Contract please share locals candidates only.there will be a face to face interview Minimum 12 + years of experienceShould be Strong API development , Databases experience like MongoDB, Cassandra.7- 10 yrs. Hands experience in java backend and API development Hands on Experience in Java based technologies Java, Spring boot. Experienced in Java Web-based, Desktop Based Development with Concepts of Object-Oriented Design (OOD), Object Oriented Analysis (OOA), Object Oriented Programming (OOP) and its implementation. Experience in developing Web Services to expose useful functionality to web users through SOAP and Restful web service calls. Experience in the use of various relational databases like Oracle, DB2, SQL Server and NoSQL databases like MongoDB, Cassandra. Experienced working Agile based development environment participating in SCRUM sessions. Willing to work from Customer location Irving Tx. Good Communication skill and Stake holder management(1.) To be responsible for providing technical guidance to a team of developers, enhancing their technical capabilities and increasing productivity.(2.) To conduct comprehensive code reviews, establish and oversee quality assurance processes, performance optimization , implementation of best practices and coding standards to ensure succeful delivery of complex projects.(3.) To ensure process compliance in the assigned module, and participate in technical discussionsorreview as a technical consultant for feasibility study (technical alternatives, best packages, supporting architecture best practices, technical risks, breakdown into components, estimations).(4.) To collaborate with stakeholders to define project scope, objectives, deliverables and accordingly prepare and submit status reports for minimizing exposure and closure of escalations",
        "source": "Email",
        "date_posted": "2024-10-17 10:55:31-05:00",
        "unique_id": "1929b517b470e881",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]