[
    {
        "company": "Incom Technologies Inc",
        "job_title": "Support Services Project Manager",
        "location": "Baton Rouge, LA, USA",
        "full_location": {
            "city": "Baton Rouge",
            "state": "LA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Proven experience as a Project Manager in IT projects",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$75/hr on c2c"
        },
        "skills": {
            "core": [
                "Project Management",
                "Process Monitoring",
                "Documentation",
                "Risk Mitigation",
                "Cost-Benefit Analysis"
            ],
            "primary": [
                "IT Services Management",
                "Operations Management",
                "Stakeholder Management",
                "Project Management Tools (MS Project, Jira)",
                "Cross-Functional Collaboration"
            ],
            "secondary": [
                "Government Procurement Laws",
                "Leadership Skills",
                "Communication Skills",
                "Multi-Project Management"
            ],
            "all": [
                "Project Management",
                "Process Monitoring",
                "Documentation",
                "Risk Mitigation",
                "Cost-Benefit Analysis",
                "IT Services Management",
                "Operations Management",
                "Stakeholder Management",
                "Project Management Tools (MS Project, Jira)",
                "Cross-Functional Collaboration",
                "Government Procurement Laws",
                "Leadership Skills",
                "Communication Skills",
                "Multi-Project Management"
            ],
            "with_experience": [
                "Project Management",
                "IT Services Management",
                "Operations Management"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "komal",
        "email": "komal@incom-tech.net",
        "jd": "From: komal, Incom Technologies Inc komal@incom-tech.net Reply to: komal@incom-tech.net Hi Role: Support Services Project ManagerClient :State of LALocation : OnsiteRate :$75/hr on c2c NOTE : CANDIDATES SHOULD BE LOCAL TO LOUISIANAProject OverviewIn an effort to digitize the agency’s file rooms, LA Dept. of Energy and Natural Resources is looking for consulting services to perform an assessment of their current practices and develop an actionable roadmap to effectively digitize the paper files and store the documents into a repository that will allow users throughout the agency to have access. Data gathering sessions will need to be performed with multiple agency departments and regional offices. The current process involves desktop scanning, indexing and storing documents into the Oracle document repository. After scanning, documents are available for public viewing using the Sunrise application. Physical documents are boxed and shipped to La. State Archives after scanning. A small portion of the documents that need to be scanned require an oversize scanner. LDENR wants to set up a centralized scanning location for all paper documents to get processed. The centralized scanning will be to process the file room documents as well as any new documents that the agency needs to archive.Duties/Responsibilities• Provide day-to-day project management support.• Activity and resource planning.• Creation of project documentation: daily, weekly, semi-monthly and monthly status reports; project schedules and plans, meeting minutes, risks and issues, other documentation as needed.• Analyzing project risks and issues, help identify ways to mitigate risks.• Process monitoring.• Monitor project deliverables.• Provide day-to-day support for on-going processes.• Provide on-going evaluation and improvements for processes; work in needed areas to provide support services for the agency's workload demands.• Documentation of specifications and requirements tracking.• Conduct cost/benefit analysisRequired Experience• Proven experience as a Project Manager in IT projects, with a focus on support services and operations management.• Experience in process monitoring and improvement strategies within government or public sector organizations.• Ability to create comprehensive project documentation including schedules, status reports, risks, and issue tracking.• Strong knowledge of cost-benefit analysis techniques and risk mitigation strategies.• Experience in managing both internal teams and external stakeholders, including vendors and contractors.• Proficiency in using project management tools such as MS Project, Jira, or similar software.• Familiarity with State procurement laws and regulations.• Demonstrated ability to manage multiple projects simultaneously and deliver them on time and within budget.• Excellent communication and leadership skills, with a focus on cross-functional collaboration.• Experience in IT services management, operations, and support within large organizations",
        "source": "Email",
        "date_posted": "2024-10-17 13:10:39-05:00",
        "unique_id": "1929bcd32b6d2013",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]