[
    {
        "company": "Tek Inspirations LLC",
        "job_title": "Performance Framework Engineer",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "3 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Performance Testing",
                "Performance Framework Development"
            ],
            "primary": [
                "Python",
                "Loadrunner",
                "JMeter",
                "Ansible",
                "Puppet",
                "Oracle SQL",
                "MongoDB",
                "Jenkins",
                "XLR",
                "XLD",
                "Apache Kafka",
                "OpenShift",
                "Microservices"
            ],
            "secondary": [
                "Object-oriented analysis and design",
                "Integrated Development Environments (IntelliJ, VSCode, Eclipse)",
                "Version Control (Git)",
                "Build tools (Gradle, Maven, Ant)",
                "Code review processes",
                "Static analysis tools",
                "Continuous delivery tools",
                "Podman"
            ],
            "all": [
                "Java",
                "Performance Testing",
                "Performance Framework Development",
                "Python",
                "Loadrunner",
                "JMeter",
                "Ansible",
                "Puppet",
                "Oracle SQL",
                "MongoDB",
                "Jenkins",
                "XLR",
                "XLD",
                "Apache Kafka",
                "OpenShift",
                "Microservices",
                "Object-oriented analysis and design",
                "Integrated Development Environments (IntelliJ, VSCode, Eclipse)",
                "Version Control (Git)",
                "Build tools (Gradle, Maven, Ant)",
                "Code review processes",
                "Static analysis tools",
                "Continuous delivery tools",
                "Podman"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Muskan Yadav",
        "email": "muskan.yadav@tekinspirations.com",
        "jd": "From: Muskan Yadav, Tek Inspirations LLC muskan.yadav@tekinspirations.com Reply to: muskan.yadav@tekinspirations.com Urgent Hiring-Title: Performance Framework Engineer Duration: Long TermLocation: RemoteVisa – USC/GC/GC EAD/H4 EADMOI – SkypeJob Description - PV Note - For the Performance Engineer what they really want is a Java Developer with 3 years’ experience that would like to get into Performance. (not looking for someone more that 3 years or less than 3 years experience) Has a Performance Mindset, solid Java development and creating back-end frameworks, performance tools etc. Will need to do assessments before I set up a zoom meeting.MUST have Excellent communication Tech Stack You’ll Work With: Java Python Loadrunner, JMeter Ansible, Puppet Oracle SQL, MongoDB Jenkins, XLR, and XLD Apache Kafka OpenShift Microservices What You Will Do:Framework Development: Design, develop, and maintain scalable and reusable performance testing frameworks and tools. Performance Testing: Plan, execute, and analyze performance tests to identify bottlenecks and ensure the scalability and reliability of business-critical applications. Automation: Implement automation scripts to integrate performance tests into CI/CD pipelines. Collaboration: Work closely with application development, infrastructure, and product teams to understand performance requirements and integrate performance testing into the software development lifecycle. Monitoring and Analysis: Monitor application performance with tools like JMeter, LoadRunner, and Splunk, communicating in-depth results and analysis to a variety of technical and non-technical stakeholders. Optimization: Inspect application code in a complex distributed system to provide recommendations for performance improvements and work with application development teams to implement them. Documentation: Create and maintain detailed documentation for performance testing frameworks, tools, and processes. Skills Required: Strong understanding and appreciation for object-oriented analysis and design Experience with Integrated Development Environments (IntelliJ, VSCode, Eclipse, etc.), version Control (Git, etc.), and build tools (Gradle, Maven, Ant, etc.) Code review processes and static analysis tools Continuous delivery tools: XLR/XLD, Jenkins, etc. Microservices experience and technologies - OpenShift, Podman WhatWe Love Finding: Self-motivated, results-oriented developers who are comfortable setting and meeting deadlines Developers who have excellent written and communication skills with the ability to effectively document and present ideas both verbally and visually Strong problem solvers who thrive on a good challenge Naturally detail-oriented developers with the ability to balance value versus effort Developers who are passionate about new technologies guided by end-user, technology, and business drivers Muskan YadavTechnical RecruiterTEK Inspirations LLC - 13573 Tabasco Cat Tr. Frisco, TX 75035Email: Muskan.yadav@tekinspirations.comPhone Number: +14694057144",
        "source": "Email",
        "date_posted": "2024-10-17 15:20:00-05:00",
        "unique_id": "1929c439ccff6a18",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]