[
    {
        "company": "Siriinfo",
        "job_title": "ServiceNow Business Analyst",
        "location": "Rockville, MD, USA",
        "full_location": {
            "city": "Rockville",
            "state": "MD",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "experience_required": "3-5+ years",
            "degree_required": "Bachelor’s degree in Business Administration, Information Technology, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "ServiceNow",
                "Business Analysis",
                "Procurement",
                "Case Management",
                "ITSM"
            ],
            "primary": [
                "Requirement Gathering",
                "Process Mapping",
                "Solution Design",
                "Testing",
                "Change Management"
            ],
            "secondary": [
                "Communication",
                "Analytical Skills",
                "Problem-solving",
                "Documentation",
                "User Acceptance Testing"
            ],
            "all": [
                "ServiceNow",
                "Business Analysis",
                "Procurement",
                "Case Management",
                "ITSM",
                "Requirement Gathering",
                "Process Mapping",
                "Solution Design",
                "Testing",
                "Change Management",
                "Communication",
                "Analytical Skills",
                "Problem-solving",
                "Documentation",
                "User Acceptance Testing"
            ]
        },
        "job_type": [],
        "contact_person": "Dushyanth",
        "email": "dushyanth@siriinfo.com",
        "jd": "From: Dushyanth, Siriinfo dushyanth@siriinfo.com Reply to: dushyanth@siriinfo.com Hiring for ServiceNow Business Analyst at Rockville,MD Richmond VA Role Description: 1. Requirement Gatheringand Analysis:- Work with stakeholders across procurement, case management, S2P, and ITSM domains to gather detailed business requirements. - Conduct gap analysis between current processes and desired outcomes, identifying areas where ServiceNow can deliver value. - Document and prioritize requirements, ensuring alignment with business goals. 2. Process Mapping and Documentation: - Develop detailed process maps for existing and proposed processes within Procurement, Case Management, S2P, and ITSM. - Create and maintain comprehensive documentation, including business requirements documents (BRDs), functional specifications, and user stories. - Ensure that documentation is clear, concise, and accessible to both technical and non-technical stakeholders. 3. Solution Design and Collaboration:- Collaborate with ServiceNow developers and architects to design solutions that meet business requirements. - Participate in solution design sessions, providing input on the feasibility and impact of proposed solutions.- Ensure that solutions are user-friendly and aligned with industry best practices. 4. Testing and Validation: - Develop test cases and coordinate user acceptance testing (UAT) to validate that solutions meet business needs. - Identify, track, and resolve defects or issues during the testing phase. - Ensure that the final deliverables are of high quality and fully meet the specified requirements. 5. Change Management and Training:- Assist in the development and execution of change management plans to ensure successful adoption of new solutions. - Prepare and deliver training materials for end-users and administrators.- Provide ongoing support during and after the implementation to ensure smooth transition and adoption.6. Stakeholder Communication and Management:- Serve as a liaison between business stakeholders and the technical team, ensuring clear communication and understanding of requirements. - Facilitate workshops, meetings, and presentations to communicate project status, risks, and issues. - Build strong relationships with stakeholders to foster collaboration and ensure alignment throughout the project lifecycle.Competencies: ServiceNow_ITAM (IT Asset Management)Experience (Years): 10 & AboveEssential Skills: - Bachelor’s degree in Business Administration, Information Technology, or a related field. - 3-5+ years of experience as a Business Analyst, preferably with a focus on ServiceNow implementations. - Strong understanding of Procurement, Case Management, S2P processes, and ITSM frameworks. - Proven experience in gathering and documenting business requirements and translating them into functional specifications. - Familiarity with process mapping tools and methodologies. - Excellent communication, analytical, and problem-solving skills.",
        "source": "Email",
        "date_posted": "2024-10-17 11:30:51-05:00",
        "unique_id": "1929bb0cda7acb5d",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]