[
    {
        "company": "Panzer Solutions LLC",
        "job_title": "ERP Developer",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "14 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "C#",
                ".NET",
                "SQL Server",
                "Angular",
                "Blazor"
            ],
            "primary": [
                "Web API",
                "JavaScript",
                "JQuery",
                "CSS3",
                "HTML5"
            ],
            "secondary": [
                "Automated Builds using Microsoft Team Foundation",
                "Agile SDLC best practices",
                "Source Control using TFS",
                "Excellent troubleshooting skills"
            ],
            "all": [
                "C#",
                ".NET",
                "SQL Server",
                "Angular",
                "Blazor",
                "Web API",
                "JavaScript",
                "JQuery",
                "CSS3",
                "HTML5",
                "Automated Builds using Microsoft Team Foundation",
                "Agile SDLC best practices",
                "Source Control using TFS",
                "Excellent troubleshooting skills"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Rahat",
        "email": "rahat@panzersolutions.com",
        "jd": "Hi,I hope you're doing well!My name is Rahat and I am working as a Talent Acquisition at Panzer Solutions LLC.We deal with US IT and non-IT recruitment services. We have the below opening with our preferred client,Let me know if you are available & interested in this position. If interested please share a copy of your resume and best time, number to reach. Role :- ERP Developer Location:- Richmond, VA, (HYBRID ) Contract :- 12 MonthsResponsibilities:Client-AMD is seeking a Developer with 14 yrs or more .Net Web application development. Experience and fluency with C#, Angular or Blazor, SQL Server, JQuery, CSS3 and HTML5 experience.Client is seeking a Full Stack Senior ERP Developer/Programmer with .Net Applications Development experience who will be responsible for managing, programming, testing, debugging and analyzing complex software requirements to design and develop high quality components using the .NET Core framework.The ERP Developer will be programming the current budget and spend plan tool that is used agency wide for financial and budget management for the Maintenance Program. The Senior Developer is expected to program using best practices, prioritize programming work effectively and write system documentation as required.The successful candidate should have strong programming and communication skills to be effective in both technical and business requirement discussions.Ability to develop, program and code in .NET Core environment applications and backend services using C#, Web API, Java Script, JQuery, Angular or Blazor and CSS. Design, develop and program using appropriate software design patterns to attain high reusability and maintainability. Write effective unit tests and integration tests to ensure high quality software delivery. In-depth knowledge and skills in programming, system design patterns, tiered architecture, and testing practices. Understanding of key business processes and competitive strategies related to the IT function. Work with project architect, project manager, business owner and system analysts to clarify the requirements and then implement them.Participate in Agile SDLC. Requirements:14 Years – C# .NET development experience.Strong database development experience using SQL Server.Excellent troubleshooting skills.Experience with Source Control using TFS.Angular or Blazor experience.Experience with Web API.Experience with CSS3 and HTML5.Experience with Automated Builds using Microsoft Team Foundation.Experience with Agile SDLC best practices.",
        "source": "Email",
        "date_posted": "2024-10-17 16:43:32-05:00",
        "unique_id": "1929d36acc6ab7bf",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]