[
    {
        "company": "DLCP",
        "job_title": "Business Process Consultant",
        "location": "Washington, DC, USA",
        "full_location": {
            "city": "Washington",
            "state": "DC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "11+ years",
            "degree_required": "Bachelor's degree in finance, accounting, business administration, economics, engineering, mathematics, statistics or a related technical or quantitative field",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business process re-engineering",
                "Data analysis",
                "SQL",
                "Excel",
                "Tableau"
            ],
            "primary": [
                "Stakeholder engagement",
                "Requirement gathering",
                "Process analysis and improvement",
                "Business process mapping",
                "Testing and validation"
            ],
            "secondary": [
                "Analytical thinking",
                "Problem-solving",
                "Communication skills",
                "Cross-functional teamwork",
                "Customer outreach"
            ],
            "all": [
                "Business process re-engineering",
                "Data analysis",
                "SQL",
                "Excel",
                "Tableau",
                "Stakeholder engagement",
                "Requirement gathering",
                "Process analysis and improvement",
                "Business process mapping",
                "Testing and validation",
                "Analytical thinking",
                "Problem-solving",
                "Communication skills",
                "Cross-functional teamwork",
                "Customer outreach"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Sapna Thakur",
        "email": "sapnathakur@sibitalent.com",
        "jd": "From: Sapna Thakur, Sibi Talent sapnathakur@sibitalent.com Reply to: sapnathakur@sibitalent.com DLCP Business Process Consultant, ONSITE - Candidate MUST be local to the DC.Duration :: 6 monthsExperience :: 11+ years Phone + Video JD: SHORT DESCRIPTION: Analyzes process and re-engineering with an understanding of technical problems and solutions as they relate to the current and future business environment. COMPLETE JOB DESCRIPTION: DLCP is looking for a Business Process Consultant (Senior) to support business reporting/data needs (e.g., performance and KPI reporting, selection management, cost improvements, business process analysis) while developing scalable solutions for the future. A successful BA delivers operational and strategic results, being able to think deeply about the data and information needed to support growth, reduce costs, and improve efficiency, and provide clear recommendations and/or modeling to support their conclusions. The BA will identify opportunities and drive improvements through data fueled solutions, and leverage stakeholder input and feedback to develop roadmaps and set expectations. The ideal candidate will take a customer-centric approach to identifying and addressing challenges. The candidate will have both a business sense and a solid understanding of the technical landscape. The candidate is expected to be experienced with business process reengineering and identifying new applications of technology to business problems to make business more effective. Possess the ability to navigate ambiguities and competing priorities, analytical thinking capabilities, and exceptional communication skills are needed to succeed. Author detailed descriptions of user needs, program functions, and steps required to develop or modify programs. Key Responsibilities… • Stakeholder Engagement: Work closely with program teams to ensure alignment between business goals and system functionalities. • Requirement Gathering: Collaborate with stakeholders to understand business needs and document technical and functional requirements that align with DLCP’s goals. • Process Analysis and Improvement: Evaluate existing business processes, gather and analyze data, and recommend improvements that drive efficiency and reduce operational risks. • Business Process Mapping: Develop detailed workflow charts, diagrams, and process documentation to visualize business operations and identify areas for re-engineering. • Business Process Engineering/Re-Engineering: Work closely with IT and Data Teams to visualize DLCP’s Business Architecture and implementing Data Driven organization • Data Analysis and Reporting: Use tools like Tableau, SQL, and Excel to analyze operational data, create reports, and identify trends that inform decision-making. • Testing and Validation: Assist in validating new processes and systems through testing and user acceptance reviews, ensuring they meet business and functional requirements. • Customer Outreach: Assist in developing and designing Customer outreach programs that promote DLCP’s goals and increase customer engagement • Solicit the team for reporting needs, areas of opportunity, dashboard requests, and cost reduction opportunities. • Consult on the analysis of an application, troubleshoots system problems, and recommend solutions. Basic Qualifications… • Education: Bachelor's degree in finance, accounting, business administration, economics, engineering, mathematics, statistics or a related technical or quantitative field • Experience: 3+ years of business analyst, data analyst or similar role experience preferably in government or regulatory environment • Technical Skills: 3+ years of Excel (including VBA, pivot tables, array functions, power pivots, etc.). Proficiency in SQL and process mapping software (e.g., Visio, Miro, Draw.io etc), and data visualization tools such as Tableau, Seaborn etc. Experience with any programming language and automated testing tools is a plus. • Soft Skills: Strong analytical thinking, problem-solving abilities, excellent communication skills, and the ability to work cross-functionally with teams. MINIMUM EDUCATION/CERTIFICATION REQUIREMENTS: Bachelor’s degree in finance, accounting, business administration, economics, engineering, mathematics, statistics, or related field or equivalent experience Candidate must complete/return the skill matrix below…748527 - DLCP Business Process Consultant SeniorCLIENT REQUIREMENTSItemSkillsRequired orYears ofCandidate's Years of Exp.DesiredExperience1Bachelor's degree in IT, finance, business administration, economics, engineering, related field or equivalent experienceRequired15 211-15 yrs. Business process re-engineering experienceRequired11 3Navigate Ambiguity and Competing priorities - Managing tasks effectively in uncertain and fast-paced environmentsRequired11 4Business process reengineering and identifying new applications of technology to business problems to make business more effective.Required11 5Write detailed descriptions of user needs, program functions, and steps required to develop or modify programs.Required10 6Use tools like Tableau, SQL, and Excel to analyze operational data, create reports, and identify trends that inform decision-making.Required8 7Solicit the team for reporting needs, areas of opportunity, dashboard requests, and cost reduction opportunities.Highly Desired10 8Assist in validating new processes and systems through testing and user acceptance reviews, ensuring they meet business and functional requirements.Highly Desired10 9Consult on the analysis of an application, troubleshoots system problems, and recommend solutionsHighly Desired8 10Assist in developing and designing Customer outreach programs that promote DLCP’s goals and increase customer engagementDesired10 11Analytical Thinking and Communication - Ability to analyze complex data, extract insights, and communicate findings to stakeholdersDesired11 12Working with IT and Data Teams to analyze business architecture and implement data within the organization.Desired8 Thanks & RegardsSapna Thakur | Sr. Technical Recruiter",
        "source": "Email",
        "date_posted": "2024-10-17 14:58:18-05:00",
        "unique_id": "1929c2fbe95fa8da",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]