[
    {
        "company": "DIA SOFTWARE SOLUTIONS LLC",
        "job_title": "Senior Program Manager",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "20+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Agile",
                "Scrum",
                "SAFe",
                "Waterfall",
                "Microsoft Project",
                "Microsoft Project Professional"
            ],
            "primary": [
                "Leadership",
                "Communication",
                "Risk Management",
                "Knowledge Management",
                "Training Development"
            ],
            "secondary": [
                "Microsoft Teams",
                "SharePoint",
                "Microsoft Planner",
                "Power BI",
                "VITA Project Manager Certification"
            ],
            "all": [
                "Project Management",
                "Agile",
                "Scrum",
                "SAFe",
                "Waterfall",
                "Microsoft Project",
                "Microsoft Project Professional",
                "Leadership",
                "Communication",
                "Risk Management",
                "Knowledge Management",
                "Training Development",
                "Microsoft Teams",
                "SharePoint",
                "Microsoft Planner",
                "Power BI",
                "VITA Project Manager Certification"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Divya",
        "email": "divya@diasoftwaresolutions.com",
        "jd": "From: Divya, Dia Software solutions divya@diasoftwaresolutions.com Reply to: divya@diasoftwaresolutions.com Hi , I hope this message finds you well! I am reaching out to you on an exciting Direct client opportunity with one of our clients. Can you please go through the requirements and let me know if you are interested in this position? Job title : Senior Program ManagerWork Arrangement: HybridWork Location: Richmond, VAExp: 20+Duration of the Project: 12+ MonthsNotes: candidates who have prior State govt exp is huge plus! Ideally Virginia candidate is highly preferredRESPONSIBILITIES:Oversee initiatives for the assigned program.Oversee work in assigned program to ensure consistent process and quality standards.Assign resources to complete deliverables.Assign resources to support processes.Work with peers and subordinates to define strategic direction for assigned program.Identify gaps, trends, patterns and implement process improvements as neededBe an expert in the use of the division core project management tool, Microsoft Project On-Line (POL).Develop project management processes, tools, templates, and training, drawing on common project management methodologyEstablish and maintain Agile Project Management, Scaled, Kanban and Waterfall Project Management frameworks and their supporting practicesCreate new and enhanced procedures to capture best practices and mature the project management process.Manage the knowledge base of project management reference materials to ensure accuracy, relevancy and currency.Monitor projects for compliance with established policies and procedures.Monitor projects to detect risks and issues and escalate as needed to ensure appropriate mitigation is applied to keep the project on-track.Guide project managers in identifying and managing risks.REQUIRED SKILLS:20 years of experience in Project Management.15 years of combined experience with scrum, Agile, SAFe, Product Line and Waterfall methodologies.15 years of experience managing complex projects with multiple workstreams and high organizational change.10 years' experience leading and managing direct reports. Set direction and strategy for the assigned teamAbility to interact effectively with customers and project team members.Knowledge of project management tools, methods and practices.Ability to communicate effectively orally and in writing.Ability to program and create custom reports using IT application standard tools.PMP certificationVITA Project Manager Certification (can be obtained within 120 days of hire) is a plus but not required.Advanced skills using Microsoft Project Professional.Must be able to quickly and easily adapt to changing priorities, embracing changes to deliver leadership and guidance.Experience creating and managing knowledge bases, job aids and training programs.Strong functional understanding of MS Project, Project Server, SharePoint, Microsoft Teams, Microsoft Planner and Power BIAbility to assess project risks and issues, and determine mitigation required to contain or resolve them.Demonstrated understanding of project portfolio and lifecycle management processes, governance processes, procedures and policies for project management and understanding of organizational change.",
        "source": "Email",
        "date_posted": "2024-10-17 13:35:03-05:00",
        "unique_id": "1929be389dc15925",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]