[
    {
        "company": "NITYA Software Solutions Inc.",
        "job_title": "Business Analyst",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Requirements Gathering",
                "Data Analysis",
                "Test Planning",
                "Project Management"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Business Analysis",
                "Requirements Gathering",
                "Data Analysis",
                "Test Planning",
                "Project Management"
            ],
            "with_experience": []
        },
        "job_type": [],
        "contact_person": "Rajkumar",
        "email": "rajkumar.v@nityainc.com",
        "jd": "From: rajkumar, NITYA Software Solutions Inc. rajkumar.v@nityainc.com Reply to: rajkumar.v@nityainc.com Hi,I hope you are doing well.I am Raj from NITYA Software Solutions Inc.I've included below the job description, please let me know if you are interested, and reply with one updated resume, which I've expected.Role: Business AnalystDocumenting existing systems and/or business processes.Interviewing users to determine functional requirements for new development and enhancement projects.Working with the client personnel as needed to develop test plans and coordinate testing efforts.Working with technical leads and developers to understand, develop, and refine project technical requirements.Assisting in the development and refinement of systems development methodology processes and artifacts as needed.Assisting in the tracking and reporting of project status as required in support of project and Project Management Office efforts.Providing input to and support for the development of Project Definition documents used to establish initial project scope, cost and resource estimates, impact on existing activities, and estimated return on investment.Performing data analysis in support of projects and develop database inquiries as needed.Coordinating use of business analysis, project requirements, test planning, tracking, problem reporting throughout projects within JIS as needed.Assisting client project managers and IT managers, as needed, with the coordination ofrequirements gathering and test planning activities.Conducting Joint Application Design (JAD) sessions and coordinate business unit review and approval of project functional requirements and test plans.Thank you,RajkumarEMAIL ID:rajkumar.v@nityainc.comNITYA Software Solutions Inc.",
        "source": "Email",
        "date_posted": "2024-10-17 18:00:18-05:00",
        "unique_id": "1929d602cf433350",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]