[
    {
        "company": "Scalable Systems",
        "job_title": "Project Management with ServiceNow implementation experience",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "ServiceNow",
                "Project Management",
                "Stakeholder Management",
                "Team Leadership",
                "Budget Management"
            ],
            "primary": [
                "Risk Management",
                "Quality Assurance",
                "Resource Allocation",
                "Project Planning"
            ],
            "secondary": [
                "Communication",
                "Documentation",
                "Vendor Management",
                "Coaching",
                "Mentoring"
            ],
            "all": [
                "ServiceNow",
                "Project Management",
                "Stakeholder Management",
                "Team Leadership",
                "Budget Management",
                "Risk Management",
                "Quality Assurance",
                "Resource Allocation",
                "Project Planning",
                "Communication",
                "Documentation",
                "Vendor Management",
                "Coaching",
                "Mentoring"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Pradeep Sharma",
        "email": "pradeep.sharma@scalable-systems.com",
        "jd": "From: Pradeep, Scalable Systems pradeep.sharma@scalable-systems.com Reply to: pradeep.sharma@scalable-systems.com Hi,Greetings of the day! I have an urgent requirement below, please go through JD and let me know if you are comfortable or have any profile. Kindly revert me back with your updated resume as well. Job Title: Project Management with ServiceNow implementation experience Location: Richmond, VA (Work from Office)Duration: Long Term Contract Responsibilities:1. Project Planning and Management: Lead the planning and execution of ServiceNow projects from inception to completion. - Define project scope, objectives, and deliverables that support business goals in collaboration with senior management and stakeholders. - Develop detailed project plans, schedules, and resource allocation. - Manage project risks, issues, and changes to ensure successful delivery.2. Stakeholder Management: Act as the main point of contact between stakeholders and the project team. - Facilitate regular meetings and communications with stakeholders to report on project status, risks, and issues. - Ensure alignment between project objectives and business needs.3. Team Leadership: Lead, coach, and mentor project team members, including business analysts, developers, testers, and other project staff. - Foster a collaborative and high-performance team environment. - Manage third-party vendors and consultants as required.4. Budget and Resource Management: Manage project budgets, ensuring projects are delivered within approved financial limits. - Allocate resources effectively to meet project objectives and timelines. - Track project costs and report on financial performance against budgets.5. Quality Assurance: Ensure that project deliverables meet quality standards and are delivered on time. - Implement best practices and methodologies for ServiceNow project management. - Conduct project reviews and lessons learned sessions post-delivery.6. Reporting and Documentation: Prepare and deliver project status reports, including progress, risks, and issues.- Maintain comprehensive project documentation throughout the project lifecycle. - Ensure proper handover of completed projects to operations and support teams. Thanks & Regards, Pradeep SharmaEmail: pradeep.sharma@scalable-systems.com \"Scalable Systems is an Equal Opportunity Employer. We are committed to creating an inclusive environment for all employees and do not discriminate based on race, color, religion, sex, national origin, age, disability, or any other legally protected status.",
        "source": "Email",
        "date_posted": "2024-10-17 06:19:23-05:00",
        "unique_id": "1929a54af1959dfb",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]