[
    {
        "company": "Apple",
        "job_title": "Engineering Project Manager",
        "location": "Cupertino, CA, USA",
        "full_location": {
            "city": "Cupertino",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Minimum of 10 years",
            "degree_required": "Bachelor’s Degree in Engineering / Computer Science / Information Technology or equivalent work experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "product lifecycle management (PLM) systems",
                "Bills of Material (BOM)",
                "project management",
                "analytical skills",
                "problem-solving skills"
            ],
            "primary": [
                "organizational abilities",
                "attention to detail",
                "self-motivated",
                "experience in the electronics industry",
                "Agile scrum"
            ],
            "secondary": [
                "fast-paced environment",
                "stakeholder management",
                "test strategy",
                "software development lifecycle (SDLC)"
            ],
            "all": [
                "product lifecycle management (PLM) systems",
                "Bills of Material (BOM)",
                "project management",
                "analytical skills",
                "problem-solving skills",
                "organizational abilities",
                "attention to detail",
                "self-motivated",
                "experience in the electronics industry",
                "Agile scrum",
                "fast-paced environment",
                "stakeholder management",
                "test strategy",
                "software development lifecycle (SDLC)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Rajeev Gupta",
        "email": "rajeeve.g@mobcoderstaffing.com",
        "jd": "From: Rajeev, Mobcoder rajeev.g@mobcoderstaffing.com Reply to: rajeev.g@mobcoderstaffing.com Hi, Hope you are doing well!! We do have Urgent opening for the below position. Please do find the job description below for your reference. Would appreciate if you can share your updated resume along with the expected rate. Job Title: Engineering Project ManagerLocation : Cupertino, CADurations: 12+ Months Responsibility:-Apples Environmental Technologies group is seeking temporary professional services of an Engineering Project Manager to manage minimum to large enterprise projects in support of Apple’s various Smarter Chemistry objectives and initiatives, considering current and future key global regulatory requirements. The EPM will collaborate closely with SMEs, stakeholders, cross-functional teams and vendors during the full lifecycle development process – including requirements analysis, design, development, deployment, testing and maintenance.Key Qualifications:Experience with product lifecycle management (PLM) systems and Bills of Material (BOM), ideally for complex products like electronicsMinimum of 10 years of first-hand experience in managing and implementing business processes and systemsStrong organizational abilities with attention to detailStrong analytical and problem-solving skillsHighly accountable and dedicated to completing tasksDemonstrated ability to excel in a fast-paced, schedule-driven environmentCapable of prioritizing work effectivelyIndependent, self-motivated, and committed individualExperience in the electronics industry preferred Job Description:This temporary professional services role is within Apples Environmental Technologies group within Apples Hardware Engineering division. Our mission is to deliver the worlds leading programs on the elimination of hazardous substances, improved material and energy efficiency, as well as design for environment. Apple believes that major improvements in environmental performance will be delivered through product design innovations. Roles and Responsibilities:Lead meetings with stakeholders including process owners, subject matter experts, internal and external technical experts to ensure business processes and technical solutions are consistently understood and accurately documentedDevelop and execute work plans by leading scope, schedule, deliverables, and prioritizationProviding project updates on a consistent basis to stakeholdersActively collaborate with business and technical teams on innovative solutions, requirements, scope, and project deliverablesProactively identify and communicate project issues and risksPrioritize issues while negotiating and setting appropriate expectations with team members, stakeholders and senior managementPrioritize team activities and drive resolution of issues across all areas of the projectLead test strategy for user acceptance, creating and executing test scriptsWorking knowledge of the software development lifecycle (SDLC), Agile scrum Education and Experience:Bachelor’s Degree in Engineering / Computer Science / Information Technology or equivalent work experience Thanks & Regards Rajeev GuptaSenior IT Recruiter Mobcoder IT Solutions LLCCell: +1 469-676-1623rajeev.g@mobcoderstaffing.com Houston, TX 77064- USA",
        "source": "Email",
        "date_posted": "2024-10-17 10:54:18-05:00",
        "unique_id": "1929b74b92871cc1",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]