[
    {
        "company": "Sonitalent",
        "job_title": "Business Function Process Analyst",
        "location": "Grand Rapids, MI, USA",
        "full_location": {
            "city": "Grand Rapids",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Bachelor’s degree and/or professional certifications required or equivalent related experience",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "12 Months contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SAP MM",
                "SAP PP"
            ],
            "primary": [
                "SAP S/4",
                "EWM",
                "TM",
                "PP/DS",
                "manufacturing experience",
                "distribution experience",
                "engineering experience"
            ],
            "secondary": [
                "strong communication skills",
                "cross-functional teamwork",
                "project management skills",
                "problem resolution",
                "customer urgency understanding"
            ],
            "all": [
                "SAP MM",
                "SAP PP",
                "SAP S/4",
                "EWM",
                "TM",
                "PP/DS",
                "manufacturing experience",
                "distribution experience",
                "engineering experience",
                "strong communication skills",
                "cross-functional teamwork",
                "project management skills",
                "problem resolution",
                "customer urgency understanding"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Sushmita Soni",
        "email": "sushmita.soni@sonitalentcorp.com",
        "jd": "From: Sushmita Soni, Sonitalent sushmita.soni@sonitalentcorp.com Reply to: sushmita.soni@sonitalentcorp.com HiHope you are doing well , We are Hiring for : Business Function Process Analystand let me know if you are looking for this role and send me your updatedJob Title: Business Function Process AnalystLocation: Grand Rapids, MI (Onsite/Hybrid preferred) LocalDuration: 12 Months contractInterview: Phone/ Skype-2RoundsVisa: No H1B, CPTLinkedIn Must have Job Description: have great communication skills. They are NOT looking for people with financial backgrounds. These candidates must have manufacturing, distribution and engineering experience. Keys:Specifically looking for people with SAP MM and PP experience, and bonus points for experience in SAP S/4 and the following modules: EWM, TM, PP/DS.MM: Materials ManagementPP: Production PlanningEWM: Extended Warehouse ManagementTM: Transportation ManagementPP/DS: Production Planning and Detailed Scheduling General Description (Summary description of the primary duties and objectives of the position.) Member of a global or regional Competency Center covering assigned business functions, such as Order Management, Manufacturing Distribution, Engineering, or other supported functions. Provides support throughout North America, Europe, and/or Asia to create, implement, and monitor standard processes and controls, and ensure Best Practices are used to support business requirements pertaining to the assigned business functions. Provides subject matter expertise to the end users, consulting on business problems with business leaders, and ensures system and process quality testing. Ensures the related systems, applications, and modules are designed, configured, tested and documented to specifications. Analyzes researches and develops solutions to ensure the configuration and testing meet business requirements. Identifies opportunities to improve current business processes. Participates in and/or analyzes the development of system strategy by identifying and establishing the scope of the business requirements for various process areas. Provides technical support for Order Management / Manufacturing / Distribution / Engineering / or other supported functions. Provides leadership and support for improving business process in Order Management / Manufacturing / Distribution / Engineering / or other supported functions. Our teams’ purpose is to provide our users with a user experience that meets their needs, facilitates process discipline, and meets the needs of the business, within the abilities of the applications we support. Additionally, employees are expected to abide by all internal control & compliance practices to:Safeguard assets from theft and misuse.Ensure segregation of duties to minimize fraud.Comply with business ethics, applicable laws and regulations.Maintain confidentiality of proprietary information.Periodically reconcile physical assets to accounting records. Skills/AbilitiesAbility to work with cross-functional teams within and outside assigned business areas.Strong communication skills for interaction with all levels internally and externally.Ability to stay current with relevant system methods and emerging technology as well as best business practices.Ability to understand customer sense of urgency and make independent decisions in stressful situations.Intuitive thinking for complex system problem resolution.Ability to analyze business or operational problems and design solution alternatives.Strong project management skills with the ability to develop project scope and action plans.Provide direction and assist process team members for implementation of changes.",
        "source": "Email",
        "date_posted": "2024-10-17 15:17:01-05:00",
        "unique_id": "1929cd1fe9d1bc4f",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]