[
    {
        "company": "Vyze Inc.",
        "job_title": "Project Manager",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "8 plus years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Microsoft Project"
            ],
            "primary": [
                "Global Infrastructure",
                "PMP certification",
                "ITIL",
                "International experience"
            ],
            "secondary": [
                "LAN/WAN",
                "Servers",
                "Routers",
                "Storage",
                "Firewall",
                "Security",
                "Risk processes",
                "Business continuity",
                "Enterprise software"
            ],
            "all": [
                "Project Management",
                "Microsoft Project",
                "Global Infrastructure",
                "PMP certification",
                "ITIL",
                "International experience",
                "LAN/WAN",
                "Servers",
                "Routers",
                "Storage",
                "Firewall",
                "Security",
                "Risk processes",
                "Business continuity",
                "Enterprise software"
            ],
            "with_experience": [
                "Project Management",
                "Microsoft Project"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Rahul Mishra",
        "email": "rmishra@vyzeinc.com",
        "jd": "From: Rahul Mishra, Vyzeinc rmishra@vyzeinc.com Reply to: rmishra@vyzeinc.com Title : Project ManagerLocation: RemoteVisa: No H1b?CPTMOI: Video We are currently looking for a Senior Project Manager who has large enterprise experience to help manage an ongoing global hardware refresh. Including LAN/WAN, Servers, Routers, Storage and other networking equipment. Outline of projectsWAN migrationsFirewall, Security and Risk processesServer hardware, software, licensingRequired experience8 plus years of managing projects across a large enterprise, various time zonesStrong competency using Microsoft ProjectPreferred experienceGlobal InfrastructurePMP certificationUnderstanding of ITIL preferredInternational experienceObjectivesProject Managing implementations and deployments of networks, servers, security, business continuity and/or enterprise software.The selected candidate will have experience managing multiple projects across multiple geographic locations, ideally having supported Asia and/or EuropeExpertise in Project Management Principles, process definition, methods, techniques, (MS Project desired). PMP certification preferred, but not required. Ability to identify and categorize required skills and skill sets needed on an assignment.Ability to develop credible estimates for project work tasks and activities.DutiesUsing documentation of current outstanding work to create a thorough project plan for the Infrastructure Team.Using documentation of current outstanding initiatives and priorities, create and maintain a high-level Infrastructure Project Roadmap for the Infrastructure Team, representing project importance and best intent timing plans.Work with all members of the Infrastructure team to determine skills, abilities and current work projects.Create reports and provide updates to management as to the current status, issues, risks or other information associated with identified projects.Participate in IT Project Reviews to provide input on techniques, skills and tools for all IT Project Managers.Contribute input to employee performance evaluations.",
        "source": "Email",
        "date_posted": "2024-10-17 07:46:45-05:00",
        "unique_id": "1929aa4aaf725e14",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]