[
    {
        "company": "Source InfoTech Inc.",
        "job_title": "Business Analyst - Product Owner with Pharma knowledge",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5-8 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "3 months with possible extensions",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Agile Methodologies",
                "Requirements Gathering",
                "Jira",
                "Pharma Knowledge"
            ],
            "primary": [
                "Customer Expectation Mgmt.",
                "Product Backlog Grooming",
                "User Stories Creation"
            ],
            "secondary": [],
            "all": [
                "Agile Methodologies",
                "Requirements Gathering",
                "Jira",
                "Pharma Knowledge",
                "Customer Expectation Mgmt.",
                "Product Backlog Grooming",
                "User Stories Creation"
            ],
            "with_experience": [
                "Agile Methodologies",
                "Requirements Gathering",
                "Jira",
                "Pharma Knowledge"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Sunny",
        "email": "sunny@sourceinfotech.com",
        "jd": "From: sunny, Source Infotech Inc sunny@sourceinfotech.com Reply to: sunny@sourceinfotech.com Hi,Hope you are all doing well,Please find the details of Requirement,Business Analyst / Product Owner with Pharma knowledge3 months with possible extensions**FULLY REMOTE (CST only)**Visa- No Cpt/Opt/H1B Job Summary:This role involves managing multiple projects with a focus on delivering high-quality outcomes.Lead the planning and implementation of projects to ensure timely delivery and alignment with business objectives. - Oversee project scope, goals, and deliverables, ensuring they meet stakeholder expectations. - Provide direction and support to project teams, fostering a collaborative and productive work environment. - Utilize Agile Methodologies to manage project timelines, resources, and deliverables effectively. - Conduct regular status meetings with project teams to monitor progress and address any issues. - Facilitate requirements gathering sessions to ensure all project requirements are clearly defined and documented. - Use Jira to track project progress, manage tasks, and communicate updates to stakeholders. - Develop detailed project plans, including timelines, milestones, and resource allocation. - Identify and mitigate risks throughout the project lifecycle to ensure successful project outcomes. - Ensure all project documentation is complete, current, and stored appropriately. - Coordinate with cross-functional teams to ensure project dependencies are managed and deliverables are met. - Provide regular project updates to senior management and other stakeholders to keep them informed of progress. - Evaluate project performance and implement improvements to enhance future project outcomes. Experience: 5-8 yrs Required Skills:1. Customer Expectation Mgmt.2. Agile Methodologies, Requirements Gathering, and Jira3. Product Backlog Grooming and User Stories Creation4. Pharma Knowledge is must. Thanks,SunnyIT RecruiterSource InfoTech Inc.,Email: sunny@sourceinfotech.com",
        "source": "Email",
        "date_posted": "2024-10-17 10:33:45-05:00",
        "unique_id": "1929b8dedd632342",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]