[
    {
        "company": "Sibitalent Corp.",
        "job_title": "Project Management Office (PMO)",
        "location": "New York, NY, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "12+ years, plus 3 years minimum experience in a people leader role",
            "degree_required": "Bachelor’s degree in a related field, MS preferred",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Customer Engagement",
                "Leadership",
                "Risk Management",
                "Program Planning"
            ],
            "primary": [
                "MS Office",
                "MS-Project",
                "MS-Excel",
                "PMP certification",
                "Waterfall or hybrid project experience"
            ],
            "secondary": [
                "Effective communication",
                "Team building",
                "Conflict management",
                "Organizational skills",
                "Self-starter"
            ],
            "all": [
                "Project Management",
                "Customer Engagement",
                "Leadership",
                "Risk Management",
                "Program Planning",
                "MS Office",
                "MS-Project",
                "MS-Excel",
                "PMP certification",
                "Waterfall or hybrid project experience",
                "Effective communication",
                "Team building",
                "Conflict management",
                "Organizational skills",
                "Self-starter"
            ],
            "with_experience": [
                "Project Management",
                "Customer Engagement",
                "Leadership"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Sagar Kumar",
        "email": "sagar.kumar@sibitalent.com",
        "jd": "From: Sagar, Sibitalent sagar.kumar@sibitalent.com Reply to: sagar.kumar@sibitalent.com 12+ years’ experience, plus 3 years minimum experience in a people leader role required. Title : Project Management Office (PMO)Work Location: NYC NY/ Jersey City NJ – Onsite - ONLY LOCAL CANDIDATES Duration: Long Term Qualifications:Required Qualifications:Bachelor’s degree in a related field, MS preferred required.12+ years’ experience, plus 3 years minimum experience in a people leader role required.Demonstrated track record of effective project management experience, cradle to grave required.Track record of significant customer engagement required.Responsibilities:Leads internal teams in aligning external customer needs in support of pre-and post-sales requirements. Often requires driving internal engineering and supply chain teams to deliver new outcomes with the goal of closing deals.Provides leadership and organization to Engineering Customer Response Team (ECRT) for multiple business units, with the goal of remedying critical issues in the installed base of various solutions.Responsible for implementing successful customer engagement model across expansion businesses at Zebra, partnering with other areas of the company presently employing these best practices.Functional Leadership of Program management teams possibly to include direct supervision of one or more direct reports. Independently drive team growth and development plans and supports individual's execution & development activities such as training, mentorships, and guiding growth opportunities.Will be responsible for the execution of multiple moderate to large scope projects. Programs will be complex in nature with cross-functional teams in multiple locations. Programs may be of various nature, including transformation, customer enagement, products, services.Uses and makes improvement recommendations to established tools, approaches/methodologies, and templates to guide and document the plan and communicate it to the team.Responsible for all aspects of program planning and execution fully autonomously.Organizes cross-functional activities, ensuring program completion, i.e., product on schedule and within budget constraints. Owns regular meeting coordination, facilitation, anddocumentation of progress.Operates cross-functionally to identify and execute solutions to unclearly defined, complex, portfolio level challenges.Balances scope, schedule, and budget considerations to ensure program and business objectives are achieved.Assumes self and team accountability for program success. Executes and enables strategic cross-functional improvements. Assumes self and indirect project team’s accountability for program success against the objectives.Prepares and influentially presents status updates and other deliverables to senior-level audiences.Independently engages additional resources as needed to address obstacles/delays. Proactively provides recommendations for issue resolution. Adjusts the plan as delays/obstacles are experienced.Establishes operational objectives and delegates assignments to achieve business results.Demonstrates advanced knowledge of all PM techniques. Utilizes PM tools & techniques in scheduling & staffing plans with an understanding of task duration and dependencies.Develops comprehensive risk management plans.Demonstrates advanced knowledge of development processes and product launch scope and activities.Demonstrates ability to navigate complex problems and overcome ambiguity with limited manager oversight.Identifies, recommends, and implements process improvements.Drives definition and charter of future Customer Engagement Team roles and responsibilities, for those areas of the business that do not already have CET.Creates and manages schedules for products and solutions between Zebra and the customer(s)Drives identification and closure of risks and dependencies for NPI programs and milestonesHosts and is responsible for core team meetings. Drives team alignment and action item closure.Communicates regularly to business unit and Sales leadership teams (plans, issues, alignment, x-BU.Escalates issues as necessary for timely resolution. Preferred Qualifications:Effective in presenting and communicating (verbal and written), and facilitating topeers, direct reports, and executive audiencesProficient in MS Office or similar.Comfortable and experienced in delegating and requesting follow-upPMP certification preferred.Degree in engineering preferred.Deep understanding of the customer experience.Experience working on Waterfall or hybrid projects.Proficient in MS Office or similar. Power user in MS-Project and MS-Excel.Exceptional organizational and communication skills.Ability to collaborate effectively with cross-functional teams.Ability to present, communicate, and facilitate effectively to peers, team members, and senior managers.Self-starter with enthusiasm, flexibility, and motivation.Excellent team building and conflict management skills.Demonstrated ability to manage multiple projects simultaneously.Comfortable and experienced in delegating and requesting follow-up.",
        "source": "Email",
        "date_posted": "2024-10-17 14:53:43-05:00",
        "unique_id": "1929c2b8e49c9540",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]