[
    {
        "company": "Han Staffing",
        "job_title": "Product Owner (Life insurance exp)",
        "location": "Clinton, NJ, USA",
        "full_location": {
            "city": "Clinton",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Bachelor's degree in a related field and/or equivalent work experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "IT Business Analyst",
                "Product Owner",
                "Insurance domain knowledge",
                "Agile project execution",
                "Business Analysis Standards"
            ],
            "primary": [
                "SAFe agile environment",
                "Facilitating PI planning",
                "MS Word",
                "Excel",
                "Visio",
                "MS Project",
                "PowerPoint"
            ],
            "secondary": [
                "SharePoint",
                "Quality Center",
                "JIRA",
                "Leadership",
                "Negotiation",
                "Relationship management",
                "Critical thinking"
            ],
            "all": [
                "IT Business Analyst",
                "Product Owner",
                "Insurance domain knowledge",
                "Agile project execution",
                "Business Analysis Standards",
                "SAFe agile environment",
                "Facilitating PI planning",
                "MS Word",
                "Excel",
                "Visio",
                "MS Project",
                "PowerPoint",
                "SharePoint",
                "Quality Center",
                "JIRA",
                "Leadership",
                "Negotiation",
                "Relationship management",
                "Critical thinking"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Abhishek Kumar",
        "email": "abhishekkumar@hanstaffing.com",
        "jd": "From: Abhishek Kumar, Han Staffing abhishekkumar@hanstaffing.com Reply to: abhishekkumar@hanstaffing.com Job: Product Owner (Life insurance exp)Location: Clinton, NJ (Onsite from Day 1)Duration: Long TermJob Description:JD:Functional Responsibilities: Experienced IT Business Analyst/Product Owner with a 10+ years experience Demonstrated experience solving complex business problems, working across multiple workstreams, and strong attention to detail Collaborate with business partners from multiple disciplines to elicit, document, prepare and manage business requirements / user stories Establish meaningful traceability between related requirements Act as a liaison between the business and IT design and delivery teams Utilize industry standard diagram techniques to enhance the clarity of definition, including process flows, context diagrams, use cases, wireframes, etc. Set requirement baselines upon obtaining requirements package sign-off Support requirements change management; analyze impact and obtain change sign-off throughout NYLs Technology Delivery Life Cycle (TDLC) framework Interface with Business Partners and Technical resources to translate and simplify requirements Ensure requirements are met and verify that the implemented solution meets the requirements Partner with QA team and SMEs to ensure adequate test coverage Work with stakeholders to conduct training sessions / demos, and to develop manuals / user guides Works within NYLs Operational Excellence COE business analysis standards and participates in continuous improvement efforts Experience & Skills: Applied experience with large scale, complex IT projects Insurance domain knowledge (specifically new business and underwriting) Experience in execution of agile projects, Experience working in SAFe agile environment, facilitating PI planning Experience projects with variable staffing including onsite/offshore execution model and distributed teams. Working knowledge of Business Analysis Standards (i.e. IIBA best practices) Proficient in MS Word, Excel, Visio, MS Project, and PowerPoint. Knowledge of SharePoint, Quality Center, and JIRA a plus. Quickly learns new businesses and complex processes Ability to work from objectives with minimal guidance or supervision Demonstrated ability to understand and work across multiple business domains in support of projects Ability to partner with development teams that support various technology platforms Proven leadership, negotiation and relationship management skills Strong critical thinking skills and attention to detail Education: Bachelors degree in a related field and/or equivalent work experience Advanced degree encouraged",
        "source": "Email",
        "date_posted": "2024-10-17 17:24:56-05:00",
        "unique_id": "1929cb5fef61d3f6",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]