[
    {
        "company": "Siriinfo",
        "job_title": "Manhattan OMS developer",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "7+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Manhattan Active OMNI",
                "microservices",
                "REST API",
                "data mappings",
                "business systems analysis"
            ],
            "primary": [
                "ecommerce",
                "retail use cases",
                "Agile principles",
                "SCRUM",
                "LEAN",
                "Kanban",
                "SAFe",
                "Design Thinking"
            ],
            "secondary": [
                "data-driven analysis",
                "KPI analysis",
                "written communication",
                "verbal communication",
                "stakeholder management"
            ],
            "all": [
                "Manhattan Active OMNI",
                "microservices",
                "REST API",
                "data mappings",
                "business systems analysis",
                "ecommerce",
                "retail use cases",
                "Agile principles",
                "SCRUM",
                "LEAN",
                "Kanban",
                "SAFe",
                "Design Thinking",
                "data-driven analysis",
                "KPI analysis",
                "written communication",
                "verbal communication",
                "stakeholder management"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Dhirendra deo",
        "email": "dhirendra@siriinfo.com",
        "jd": "From: Dhirendra deo, Siriinfo dhirendra@siriinfo.com Reply to: dhirendra@siriinfo.com Urgently looking : Manhattan OMS developerLocation : Remote Key Responsibilities:Liaise with Business, Technical, and other stakeholders to understand the OMS requirements in different regions including call center order management and store fulfillment solutions.Able to conduct workshops with business teams, engineering for requirement elicitation.Able to maintain relations ships with business stakeholders, engineering team and work with them to get functional and technical requirements.Should be able to write JIRA stories and manage scrum meetings.Should be able to own the data mappings and work with source, target and middleware teams for getting the mappings done.Should have the thought process of bringing requirements in such a way that would make OMS scalable.Should be able to write the non functional requirements. Years and Type of Experience Required:7+ years of business systems analyst experience in order management (Manhattan Active OMNI experience is a nice to have), microservices, preferably with wide breadth across ecommerce and retail use cases. Knowledge, Skills, and Abilities Required:Should have working experience on Manhattan Active OMNI.Detailed understanding of microservices, web services, REST API and other synchronous/asynchronous integration mechanisms, and the ability to translate that knowledge into detailed, comprehensive requirementsGood understanding of OMS related data models for taking the ownership of data mappings.Data-driven with the analytical abilities to identify opportunities and drive core KPI analysis. Ability to analyze and document complex business and technical processes. Experience with established ecommerce metrics, such as conversion.Demonstrated ability to understand technology concepts and implications.Order Management & Fulfillment domain experience.Experience Agile principles methodologies and how they’re applied in a workplace culture (SCRUM, LEAN, Kanban, SAFe, Design Thinking etc)Ability to work through ambiguity and be a self-learnerExcellent written and verbal communication skills and the ability to interact professionally with a diverse group of executives, managers and subject matter expertsFlexible work hours to match overseas project implementations Thanks & RegardsDhirendra deoTechnical RecruiterContact# 8488000581 Email: dhirendra@siriinfo.com",
        "source": "Email",
        "date_posted": "2024-10-17 16:05:32-05:00",
        "unique_id": "1929cb78034c02ee",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]