[
    {
        "company": "Schrilltech",
        "job_title": "Database Administrator 3",
        "location": "Austin, TX, USA",
        "full_location": {
            "city": "Austin",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "529501199",
            "experience_required": "13 Years & Above",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Database Management",
                "Performance Tuning",
                "Data Modeling",
                "Database Security",
                "Database Software Installation"
            ],
            "primary": [
                "Utility Programs",
                "Data Integrity",
                "Relational Database Models",
                "Disaster Recovery Procedures",
                "Computer Systems Analysis"
            ],
            "secondary": [
                "Computer Programming",
                "Project Control",
                "Cost Estimating Techniques",
                "Data Processing Flowcharting",
                "EIR Accessibility Standards"
            ],
            "all": [
                "Database Management",
                "Performance Tuning",
                "Data Modeling",
                "Database Security",
                "Database Software Installation",
                "Utility Programs",
                "Data Integrity",
                "Relational Database Models",
                "Disaster Recovery Procedures",
                "Computer Systems Analysis",
                "Computer Programming",
                "Project Control",
                "Cost Estimating Techniques",
                "Data Processing Flowcharting",
                "EIR Accessibility Standards"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "manindra",
        "email": "manindra@schrilltech.com",
        "jd": "From: manindra, schrilltech manindra@schrilltech.com Reply to: manindra@schrilltech.com Hi Good Morning,Hope you are doing wellWe have a position for the below requirement.ONLY LOCAL Role: Database Administrator 3Location: Austin, TX 78751 || RemoteDuration : 12 MonthsJob Id: 529501199Experience:13 Years & AboveClient: State of TXKey Responsibilities:·Enter codes to create a production database. Selects and enters codes of utility programs to monitor database performance, such as distribution of records and amount of available memory.·Directs programmers and analysts to make changes to database management systems.·Reviews and corrects programs. Answers user questions. Confers with coworkers to determine impact of database changes on other systems and staff cost for making changes. Modifies database programs to increase processing performance, referred to as performance tuning. Workers typically specialize in one or more types of database management systems.·Providing assistance in the planning, development, maintenance, and monitoring of integrated database systems, and ensuring that the conceptual and design phases of new applications are consistent with the structural parameters within the database environment.·Evaluates users requests for new data elements and systems, incorporates them into the existing shared data environment, and provides technical assistance.·Coordinates the use of data to ensure data integrity and control redundancy, loads databases, and reorganizes as needed. Performs data modeling and prototyping.·Performs logical and physical data modeling, designs relational database models, and creates physical data models from logical data models.·Performs security recovery procedures. Determines and implements database search strategies and storage requirements.·Maintains data dictionaries ensuring uniformity of definitions and sets standards for use of data dictionaries. Monitors database performance and recommends efficiency improvements.·Creates a test database environment for the applications section, including the creation of necessary libraries and procedures. Executes the procedures necessary to save, retrieve, and recover databases from hardware and software failures within established procedures.·Assists with determining, implementing, and enhancing standards on database security and with monitoring agency disaster recovery procedures and systems. Assists with the installation of database software and with analyzing, designing, and implementing databases. Assists in benchmarking and threshold testing of databases and with establishing and controlling necessary database security. Assists in the selection of database management software.·Experience in computer systems analysis or computer programming work.·Knowledge of the principles, practices, and techniques of computer programming and systems design; of computer operations, systems, and procedures; of project control and cost estimating techniques; of computer programming languages; of data processing flowcharting techniques; of database structures and theories; and of current database technologies.·Has working knowledge of EIR Accessibility standards and assistive technologies.·Ensures that user interfaces for database administration and inputting, viewing, outputting data(via reports) are compliant with accessibility standards.·Provides support to users in obtaining data / information when EIR Accessibility issues arise.",
        "source": "Email",
        "date_posted": "2024-10-17 09:51:29-05:00",
        "unique_id": "1929b39a7ed3a7fe",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "DB Admin"
    }
]