[
    {
        "company": "Steneral Consulting Inc.",
        "job_title": "Business Operations Specialist",
        "location": "East Peoria, IL, USA",
        "full_location": {
            "city": "East Peoria",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Minimum 3 years relevant industry experience",
            "degree_required": "Bachelor’s degree in business management, economics, finance, accounting, engineering or relevant field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$40/hr. on C2C only"
        },
        "skills": {
            "core": [
                "MS O365 applications",
                "PowerApp development",
                "DMAIC principles"
            ],
            "primary": [
                "Power-BI",
                "Tableau data visualization development",
                "mechanical drivetrain components"
            ],
            "secondary": [
                "process-oriented mindset",
                "ability to communicate with a cross-functional audience",
                "ability to engage others to take action"
            ],
            "all": [
                "MS O365 applications",
                "PowerApp development",
                "DMAIC principles",
                "Power-BI",
                "Tableau data visualization development",
                "mechanical drivetrain components",
                "process-oriented mindset",
                "ability to communicate with a cross-functional audience",
                "ability to engage others to take action"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Anshu Chaudhary",
        "email": "anshu@steneral.com",
        "jd": "From: Anshu Chaudhary, Steneral Consulting Inc. anshu@steneral.com Reply to: anshu@steneral.com Job Title - Business Operations Specialist Location - East Peoria, IL- hybrid Visa: Green Card Holder, US Citizen Rate $40/hr. on C2C only Description - Develop standard data analysis procedures with automation Monthly reporting of R&E budget, project financials Fulfill data analyst role on select Lifecycle projects Typical task breakdown:- Create process map of existing manual data collection/analysis needs through collaboration with subject matter experts- Develop data tools to automate collection, analysis and report generation after exhausting opportunities for replication through collaboration with enterprise process partners and peers Interaction with team:- Daily collaboration with Drivetrain Lifecycle team members- Weekly engagement with enterprise process partners and SME’s Education & Experience Required:- Bachelor’s degree in business management, economics, finance, accounting, engineering or relevant field- Minimum 3 years relevant industry experience Technical Skills(Required) MS O365 applications, including PowerApp development Experience with DMAIC principles of project execution (Desired) Power-BI or Tableau data visualization development Familiarity and understanding of mechanical drivetrain components Soft Skills(Required) Process-oriented mindset, disciplined in developing and following a process Ability to communicate with a cross-functional audience (engineering, procurement, supply chain, accounting) Ability to engage others to take action on identified opportunities (Desired) Clifton Strengths: Achiever, Analytical, Discipline, Ideation, Relator Thanks & Regards, Anshu Chaudhary Ass. Team Lead-Talent Acquisition -North America Direct: +1 302-440-2497 anshu@steneral.com",
        "source": "Email",
        "date_posted": "2024-10-17 15:31:02-05:00",
        "unique_id": "1929c4db540d0f8e",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]