[
    {
        "company": "Siri infosolutions Inc",
        "job_title": "Project Management with ServiceNow implementation",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Master's degree in a related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "ServiceNow implementation",
                "Stakeholder Management",
                "Team Leadership",
                "Budget Management"
            ],
            "primary": [
                "Risk Management",
                "Quality Assurance",
                "Reporting",
                "Documentation"
            ],
            "secondary": [
                "Integration of ServiceNow",
                "Customization of ServiceNow",
                "Knowledge of SecOps",
                "Knowledge of GRC",
                "Knowledge of CSM"
            ],
            "all": [
                "Project Management",
                "ServiceNow implementation",
                "Stakeholder Management",
                "Team Leadership",
                "Budget Management",
                "Risk Management",
                "Quality Assurance",
                "Reporting",
                "Documentation",
                "Integration of ServiceNow",
                "Customization of ServiceNow",
                "Knowledge of SecOps",
                "Knowledge of GRC",
                "Knowledge of CSM"
            ],
            "with_experience": [
                "ServiceNow implementation"
            ]
        },
        "job_type": [],
        "contact_person": "Prateek Kapoor",
        "email": "prateek.kapoor@siriinfo.com",
        "jd": "From: Prateek Kapoor, Siri infosolutions Inc prateek.kapoor@siriinfo.com Reply to: prateek.kapoor@siriinfo.com Project Management with ServiceNow implementationRichmond, VA 1. Project Planning and Management: Lead the planning and execution of ServiceNow projects from inception to completion. - Define project scope, objectives, and deliverables that support business goals in collaboration with senior management and stakeholders. - Develop detailed project plans, schedules, and resource allocation. - Manage project risks, issues, and changes to ensure successful delivery. 2. Stakeholder Management: Act as the main point of contact between stakeholders and the project team. - Facilitate regular meetings and communications with stakeholders to report on project status, risks, and issues. - Ensure alignment between project objectives and business needs. 3. Team Leadership: Lead, coach, and mentor project team members, including business analysts, developers, testers, and other project staff. - Foster a collaborative and high-performance team environment. - Manage third-party vendors and consultants as required. 4. Budget and Resource Management: Manage project budgets, ensuring projects are delivered within approved financial limits. - Allocate resources effectively to meet project objectives and timelines. - Track project costs and report on financial performance against budgets. 5. Quality Assurance: Ensure that project deliverables meet quality standards and are delivered on time. - Implement best practices and methodologies for ServiceNow project management. - Conduct project reviews and lessons learned sessions post-delivery.6. Reporting and Documentation: Prepare and deliver project status reports, including progress, risks, and issues.- Maintain comprehensive project documentation throughout the project lifecycle. - Ensure proper handover of completed projects to operations and support teams.- Master's degree in a related field.- Experience in managing large-scale ServiceNow implementations. - Familiarity with integration and customization of ServiceNow with other enterprise systems. - Knowledge of other ServiceNow modules, such as SecOps, GRC, or CSM. Thank youPrateek Kkapoor",
        "source": "Email",
        "date_posted": "2024-10-17 06:28:29-05:00",
        "unique_id": "1929a5d0224e8a9a",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]