[
    {
        "company": "Vyze Inc",
        "job_title": "Sr. SQL Developer",
        "location": "Charlotte, NC, USA",
        "full_location": {
            "city": "Charlotte",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "4+ years",
            "degree_required": "BA/BS degree or equivalent work experience",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SQL",
                "Database Design",
                "Query Optimization",
                "Database Security"
            ],
            "primary": [
                "Interpersonal Skills",
                "Problem-Solving",
                "Conflict Resolution",
                "Detail-Oriented",
                "Organizational Skills"
            ],
            "secondary": [
                "Financial Services Experience",
                "Software Development Lifecycle",
                "Communication Skills"
            ],
            "all": [
                "SQL",
                "Database Design",
                "Query Optimization",
                "Database Security",
                "Interpersonal Skills",
                "Problem-Solving",
                "Conflict Resolution",
                "Detail-Oriented",
                "Organizational Skills",
                "Financial Services Experience",
                "Software Development Lifecycle",
                "Communication Skills"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Rohit Singh",
        "email": "srohit@vyzeinc.com",
        "jd": "From: Rohit Singh, Vyze Inc srohit@vyzeinc.com Reply to: srohit@vyzeinc.com Hi,Hope you are doing well today! My name is Rohit Singh and I am a Technical Recruiter working with Vyze Inc. I have an exciting opportunity with one of our client. Below are the job details for your review. If interested send me your updated resume with contact details, expected pay rate along with below information.Job Description -Need NC candidates** Title: Sr. SQL DeveloperLocation: Charlotte, NC - 3 Days on-siteContract - 6 MonthsVisa: USC or GC ONLYExcellent communication skillsFinancial experience a must Must Haves: Goal of this role/Primary responsibilities based on JO call:Design, develop, and maintain efficient, reliable, and scalable SQL databases.Enhance database performance through query optimization, indexing, and schema design improvements.Quickly troubleshoot and resolve database-related issues.Implement and uphold database security best practices in line with organizational standards.We are seeking an experienced SQL Developer to join our Research Management Systems team. As a SQL Developer, you will play a vital role in directing and supporting our database design & development process to build a next-generation software solution that investment teams across all areas of our business will use to make better-informed investment decisions. This is an exciting opportunity to work in a fast-paced environment, collaborate with cross-functional teams, and drive the successful delivery of a critical multi-year project.QualificationsBA/BS degree or equivalent work experience4+ years of SQL development experienceFamiliarity with the software development lifecycleExcellent communication, facilitation, and interpersonal skills, with the ability to effectively communicate with both technical and non-technical stakeholders.Strong problem-solving and conflict resolution skills, with the ability to address challenges and identify obstacles for the team.Detail-oriented and highly organized, with the ability to manage multiple priorities and complete tasks on time.Proven experience as a SQL Developer in a software development or data management role, within the Financial Services industry.Best RegardsRohit SinghUS Technical Recruiter |Vyze Inc.E-Mail: Srohit@vyzeinc.com",
        "source": "Email",
        "date_posted": "2024-10-17 18:35:24-05:00",
        "unique_id": "1929cf67e222cb7a",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "DB Admin"
    }
]