[
    {
        "company": "Virginia Department of Transportation (VDOT)",
        "job_title": "Business Analyst",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Requirements Documentation (BRD)",
                "Requirements Traceability Matrix (RTM)",
                "Agile Business Analyst",
                "Microsoft Office products",
                "Application Lifecycle management (ALM)"
            ],
            "primary": [
                "Scrum concepts and methodology",
                "Translating business and product strategy requirements",
                "Defining acceptance criteria",
                "Creating wireframes and prototypes",
                "Exceptional written and oral communications skills"
            ],
            "secondary": [
                "Certified Business Analysis Professional (CBAP)",
                "Certified Scrum Product Owner (CSPO)",
                "Team Foundation Server",
                "Automated testing tools",
                "Power platform"
            ],
            "all": [
                "Business Requirements Documentation (BRD)",
                "Requirements Traceability Matrix (RTM)",
                "Agile Business Analyst",
                "Microsoft Office products",
                "Application Lifecycle management (ALM)",
                "Scrum concepts and methodology",
                "Translating business and product strategy requirements",
                "Defining acceptance criteria",
                "Creating wireframes and prototypes",
                "Exceptional written and oral communications skills",
                "Certified Business Analysis Professional (CBAP)",
                "Certified Scrum Product Owner (CSPO)",
                "Team Foundation Server",
                "Automated testing tools",
                "Power platform"
            ],
            "with_experience": [
                "Business Requirements Documentation (BRD)",
                "Requirements Traceability Matrix (RTM)",
                "Agile Business Analyst",
                "Microsoft Office products",
                "Application Lifecycle management (ALM)"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Divya",
        "email": "divya@diasoftwaresolutions.com",
        "jd": "Hi , I hope this message finds you well! I am reaching out to you on an exciting Direct client opportunity with one of our clients. Can you please go through the requirements and let me know if you are interested in this position? Job Title : Business Analyst Work Arrangement: Hybrid Work Location: Richmond, VA Exp: 15+ Duration of the Project: 12 Months Interview Type: Both Webcam and In Person Interview Notes: candidates who have with prior State govt exp is huge plus! Ideally Virginia candidate is highly preferred Job Description : The Virginia Department of Transportation (VDOT) Information Technology Division (ITD) is seeking a Business Analyst to work as a key member of Business Analytics and Testing Support Team for IT projects. This analyst will support teams working in Agile (Sprint) as well as traditional Waterfall methodologies for Software Development Lifecycle (SDLC). Skills:-Delivering business and systems analysis artifacts such as Business Requirements Documentation (BRD), Requirements Traceability Matrix (RTM) -Agile Business Analyst; strong understanding of Scrum concepts and methodology -Experience translating business and product strategy requirements into application requirements and user stories-Proficient with defining acceptance criteria and managing acceptance process with development-Experience creating wireframes and prototypes (using applications such as Balsamiq)-Experience with large, multi-module systems Required 5 Years-Expertise with Microsoft Office products (Word, Excel, Access, Outlook, Visio, PowerPoint, Project Server) Required 10 Years-Experience with Application Lifecycle management (ALM) Required 5 Years-Exceptional written and oral communications skills and have the proven ability to work well with a diverse set of peers and customers Required-Certified Business Analysis Professional (CBAP) or Certified Scrum Product Owner (CSPO) Certification Desired-Experience using Team Foundation Server for agile software development and work item tracking Desired-Experience with automated testing tools such as Test Complete -Expertise with Power platform Desired Preferred:-CBAP and/or CSPO Certification-Experience using Team Foundation Server for agile software development and work item tracking-Experience with automated testing tools such as Test Complete",
        "source": "Email",
        "date_posted": "2024-10-17 13:59:18-05:00",
        "unique_id": "1929bf9bc0eb1c1f",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]