[
    {
        "company": "Samson Software Solutions",
        "job_title": "Oracle Project Manager",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Bachelor's degree in Computer Science, Information Technology, Business Administration, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle ERP",
                "Project Management",
                "Cutover Planning",
                "Data Migration",
                "Risk Management"
            ],
            "primary": [
                "Stakeholder Coordination",
                "Testing and Validation",
                "Contingency Planning",
                "Post-Cutover Support",
                "Documentation"
            ],
            "secondary": [
                "PMP",
                "Agile",
                "Prince2",
                "Communication",
                "Problem-solving"
            ],
            "all": [
                "Oracle ERP",
                "Project Management",
                "Cutover Planning",
                "Data Migration",
                "Risk Management",
                "Stakeholder Coordination",
                "Testing and Validation",
                "Contingency Planning",
                "Post-Cutover Support",
                "Documentation",
                "PMP",
                "Agile",
                "Prince2",
                "Communication",
                "Problem-solving"
            ],
            "with_experience": [
                "Oracle ERP (5+ years)",
                "Project Management (5+ years)"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Ashish Awasthi",
        "email": "ashish.awasthi@samsonsoft.com",
        "jd": "From: Ashish Awasthi, Samson software solutions ashish.awasthi@samsonsoft.com Reply to: ashish.awasthi@samsonsoft.com Role- Oracle Project ManagerLocation- RemoteMandate- In-depth knowledge of Oracle ERP modules (Finance, Supply Chain, HR, etc.) and cutover processesKey Responsibilities:Cutover planning: Develop and manage the detailed cutover plan, outlining activities, resources, and timelines required for the transition from legacy systems to Oracle ERP. Stakeholder coordination: Collaborate with cross-functional teams, including IT, business units, and external vendors, to ensure alignment on cutover activities and readiness. Risk management: Identify and mitigate potential risks associated with cutover activities, including data migration, system outages, and user access issues. Communication: Act as the main point of contact for all cutover-related communications, keeping stakeholders informed of timelines, activities, and any issues or changes. Data migration oversight: Coordinate data migration activities with technical teams, ensuring data integrity and accuracy through pre- and post-migration checks. Testing and validation: Work with QA and functional teams to develop and execute cutover testing plans, ensuring systems are fully operational before go-live. Contingency planning: Develop and maintain contingency plans for critical cutover activities, preparing for potential delays, rollbacks, or system issues. Post-cutover support: Oversee post-cutover stabilization activities, ensuring any issues are addressed quickly and that end-users have the support they need. Documentation: Create and maintain comprehensive documentation for all cutover activities, including step-by-step procedures, roles and responsibilities, and lessons learned. Continuous improvement: After cutover, conduct a post-mortem review and implement best practices for future deployments or upgrades. Required Qualifications: Education: Bachelor s degree in Computer Science, Information Technology, Business Administration, or a related field. Experience: 5+ years of project management experience, including at least 3 years with Oracle ERP implementations. Proven experience managing cutover activities for large-scale Oracle ERP projects. Technical Skills: In-depth knowledge of Oracle ERP modules (Finance, Supply Chain, HR, etc.) and cutover processes. Familiarity with data migration tools, techniques, and best practices. o Strong understanding of project management methodologies, such as PMP, Agile, or Prince2. Soft Skills: o Excellent organizational and time-management skills, with a keen attention to detail. o Strong communication and interpersonal skills, with the ability to manage multiple stakeholders effectively. o Problem-solving skills, with the ability to make quick decisions under pressure. (1.) To leverage design expertise to ensure that software and products exhibit user-friendliness, intuitiveness, and alignment with user expectations, contributing to the creation of seamless user experiences. (2.) To lead a team of designers, provide guidance, and ensuring the delivery of high-quality design solutions in alignment with the overall business goals. (3.) To present design concepts and play a crucial role in shaping the overall design vision and strategy. (4.) To stay abreast of industry trends, emerging technologies to drive innovation and excellence in design.Thanks & Regards, Ashish Awasthi | US IT Recruiter Samson Software Solutions Inc. Email: ashish.awasthi@samsonsoft.com",
        "source": "Email",
        "date_posted": "2024-10-17 10:01:08-05:00",
        "unique_id": "1929b216fe52189b",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]