[
    {
        "company": "Sun-Itsolutions",
        "job_title": "GenAI Program Manager",
        "location": "Sacramento, CA, USA",
        "full_location": {
            "city": "Sacramento",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Bachelor's degree in Computer Science, Business Administration, or related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "program management",
                "technology implementation",
                "AI",
                "machine learning",
                "risk management"
            ],
            "primary": [
                "change management",
                "stakeholder engagement",
                "executive presentation",
                "communication skills",
                "PMP certification"
            ],
            "secondary": [
                "AI/ML certifications",
                "Agile methodologies",
                "multi-domain project experience",
                "consulting experience"
            ],
            "all": [
                "program management",
                "technology implementation",
                "AI",
                "machine learning",
                "risk management",
                "change management",
                "stakeholder engagement",
                "executive presentation",
                "communication skills",
                "PMP certification",
                "AI/ML certifications",
                "Agile methodologies",
                "multi-domain project experience",
                "consulting experience"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Revanth",
        "email": "revanth@sun-itsolutions.com",
        "jd": "Hi Partners, Please Check below position: Don't Send without filling submission format I will not consider profile DescriptionWe are seeking a GenAI Program Manager for a hybrid assignment working 2 days/wk on-site with our Sacramento Based client. In this role you will oversee the entire GenAI implementation program, coordinating activities across different teams and stakeholders. This senior-level position requires a blend of project management expertise, strategic thinking, and leadership skills. Key Responsibilities:Lead and execute complex GenAI implementation programsDevelop and maintain project plans, timelines, and budgetsCoordinate activities across different teams and stakeholdersManage risks and issues, ensuring timely resolutionReport project progress to senior managementDrive client satisfaction through effective communication and solution deliveryIdentify and propose process improvements and automation opportunitiesEngage with executives to drive value-based solution discussionsContribute to business development efforts and proposal creationDemonstrate thought leadership in GenAI implementation and team integration Required Qualifications:10+ years of experience in program management, with at least 5 years focus on technology implementation projects5+ years in consulting or senior leadership rolesStrong understanding of AI and machine learning conceptsProven track record in designing and implementing large-scale technology solutions using industry best practicesExperience in change management and stakeholder engagementExpertise in risk management and mitigation strategiesStrong executive presentation and communication skillsPMP or similar project management certification Preferred Qualifications:Experience in AI or machine learning implementationsRelevant industry certifications (e.g., AI/ML certifications, Agile methodologies)Bachelor's degree in Computer Science, Business Administration, or related fieldMulti-domain project experience solving complex organizational challengesProven consulting experience with a focus on client engagementIf you're consultant has all the skills required, you will be notified when we will move forward. Please attach with DL& Visa copy Submission process format First Name Middle Name Last Name LinkedIn Contact Number Email Address Skype Id / Zoom ID Available Start Date Best time to call you in Working hours Your preferred Interview time Slot Work Authorization Visa expire date Highest Qualification Year of Passing University Comfortable working on Dayone onsite role Yes / No :- Last 4 Digits of SSN Total Years of Experience Total U.S.A. Years of Experience Current Location Willing to Relocate (Yes/No) Passport Number Pay Rate (W2/1099/C2C) Profile Sourced from Vendor/Partner company is Consultant on there W2/1099/H1b ?",
        "source": "Email",
        "date_posted": "2024-10-17 13:27:09-05:00",
        "unique_id": "1929c857ff88a13c",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]