[
    {
        "company": "VRN Tech",
        "job_title": "Business Systems Analyst",
        "location": "Manassas, VA, USA",
        "full_location": {
            "city": "Manassas",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "experience_required": "Senior-level, 6-9 years",
            "degree_required": "B.S or M.S with Comp. Sci. or closely related Major",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Analytical skills",
                "Knowledge of Atlassian tools",
                "Knowledge of UML including sequence and activity diagrams",
                "UX Requirements using wire diagrams"
            ],
            "primary": [
                "Exposure to Azure Cloud solutions",
                "Ability to critically process multiple sources of information",
                "Customer oriented and quality mindset",
                "Excellent in follow ups and collaboration with stakeholders",
                "Fluent in English",
                "Exposure to Financial Messaging Applications"
            ],
            "secondary": [],
            "all": [
                "Analytical skills",
                "Knowledge of Atlassian tools",
                "Knowledge of UML including sequence and activity diagrams",
                "UX Requirements using wire diagrams",
                "Exposure to Azure Cloud solutions",
                "Ability to critically process multiple sources of information",
                "Customer oriented and quality mindset",
                "Excellent in follow ups and collaboration with stakeholders",
                "Fluent in English",
                "Exposure to Financial Messaging Applications"
            ]
        },
        "job_type": [],
        "contact_person": "pavan",
        "email": "pavan@vrntech.us",
        "jd": "Hello Business Systems Analyst -Manassas,VADescriptionWe are looking for a business/systems analyst who excels in translating business needs and requirements into technical functionalities and specifications for large systems with complex interacting components and very low risk tolerance projects. In addition to understanding business requirements, the role needs skills of functionally understanding internal message flows, interactions between components and their recoverability. Should have awareness of impact on message flows due to component recoveries. These are mission critical products, so both functional and systems view are needed, and the requirement specifications include non-functional aspects like observability, performance, RTO, RPO, etc.This role requires wide collaboration with several stakeholders such as Marketing specialists, Customer Support, Enterprise/Solution Architect, other Business Analysts, Developers and Testers working across different tribes/groups. During this process you will be the customer’s voice and ensure that customer’s business problems are solved. While you meticulously gather, define and maintain functional requirement specifications identify the product inter-dependencies as you will have a vantage point that provides the wide perspective. Your ability to manage multiple sources of information, sometimes conflicting, and to quickly master the specification aspect of solutions will be needed. As the solution evolves pay attention to details and ensure high quality of artefacts produced. The artefacts include applicable diagrams that best illustrate the overview and functional aspects. This is not a project management or equivalent role, this role requires producing detailed artefacts.When needed, prepare and conduct requirement workshops, walkthrough, critical review and presentations on system enhancements and/or alternatives. Support testers in defining/understanding acceptance criteria during qualification cycles.You will be working with tribes/squads in multiple time zones across 3 continents. This may need flexibility for getting better time overlap.",
        "source": "Email",
        "date_posted": "2024-10-17 11:41:46-05:00",
        "unique_id": "1929b7bd3efa38c6",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]