[
    {
        "company": "Sligo Software Solutions Inc.",
        "job_title": "PowerBuilder/Java Developer with the EAServer Enterprise Application Framework (DDS EAF)",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "PowerBuilder",
                "Java",
                "EAServer Enterprise Application Framework (DDS EAF)",
                "C#"
            ],
            "primary": [
                "CORBA",
                "JSP",
                "code review",
                "knowledge transfer",
                "communication skills"
            ],
            "secondary": [
                "remote work",
                "documentation",
                "architecture diagrams",
                "technology roadmaps",
                "technical specifications",
                "project management"
            ],
            "all": [
                "PowerBuilder",
                "Java",
                "EAServer Enterprise Application Framework (DDS EAF)",
                "C#",
                "CORBA",
                "JSP",
                "code review",
                "knowledge transfer",
                "communication skills",
                "remote work",
                "documentation",
                "architecture diagrams",
                "technology roadmaps",
                "technical specifications",
                "project management"
            ],
            "with_experience": [
                "PowerBuilder (6+ years)",
                "Java (6+ years)",
                "EAServer Enterprise Application Framework (DDS EAF) (6+ years)"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Hemamalini Logan",
        "email": "hemamalini.logan@sligosoft.com",
        "jd": "From: Hemamalini Logan, Sligosoft hemamalini.logan@sligosoft.com Reply to: hemamalini.logan@sligosoft.com Hi,Greetings from Sligo Software Solutions, Inc. !!SLIGO is a Software Development & IT Consulting company. We have around 100+ IT associates working with our esteemed clients across several domains such as IT, Banking, Healthcare, and Government. We have an urgent requirement for PowerBuilder/Java Developer with the EAServer Enterprise Application Framework (DDS EAF) position with our client.Job Title: PowerBuilder/Java Developer with the EAServer Enterprise Application Framework (DDS EAF)Duration: 12 monthsLocation: RemoteJob Description: This is 100% Remote opportunity. I have attached a form to be duly filled by the qualified candidates with all details. The client will not look into the resume of the candidate. Total Work Experience : 10+ Years PowerBuilder/Java Developer• Provide two lead development resources to rewrite the EAF framework java classes that currently support the JSP-to-Jaguar calls (via CORBA) into C#.• Deploy code through the DEV, QA, and Production environments at appropriate times in the development lifecycle.*• Provide code review and knowledge transfer sessions with NYS IT staff.• Provide Remediation of any post deployment issues.Minimum Qualifications: a)Minimum of 6 years of experience successfully migrating 3-tier PowerBuilder Systems to modernized, supported platforms. b)Minimum 6 years of experience specifically with the EAServer Enterprise Application Framework (DDS EAF). c)Possess excellent communication skills including, but not limited to: (1) the ability to provide highly effective knowledge transfer; and (2) the ability to provide written documentation of architecture diagrams, technology roadmaps, technical specifications, procedures, technical recommendations, testing results and project management documentation including risks, issues, and schedules. d)Possess a demonstrable ability (based on the successful completion of previous projects) to successfully work effectively in a remote environment while maintaining a high level of collaboration with all project team members. Thanks & RegardsHemamalini LoganSenior Talent Acquisition SpecialistSligo Software Solutions Inc.Hemamalini.logan@sligosoft.comwww.sligosoft.comOffice: (518) 444-0459 X 122Fax: (518) 444 0457Sligo Software Solutions IncSLIGO specializes in IT Consulting, Right-to-Hire Solutions, and Staff Augmentation in Albany, NY. We connect Government and Enterprise clients with top technology talent. Explore our services for ...",
        "source": "Email",
        "date_posted": "2024-10-17 09:26:43-05:00",
        "unique_id": "1929b036f5547fbf",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]