[
    {
        "company": "Apple",
        "job_title": "Project Manager with service channel admin experience",
        "location": "San Jose, CA, USA",
        "full_location": {
            "city": "San Jose",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "ServiceChannel",
                "System Integration"
            ],
            "primary": [
                "Data Integration",
                "Stakeholder Communication",
                "Process Improvement",
                "Problem-Solving",
                "Organizational Skills"
            ],
            "secondary": [
                "Facilities Management",
                "Operations",
                "Corporate Services",
                "Technical Background",
                "Global Rollouts"
            ],
            "all": [
                "Project Management",
                "ServiceChannel",
                "System Integration",
                "Data Integration",
                "Stakeholder Communication",
                "Process Improvement",
                "Problem-Solving",
                "Organizational Skills",
                "Facilities Management",
                "Operations",
                "Corporate Services",
                "Technical Background",
                "Global Rollouts"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Sushil Kaushik",
        "email": "sushil.k@mobcoderstaffing.com",
        "jd": "Hi Please share the resume on sushil.k@mobcoderstaffing.comPosition : Project Manager with service channel admin experienceLocation : San Jose, CAContract :contract About the Role:Apple is seeking an experienced Project Manager to lead the global rollout of key iniEaEves across our Corporate spaces. This contractor role will focus on implementing systems and processes that enhance our operational.ons and Maintenance experience. The ideal candidate will have a strong background in managing complex global rollouts.Key Responsibili.es:?Manage the global rollout of systems and tools, ensuring alignment with Apple?s objectives and operational needs.?Develop and maintain project plans, tracking milestones, risks, and dependencies to ensure successful implementaEon.?Collaborate with engineering, operations, and regional stakeholders to ensure that requirements are met and issues are promptly resolved.?Oversee data integration and system dependencies and resolve gaps before implemetation ?Drive process improvements, particularly around efficiencies while maintaining current timelines?Facilitate stakeholder communication, providing regular updates on project progress, risks, and issue resolution.?Ensure seamless transition post-rollout, working with operational teams to embed new tools and systems into their daily processes.?Provide training and documentation to support regional stakeholdersQualifications:?Proven experience as a Project Manager, with a strong track record of leading global rollouts or implementations.?Experience managing end-to-end project lifecycles, from planning through execution, including handling complex data dependencies.?Ability to manage multiple stakeholders across different regions and Eme zones.?Strong problem-solving and organizational skills, with the ability to handle technical challenges in real-Eme.?Excellent communication skills with experience presenting project updates to leadership and cross-functional teams.?Technical background or familiarity with system integration is a plus.Preferred Experience:?Experience with ServiceChannel or similar facilities management/operations systems. ?Prior experience in facilities management, operations , or corporate services within a fast- paced environment.?Ability to work global hours to manage international teams and stakeholders.",
        "source": "Email",
        "date_posted": "2024-10-17 09:32:09-05:00",
        "unique_id": "1929b08b390cab4f",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]