[
    {
        "company": "Vysystems",
        "job_title": "Data Scientist With GCP & Gen AI Consultant",
        "location": "Hartford, CT, USA",
        "full_location": {
            "city": "Hartford",
            "state": "CT",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "12-16 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Python",
                "PySpark",
                "Thoughtspot",
                "GCP Gen AI chat-bison",
                "GCP Gen AI text-bison",
                "GCP Gen AI code-bison",
                "GCP Gen AI speech",
                "Oracle GenAI"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Python",
                "PySpark",
                "Thoughtspot",
                "GCP Gen AI chat-bison",
                "GCP Gen AI text-bison",
                "GCP Gen AI code-bison",
                "GCP Gen AI speech",
                "Oracle GenAI"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Kaushik",
        "email": "kaushik@vysystems.com",
        "jd": "From: Kaushik, vysystems kaushik@vysystems.com Reply to: kaushik@vysystems.com Primary skills:(12+ Years Exp)Python,PySpark,Thoughtspot,GCP Gen AI chat-bison,GCP Gen AI text-bison,GCP Gen AI code-bison,GCP Gen AI speech,Oracle GenAIWe are seeking a highly skilled GeoSpatial Sr. Engineer with extensive experience in Thoughtspot Sage AI , PySpark, Python, and various GCP Gen AI technologies. The ideal candidate will have 12 to 16 years of experience and will work in a hybrid model. This role involves leveraging advanced technologies to drive impactful solutions, contributing to our companys mission and societal impact. 3.Experience : 12to16Yrs 4.Required Skills : ,Python,PySpark,Thoughtspot,GCP Gen AI chat-bison,GCP Gen AI text-bison,GCP Gen AI code-bison,GCP Gen AI speech,Oracle GenAI 5.Nice to have skills : 6.Technology : -Not Applicable 7.Shift : Day 8.Responsibilities : - Lead the development and implementation of solutions using Thoughtspot, PySpark, and Python to meet business requirements. - Oversee the integration of GCP Gen AI text-bison, speech, code-bison, and chat-bison technologies to enhance data processing and analysis. - Realtime streaming for ECOS migration Guidewire SAS , Start doing Realtime POC smaller use case in 2025. - Provide technical expertise in the design and deployment of Oracle GenAI solutions to support projects. - Collaborate with cross-functional teams to gather requirements and ensure the successful delivery of solutions. - Conduct thorough data analysis and visualization to support decision-making processes and drive business insights. - Develop and maintain geospatial databases and ensure data accuracy and integrity. - Implement best practices for geospatial data management and processing to optimize performance and scalability. - Mentor and guide junior engineers in geospatial technologies and best practices. - Stay updated with the latest advancements in geospatial technologies and incorporate them into ongoing projects. - Ensure compliance with industry standards and regulations in all geospatial projects. - Provide technical support and troubleshooting for geospatial applications and systems. - Contribute to the continuous improvement of geospatial processes and methodologies. - Communicate effectively with stakeholders to present findings and recommendations. -Qualifications - Possess a minimum of 12 years of experience in geospatial engineering with a strong background in Thoughtspot, PySpark, and Python. - Demonstrate expertise in GCP Gen AI technologies, including text-bison, speech, code-bison, and chat-bison. - Have experience with Oracle GenAI and its application in geospatial projects. - Exhibit strong analytical and problem-solving skills with the ability to interpret complex geospatial data. - Show proficiency in data visualization tools and techniques to present geospatial insights. - Display excellent communication and collaboration skills to work effectively with cross-functional teams. - Maintain a proactive approach to learning and implementing new geospatial technologies and methodologies. 9.Job Location : Primary :USCTHARC01 Hartford - CT USA, CLT Alternate : , 10.Job Type : 45CW15 Zn Technical Consultant 11.Demand Requires Travel? : N 12.Certifications Required : Certified ThoughtSpot Professional, GCP Professional Data Engineer, Oracle Certified Professional",
        "source": "Email",
        "date_posted": "2024-10-17 10:07:26-05:00",
        "unique_id": "1929b26a69312a72",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "GCP Data Engineer"
    }
]