[
    {
        "company": "Inherent Technologies",
        "job_title": "Business Analyst Healthcare",
        "location": "Residing, NJ, USA",
        "full_location": {
            "city": "Residing",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "8+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "1 Year",
            "rate": "$55/hour"
        },
        "skills": {
            "core": [
                "Business Analyst",
                "GxP",
                "Veeva Vault systems"
            ],
            "primary": [
                "Business analysis skills",
                "Writing system test scripts",
                "Testing",
                "Coordinating with stakeholders",
                "Agile (SAFe) environment"
            ],
            "secondary": [
                "Good communication skills",
                "Knowledge of Veeva systems (CRM and medcomms and Med inquiry)",
                "Document Process flows"
            ],
            "all": [
                "Business Analyst",
                "GxP",
                "Veeva Vault systems",
                "Business analysis skills",
                "Writing system test scripts",
                "Testing",
                "Coordinating with stakeholders",
                "Agile (SAFe) environment",
                "Good communication skills",
                "Knowledge of Veeva systems (CRM and medcomms and Med inquiry)",
                "Document Process flows"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Nekesh",
        "email": "nekesh@inherenttech.com",
        "jd": "From: Nekesh, Inherent Technologies nekesh@inherenttech.com Reply to: nekesh@inherenttech.com PASSPORT NUMBER REQUIREDLOCAL TO NEW JERSEY(DL MUST BE LOCAL TO NEW JERSEY OR NEW YORK)RATE – 55$/HR ON C2CNO OPT NO GCEXP. 8+ REQUIREDGreetings from Inherent Technologies! Hope this email finds you in the best of your health,My name is Nekesh and I'm an IT recruiter at Inherent Technologies. I came across your resume on one of the job boards and wanted to check if you are available for a new role. Look forward to talking to you Position: Business Analyst HealthcareLocation: Residing, NJ ***Day 1 Onsite***Duration: 1 Years Phone & SkypeClient: HCLImmediate Interview Mandatory SkillsBusiness Analyst, GxP, Veeva Vault systems (and Med Comms and Med inquiry) Looking for a smart, positive, enthusiastic candidate that is on top of the things. Should be preferably on eastern time. Central time will do. Business analysis skills Writing system test scripts and testing Coordinating with various stakeholders to get the work done in an efficient way Knowledge of working in Agile (SAFe) environment. Experience in working on GxP regulated applications and knowledge of validation Document Process flows Knowledge of Veeva systems (CRM and medcomms and Med inquiry) is a plus Good communication skills (Written and verbal) (1.) To oversee quality assurance processes, ensuring adherence to coding standards, implementation of best practices and participate in technical discussions or review. (2.) To create work plans, monitor and track the work schedule for on time delivery as per the defined quality standards. (3.) To Identify potential risks and issues that may impact project timelines or quality and accordingly develop mitigation strategies or contingency plans to address risks. (4.) To lead and empower a dynamic development team by boosting their technical skills, improving productivity, and fostering a collaborative high-performance culture.",
        "source": "Email",
        "date_posted": "2024-10-17 13:12:39-05:00",
        "unique_id": "1929bcf0458a4762",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]