[
    {
        "company": "Texas Health and Human Services Commission",
        "job_title": "Oracle Database Administrator 2",
        "location": "Austin, TX, USA",
        "full_location": {
            "city": "Austin",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "6 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Visa sponsorship available",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle database design",
                "Performance tuning",
                "Data analysis",
                "Technical documentation",
                "Agile methodology"
            ],
            "primary": [
                "Enterprise applications design",
                "Multi-tier system/application development",
                "Oracle Stored Procedures",
                "PL/SQL",
                "Linux shell scripting"
            ],
            "secondary": [
                "Jira",
                "Oracle Certification",
                "Data warehouse applications",
                "Database reporting features"
            ],
            "all": [
                "Oracle database design",
                "Performance tuning",
                "Data analysis",
                "Technical documentation",
                "Agile methodology",
                "Enterprise applications design",
                "Multi-tier system/application development",
                "Oracle Stored Procedures",
                "PL/SQL",
                "Linux shell scripting",
                "Jira",
                "Oracle Certification",
                "Data warehouse applications",
                "Database reporting features"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Nidhi Yadav",
        "email": "nidhi.yadav@tekinspirations.com",
        "jd": "Hello,Hope you are doing well..I have positions for . Oracle Database Administrator 2in Location::Remote with our client. Kindly review the job description below and see if it might be an option worth considering.Note 1 : Candidates must fill out the job form with 3 official References, Skill matrix and RTR – For the End Client Submission. Note 2 : Please submit only candidates who have more years of experience in the required field given in the skill matrix below. – Only Qualified as per the requirement. Solicitation 529501191 EC : Texas Health and Human Services Commission.Role : Oracle Database Administrator 2Location : Austin, Texas ( Remote ) – candidate have to pick up the laptop by themselves. Position will be remote but need candidates to be in State of Texas or who can relocate to Texas. LinkedIn is a mustAny Visa ok ( only need qualified candidates. H1B is ok. 8 years of experience is ideal for Level 2. Level Description4-7 years of experience in the field or in a related area. Familiar with standard concepts, practices, and procedures within a particular field. Relies on limited experience and judgment to plan and accomplish goals. A certain degree of creativity and latitude is required. Works under limited supervision with considerable latitude for the use of initiative and independent judgment.? Job DescriptionEnters codes to create production data base. Selects and enters codes of utility program to monitor database performance, such as distribution of records and amount of available memory. Directs programmers and analysts to make changes to data base management system. Reviews and corrects programs. Answers user questions. Confers with coworkers to determine impact of data base changes on other systems and staff cost for making changes to data base. Modifies data base programs to increase processing performance, referred to as performance tuning. Workers typically specialize in one or more types of data base management systems. Providing assistance in the planning, development, maintenance, and monitoring of integrated database systems, and ensuring that the conceptual and design phases of new applications are consistent with the structural parameters within the database environment. Evaluates users' requests for new data elements and systems, incorporates them into the existing shared data environment, and provides technical assistance. Coordinates the use of data to ensure data integrity and control redundancy, loads databases, and reorganizes as needed. Performs data modeling and prototyping. Performs logical and physical data modeling, designs relational database models, and creates physical data models from logical data models. Performs security recovery procedures. Determines and implements database search strategies and storage requirements. Maintains data dictionary ensuring uniformity of definitions and sets standards for use of data dictionary. Monitors database performance and recommends efficiency improvements. Creates test database environment for applications section, including the creation of necessary libraries and procedures. Executes the procedures necessary to save, retrieve, and recover databases from hardware and software failures within established procedures. Assists with determining, implementing, and enhancing standards on database security and with monitoring agency disaster recovery procedures and systems. Assists with the installation of database software and with analyzing, designing, and implementing databases. Assists in benchmarking and threshold testing of databases and with establishing and controlling necessary database security. Assists in the selection of database management software. Experience in computer systems analysis or computer programming work. Knowledge of the principles, practices, and techniques of computer programming and systems design; of computer operations, systems, and procedures; of project control and cost estimating techniques; of computer programming languages; of data processing flowcharting techniques; of database structures and theories; and of current database technologies. Has working knowledge of EIR Accessibility standards and assistive technologies. Ensures that user interfaces for database administration and inputting, viewing, outputting data(via reports) are compliant with accessibility standards. Provides support to users in obtaining data / information when EIR Accessibility issues arise. Additional job details and special considerationsThis Database Administrator contractor position is part of the Administrative Applications Production Data Services team and will be working on the development and implementation of modifications and enhancements to the Financial Data Warehouse. This position will perform the duties of database development will perform advanced database development tasks for databases used by an application with complex data models, workflows, and reports. May be required to create new logical and physical data models. The role will involve working with Oracle databases. The candidate will optimize database performance during and after migration, identify and resolve performance bottlenecks, and implement monitoring solutions to track database health and performance metrics. This position will develop new views, tables and PL/SQL code to be used by the customer of the Financial Data Warehouse application. Will work on activities including, but not limited to the design, development, and testing of new tables, views, PL/SQL stored procedures and functions, and necessary loaders to support the project news. Will develop and test Linux shell scripts to invoke database calls. Will develop and test scheduled jobs and shell scripts. May perform performance tuning of new and existing tables, views, PL/SQL code. The role will involve working closely with the team to create and maintain logical and physical data models, with a primary focus on Oracle. This role will require knowledge of Oracle Stored Procedures and Functions. II. CANDIDATE SKILLS AND QUALIFICATIONS Minimum Requirements: Candidates that do not meet or exceed the minimum stated requirements (skills/experience) will be displayed to customers but may not be chosen for this opportunity.ActualYearsExperienceYearsExperienceNeededRequired/PreferredSkills/Experience 6RequiredExperience in Oracle database design, analysis, and performance tuning 6RequiredExperience in Oracle database structures and data analysis 6RequiredExperience designing enterprise applications and/or services 6RequiredExperience creating technical and functional design documentation 6RequiredExperience within software development lifecycle using Agile methodology – (Scrum, for example) 6RequiredExperience with multi-tier system/application development – (SOA, Microservices, 3-Tier applications, for example) 1PreferredJira experience 1PreferredOracle Certification 1PreferredExperience with data warehouse applications and/or database reporting features",
        "source": "Email",
        "date_posted": "2024-10-17 12:25:49-05:00",
        "unique_id": "1929ba4291c841c3",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Oracle DBA"
    }
]