[
    {
        "company": "Texas Health and Human Services Commission",
        "job_title": "Project Manager 2",
        "location": "Austin, TX, USA",
        "full_location": {
            "city": "Austin",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "6 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "8+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Agile (Scrum)",
                "Development"
            ],
            "primary": [
                "State of Texas Project Management",
                "Jira"
            ],
            "secondary": [
                "PMP Certification",
                "State of Texas Project Delivery Framework",
                "Experience with data warehouse applications and/or database reporting features",
                "State Procurement and Contracting"
            ],
            "all": [
                "Project Management",
                "Agile (Scrum)",
                "Development",
                "State of Texas Project Management",
                "Jira",
                "PMP Certification",
                "State of Texas Project Delivery Framework",
                "Experience with data warehouse applications and/or database reporting features",
                "State Procurement and Contracting"
            ],
            "with_experience": [
                "Project Management (6 years)",
                "Agile (Scrum) (3 years)",
                "Development (3 years)"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Rohit Kumar Singh",
        "email": "rksingh@vyzeinc.com",
        "jd": "From: Rohit Kumar Singh, Vyze Inc rksingh@vyzeinc.com Reply to: rksingh@vyzeinc.com Hi,Hope you are doing well today! Myself Rohit Kumar Singh working as Technical recruiter at Vyze Inc. I have an exciting opportunity with one of our client. If interested send me your updated resume with contact details. Job Description -Job Title : Project Manager 2Location : 701 W 51st Street Austin, TX 78751 (REMOTE)Duration : 8+ Months (With possibility of extensions)LinkedIn required with three reference Candidate needs to be in TX State and must have 6 years of experience with State of Texas or similar Federal/State Project Management.Texas Health and Human Services Commission requires the services of 1 Project Manager 2, hereafter referred to as Candidate(s), who meets the general qualifications of Project Manager 2, Project Management and the specifications outlined in this document for the Texas Health and Human Services Commission. II. CANDIDATE SKILLS AND QUALIFICATIONSMinimum Requirements:Candidates that do not meet or exceed the minimum stated requirements (skills/experience) will be displayed to customers but may not be chosen for this opportunity.YearsRequired/PreferredExperience6RequiredProject Management experience for large-scale enterprise implementations6RequiredState of Texas or similar Federal/State Project Management experience3RequiredAgile (Scrum) experience3RequiredDevelopment experience3RequiredJira Experience1PreferredPMP Certification1PreferredState of Texas Project Delivery Framework experience1PreferredExperience with data warehouse applications and/or database reporting features1PreferredState Procurement and Contracting experienceIII. TERMS OF SERVICEServices are expected to start 11/25/2024 and are expected to complete by 08/31/2025. Total estimated hours per Candidate shall not exceed 1680 hours. This service may be amended, renewed, and/or extended providing both parties agree to do so in writing. IV. WORK HOURS AND LOCATIONServices shall be provided during normal business hours unless otherwise coordinated through the Texas Health and Human Services Commission. Normal business hours are Monday through Friday from 8:00 AM to 5:00 PM, excluding State holidays when the agency is closed.The primary work location(s) will be at 701 W 51st Street Austin, TX 78751. The working position is Telework. Any and all travel, per diem, parking, and/or living expenses shall be at the Candidate's and/or Vendor's expense. Texas Health and Human Services Commission will provide pre-approved, written authorization for travel for any services to be performed away from the primary work location(s). Pre-approved travel expenses are limited to the rates and comply with the rules prescribed by the State of Texas for travel by its classified employees, including any requirement for original receipts.The Candidate(s) may be required to work outside the normal business hours on weekends, evenings and holidays, as requested. Payment for work over 40 hours will be at the hourly rate quoted and must be coordinated and pre-approved through Texas Health and Human Services Commission. V. OTHER SPECIAL REQUIREMENTSTERM OF SERVICE (Required)Services are expected to start on or around November 25, 2024 and are expected to completed by August 31, 2025. Total estimated hours per Candidate shall not exceed 1,680 hours for FY25. WORK HOURS AND LOCATION (Required)A) Services shall be provided during normal business hours unless otherwise coordinated through the Agency. Normal business hours are Monday through Friday from 8:00 a.m. through 5:00 p.m., excluding Texas state holidays when the agency is closed.B) The primary work location will be 4601 W. Guadalupe, Austin, Texas 78751. (remote position)Position will be remote. Program will allow candidates who are within the state (Any location within the State of Texas).C) Any and all travel, per diem, parking, and/or living expenses shall be at the worker's and/or Vendor's expense.D) The worker may be required to work remotely at HHSC discretion, up to 100 percent of the time.E) The worker may be required to work outside the normal business hours on weekends, evenings and holidays, as requested. Payment for work over 40 hours will be at the hourly rate quoted and must be coordinated and pre-approved through the Agency. Best RegardsRohit Kumar SinghTechnical Recruiter |Vyze Inc.",
        "source": "Email",
        "date_posted": "2024-10-17 14:18:03-05:00",
        "unique_id": "1929c0ae61391970",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]