[
    {
        "company": "Panzer Solutions LLC",
        "job_title": "Project Manager",
        "location": "Austin, TX, USA",
        "full_location": {
            "city": "Austin",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "8+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Network project management",
                "Network Infrastructure",
                "Verbal communication",
                "Written communication",
                "Facilitating large group meetings",
                "Collaboration with technical teams",
                "Enterprise Systems Integration"
            ],
            "primary": [
                "SDWAN projects",
                "Experience with State of Texas government agencies",
                "Experience with multivendor and professional services",
                "PMP certification"
            ],
            "secondary": [],
            "all": [
                "Network project management",
                "Network Infrastructure",
                "Verbal communication",
                "Written communication",
                "Facilitating large group meetings",
                "Collaboration with technical teams",
                "Enterprise Systems Integration",
                "SDWAN projects",
                "Experience with State of Texas government agencies",
                "Experience with multivendor and professional services",
                "PMP certification"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Zaid Khan",
        "email": "zaid.khan@panzersolutions.com",
        "jd": "Hi ,My name is Zaid Khan, and I am a certified LinkedIn Recruiter currently working as a Talent Acquisition Specialist at Panzer Solutions LLC. We specialize in both IT and non-IT recruitment services across the U.S. I wanted to inform you about an exciting opportunity we have with one of your preferred clients. If you're available and interested, please let me know. You can also send me your updated resume and the best contact number for a quick follow-upImmediate InterviewCandidates Must be Local to Texas OnlyRole: Project Manager Location : Austin, TX 78744 -HybridDuration: ContractNOTE : Candidates Must Have Previous Experience with Any State ClientNote – Please look for local candidates only based out of Austin, TXI have a backfill position , 100% Closable Role . Please Follow As Per below JD Job Description8+ Years: Experience in delivering network projects, and products in a highly technical dispersed multi-team environment (of those 8 years, we would like at least 5 in Network project management).8+ Years: Experience to engage multiple technical teams to drive consistent expectations towards Project goals.8+ Years: Knowledge of Network Infrastructure.8+ Years: Possess strong verbal and written skills in communicating with peers and different levels of users including executive staff.8+ Years: Skilled in facilitating large group meetings with internal and external resources.8+ Years: Skilled in collaborating with the technical and functional teams to develop the Technical Specification and other documents need in support of the solution.8+ Years: Experience in implementing Enterprise Systems Integration Preferred Skills and Qualifications:Experience with SDWAN projectsExperience with one or more of the State of Texas government agenciesExperience with multivendor and professional services.PMP certification is a plus.",
        "source": "Email",
        "date_posted": "2024-10-17 21:56:50-05:00",
        "unique_id": "1929daeeadf695ac",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]