[
    {
        "company": "NITYA Software Solutions Inc.",
        "job_title": "Project Manager",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management"
            ],
            "primary": [
                "Team Leadership",
                "Project Planning",
                "Risk Management",
                "Budget Management"
            ],
            "secondary": [],
            "all": [
                "Project Management",
                "Team Leadership",
                "Project Planning",
                "Risk Management",
                "Budget Management"
            ],
            "with_experience": []
        },
        "job_type": [],
        "contact_person": "Rajkumar",
        "email": "rajkumar.v@nityainc.com",
        "jd": "From: rajkumar, NITYA Software Solutions Inc. rajkumar.v@nityainc.com Reply to: rajkumar.v@nityainc.com Hi,I hope you are doing well.I am Raj from NITYA Software Solutions Inc.I've included below the job description, please let me know if you are interested, and reply with one updated resume, which I've expected.Role: Project ManagerLead multiple small or medium sized projects simultaneously or a large project based on complexity factors.Lead project team including technical and non-technical staff in analysis, design, development, testing and implementation efforts.Create project plans, including deliverables, activities, timelines and budgets.Monitor or track project milestones and deliverables.Work closely with various internal departments to ensure successful completion of projects.Ensure appropriate use of CommScope's IT project management tools, governance, processes, and methodologies.Identify and track issues, assess impact, and execute timely resolution.Conduct project status sessions with representatives from any or all department involved in the project.Prepare reports reporting on issues and risk mitigation.Assess, manage, resolve and escalate (if necessary) risks and issues.Provide scheduled and on-demand status reports and updates.Thank you,RajkumarEMAIL ID:rajkumar.v@nityainc.comNITYA Software Solutions Inc.",
        "source": "Email",
        "date_posted": "2024-10-17 09:18:41-05:00",
        "unique_id": "1929af9bc323b777",
        "emp_type": [
            "third party"
        ],
        "tag": "Project Manager"
    }
]