[
    {
        "company": "KPG99",
        "job_title": "Lead BSA",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "12 to 15 years",
            "degree_required": "Education equivalent to a college degree in an information technology related or business administration related discipline",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Systems Analysis",
                "P&C Insurance",
                "Scrum Leadership",
                "Business Process Modeling",
                "Requirements Documentation"
            ],
            "primary": [
                "JIRA",
                "Confluence",
                "Analytical Skills",
                "Problem-Solving Skills",
                "Communication Skills"
            ],
            "secondary": [
                "PostGres",
                "SQL Server",
                "ServiceNow",
                "AWS",
                "Organizational Skills"
            ],
            "all": [
                "Business Systems Analysis",
                "P&C Insurance",
                "Scrum Leadership",
                "Business Process Modeling",
                "Requirements Documentation",
                "JIRA",
                "Confluence",
                "Analytical Skills",
                "Problem-Solving Skills",
                "Communication Skills",
                "PostGres",
                "SQL Server",
                "ServiceNow",
                "AWS",
                "Organizational Skills"
            ]
        },
        "job_type": [
            "remote",
            "hybrid"
        ],
        "contact_person": "Shivani Saini",
        "email": "ssaini@kpgtech.com",
        "jd": "From: Shivani, kpg99 ssaini@kpgtech.com Reply to: ssaini@kpgtech.com Hi, Hope you are doing well.My name is Shivani Saini and I'm an IT recruiter at KPG99. Kindly go through the below JD and let me know your interest. Also share with me your updated resume with contact details.Position : Lead BSALocation : (100% Remote)Duration : 6+ Months Contract/CTHJOB DESCRIPTION.Remote to start, then Hybrid 3 days/week : Chicago, IL / Jacksonville, FL / Burmingham, AL / Alpharetta, GA / Dallas, TXInsurance background must have this.Insurance background – P&C Insurance – must have this backgroundA Kforce client is seeking an experienced Lead Business Systems Analyst who can play Functional Lead on complex transformation programs. This individual will play a pivotal role in driving the digital self-service insurance transformation initiatives by serving as the functional lead for program-level business systems analysis and requirements, ensuring that solutions meet the needs of the customers and align with our strategic goals. He/she will be a part of a team focused on collaboration with Product Owners, developers and other stakeholders to deliver on product and program requirements for the customer/distribution value chain and corresponding applications. Accountable for large scale projects, this role will actively participate and interact to understand business needs, identify the best solutions, recommend best practices for change management, and manage production activities and major initiatives. Sr. level, aligning with value chain product leader. Expert within customer journey, scope of how this fits together from an agent/customer experience. Consider the Scrum leadership, soft skill agile champion/Position ResponsibilitiesLeadership and CoordinationServe as the functional lead for program-level business systems analysis, ensuring alignment with project goals and objectives.Coordinate work with multiple application level BSAs and Junior BSAs to accomplish program needs.Serve as a Subject Matter Expert across departments and projects handling some of the largest projects.Own risk identification, mitigation strategies, impact analysis, resolution, and communications to stakeholders.Analysis and DocumentationLead the analysis and documentation of business requirements for digital self-service insurance transformation projects.Conducts analysis with a focus on recommending and offering requirements, such as use cases, business process flows, data flow diagrams, etc.Conduct gap analysis and recommend solutions to improve business processes and systems.Gathers data and analyzes business operations to understand strengths and weaknesses to determine opportunities to automate processes and functions, reduce costs, and maintain and reach department objectives.Assist in the analysis and design of new business processes around requirements definition, information gathering, and consistent documentation methodologies.Stakeholder CollaborationCollaborate with stakeholders to understand and translate business needs into technical specifications.Facilitate workshops and meetings with stakeholders to gather and validate requirements.Serve as a liaison between business and IT departments supporting various initiatives.Development and ImplementationWork closely with development teams to ensure accurate implementation of requirements.Work with other Business Systems Analyst and Application owners to document requirements in user story format with detailed acceptance criteria.Participate in scrum ceremonies.Process Improvement and ComplianceContinuously look for process improvements by leveraging metrics.Ensure compliance with industry standards and best practices in business systems analysis.Visualization and Problem AnalysisDevelop and maintain detailed business process models, use cases, system requirements, charts and diagrams to visualize and assist in problem analysis.Prepares charts and diagrams to visualize and assist in problem analysis.Project Management SupportAssist in the development of all the project management documents, such as: the project proposal, the project charter, the project schedule, and plan.Provide ongoing support and guidance to project teams throughout the project lifecycle.Product ExpertiseBecome an expert in their product(s) to aid business in understanding capabilities and potential improvements.MiscellaneousTravel may be required on an occasional basis. Position QualificationsExperience12 to 15 years of related business analyst experience; P&C insurance industry or a related financial services industry experience is a plus.Proven experience as a functional lead for program-level business systems analysis and requirements.Requires experience as a Scrum Lead.Experience working with business processes related controls and procedures as well as improvement initiatives.The ability to manage numerous projects at one time and complete projects in a timely manner and ensure high quality.Ability to manage multiple projects and priorities in a fast-paced environment.EducationEducation equivalent to a college degree in an information technology related or business administration related discipline, supplemented by insurance or computer related courses/knowledge, or the equivalent in related work experience.SkillsProficiency in business process modeling and requirements documentation tools such as JIRA/Confluence.Excellent analytical and problem-solving skills.Must have strong critical thinking, organizational and above average written/verbal communication skills.Ability to understand and develop business requirements and work with staff at all levels to implement improvements to processes and tools.Ability to communicate (verbal and written) complex technical concepts to Information Technology, other Business Units and stakeholders in ways each group will understand.Must have above average attention to detail and organizational skills.Strong PC skills, including proficiency in MS Word, Excel and Power Point. PostGres / SQL Server, or similar experience preferred.ServiceNow and AWS knowledge is a plus. Thanks & RegardsShivani Saini|Technical Recruiterssaini@kpgtech.comDirect--609-662-6116 KPG99,INC3240 E STATE ST EXTHamilton, NJ 08619www.kpgtech.comLinkedin ID – https://www.linkedin.com/in/shivani-saini-1397311a2/",
        "source": "Email",
        "date_posted": "2024-10-17 16:39:15-05:00",
        "unique_id": "1929c8c2d8980df5",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]