[
    {
        "company": "Incom Technologies Inc",
        "job_title": "Senior Application Programmer",
        "location": "Baton Rouge, LA, USA",
        "full_location": {
            "city": "Baton Rouge",
            "state": "LA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$65/hr on c2c",
            "job_code": "",
            "contact_person": "komal",
            "email": "komal@incom-tech.net"
        },
        "skills": {
            "core": [
                "Java",
                "C#/.NET",
                "SQL",
                "Oracle",
                "PostgreSQL",
                "MySQL"
            ],
            "primary": [
                "JavaScript",
                "TypeScript",
                "RESTful APIs",
                "AWS",
                "Azure",
                "Docker",
                "Kubernetes",
                "Git",
                "CI/CD"
            ],
            "secondary": [
                "Analytical skills",
                "Problem-solving",
                "Application integration",
                "Document repository systems",
                "ECM systems"
            ],
            "all": [
                "Java",
                "C#/.NET",
                "SQL",
                "Oracle",
                "PostgreSQL",
                "MySQL",
                "JavaScript",
                "TypeScript",
                "RESTful APIs",
                "AWS",
                "Azure",
                "Docker",
                "Kubernetes",
                "Git",
                "CI/CD",
                "Analytical skills",
                "Problem-solving",
                "Application integration",
                "Document repository systems",
                "ECM systems"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "jd": "From: komal, Incom Technologies Inc komal@incom-tech.net Reply to: komal@incom-tech.net Hi Role: Senior Application ProgrammerClient :State of LALocation : OnsiteRate :$65/hr on c2c NOTE : CANDIDATES SHOULD BE LOCAL TO LOUISIANAProject OverviewIn an effort to digitize the agency’s file rooms, LA Dept. of Energy and Natural Resources is looking for consulting services to perform an assessment of their current practices and develop an actionable roadmap to effectively digitize the paper files and store the documents into a repository that will allow users throughout the agency to have access. Data gathering sessions will need to be performed with multiple agency departments and regional offices. The current process involves desktop scanning, indexing and storing documents into the Oracle document repository. After scanning, documents are available for public viewing using the Sunrise application. Physical documents are boxed and shipped to La. State Archives after scanning. A small portion of the documents that need to be scanned require an oversize scanner. LDENR wants to set up a centralized scanning location for all paper documents to get processed. The centralized scanning will be to process the file room documents as well as any new documents that the agency needs to archive.Duties/Responsibilities• Respond to computer system emergencies and resolve problems independently or in consultation with other IT staff or end-user personnel.• Research and resolve program, machine, data, or system software problems of a highly technical nature.• Provide expert advice and guidance on specialized application tools, hardware, software, or databases.• Provide specialized training to IT applications staff on databases, tools, techniques, and procedures relevant to applications maintenance and development.• Research new developments in hardware and software, staying abreast of the latest technologies.• Design, code, compile, test, debug, modify, and document new or existing highly complex applications programs.• Implement complex in-house and vendor-supplied applications software.• Evaluate, analyze, and prepare information and recommendations on technical solutions related to operating and managing an information system• Independently define data elements and design structures for databases.• Prepare and monitor work plans and schedules to ensure timeliness, data integrity, and project availability.Required Experience• Proficiency in Java or C#/.NET for enterprise application development.• Expertise in SQL and working with relational databases such as Oracle (PL/SQL), PostgreSQL, or MySQL.• Experience with JavaScript or TypeScript for frontend or backend API development.• Familiarity with Oracle document repository systems and other ECM systems.• Strong knowledge of RESTful APIs for application integration.• Experience in deploying and managing applications in cloud environments such as AWS or Azure.• Proficiency in containerization and orchestration tools like Docker and Kubernetes.• Experience with version control using Git and CI/CD pipelines (e.g., Jenkins, GitLab CI).• Strong analytical skills and problem-solving abilities, especially in debugging complex systems.• Experience with developing, maintaining, and scaling highly complex applications in a production environment",
        "source": "Email",
        "date_posted": "2024-10-17 12:46:31-05:00",
        "unique_id": "1929bb718fd31fca",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]