[
    {
        "company": "Northite",
        "job_title": "Lead Java Full Stack Developer (React)",
        "location": "Princeton, NJ, USA",
        "full_location": {
            "city": "Princeton",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "12+ years",
            "degree_required": "Bachelor’s or higher degree in Computer Science, Engineering, or a related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months with extension",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "J2EE",
                "Spring Core",
                "Spring MVC",
                "Spring Cloud",
                "Spring Boot",
                "Hibernate",
                "Restful services",
                "Spring JDBC",
                "Microservices",
                "Rest API",
                "JPA",
                "HTML",
                "CSS",
                "JavaScript",
                "React.js",
                "Webpack",
                "Redux",
                "Flux",
                "Oracle PL/SQL",
                "SQL"
            ],
            "primary": [
                "Mocha",
                "Jest",
                "Oracle Web logic",
                "Tomcat",
                "Git",
                "Jenkins",
                "CI/CD pipelines",
                "Agile",
                "Test-driven development"
            ],
            "secondary": [
                "System architecture",
                "N-Tire",
                "Cloud-native",
                "User interface design",
                "Browser based debugging",
                "Troubleshooting skills",
                "System design principles",
                "API management",
                "Cloud-based platforms",
                "AWS",
                "Google",
                "Dev-Ops",
                "Automation",
                "Unit Testing",
                "Analytical Skills",
                "System observability",
                "Monitoring",
                "Alerting",
                "Building applications for financial industry"
            ],
            "all": [
                "Java",
                "J2EE",
                "Spring Core",
                "Spring MVC",
                "Spring Cloud",
                "Spring Boot",
                "Hibernate",
                "Restful services",
                "Spring JDBC",
                "Microservices",
                "Rest API",
                "JPA",
                "HTML",
                "CSS",
                "JavaScript",
                "React.js",
                "Webpack",
                "Redux",
                "Flux",
                "Oracle PL/SQL",
                "SQL",
                "Mocha",
                "Jest",
                "Oracle Web logic",
                "Tomcat",
                "Git",
                "Jenkins",
                "CI/CD pipelines",
                "Agile",
                "Test-driven development",
                "System architecture",
                "N-Tire",
                "Cloud-native",
                "User interface design",
                "Browser based debugging",
                "Troubleshooting skills",
                "System design principles",
                "API management",
                "Cloud-based platforms",
                "AWS",
                "Google",
                "Dev-Ops",
                "Automation",
                "Unit Testing",
                "Analytical Skills",
                "System observability",
                "Monitoring",
                "Alerting",
                "Building applications for financial industry"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "sirisha",
        "email": "sirisha@northite.com",
        "jd": "From: sirisha, northite sirisha@northite.com Reply to: sirisha@northite.com Lead Java Full Stack Developer (React)Princeton, NJ (Hybrid from day 1) (Need Locals)W2 Contract - USC/GC/H4EAD/L2EADDuration: 12+ Months with extensionAs an Engineering Lead for the application delivery team, you will be responsible for leading a talented team of engineers (DEV&QA). You will demonstrate high technical acumen, solution design capability, and strong hands-on expertise in the development of technical solutions for complex business requirements. You will play leading role in providing the technical guidance to the team, best practices adoption, fostering collaborative & dynamic team built-up ensuring successful development and delivery of high-quality enterprise applications/systems. Core Responsibilities (Team & Delivery Leadership):Technical Acumen:Deliver business value through application development and enhancements.Demonstrate a strong sense of ownership and responsibility with assignments. This includes gathering and understanding requirements, technical specifications, design, architecture, implementation, unit testing, builds/deployments, and code management.Evaluate, assess, plan, and guide technical direction and architecture decisions. Leading Team:Mentor, guide the development team through the process of design, estimation, development, and unit testing.Conduct code reviews, ensure coding standards are maintained, lead the best practices adoption, and drive continuous improvement in development processes.Lead to inspire a team of engineers, fostering a positive and productive work culture.Be a self-starter and an excellent team player.Stay abreast with industry trends and technological advancements and apply this knowledge to guide the team in selecting appropriate technologies and methodologies.Provide technical guidance, support professional development, and conduct regular performance reviews in conjunction to the delivery managers. Partnership:Interface, collaborate and communicate effectively with business and cross functional/technical partners.Active participation and contribution to PI, product & release planning etc.Collaborate with onsite and offsite team members effectively. Core Skills:12+ years in Java J2EE building web applications, spring technologies/frameworks (Spring Core, Spring MVC, Spring Cloud, Spring Boot) and tools.Java, JEE & spring technologies/frameworks (Spring Core, Spring MVC, Spring Cloud, Spring Boot) and tools.5+ years of experience with related frameworks and technologies (Hibernate, Restful services Spring JDBC, MVC etc.)Strong experience with Microservices, Spring Boot / Spring framework, Rest API, JPA.8+ years of experience in web development using HTML, CSS and JavaScript including ES2016+Minimum 2 years of experience of REACT tools including React.js, Webpack, Redux and FluxExperience with user interface designKnowledge of unit testing frameworks like Mocha and JestExperience with browser based debugging and excellent troubleshooting skillsKnowledge on system architecture (N-Tire, Microservices, Cloud-native).Strong knowledge of system design principles for scalable, high-performance, and extensible solutions for enterprise grade distributed and services systems.Significant knowledge of Oracle PL/SQL and SQL.Experience with Oracle Web logic, Tomcat to include installation, configuration, troubleshooting.Working experience of Spring Boot application configuration, deployment and troubleshooting on server platforms Oracle Web logic/Tomcat/Cloud.Experience with API management and Cloud-based platforms and services (AWS, Google).Working knowledge of Dev-Ops: Git, Jenkins, CI/CD pipelines, etc.Understanding of Test-Driven Development practices as well as Automation and Unit Testing.Strong Analytical Skills.Working knowledge on system observability/monitoring and alerting.Experience Architecting and developing large scale Enterprise applications.Proficient with software development lifecycle (SDLC) methodologies like Agile, Test- driven development.Any experience in building applications for financial industry is a plusEducation:Bachelor’s or higher degree in Computer Science, Engineering, or a related field.Proven experience (12+years) in Engineering role.3+ Year experience as Engineering/Technical lead role.Excellent communication skills and the ability to collaborate effectively with cross-functional teams.Demonstrated experience in delivering complex enterprise grade software solutions.",
        "source": "Email",
        "date_posted": "2024-10-17 09:52:53-05:00",
        "unique_id": "1929b1a56830c758",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]