[
    {
        "company": "Intelligenz IT",
        "job_title": "AWS with API Technical Lead",
        "location": "Alameda, CA, USA",
        "full_location": {
            "city": "Alameda",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "12-19 years",
            "degree_required": "BE/Btech",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long term contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "AWS Cloud Experience",
                "AWS API Gateway",
                "AWS Lambda",
                "Python"
            ],
            "primary": [
                "API Design and Development",
                "Architectural Guidance",
                "Performance and Scalability",
                "Security and Compliance",
                "Continuous Improvement"
            ],
            "secondary": [
                "Good communication skills",
                "Team bonding and collaboration",
                "Good attitude"
            ],
            "all": [
                "AWS Cloud Experience",
                "AWS API Gateway",
                "AWS Lambda",
                "Python",
                "API Design and Development",
                "Architectural Guidance",
                "Performance and Scalability",
                "Security and Compliance",
                "Continuous Improvement",
                "Good communication skills",
                "Team bonding and collaboration",
                "Good attitude"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Mohit Jaiswal",
        "email": "mohit.jaiswal@intelligenzit.com",
        "jd": "Hi,I hope you and your family are doing well.I have a good position for you with my client. This point of time I don't know whether you are looking for a new job or not. But just thought if I can share the details and then confirm from you about your interest level for the opportunity. If you are interested and an available consultant, send me your most updated resumes in word format and contact details.Job Title: AWS with API Technical LeadLocation: Alameda, CA (100% on-site from day 1)Duration: Long term contractExperience should be in b/w 12-19 Years Note : This is replacement position. Direct client interview & Immediate HireStart Date ASAP...Educational Qualification*BE/BtechJob Overview:As an API / Solutions Architect, you will be responsible for designing, developing, and maintaining complex API solutions that meet the requirements as well as adhere to established architectural principles, standards, and patterns.He / She will collaborate closely with cloud engineering platform team to work on API and Devops tools. He / she will collaborate with software developers, system architects, product managers, and stakeholders, to ensure APIs are robust, scalable, and secure.Mandatory Skills :Total IT 13+ YearsMinimum : 5 Years AWS Cloud ExperienceAWS API GatewayAWS LambdaAble to write Lambda functions using PythonPrimary (Must have skills)*Key Responsibilities:API Design and Development:Lead the design and development of APIs that enable integration between various AWS componentsDefine API standards, best practices, and guidelines to ensure consistency across APIs.Architectural Guidance:Provide reviews on present AWS architecture implementation andProvide technical leadership and guidance on API architecture, design decisions, and implementation strategies.Collaborate with solution architects and development teams to integrate API solutions into larger systems or platforms.Technologies and Frameworks:Use of Okta for authentication make use of CSRF and Access tokensKnowledge of aws well architected framework pillarsPerformance and Scalability:Design APIs with a focus on performance, scalability, reliability, and security.Conduct performance tuning and optimization of APIs to handle high traffic and large volumes of data.Security and Compliance:Implement security measures such as authentication, authorization, encryption, and data protection mechanisms in APIs.Understand AWS SSO API working and cross role working across accountsContinuous Improvement:Stay updated on emerging technologies, industry trends, and best practices related to APIs and integration.Drive initiatives for continuous improvement of API development processes, tools, and methodologies.",
        "source": "Email",
        "date_posted": "2024-10-17 07:23:53-05:00",
        "unique_id": "1929a8fba78d8270",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]