[
    {
        "company": "W3Global",
        "job_title": "Business Analyst",
        "location": "New Jersey, NJ, USA",
        "full_location": {
            "city": "New Jersey",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business analysis",
                "GxP",
                "Veeva Vault systems",
                "Agile (SAFe)",
                "Communication skills"
            ],
            "primary": [
                "Writing system test scripts",
                "Coordinating with stakeholders",
                "Document Process flows"
            ],
            "secondary": [
                "Knowledge of Veeva systems (CRM and medcomms and Med inquiry)",
                "Quality assurance processes",
                "Risk management",
                "Team leadership"
            ],
            "all": [
                "Business analysis",
                "GxP",
                "Veeva Vault systems",
                "Agile (SAFe)",
                "Communication skills",
                "Writing system test scripts",
                "Coordinating with stakeholders",
                "Document Process flows",
                "Knowledge of Veeva systems (CRM and medcomms and Med inquiry)",
                "Quality assurance processes",
                "Risk management",
                "Team leadership"
            ]
        },
        "job_type": [
            "remote",
            "onsite"
        ],
        "contact_person": "Nora West",
        "email": "nora.west@w3global.com",
        "jd": "Hello, Remote - Business Analyst (Business Analyst, GxP, Veeva Vault systems (and Med Comms and Med inquiry))Location : NJ (customer preference is New Jersey). Remote is OK but have to come to the office for any customer meetings. Job DescriptionLooking for a smart, positive, enthusiastic candidate that is on top of the things. Should be preferably in eastern time. Central time will do. Living in NJ is a plus. Business analysis skills Writing system test scripts and testing Coordinating with various stakeholders to get the work done in an efficient way Knowledge of working in Agile (SAFe) environment. Experience in working on GxP regulated applications and knowledge of validation Document Process flows Knowledge of Veeva systems (CRM and medcomms and Med inquiry) is a plus Good communication skills (Written and verbal) (1.) To oversee quality assurance processes, ensure adherence to coding standards , implementation of best practices and participate in technical discussionsorreview. (2.) To create work plans, monitor and track the work schedule for on time delivery as per the defined quality standards. (3.) To Identify potential risks and issues that may impact project timelines or quality and accordingly develop mitigation strategies or contingency plans to address risks. (4.) To lead and empower a dynamic development team by boosting their technical skills, improving productivity, and fostering a collaborative high-performance culture.",
        "source": "Email",
        "date_posted": "2024-10-17 11:46:48-05:00",
        "unique_id": "1929b806f0a8feeb",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]