[
    {
        "company": "GSK SOLUTIONS INC",
        "job_title": "Senior Full Stack .NET Developer",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "748487",
            "experience_required": "14 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "C#",
                ".NET Development",
                "SQL Server",
                "Angular",
                "Blazor"
            ],
            "primary": [
                "Web API",
                "JavaScript",
                "JQuery",
                "CSS3",
                "HTML5"
            ],
            "secondary": [
                "Source Control using TFS",
                "Automated Builds using Microsoft Team Foundation",
                "Agile SDLC best practices",
                "Oracle",
                "SOAP Services",
                "Azure Cloud Concepts",
                "Power BI"
            ],
            "all": [
                "C#",
                ".NET Development",
                "SQL Server",
                "Angular",
                "Blazor",
                "Web API",
                "JavaScript",
                "JQuery",
                "CSS3",
                "HTML5",
                "Source Control using TFS",
                "Automated Builds using Microsoft Team Foundation",
                "Agile SDLC best practices",
                "Oracle",
                "SOAP Services",
                "Azure Cloud Concepts",
                "Power BI"
            ],
            "with_experience": [
                "C# (14 years)",
                "SQL Server (14 years)",
                "Web API (5 years)",
                "CSS3 (5 years)",
                "HTML5 (5 years)",
                "Source Control using TFS (10 years)",
                "Automated Builds using Microsoft Team Foundation (5 years)",
                "Agile SDLC best practices (5 years)"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Lokesh",
        "email": "lokesh@gsksolutions.com",
        "jd": "From: Lokesh, GSK SOLUTIONS INC lokesh@gsksolutions.com Reply to: lokesh@gsksolutions.com Job Title: Senior Full Stack .NET Developer (Hybrid)Location: Richmond, VADuration:12+ MonthsJob Type: Corp-Corp / 1099 / Contract W2Client: State of VirginiaInterview Type: InPersonNote: Candidate MUST be LOCAL and MUST have experience working with ERP systems in the past Job Description: VDOT-AMD is seeking a Developer with 14 yrs or more .Net Web application development. Experience and fluency with C#, Angular or Blazor, SQL Server, JQuery, CSS3 and HTML5 experienceVDOT is seeking a Full Stack Senior ERP Developer/Programmer with .Net Applications Development experience who will be responsible for managing, programming, testing, debugging and analyzing complex software requirements to design and develop high quality components using the .NET Core framework. The ERP Developer will be programming the current budget and spend plan tool that is used agency wide for financial and budget management for the Maintenance Program. The Senior Developer is expected to program using best practices, prioritize programming work effectively and write system documentation as required. The successful candidate should have strong programming and communication skills to be effective in both technical and business requirement discussions. Primary responsibilities include: Ability to develop, program and code in .NET Core environment applications and backend services using C#, Web API, Java Script, JQuery, Angular or Blazor and CSS. Design, develop and program using appropriate software design patterns to attain high reusability and maintainability. Write effective unit tests and integration tests to ensure high quality software delivery. In-depth knowledge and skills in programming, system design patterns, tiered architecture, and testing practices. Understanding of key business processes and competitive strategies related to the IT function. Work with project architect, project manager, business owner and system analysts to clarify the requirements and then implement them.Participate in Agile SDLC. Required/Desired Skills SkillRequired /DesiredAmountof ExperienceC#.NET Development experienceRequired14YearsAngular or Blazor Development experienceRequired5YearsStrong Database development experience using SQL ServerRequired14YearsExperience with Web APIRequired5YearsExperience with CSS3 and HTML5Required5YearsExperience with Source Control using TFSRequired10YearsExperience with Automated Builds using Microsoft Team FoundationRequired5YearsExcellent Troubleshooting skillsRequired12YearsExperience with Agile SDLC best practicesRequired5YearsExperience working in OracleDesired2YearsUnderstanding of SOAP ServicesDesired5YearsFamiliar with Azure Cloud ConceptsNice to have1YearsExperience with PowerBINice to have1Years",
        "source": "Email",
        "date_posted": "2024-10-17 11:31:39-05:00",
        "unique_id": "1929b73166e987f8",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]