[
    {
        "company": "IDC Technologies",
        "job_title": "Sr. Java Programmer",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "5 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java EE",
                "Core Java",
                "OOP Design",
                "Multi-Threading",
                "Generics",
                "Exception Handling",
                "Collections",
                "Java Reflection",
                "Annotation"
            ],
            "primary": [
                "Oracle",
                "Git Workflows",
                "CI/CD pipelines",
                "Azure DevOps"
            ],
            "secondary": [
                "Selenium",
                "Cucumber",
                "Playwright",
                "JUnit",
                "IBM SOA products",
                "Node.js",
                "Angular"
            ],
            "all": [
                "Java EE",
                "Core Java",
                "OOP Design",
                "Multi-Threading",
                "Generics",
                "Exception Handling",
                "Collections",
                "Java Reflection",
                "Annotation",
                "Oracle",
                "Git Workflows",
                "CI/CD pipelines",
                "Azure DevOps",
                "Selenium",
                "Cucumber",
                "Playwright",
                "JUnit",
                "IBM SOA products",
                "Node.js",
                "Angular"
            ],
            "with_experience": [
                "Java EE (5+ years)",
                "Core Java (5+ years)",
                "Oracle (5+ years)",
                "Git Workflows (5+ years)",
                "CI/CD pipelines (3+ years)"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "John Joseph",
        "email": "john.joseph@idctechnologies.com",
        "jd": "HI, Hope you are doing well. We have an urgent opening for the below role with Contract position for our clients, kindly Check the below job description and let me know your interest. Position – Sr. Java Programmer Location – Richmond, VA 23219 ABOUT THE ROLE This position will serve as a senior BACK-END application developer for the DMAS Information Management Division in the design, development, and maintenance of Java/ JEE based applications. Extensive practical experience in building enterprise applications using Java EE technologies. Expertise in Core Java concepts, such as OOP Design, Multi-Threading, Generics, Exception Handling, Collections, Java Reflection, Annotation. Understanding of relational database concepts with experience in Oracle. Experience developing with Git Workflows. Experience developing CI/CD pipelines and automation. Experience using Azure DevOps. Experience with Testing Frameworks such as Selenium, Cucumber, Playwright, JUnit and an understanding of Test Left approach to development. Experience with IBM SOA products like IIB/ACE, ODM, WAS, MQ, and ITX Experience with Front End Development using Node.js and Angular Skills Matrix - Extensive practical experience in building enterprise applications using Java EE technologies Required 5 Years Expertise in Core Java concepts, such as OOP Design, Multi-Threading, Generics, Exception Handling, Collections, Java Reflection, Annotation, Required 5 Years Understanding of relational database concepts with experience in Oracle Required 5 Years Experience developing with Git Workflows Required 5 Years Experience developing CI/CD pipelines and automation Required 3 Years Experience using Azure DevOps Highly desired 2 Years Experience with Testing Frameworks such as Selenium, Cucumber, Playwright, JUnit, and an understanding of Test Left approach to development Highly desired 2 Years Experience with IBM SOA products like IIB/ACE, ODM, WAS, MQ, and ITX Highly desired 2 Years Experience with Front End Development using Node.js and Angular Nice to have 1 Years",
        "source": "Email",
        "date_posted": "2024-10-17 14:53:04-05:00",
        "unique_id": "1929c2af20776a8d",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]