[
    {
        "company": "Virginia Department of Transportation (VDOT)",
        "job_title": "VDOT Project Manager 4 - MOD PRODUCT LINE",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "8 Years",
            "degree_required": "Bachelor’s degree in computer science, Systems Engineering, Management Information Systems, Project Management or Finance/Business",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "PMP Certification",
                "Scaled Agile",
                "Waterfall Project Management",
                "IT infrastructure delivery",
                "Project Management"
            ],
            "primary": [
                "VITA Certification",
                "Agile Scrum Master Certification",
                "SAFe® Scrum Master Certification",
                "Microsoft Office Products"
            ],
            "secondary": [],
            "all": [
                "PMP Certification",
                "Scaled Agile",
                "Waterfall Project Management",
                "IT infrastructure delivery",
                "Project Management",
                "VITA Certification",
                "Agile Scrum Master Certification",
                "SAFe® Scrum Master Certification",
                "Microsoft Office Products"
            ],
            "with_experience": [
                "PMP Certification",
                "IT infrastructure delivery",
                "Scaled Agile",
                "Waterfall Project Management"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Megha",
        "email": "mveeranki@infologitech.com",
        "jd": "Hi Greetings from Info Logitech, IncHere is our open requirement which can be filled immediately Kindly respond to this requirement with your resume, contact and current location info to speed up the interview process Job Position : VDOT Project Manager 4 - MOD PRODUCT LINEJob Location : Richmond, VAJob Duration : 12 Months Job Description :VDOT Project Manager - PMP Certified - Hybrid schedule with 3 days in the office at VDOT Richmond VA.Project Manager position will be for 12 months or more. PMP CERTIFICATION REQUIRED with experience in Scaled Agile environment, VITA certification is preferred. Virginia Department of Transportation (VDOT) Asset Management Division is seeking a senior technical Project Manager to manage and deliver complex IT Project(s) with multiple teams and work streams coordinated to an aggressive delivery schedule. Project Manager is responsible for the outcome of the assigned projects. The Project Manager leads the team through the Commonwealth Standard for Project Management for successful completion of the project phases:PreselectInitiation PlanningExecution and ControlCloseout. The selected candidate will:Serve as a hands-on technical project manager with development staff and business groupsCoordinate and communicate with Information Technology Division management and staff to coordinate work staff and resourcing.Communicate timelines and expectations to technical and business staffFacilitate multi-functional technical team collaboration.Collaborate with vendors, consultants, and contractors in the execution of projects, including contract management, and work with procurement office(s).Adhere to VDOT and VITA project management practices and governance requirements.Coordinate with VDOT and VITA project management offices.Maintain project budget, plans, tasks, schedules, risks, and status and disseminate information to team members and customers as defined in the communication plan.Ensure documentation of requirements and use cases, facilitate design workshops for assigned project.Ensure preparation of test objectives, test plans and test cases for assigned project.Provide the management of project milestones and deliverables for on-time and on-budget delivery.Define, measure, and clearly communicate progress with project metrics.Support system and application training efforts. Skills:Experience managing large MultiStream projects valued at $10M or greater each Required 8 YearsExperience in IT infrastructure delivery (Networking, physical plant, vendor management, site provisioning) Required 8 YearsPMP Certification RequiredExperience in both Scaled Agile and Waterfall Project Management Required 8 YearsVITA Certification Highly desiredAgile Scrum Master Certification DesiredSAFe® Scrum Master Certification DesiredMicrosoft Office Products (Word, Excel, Access, Outlook, Visio, PowerPoint, Project Server) Required 8 YearsExperience managing projects with high visibility and high stakes Required 8 YearsExperience managing projects that had to coordinate with at least one external team. Required 8 YearsExperience managing a project as part of a larger program and under PMO governance. Required 8 YearsBachelor’s degree in computer science, Systems Engineering, Management Information Systems, Project Management or Finance/Business Required 4 Years",
        "source": "Email",
        "date_posted": "2024-10-14 09:21:47-05:00",
        "unique_id": "1928baf7d07cc097",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]