[
    {
        "company": "Kovan Technology Solutions",
        "job_title": "IVR Developer",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Minimum of 4 years of experience in IVR development.",
            "degree_required": "Bachelor’s degree in Computer Science, Information Technology, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Springboot",
                "VXML",
                "GDF",
                "SQL"
            ],
            "primary": [
                "IVR application development",
                "Avaya",
                "Genesys",
                "Amazon connect",
                "Watson",
                "Nuance",
                "Cyara"
            ],
            "secondary": [
                "Problem-solving",
                "Analytical skills",
                "Communication skills",
                "Interpersonal skills"
            ],
            "all": [
                "Java",
                "Springboot",
                "VXML",
                "GDF",
                "SQL",
                "IVR application development",
                "Avaya",
                "Genesys",
                "Amazon connect",
                "Watson",
                "Nuance",
                "Cyara",
                "Problem-solving",
                "Analytical skills",
                "Communication skills",
                "Interpersonal skills"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Jenifer",
        "email": "jenifer.a@kovantech.com",
        "jd": "From: Jenifer.A, Kovan Technology Solutions jenifer.a@kovantech.com Reply to: jenifer.a@kovantech.com Hi Professional,Hope you are safe and good,Please find the below JD and share the suitable profiles Role: IVR DeveloperRemoteMandatory: Coding skills in Java , Springboot Key Responsibilities:Design and Development:Design and develop IVR applications using VXML and GDF.Integrate IVR solutions with backend systems and databases using Java and SQL.Develop call flows for inbound and outbound IVR systems.Testing and Deployment:Perform unit, functional and integration testing of IVR applications.Use Cyara for automated testing and monitoring of IVR systems.Deploy IVR applications on Avaya and Genesys platforms.Integration and Maintenance:Integrate speech recognition and text-to-speech technologies using GDF.Monitor and maintain IVR systems to ensure high availability and performance.Troubleshoot and resolve issues related to IVR applications and infrastructure. Collaboration:Work closely with cross-functional teams, including business analysts, QA engineers, and project managers.Provide technical support and training to other team members and stakeholders. Qualifications: Technical Skills:Proficient in VXML, GDF, and IVR application development.Expertise in few or more of IVR technologies/products like GDF, Avaya, Genesys, Amazon connect, Watson and Nuance, Avaya and Genesys platforms.Familiarity with Cyara for IVR testing and monitoring.Strong understanding of inbound and outbound call flow design.Experience with speech recognition and text-to-speech technologies.Experience:Minimum of 4 years of experience in IVR development.Experience in deploying and maintaining IVR systems in a production environment.Knowledge of telephony protocols and standards.Education:Bachelor’s degree in Computer Science, Information Technology, or a related field.Soft Skills:Excellent problem-solving and analytical skills.Strong communication and interpersonal skills.Ability to work independently and as part of a team. Thanks & Regards, JeniferRecruitment ManagerKovan Technology Solutions Certified Minority Business Enterprise (MBE) ✉ Email : Jenifer.A@kovantech.com |🌐 www.kovantech.com🔗 Linkedin - Connect with me on LinkedIn for a quick response! Bridge the gapThis email and any attached files (\"Message\") may contain confidential and/or privileged information. It is intended solely for the addressee(s). If you receive this Message in error, inform the sender by reply email, delete the Message and destroy any printed copy.Any unauthorized use, distribution, or copying of this Message or any part thereof is prohibited. Emails are susceptible to alteration. Neither KovanTech nor any of its affiliates shall be liable for the Message if altered or falsified nor shall they be liable for any damage caused by any virus that might be transmitted with this Message.",
        "source": "Email",
        "date_posted": "2024-10-14 08:22:21-05:00",
        "unique_id": "1928b524b3bfdd85",
        "emp_type": [
            "third party"
        ],
        "tag": "Java developer"
    }
]