[
    {
        "company": "Magicforce",
        "job_title": "Full stack .Net Developer",
        "location": "Philadelphia, PA, USA",
        "full_location": {
            "city": "Philadelphia",
            "state": "PA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Fullstack.Net",
                ".Net Core",
                "Angular",
                "SQL",
                "microservices architecture"
            ],
            "primary": [
                "logging/security experience",
                "API development",
                "Java",
                "Cloud upgrade / transition",
                "Liferay"
            ],
            "secondary": [
                "C#",
                "LINQ",
                "JavaScript",
                "jQuery",
                "Web Api",
                "HTML",
                "CSS",
                "WCF",
                "REST",
                "MS SQL/T-SQL",
                "Entity Framework",
                "ADO.NET"
            ],
            "all": [
                "Fullstack.Net",
                ".Net Core",
                "Angular",
                "SQL",
                "microservices architecture",
                "logging/security experience",
                "API development",
                "Java",
                "Cloud upgrade / transition",
                "Liferay",
                "C#",
                "LINQ",
                "JavaScript",
                "jQuery",
                "Web Api",
                "HTML",
                "CSS",
                "WCF",
                "REST",
                "MS SQL/T-SQL",
                "Entity Framework",
                "ADO.NET"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Saikiran",
        "email": "saikiran@magicforce.us",
        "jd": "Hi Greetings from Magic force!!! My name is Saikiran we have a job opportunity for you as a Full stack .Net Developer of our client based at Philadelphia, PA (Day 1 onsite) please find the Job description below, if you are available and interested, please send us your word copy of your resume with following detail to saikiran@magicforce.us Job Title: Full stack .Net DeveloperLocation: Philadelphia, PA (Day 1 onsite)Duration: 12+ monthsStart Date: ASAP Roles and Responsibilities: Fullstack.Net, Angular, .Net Core, WCF Responsibilities: - 10+ years of front-end experience. This will be a hybrid role, following return to work guidelines Must have: • .Net core, Angular 14+, SQL, microservices architecture, and logging/security experience for external users (for example: ELK stack). Candidate should also have proven leadership, business, and presentation skills.Preferred: API development experience highly preferred. Java, Cloud upgrade / transition – hosting on cloud (GCP) and Liferay experience are nice to have Additional Job Tasks: Coordinating with related teams such as enterprise services, informatics, infrastructure, data modelling, testing/QA, security, and architecture. • Assisting the team members with best patterns and practices and ensuring they are followed. Ensuring security, maintainability, and performance of the application. Mentoring team membersRefining the requirements and translating them into a detail design of data stores, components, and services. Assisting the PM with task breakdown, estimation, and assignment.Creating functional and detail design documentation. Assisting with production problem resolution.Extensive knowledge and experience with following languages/frameworks.NET 6 and above, C#, LINQ, SQL, JavaScript, jQuery, AngularJS, Web Api, HTML, CSSWeb Services design and development using: WCF, REST Database skills: • MS SQL/T-SQL (queries and stored procedure development),ORM • Entity Framework, ADO.NET Experienced using the following Architecture Patterns and Programming language model: If you are interested in this position, kindly fill the details and revert back to me ASAP. Requirement id / Title Full Name Work Authorization and validity Present location Passport Number Contact Number E-mail Address SSN Number Last 4 digits DOB LinkedIn ID Currently on the project (Yes / No) Availability to join the project Availability for onsite / remote Overall, USA IT experience Overall relevant IT experience Bill rate Year of arrival in USA and the employer’s name Is the USA working experience mentioned in the resume, correct? Highest degree and passing year Is the candidate submitted for the same client earlier? Thanks, and Regards: SaikiranTechnical Recruitersaikiran@magicforce.us",
        "source": "Email",
        "date_posted": "2024-10-14 07:51:38-05:00",
        "unique_id": "1928b48c95183657",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]