[
    {
        "company": "Yochana Solutions Inc.",
        "job_title": "Business Analyst",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "15+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6-12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business process design",
                "Business process reengineering",
                "Application rationalization",
                "System implementation",
                "Semiconductor knowledge",
                "High-tech manufacturing knowledge"
            ],
            "primary": [
                "Server rack design",
                "Process analysis",
                "Gap understanding",
                "Application to process mapping",
                "Data dependency analysis"
            ],
            "secondary": [
                "Documentation",
                "Future roadmaps",
                "Merger operations",
                "De-merger operations"
            ],
            "all": [
                "Business process design",
                "Business process reengineering",
                "Application rationalization",
                "System implementation",
                "Semiconductor knowledge",
                "High-tech manufacturing knowledge",
                "Server rack design",
                "Process analysis",
                "Gap understanding",
                "Application to process mapping",
                "Data dependency analysis",
                "Documentation",
                "Future roadmaps",
                "Merger operations",
                "De-merger operations"
            ],
            "with_experience": [
                "Business process design",
                "Business process reengineering",
                "Application rationalization",
                "System implementation",
                "Server rack design"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Pallavi Boola",
        "email": "pallavi@yochana.com",
        "jd": "Hello,I’m a Technical Recruiter with Yochana Solutions Inc., a national IT staffing solutions provider with 14+ years of experience delivering value to leading companies across the U.S.A. and Canada,I'm currently staffing for Business Analyst – Remote, Below you will find the job description, if you are qualified and interested, please send me your Updated Word Document Resume.I'm very sorry if this position is not an ideal fit, We'll keep you in mind for other suitable positions and referrals would be appreciated.Thank you so much for your attention and participation.Job Role: Business AnalystJob Location: RemoteProject Duration: 6-12 MonthsJob Description: This is a remote role, but travel required. Client is in Austin, TX. A qualified candidate must have Semiconductor / high tech Manufacturing knowledge. Along with the following requirements are required:15+ years' experience in Business process design, Business process reengineering, Application rationalization, System implementation in high-tech and manufacturing industryExpertise in the server rack design and manufacturing sector to optimize and streamline both design and production processes. This role will focus on studying the Value Stream—from design conceptualization, material sourcing, and manufacturing through final assembly and distribution—identifying inefficiencies, and implementing solutions to drive operational excellence.Ability to do process analysis, gap understanding, Application to process mapping and processes/ Data dependency analysisAbility to clearly document and articulate the gaps, dependencies Ability to build future roadmaps and based on the objectives definedPrior experience / Expertise with organization Merger and Organization De-merger operations is highly preferred Regards, Pallavi BoolaRESOURCE SPECIALIST Contact- 2482373189Yochana IT Solutions Inc. 23000 Commerce Dr, Farmington hills, MI-48335 pallavi@yochana.com || www.yochana.com",
        "source": "Email",
        "date_posted": "2024-10-14 09:13:24-05:00",
        "unique_id": "1928ba0735162d21",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]