[
    {
        "company": "Dept. of Community Affairs (DCA)",
        "job_title": "Project Manager (PMP)",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "5 years",
            "degree_required": "Bachelor’s degree in IT, Computer Science, or related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management Certification",
                "Software Testing and Quality Assurance (QA)",
                "Experience with Housing Management Systems",
                "Experience with SQL and Data Manipulation",
                "Proficiency in HUD Reporting"
            ],
            "primary": [
                "Change Management Experience",
                "Business Process Analysis",
                "Experience with Agile or Waterfall Project Methodologies"
            ],
            "secondary": [
                "Training and Facilitation Skills",
                "Customer Service Orientation"
            ],
            "all": [
                "Project Management Certification",
                "Software Testing and Quality Assurance (QA)",
                "Experience with Housing Management Systems",
                "Experience with SQL and Data Manipulation",
                "Proficiency in HUD Reporting",
                "Change Management Experience",
                "Business Process Analysis",
                "Experience with Agile or Waterfall Project Methodologies",
                "Training and Facilitation Skills",
                "Customer Service Orientation"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "John Joseph",
        "email": "john.joseph@idctechnologies.com",
        "jd": "HI, Hope you are doing well. We have an urgent opening for the below role with Contract position for our clients, kindly Check the below job description and let me know your interest. Position – Project Manager (PMP)Location – Atlanta, GA 30345 - Hybrid Skills Required / Desired Amount of Experience:Project Management Certification – Required 5 YearsSoftware Testing and Quality Assurance (QA) – Required 4 YearsExperience with Housing Management Systems – Required 3 YearsExperience with SQL and Data Manipulation – Required 2 YearsProficiency in HUD Reporting – Required 2 YearsChange Management Experience – Highly desired 2 YearsBusiness Process Analysis – Highly desired 2 YearsExperience with Agile or Waterfall Project Methodologies – Desired 2 YearsTraining and Facilitation Skills – Nice to have 2 YearsCustomer Service Orientation – Nice to have 2 Years Complete Description:Agency: Dept. of Community Affairs (DCA) The Public Housing Authority seeks a seasoned IT Applications Project Manager – Housing Systems to lead, coordinate, and support the transition from Tenmast WinTen2+ to Yardi Voyager. This role will serve as the project lead, ensuring the successful implementation and integration of housing management software while maintaining data integrity, compliance, and effective communication across all stakeholders.**This is position is primarily remote. However, local candidates only as they may be required to come to the office for project meetings. The ideal candidate will have strong project management skills, data analysis expertise, and proficiency in HUD PIC reporting. The role requires a deep understanding of housing management systems and proven experience configuring and managing platforms such as Tenmast WinTen2+ and Yardi Voyager.Key Responsibilities:Project Leadership: Lead the planning, execution, and completion of the housing software transition project, ensuring alignment with project goals and timelines.Coordination & Support: Coordinate with internal teams and external vendors, providing technical and operational support to drive project success.Data Management: Oversee data analysis and cleanup activities, ensuring data quality and accuracy during migration.HUD Reporting: Develop and refine HUD PIC and other compliance-related reports, ensuring all data and system configurations adhere to HUD standards.Training & Documentation: Create user guides, training materials, and process documentation to support staff in navigating the new system.Qualifications:Bachelor’s degree in IT, Computer Science, or related field.Experience: Minimum of 5 years in IT project management, with a focus on housing management systems.Strong proficiency in Yardi Voyager, Tenmast WinTen2+, and HUD reporting.Demonstrated expertise in data analysis and data migration strategies.Excellent communication skills and the ability to lead cross-functional teams.Preferred Skills:Certification in project management (PMP or similar) or application management.Experience with SQL and data manipulation for housing systems.Knowledge of Housing Choice Voucher Program lifecycle and financial management.",
        "source": "Email",
        "date_posted": "2024-10-14 09:57:07-05:00",
        "unique_id": "1928ba911b3b837a",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]