[
    {
        "company": "GAC Solutions",
        "job_title": "Java Developer",
        "location": "Honolulu, HI, USA",
        "full_location": {
            "city": "Honolulu",
            "state": "HI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java 8",
                "J2EE",
                "Oracle",
                "Web Services"
            ],
            "primary": [],
            "secondary": [
                "JSF",
                "iText",
                "velocity",
                "drools"
            ],
            "all": [
                "Java 8",
                "J2EE",
                "Oracle",
                "Web Services",
                "JSF",
                "iText",
                "velocity",
                "drools"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Praveena Kanakanti",
        "email": "praveena@gacsol.com",
        "jd": "From: Praveena Kanakanti, GAC Solutions praveena@gacsol.com Reply to: praveena@gacsol.com Hi, This is Praveena from GAC Solutions. Hope you are doing good. Role: Java Developer Location: Honolulu, HI - Locals (Onsite)Duration: Contract Job Description:Primary Skills: Java 8, J2EE, Oracle, Web ServicesSecondary Skills: JSF, iText, velocity, drools. Job Responsibilities: • Detail analysis of the business requirements captured by Business Analyst using various tools like JIRA, JAMA.• Involve in initial analysis, effort estimation, Software Development Life Cycle (SDLC) Design, Development, testing and Deployment of the assigned modules.• Analyze the feasibility and impact of new requirement.• Engage in Team meetings and create High and low level design documents for the modules.• Reviewing the work of other developers and providing feedback.• Using coding standards and best practices to ensure quality.• Unit Testing, Peer Testing, defect fixing of development modules by Team members.• Prepare and produce releases of software components.• Support continuous improvement, investigating alternatives and technologies, and presenting for architectural review.• Oversee, maintain, and support the production, staging, and testing environments.• Develop and maintain consistent documentation practices and standards.• Status reporting activities• Work with Onsite and Offshore team members.• Mentor and Guide the technical team members -Thanks,Praveena KanakantiE: praveena@gacsol.comwww.gacsol.com‘Experts in Digitalization and Engineering - Enterprise 4.0’",
        "source": "Email",
        "date_posted": "2024-10-14 16:00:59-05:00",
        "unique_id": "1928cf62f587189c",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]