[
    {
        "company": "SONITALENTCORP",
        "job_title": "Scrum Master - SCM",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "4-5 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Scrum",
                "Agile",
                "Rally",
                "SAFe",
                "Kanban"
            ],
            "primary": [
                "Communication",
                "Servant Leadership",
                "Problem-solving",
                "Conflict Resolution",
                "Organizational Skills"
            ],
            "secondary": [
                "Agile Metrics",
                "Scrum Master Certification"
            ],
            "all": [
                "Scrum",
                "Agile",
                "Rally",
                "SAFe",
                "Kanban",
                "Communication",
                "Servant Leadership",
                "Problem-solving",
                "Conflict Resolution",
                "Organizational Skills",
                "Agile Metrics",
                "Scrum Master Certification"
            ],
            "with_experience": [
                "Scrum (4-5 years)",
                "Agile (4-5 years)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Uttam Barman",
        "email": "uttam.barman@sonitalentcorp.com",
        "jd": "This role is C2H Title: Scrum Master - SCM -4-5 years of experience working with agile teams and experience with Rally Work location: Atlanta, GA(Onsite)Visa –( No third party layer )Local or from same time zone profiles only .I need solid profiles with Banking experience. (CAPITAL MARKET AND TRADING PLATFORM DOMAIN EXP. CANDIDATES WILL CONSIDER FIRST) Job descriptionScrum Master – with 4-5 years of experience working with agile teams and experience with RallyScrum Master experience and skills:Should have excellent knowledge of the scrum framework (SAFe), with all its artifacts and techniques. Need the ability to coordinate people and projects (occasionally facilitating changes) with mind set on deliverables. Responsibilities:Manage each project’s scope and timelineCoordinate sprints, retrospective meetings and daily stand-upsFacilitate internal communication and effective collaboration Work with product owners to handle backlogs and new requestsResolve conflicts and remove obstacles that occurHelp teams implement changes effectivelyShare Agile Metrics with Client Manager after each SPRINTRequirements:Experience in a scrum master roleFamiliarity with software developmentExcellent knowledge of Scrum techniques and artifacts (such as definition of done, user stories, automated testing, backlog refinement) Good knowledge of other Agile frameworks (SAFe, Kanban)Excellent communication and servant leadership skillsProblem-solving and conflict-resolution abilityOutstanding organizational skillsExperiance Agile Metrics Scrum Master certification is a plus LinkedIn: https://www.linkedin.com/in/uttam-barman-b494b1254/Email: uttam.barman@sonitalentcorp.comContact: 8599464061",
        "source": "Email",
        "date_posted": "2024-10-14 10:33:00-05:00",
        "unique_id": "1928bc9e6d2f9e24",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Scrum Master"
    }
]