[
    {
        "company": "GSK Solutions Inc",
        "job_title": "IT Project Manager (Hybrid)",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "748108",
            "experience_required": "10 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "$80/hr on C2C"
        },
        "skills": {
            "core": [
                "Project Management",
                "Agile",
                "Waterfall",
                "Vendor Management",
                "MS Project"
            ],
            "primary": [
                "PowerPoint",
                "Excel",
                "MS Visio",
                "Stakeholder Management",
                "Dashboard Creation"
            ],
            "secondary": [
                "Medicaid Management IT Systems",
                "Business Project Management",
                "Risk Management",
                "Issue Management",
                "Communication"
            ],
            "all": [
                "Project Management",
                "Agile",
                "Waterfall",
                "Vendor Management",
                "MS Project",
                "PowerPoint",
                "Excel",
                "MS Visio",
                "Stakeholder Management",
                "Dashboard Creation",
                "Medicaid Management IT Systems",
                "Business Project Management",
                "Risk Management",
                "Issue Management",
                "Communication"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Sameer",
        "email": "sameer@gsksolutions.com",
        "jd": "From: Sameer, GSK Solutions Inc sameer@gsksolutions.com Reply to: sameer@gsksolutions.com Job Title: IT Project Manager (Hybrid) Location: Richmond, VA Duration: 6+ Months Job Type: Corp-Corp / 1099 / Contract W2 Rate: $80/hr on C2C Client: State of Virginia Interview Type: Webcam Job Description: The individual in this position works in the DMAS Project Management Office as a Project Manager. The position will be responsible for project management services for a variety of DMAS initiatives that will include both technology and business projects. Experience in the field of Medicaid Management IT Systems and a general understanding of the business is preferred. Duties Manage full project lifecycle, including, procurement (where needed), planning, execution, controlling, and closeout of for Information Technology (IT) and Business projects. Apply Agile, Waterfall and Hybrid methodologies as needed. Perform vendor management functions as needed. Track and manage vendor deliverables. Manage project schedules, budgets, risks, issues status updates etc. during the project life cycle. Produce detailed project plans and build schedules utilizing MS project. Create both standalone and integrated project schedules. Capability to manage multiple projects and priorities. Manage stakeholder communications and expectations. Communicate with senior leadership as needed. Produce project dashboards and presentations. Lead meetings and present information to a variety of stakeholders. Create workflows, user stories and project requirements as needed. Required/Desired Skills Skill Required /Desired Amount of Experience Experience managing large projects, stakeholders, and leading project teams Required 10 Years Advanced knowledge and experience in using MS project Required 6 Years Advanced knowledge of using PowerPoint and Excel to analyze data and produce dashboards Required 6 Years Experience in leading Waterfall projects Required 10 Years Experience in leading Waterfall and Agile projects Required 6 Years Advanced knowledge of MS Visio Required 5 Years Active PMP certification Required 0 Experience of working in the Medicaid or Managed Care Organizations Desired 0",
        "source": "Email",
        "date_posted": "2024-10-14 13:00:18-05:00",
        "unique_id": "1928c50c3eb829ab",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]