[
    {
        "company": "Yochana Solutions Inc.",
        "job_title": "Java/ AWS Solution Architect",
        "location": "San Antonio, TX, USA",
        "full_location": {
            "city": "San Antonio",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "17+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6-12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "AWS",
                "React",
                "Backend API"
            ],
            "primary": [
                "Guidewire",
                "Docker",
                "Terraform",
                "Springboot",
                "REST micro services"
            ],
            "secondary": [
                "Kafka",
                "Gitlab-CI",
                "Kibana",
                "Grafana",
                "Datadog",
                "Postman",
                "JSP/Servlets",
                "Struts",
                "IBM-DB2",
                "Oracle",
                "Websphere",
                "Tomcat"
            ],
            "all": [
                "Java",
                "AWS",
                "React",
                "Backend API",
                "Guidewire",
                "Docker",
                "Terraform",
                "Springboot",
                "REST micro services",
                "Kafka",
                "Gitlab-CI",
                "Kibana",
                "Grafana",
                "Datadog",
                "Postman",
                "JSP/Servlets",
                "Struts",
                "IBM-DB2",
                "Oracle",
                "Websphere",
                "Tomcat"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Madhulatha",
        "email": "madhulatha@yochana.com",
        "jd": "Hello,I’m a Technical Recruiter with Yochana Solutions Inc., a national IT staffing solutions provider with 14+ years of experience delivering value to leading companies across the U.S.A. and Canada,I'm currently staffing for Java/ AWS Solution Architect – San Antonio, TX(onsite), Below you will find the job description, if you are qualified and interested, please send me your Updated Word Document Resume.I'm very sorry if this position is not an ideal fit, We'll keep you in mind for other suitable positions and referrals would be appreciated.Thank you so much for your attention and participation.Job Role: Java/ AWS Solution ArchitectJob Location: San Antonio, TX(onsite)Project Duration: 6-12 MonthsJob Description:Pr Providing Tech Solutions2. Property & Causality (10 to 12 years) or insurance domain3. Have Lead Refinement Features4. Java / AWS5. Experience/ Lead Digital Projects6. UI (User Interface) none core AWS React JS Backend API knowledge7. Guidewire is a plusRole/ Title: Java/ AWS Solution Architect (Min 17+years experience) Experience:· Architect with Java / AWS skills· Gather new requirements for different components, prepare an implementable design, drawing out a plan for releases of the solution· Involve in all new RFP proposals and provide innovative solutions, design and estimates· Be updated with the latest AWS services and have hands-on expertise on required AWS services· Participate in PI Planning sessions to define Features to be developed in each PI and Sprint· Review all technical deliverables from the teams and ensure its adhering to the client’s standards and processes· Design, develop, test and deploy critical application components. Coordinate with offshore team to develop and integrate all code components· Create and maintain standardized documentation for the solutions implemented· Coordinate with the testing teams to improve automation testing in different environments· Interacting with onsite and offshore teams in resolving the impediments· Cloud Tools & Technologies:· AWS – Lambda, EKS, SQS, S3, RDS, DynamoDB, API-Gateway. Terraform· Openshift, Docker, Kafka, helm, Gitlab-CI, Gradle, Kibana, Grafana, Datadog, Postman· Front End Technologies:· React, Redux, NodeJS, ECMA script (ES6), Mocha, Chai, Pi-Test, Jest, CSS3, HTML5, Wicket, JSP/Servlets, Struts· JEE Tools & Technologies:· REST micro services (JAX-RS), SOAP Webservices (JAX-WS, JAX-RPC), Springboot, EJB, JPA, JDBC, XML, JEE Design Patterns, Java Batch· Databases & Servers: IBM-DB2, Oracle, Websphere, Tomcat",
        "source": "Email",
        "date_posted": "2024-10-14 11:53:03-05:00",
        "unique_id": "1928c3159048d26a",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]