[
    {
        "company": "Dept of Children and Families",
        "job_title": "On-Site APPLICATION DEVELOPEMENT ANALYST (ASP.NET/Core/API development/DDL/DML/T-SQL/Azure)",
        "location": "Tallahassee, FL, USA",
        "full_location": {
            "city": "Tallahassee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "11-12+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Multi Years",
            "rate": "$XX/hr (All Inclusive)"
        },
        "skills": {
            "core": [
                "ASP.NET Application Architect",
                "ASP.NET Core",
                "API development",
                "C#",
                "VB.NET",
                "F#",
                "web application development",
                "MVC",
                "Web API",
                "Blazor",
                "CI/CD",
                "Azure technologies",
                "DDL",
                "DML T-SQL skills"
            ],
            "primary": [
                "Data mapping",
                "API Architecture",
                "data integration",
                "Develop and optimize SQL queries",
                "stored procedures",
                "functions",
                "Develop user interfaces",
                "analyzing",
                "interpreting large datasets"
            ],
            "secondary": [
                "Salesforce",
                "Message MQ",
                "MuleSoft",
                "Testing",
                "Documentation"
            ],
            "all": [
                "ASP.NET Application Architect",
                "ASP.NET Core",
                "API development",
                "C#",
                "VB.NET",
                "F#",
                "web application development",
                "MVC",
                "Web API",
                "Blazor",
                "CI/CD",
                "Azure technologies",
                "DDL",
                "DML T-SQL skills",
                "Data mapping",
                "API Architecture",
                "data integration",
                "Develop and optimize SQL queries",
                "stored procedures",
                "functions",
                "Develop user interfaces",
                "analyzing",
                "interpreting large datasets",
                "Salesforce",
                "Message MQ",
                "MuleSoft",
                "Testing",
                "Documentation"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Alka",
        "email": "alka@abcinc-us.com",
        "jd": "From: alka, Allied Business Consulting alka@abcinc-us.com Reply to: alka@abcinc-us.com This is with Dept of Children and Families so it will be plus to have Public Sector + Child Support experience. Make sure that we have about 3+ Top candidates who can provide 3 ref. . They are only asking 11-12+ years of experience and have defined the rate parameters Start will be Dec 2024 so ideally we need candidates who already have a project NOT someone on bench.We would need the Resume, Attached Skill matrix; Ref sheet, & Signed Resume certification; for each candidate submitted. This closes by Wednesday (10/23/24) !!!!! Official ID : 6002 - OITS - RFQ - RT1053 - APPLICATION DEVELOPEMENT ANALYST (C.ADVANCED) Request #: PR613725-R118547 – Use this for R-T-R Please review the position and let us know of your interest. In order to submit we need A) complete skill MatrixB) complete ref sheet. Ref from 3 different projects are needed with All the fields filled out. The attached sheet needs to be filled out. Note: “Job period of Service and Description” refers to your experience NOT the references.C) An up to date resume D) Manual signed Resume certification form with Blue ink including the witness signature. GIS will provide the 2 witness signature. DL copy or passport copy is needed as form of identification to witness the persons signature. Please leave the date blank so we DO NOT have you bother you with this STEP for any future positions.E) Rate as agreed - $XX/hr (All Inclusive) C-2-C with once a month billing terms NET 30. Please confirmF) No Double submission to the state of Florida. Please confirm This is in ref to the position listed below Position ID: 421101-ASPNET Title: On-Site APPLICATION DEVELOPEMENT ANALYST (ASP.NET/Core/API development/DDL/DML/T-SQL/Azure) Location: Tallahassee, FLPay Rate: DOELength: Multi YearsTravel Required: noneTelecommute: no Skills: \"ASP.NET Application Architect\"; ASP.NET Core, API development, C#, VB.NET, F#; web application development; MVC, Web API, Blazor; CI/CD; Azure technologies; DDL, DML T-SQL skills, Data mapping; API Architecture and data integration; Develop and optimize SQL queries, stored procedures, and functions; Develop user interfaces ; tables, primary keys, foreign keys, constraints, indexes, transactions, process logging, error handling; Data mappings; analyzing, interpreting large datasets, catalog views, Salesforce, Message MQ, MuleSoft; Azure Cloud/SQL; Testing; Documentation, Govt Description:Note : Please reply ONLY if you 1) have all the Required skill set and have worked as a \"On-Site APPLICATION DEVELOPEMENT ANALYST (ASP.NET/Core/API development/DDL/DML/T-SQL/Azure)\" in a large & Complex enterprise level IT Environment. 2) have Minimum of 11-12+ years in IT and business work experience 3) can provide at least 3 verifiable experience from completed and/or substantially completed jobs that closely match this request (Filling the client provided form) + fill out a skill Matrix + Sign Resume certification form4) Can go through a background check including fingerprinting + Agree to a WEB CAM Interview 5) A Competitive Rate6) will be available Dec 2024 to start at the project. Each staff member assigned to this project must have a background screening that is equivalent to a Level Two (2) screening standard. This is a fixed fee/hourly based project which is inclusive of travel, lodging, per diem expenses and all other costs associated with the completion of the associated tasks. Interviews: In the event an interview is requested; all interviews will be conducted via web Cam. Telecommuting:Telecommuting is not an option for this position. This is NOT a remote position. Scope of Work (Tasks)The Vendor will provide the Department with staff augmentation services to provide Application Development Analyst (C.Advanced) services including, but not limited to: Primary Job Duties and TasksThe activities these candidates will be tasked with include, but are not limited to the following: Collaborate with business analysts, project managers, and stakeholders to understand the functional and non-functional requirements of the application. Translate business requirements into architectural designs that align with business goals. Design the overall system architecture and define how different components of the interact. Design, develop, and implement software applications using the .NET framework and languages like C#, VB.NET, and F#. Utilize ASP.NET (or ASP.NET Core) for web application development, including MVC, Web API, and Blazor for client-side and server-side programming. Develop and optimize SQL queries, stored procedures, and functions. Develop user interfaces and ensure the front end is responsive, accessible, and user- friendly. Review code, architecture, and design to ensure they meet the standards. Analyze and optimize the performance of the application. Design strategies for scaling the application efficiently as user demand grows. Ensure the application adheres to security best practices and compliance requirements. Implement DevOps practices such as continuous integration and continuous delivery (CI/CD). These positions are to provide technical guidance and expertise in supporting the department in developing, architecting, and maintaining APIs, data mappings, and monitoring high-volume complex data integration processes. Specific Knowledge, Skills, and Abilities (KSAs)The submitted candidate must be able to apply common knowledge, skills, and abilities in the following areas: Minimum Required KSAs:Minimum of 11-12+ years in IT and business work experience 5+ years of experience in .net core, API development. 5+ years of experience in DDL, DML T-SQL skills, advanced stored procedure writing skills, tables, primary keys, foreign keys, constraints, indexes, transactions, process logging, and error handling. 3+ years of experience in leading, mentoring, and managing a team of developers and engineers. 3+ years of experience with Data mapping. 3+ years of experience in API Architecture and data integration. 3+ years of analyzing and interpreting large datasets, including cleaning, transforming, and visualizing data. 3+ years of Experience in testing high-volume of complex data integration processes. 1+ years of experience in Salesforce, Message MQ, and MuleSoft Familiarity with system catalog views, and Azure Cloud Ability to provide excellent customer support, meticulous quality of work and work product. The Vendor will be paid for the staff augmentation hours worked. The Department expects the Vendor’s staff to perform services in a project-like manner. The Vendor staff must be capable of driving the service delivery required purchase order on their own through delivery of quality application changes. Also, the Vendor staff will work cooperatively and in conjunction with other Vendors, support staff, and program office customers in a team-based environment. General Knowledge, Skills and Abilities (KSAs)The submitted candidate(s) must be able to apply common knowledge, skills, and abilities in the following areas:1. Communication: Able to clearly convey information, in both written and verbal formats, to individuals or groups in a wide variety of settings (i.e.; project team meetings, management presentations, etc.). Must have the ability to effectively listen and process information provided by others.2. Customer Service: Works well with clients and customers (i.e.; business office, public, or other agencies). Able to assess the needs of the customer, provide information or assistance to satisfy expectations or resolve a problem.3. Decision Making: Makes sound, well-informed, and objective decisions.4. Flexibility: Is open to change, new processes (or process improvement), and new information. Has the ability to adapt in response to new information, changing conditions, or unexpected obstacles. Ability to receive and give constructive criticism and maintain effective work relationships with others.5. Interpersonal: Shows friendliness, courtesy, understanding, and politeness to others.6. Leadership: Motivates, encourages, and challenges others. Is able to adapt leadership styles in a variety of situations.7. Problem Solving: Able to identify, evaluate, and use sound judgement to generate and evaluate alternative actions, and make recommendations as accordingly.8. Team Building: Encourages, inspires, and guides others toward accomplishing the common goal. Resume for One Proposed Consultant - Resume Should have the following information : - Name- All work experience related to the CLIENT’s request for service- Sufficient detail for CLIENT to determine dates of the related work experience, how extensive the related work experience is, and the depth of knowledge and skills of the proposed candidate related to the needs of CLIENT- Candidate Education- Professional Summary- Technical Skills- Work Experience Candidate References: Three (3) references must be provided and include the following:- Name of Company: - Contact Person & Title: - Contact Telephone Number: - Contact Email Address: - Job Period of Service: (MM/YYYY-MM/YYYY)- Description (Scope of Work): - Reference should be a company contact not a peer on the project.- Verify candidate references, if incomplete and CLIENT is unable to email and call their reference, the proposal will be unaccepted. \"When replying please make sure to list your (All Inclusive) Compensation requirements !!!\" Note : This is a Full time ON SITE Contract Position with no REMOTE options allowed !! Start date : Dec 2024 # OF POSITIONS : 1",
        "source": "Email",
        "date_posted": "2024-10-14 16:31:35-05:00",
        "unique_id": "1928d12318ddc12e",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]