[
    {
        "company": "HCL",
        "job_title": "Oracle Technical Lead",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "7+ years",
            "degree_required": "Bachelor's degree in Computer Science, Information Technology, or a related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle E-Business Suite",
                "Oracle Fusion",
                "Oracle PLSQL",
                "SQL",
                "Oracle Forms",
                "Oracle Reports"
            ],
            "primary": [
                "ERP integrations using REST/SOAP APIs",
                "web services",
                "middleware",
                "Oracle Database management",
                "data modeling",
                "performance tuning"
            ],
            "secondary": [
                "Leadership skills",
                "Problem-solving skills",
                "Effective communication",
                "Interpersonal skills"
            ],
            "all": [
                "Oracle E-Business Suite",
                "Oracle Fusion",
                "Oracle PLSQL",
                "SQL",
                "Oracle Forms",
                "Oracle Reports",
                "ERP integrations using REST/SOAP APIs",
                "web services",
                "middleware",
                "Oracle Database management",
                "data modeling",
                "performance tuning",
                "Leadership skills",
                "Problem-solving skills",
                "Effective communication",
                "Interpersonal skills"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Rajesh",
        "email": "rajesh@info-ways.com",
        "jd": "From: rajesh, infoways rajesh@info-ways.com Reply to: rajesh@info-ways.com Hi , Hope you are doing great. We have an urgent requirement for the below position with our IT Client /HCL /client- Mars informationKindly reply back to this email or call me to discuss further.(609-858-0846) Location- RemoteRole- Oracle Technical LeadMandate- Oracle E-Business Suite, Oracle Fusion, or similar ERP platformsKey Responsibilities: Lead ERP development: Oversee the technical design, development, and deployment of Oracle ERP modules, ensuring alignment with business requirements and best practices. System integration: Architect and implement integrations between Oracle ERP and other enterprise systems, using APIs and middleware. Project management: Work closely with project managers and stakeholders to define project scope, set timelines, and allocate resources, ensuring on-time and within-budget delivery. Technical guidance and mentorship: Provide technical leadership to a team of developers, guiding them in best practices, code quality, and adherence to project requirements. Customization and configuration: Customize Oracle ERP modules to meet specific business needs, including developing Oracle Forms, Reports, PLSQL code, and more. Troubleshooting and support: Diagnose and resolve technical issues, providing Level 3 support for complex ERP issues as needed. Documentation and training: Create and maintain comprehensive technical documentation, and train team members on system configurations, customizations, and new features. Quality assurance: Conduct code reviews, implement testing strategies, and ensure solutions are thoroughly tested before deployment. Stay updated: Keep current with Oracle ERP advancements, tools, and industry best practices, recommending improvements and new technologies as appropriate. Required Qualifications: Education: Bachelor s degree in Computer Science, Information Technology, or a related field. An advanced degree is a plus. Experience: o 7+ years of experience working with Oracle ERP applications, including at least 3 years in a technical lead or supervisory role. o Proven experience with Oracle E-Business Suite, Oracle Fusion, or similar ERP platforms. Technical Skills: o Proficiency in Oracle PLSQL, SQL, Oracle Forms, and Oracle Reports. o Strong understanding of ERP modules (Finance, Supply Chain, HR) and their configurations. o Experience with ERP integrations using RESTSOAP APIs, web services, and middleware. o Familiarity with Oracle Database management, including data modeling and performance tuning. Soft Skills: o Strong leadership skills, with a proven ability to lead teams and drive project success. o Excellent problem-solving skills, with the ability to troubleshoot and resolve complex technical issues. o Effective communication and interpersonal skills, with the ability to work well with both technical and non-technical stakeholders.",
        "source": "Email",
        "date_posted": "2024-10-14 15:46:06-05:00",
        "unique_id": "1928ce88f4f98564",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Oracle DBA"
    }
]