[
    {
        "company": "Scalable Systems",
        "job_title": "Business Analyst",
        "location": "Boston, MA, USA",
        "full_location": {
            "city": "Boston",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Budget Management",
                "Risk Management"
            ],
            "primary": [
                "MS Project",
                "MS Office Suite",
                "Visio",
                "JIRA",
                "Service Now",
                "Confluence",
                "MS Teams",
                "Project Management Tools"
            ],
            "secondary": [],
            "all": [
                "Project Management",
                "Budget Management",
                "Risk Management",
                "MS Project",
                "MS Office Suite",
                "Visio",
                "JIRA",
                "Service Now",
                "Confluence",
                "MS Teams",
                "Project Management Tools"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Pradeep Sharma",
        "email": "pradeep.sharma@scalable-systems.com",
        "jd": "From: Pradeep, Scalable Systems pradeep.sharma@scalable-systems.com Reply to: pradeep.sharma@scalable-systems.com Hi,Greetings of the day! I have an urgent requirement below, please go through JD and let me know if you are comfortable or have any profile. Kindly revert me back with your updated resume as well. Job Title: Business Analyst Location: Boston, MA (Work from Office)Duration: Long Term Contract Responsibilities:Project oversight including managing project plans, managing status updates, providing management presentations for steering and status meetings, managing budgets and resource allocations and managing risks and issuesAccountable and responsible for having project deliverables and objectives executed and that the project is being managed in accordance with the Standard.Responsible for providing information to the Project Sponsor, Portfolio Manager and LOB PMO to help identify the condition of a project.This should include periodic reports capturingSignificant Risks and issues impacting the projectFinancial standing related to budget? Status against corresponding project plan representing all workstreams Decisions to be made by Sponsor or other Executive Steering forums and outcomeResponsible for leading cross-functional teams including workstream leads, Business Analyst, System Analyst, Testing Managers to develop and introduce the solution.Analyze business processes and requests and create official Business Requirements as a baseline for Technical Requirements.In depth understanding on Budget management & Risk management.Tools and Vendor ProductsExpertise with MS Project, MS Office Suite (Excel, Word, Outlook), Visio, JIRA, Service Now, Confluence, MS Teams, Project Management Tools (Delivery Hub, or the equivalent). Thanks & Regards, Pradeep SharmaEmail: pradeep.sharma@scalable-systems.com \"Scalable Systems is an Equal Opportunity Employer. We are committed to creating an inclusive environment for all employees and do not discriminate based on race, color, religion, sex, national origin, age, disability, or any other legally protected status.",
        "source": "Email",
        "date_posted": "2024-10-14 06:34:58-05:00",
        "unique_id": "1928aeffeca738ce",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]