[
    {
        "company": "KK Software Associates LLC",
        "job_title": "BI Data Visualization - Tableau, Business Analysis",
        "location": "Sunnyvale, CA, USA",
        "full_location": {
            "city": "Sunnyvale",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "8-10 years",
            "degree_required": "BS or equivalent degree in Business management, Computer Science, Engineering or related discipline required. MBA degree preferred.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Tableau",
                "Business Analysis",
                "Salesforce Platform",
                "Agile",
                "Scrum"
            ],
            "primary": [
                "Partner Portal",
                "Einstein Analytics",
                "SDLC project management",
                "process documentation",
                "project management software"
            ],
            "secondary": [
                "communication skills",
                "problem solving",
                "root cause identification",
                "team leadership",
                "relationship building",
                "active listening"
            ],
            "all": [
                "Tableau",
                "Business Analysis",
                "Salesforce Platform",
                "Agile",
                "Scrum",
                "Partner Portal",
                "Einstein Analytics",
                "SDLC project management",
                "process documentation",
                "project management software",
                "communication skills",
                "problem solving",
                "root cause identification",
                "team leadership",
                "relationship building",
                "active listening"
            ],
            "with_experience": [
                "Tableau (8+ years)",
                "Salesforce Platform (8+ years)",
                "Business Analysis (8+ years)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Priya Mishra",
        "email": "priya.m@kksoftwareassociates.com",
        "jd": "Hello,Hope you are doing good. This is Priya from KK Software Associates LLC. We are the Preferred vendor for the clients.I found your resume suitable for one of the job opportunities we currently have.Please find the detailed job description and please do let me know if you are interested in this opening:Job Title: BI Data Visualization - Tableau, Business AnalysisLocation- Sunnyvale, CA,Day -1 onsiteContractExperience (Years): 8-10Role Description:Organized, with a natural inclination for both strategic and tactical planning and turnstrategy into tangible deliverables.? Resilient and tenacious with a propensity to persevere.? Problem solving and root cause identification skills.? Flexibility to work in ambiguous situations, highly matrix environments, and supportother cross-program work-streams, as necessary.? Ability to be detail oriented and can separate priorities from distractions. You areable to analyze business requirements to determine the most e?ective approach toserving the needs of the organization .? High level of professionalism, energy and sense of urgency to make things happen.? Ability to establish and maintain trust, credibility and build strong relationships.? Ability to influence others and move toward a common vision or goal.? Lead by example and support, encourage and develop team members.? Exceptional written and verbal communication, and presentation skills, toaudiences of varying seniority.? Excellent active listening skills? Self-motivated individual, who thrives working in a global, matrixed, fast-pacedenvironment.? Experience working on projects with teams based outside the US includinginternational engagements.Related Technical Skills required? Strong knowledge of Partner Portal? 8 + years of experience as a business analyst and admin role leading enterprise-scale PRM projects.? Deep understanding of Salesforce Platform functionality and best practices.? Strong experience in implementation; ability to determine whether requirements areconfiguration, customization, and/or integrations with external systems? Experience with Agile / Scrum delivery models? Prior experience in SLDC project management and analysis including scoping /timeline management, documenting use cases, process flows/swim lane diagrams,requirements, user acceptance testing, change management, etc.? Working knowledge of process documentation & project management software? Experience working with large-scale, complex datasets and using salesforce datatools.? Superior ability to design and implement dashboards on Einstein Analytics/ TableauCRM preferred and reports to deliver business insight? Keen understanding of system security and controlsEducationBS or equivalent degree in Business management, Computer Science, Engineering orrelated discipline required. MBA degree preferred.Salesforce certifications:? Business Analyst? Salesforce Administrator Certification (preferred)? Agile SCRUM Master certification (preferred)? Salesforce Sales Cloud Consultant Certification (preferred)Competencies: Digital : BI Data Visualization - Tableau, Business AnalysisKeywords:Business Analysis, Salesforce Partner Portal, Tableau, Einstein Analytics",
        "source": "Email",
        "date_posted": "2024-10-14 12:37:32-05:00",
        "unique_id": "1928c596cc9453f7",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]