[
    {
        "company": "Dept of Law Enforcement",
        "job_title": "On-Site System Analyst (Angular/J2EE/Java/JBOSS/Springboot/REST APIs/JDBC/HTML/XML/CSS/T-SQL/JSON/SQL SERVER 2019)",
        "location": "Tallahassee, FL, USA",
        "full_location": {
            "city": "Tallahassee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "11-12+ years",
            "degree_required": "Bachelor’s Degree in Computer Science, Business Administration, or other related Information Technology (IT) fields",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term",
            "rate": "$XX/hr (All Inclusive)",
            "job_code": "421101-MEPIC"
        },
        "skills": {
            "core": [
                "Java 8.0",
                "J2EE (Servlets, JSP, EJB)",
                "Angular Framework",
                "Angular CLI",
                "Angular apps",
                "Reactive/Template-driven Forms",
                "RxJS",
                "JDBC",
                "XML",
                "HTML",
                "CSS",
                "API",
                "Webservice",
                "TypeScript",
                "JavaScript (ES6+)",
                "UI/UX Design Principles",
                "responsive design",
                "NgRx or Akita",
                "Webpack",
                "CI/CD pipelines and processes",
                "JBoss 8.x application servers",
                "Oracle",
                "MS SQL Server 2019",
                "T-SQL",
                "stored procedures",
                "triggers",
                "views",
                "Git",
                "CVS",
                "JAD Sessions",
                "Req Gathering",
                "Test plans/Cases",
                "JQuery",
                "Unix-basic scripting",
                "Agile",
                "MS Office/Visio",
                "Documentation"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Java 8.0",
                "J2EE (Servlets, JSP, EJB)",
                "Angular Framework",
                "Angular CLI",
                "Angular apps",
                "Reactive/Template-driven Forms",
                "RxJS",
                "JDBC",
                "XML",
                "HTML",
                "CSS",
                "API",
                "Webservice",
                "TypeScript",
                "JavaScript (ES6+)",
                "UI/UX Design Principles",
                "responsive design",
                "NgRx or Akita",
                "Webpack",
                "CI/CD pipelines and processes",
                "JBoss 8.x application servers",
                "Oracle",
                "MS SQL Server 2019",
                "T-SQL",
                "stored procedures",
                "triggers",
                "views",
                "Git",
                "CVS",
                "JAD Sessions",
                "Req Gathering",
                "Test plans/Cases",
                "JQuery",
                "Unix-basic scripting",
                "Agile",
                "MS Office/Visio",
                "Documentation"
            ],
            "with_experience": []
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Alka",
        "email": "alka@abcinc-us.com",
        "jd": "From: alka, Allied Business Consulting alka@abcinc-us.com Reply to: alka@abcinc-us.com Position is with Dept of Law Enforcement so it will be plus to have Criminal Justice Application exp + Govt exp. Make sure that we have about 2-3 Top candidates for the position who can provide 3 ref. We are seeking candidates with 11-12+ years of experience. Start will be Jan 2025 due to the extensive background check (including finger printing, credit check and drug screen) so ideally we need candidates who already have a project NOT someone on bench. We would need the Resume, Matrix, signed certification form (Exhibit E), on-site form and Ref for each candidate submitted. DO NOT send the signed certification to any consultant unless you have a signed Rate Agreement with them.Official ID : FDLE HQ ITS RMM RFQ SOW 24-25-057 Systems Analyst for MEPIC Technology Upgrade Project Request #: PR617136-R117047 – Use this for R-T-R Telecommuting: Telecommuting is not an option for this position. This is NOT a remote position. The person in this position:• Is knowledgeable in all areas of system development understanding business processes to successfully develop a new system within Client’s Java programming and SQL 2019 database infrastructure.• Codes the new system to meet functional and nonfunctional requirements as identified in the LBR at a high-level with JADs to delve in to the details.• Is responsible for clear communication and coordination between stakeholders, the MEPIC LBR Project Manager and the project team to successfully implement the new system.Expertise in Angular - In-depth knowledge of Angular (preferably Angular 15+ versions) including core concepts like components, services, modules, directives, and routing In order to submit we need A) complete skill Matrix B) complete ref sheet. Ref from 3 different projects are needed with All the fields filled out. C) An up to date resume and Cover letter (why you should be the selected candidate) in word format only. Please make sure all the skills listed in the skill matrix and the JD are reflected in your resume (only if you have the experience). See if you need to change anything in the attached resumeD) Manual signed Resume certification form with Blue ink including the witness signature. GIS will be able to provide the 2 witness signature. DL copy or passport copy is needed as form of identification to witness the persons signature. Please leave the date blank so we DO NOT have you bother you with this STEP for any future positions.E) Manual signed “on-site Acknowledgement” form with Blue/Black ink by the consultant providing the services. Only place the signature; the Top info box will be filled by GIS, Inc. F) Rate as agreed - $XX/hr (All Inclusive) C-2-C with once a month billing terms NET 30. Please confirmG) No Double submission to the state of Florida. Please confirm This is in ref to the position listed below Position ID: 421101-MEPIC Title: On-Site System Analyst (Angular/J2EE/Java/JBOSS/Springboot/REST APIs/JDBC/HTML/XML/CSS/T-SQL/JSON/SQL SERVER 2019)Location: Tallahassee, FLPay rate: DOELength: Long TermTravel required: noneTelecommute: No Skills: \"System Analyst\"; Java 8.0; J2EE (Servlets, JSP, EJB); Angular Framework; Angular CLI; Angular apps ; Reactive/Template-driven Forms; RxJS; JDBC; XML, HTML, CSS; API, Webservice; TypeScript; JavaScript (ES6+); UI/UX Design Principles; responsive design; NgRx or Akita; Webpack; (CI/CD) pipelines and processes; JBoss 8.x application servers; Oracle; MS SQL Server 2019, T-SQL; stored procedures, triggers, views; Git, CVS, JAD Sessions; Req Gathering; Test plans/Cases, JQuery; Unix-basic scripting; Agile; MS Office/Visio; Documentation; Govt Description: Please DO NOT Apply unless YOU: 1) can work 100% on-site from day one & have all the Required skill set and have worked as a \" On-Site System Analyst (Angular/J2EE/Java/JBOSS/Springboot/REST APIs/JDBC/HTML/XML/CSS/T-SQL/JSON/SQL SERVER 2019)\" in a large & Complex IT Environment. 2) can meet the min required experience as defined under the MANDATORY Skill. 3) can provide at least 3 verifiable experience from completed and/or substantially completed jobs that closely match this request + fill out a skill Matrix4) Can go through a Full background investigations (including finger printing, credit check and drug screen) by the client once selected. You would also need to fill out some pages of paperwork from the client to start the background check process which typically takes 4+ weeks. Your Status WILL ALSO BE VERIFIED USING E-VERIFY SYSTEM.5) have a Competitive Rate6) Can come for a Mandatory F-2-F interview at your own cost once position is confirmed and the background check has been initiated7) Can sign a certification form verifying All the experience in your resume9) will be available in Jan 2025 timeframe as the background check after a successful interview takes a minimum of 4+ weeks. each staff member assigned to this project must have a background screening that is equivalent to a Level Two (2) screening standard. This is a fixed fee/hourly based project which is inclusive of travel, lodging, per diem expenses and all other costs associated with the completion of the associated tasks. Interviews:In the event an interview is requested, in-person interviews will be conducted at Tallahassee, Florida. At the discretion of the manager, interviews may be conducted remotely via Microsoft Teams. A phone interview may also be requested as a first step. Telecommuting:Telecommuting is not an option for this position. This is NOT a remote position. BackgroundThe mission of the Client is to “promote public safety and strengthen domestic security by providing services in partnership with local, state, and federal criminal justice agencies to prevent, investigate, and solve crime while protecting Florida’s citizens and visitors.” In 1982, the Florida Legislature appropriated funds for the establishment of the first state Missing Endangered Persons Information Clearinghouse (MEPIC) in the nation. The current system has added functionality over the years as required by legislation and to assist the Client members who use the system to issue alerts and streamline processes for faster communication about a missing person.The MEPIC system needs to be replaced with a database re-design and programming in newer technology with web screens that adhere to the current business needs rather than being constrained by the foundation of a 1983 system design. Newer technology in a re-designed MEPIC system can better assist in the recovery of missing persons. Description of Services & DeliverablesClient requires the services of a Systems Analysts to work under the direction of Client’s assigned supervisor to achieve the goals and objectives of the MEPIC Technology Upgrade Project as approved by a Legislative Budget Request (LBR). The Systems Analyst is expected to use their skills to participate in the design of a new system to meet the customer requirements which will include several interfaces with other internal and external Client systems and technology improvements. They will be on a team consisting of the Project Manager, two Business Analysts and eight Systems Analysts to deliver an upgraded MEPIC system meeting the LBR requirements within the LBR three-year timeframe.The person in this position:• Is knowledgeable in all areas of system development understanding business processes to successfully develop a new system within Client’s Java programming and SQL 2019 database infrastructure.• Codes the new system to meet functional and nonfunctional requirements as identified in the LBR at a high-level with JADs to delve in to the details.• Is responsible for clear communication and coordination between stakeholders, the MEPIC LBR Project Manager and the project team to successfully implement the new system. Systems Analyst responsibilities include, but are not limited to the following:• Planning, Organizing, Integrating, and Implementing requirements with system interfaces, scheduled processes (jobs), functions and features• Adhering to Client Project Control Processes, Procedures, and Change Control• Technical issue identification and resolution• Deployment and Implementation Planning• Technical leadership within the project team and to others, both internal and external to Client• Collaborating with stakeholders to understand the project requirements• Develop and execute test plans to ensure the new system functions as expected• Document the system design, developed code, and test results• Report clearly and accurately to the Project Manager on the progress of completing assignments• Transforming requirements gathered in Joint Application Development (JAD) sessions in to the application components• Coordinate effectively with Client Information Technology Services (ITS) staff required to support the project• Effectively work with the Office of Statewide Investigative Systems (OSIS) Enforcement and Investigative Services (EIS) Leadership and MEPIC members throughout the software development life cycle to complete this project Deliverables:• Documented Detailed Technical Requirements• Documented Design Documents• Contributes the technical aspects to the System Security Plan• Documented application components with positive and negative test scenarios• Identification of issues immediately with recommendations to mitigate• Adherence to the project scope as identified by the LBR and Project Manager• Assistance to the Project Manager ensuring Action Items, Decisions, and optimal design is documented• Contributor to the Operations & Maintenance Plan• Knowledge transfer to the Client ITS MEPIC Maintenance Team Mandatory Skills and Experience: • Bachelor’s Degree in Computer Science, Business Administration, or other related Information Technology (IT) fields• Minimum of 7 years of work experience designing successful, large-scale IT projects• Analysis of detailed requirements and documentation• Programming and implementing the newly developed MEPIC systemAngular Framework In-depth knowledge of Angular (preferably Angular 15+ versions) including core concepts like components, services, modules, directives, and routing. Experience with Angular CLI for scaffolding and managing applications. Familiarity with Reactive Forms and Template-driven Forms. Strong understanding of RxJS and Observables for managing asynchronous data streams. Proficient in Angular's change detection strategy.Web Technologies HTML5: Expertise in semantic HTML and web accessibility. CSS3: Strong knowledge of CSS, preprocessors like SCSS/SASS, and responsive design (flexbox, grid systems). JavaScript (ES6+): Solid JavaScript knowledge with an emphasis on modular, clean, and maintainable code. Experience with TypeScript.UI/UX Design Principles Understanding of UI/UX best practices to create visually appealing, user-friendly interfaces. Knowledge of design systems, style guides, and design consistency across applications. Experience working with responsive design, ensuring apps function across devices and screen sizes.State Management Knowledge of state management libraries such as NgRx or Akita. Experience in handling global and local application states efficiently.Build Tools and Deployment Experience with build tools like Webpack, Angular CLI, or similar. Familiarity with Continuous Integration/Continuous Deployment (CI/CD) pipelines and processes. Understanding of optimizing performance in Angular apps (lazy loading, AoT compilation).• Experience in completing programming with the agreed functionality and within the schedule timeline• Excellent oral and written communication skills• Strong collaboration skills with stakeholders and project team• Ability to communicate the technical design in non-technical terms for the end-users to understand• Experience with transforming system requirements to design specifications and programming code• Experience working in a multi-vendor project team members• Experience designing and programming in development projectso Angular (advanced level)o Springboot and REST APIso J2EE/Java 21(JSP, EJB)o JBoss 8.x application serverso JDBCo MS-SQL 2019 databaseo T-SQL stored procedures, triggers, views, etc.o HTML5/CSSo Java/Typescripto JSON o XML Preferred Knowledge Skills and Abilities: • Government, Law Enforcement, or Public Safety IT projects• Master’s Degree in Computer Science, Business Administration, or other related IT fields or equivalent Project Management work experience The Systems Analyst will report to the designated Client supervisor. The Systems Analyst is expected to perform the tasks and specific assignments given by the Client supervisor. Note : These are Full Time ON-SITE Contract Position with NO remote options allowed. **When responding please do tell us your All-inclusive compensation requirements ***. POSITION STARTS : Jan 2025 # of Positions : 1",
        "source": "Email",
        "date_posted": "2024-10-14 17:46:26-05:00",
        "unique_id": "1928da672545b5aa",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]