[
    {
        "company": "Wise Equation solutions Inc.",
        "job_title": "Business Analyst",
        "location": "Montgomery, AL, USA",
        "full_location": {
            "city": "Montgomery",
            "state": "AL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "3-5 years",
            "degree_required": "Bachelor’s Degree in Computer Science, Information Systems, Business Administration, or other related field. Or equivalent work experience.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 Months contract to Hire",
            "rate": "$37/Hr on C2C"
        },
        "skills": {
            "core": [
                "SQL",
                "HL7",
                "Documenting and writing Reports"
            ],
            "primary": [
                "Business analysis methodologies",
                "Agile methodologies",
                "Microsoft Word",
                "Microsoft Excel",
                "Microsoft PowerPoint",
                "Microsoft Project",
                "Microsoft Visio",
                "MS Access"
            ],
            "secondary": [
                "Communication with Vendors",
                "Understanding of technological trends"
            ],
            "all": [
                "SQL",
                "HL7",
                "Documenting and writing Reports",
                "Business analysis methodologies",
                "Agile methodologies",
                "Microsoft Word",
                "Microsoft Excel",
                "Microsoft PowerPoint",
                "Microsoft Project",
                "Microsoft Visio",
                "MS Access",
                "Communication with Vendors",
                "Understanding of technological trends"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "GARGI",
        "email": "gargi@wiseq.net",
        "jd": "From: GARGI, Wise Equation solutions Inc. gargi@wiseq.net Reply to: gargi@wiseq.net State of AL Business Analystc (Onsite from Day 1)6 Months contract to HireUSC and GC OnlyPR: $37/Hr on C2C Position DescriptionServes as a liaison between the business community and the IT organization in order to provide technical solutions to meet user needs. Possesses expertise in the business unit(s) they support, as well as, an understanding of the IT organization’s systems and capabilities. Analyzes business partner’s operations to understand their strengths and weaknesses to determine opportunities to automate processes and functions. Assists in the business process redesign and documentation as needed for new technology. Translates high level business requirements into functional specifications for the IT organization and manages changes to such specifications.Educates the IT organization on the direction of the business. Negotiates agreements and commitments by facilitating communication between business unit(s) and IT from initial requirements to final implementation. Possesses an understanding of technological trends and uses this knowledge to bring solutions to business units supported to enhance the enterprise’s competitive edge. May make recommendations for buy vs. build decision. Provide the following deliverables per the direction of assignment a) Requirement Specification Document b) Functional Specification document C) Support testing and deployment of applications Serve as Primary Point of contact for all implementation and onboarding activity for providers Skills RequiredIntermediate professional level role. Works with business partners within one business function to align technology solutions with business strategies. Demonstrates an informed knowledge of a business area to resolve problems on an ongoing business. Supports several moderately complex business processes.Works on multiple projects as a project team member. Must be able to communicate clearly and Precisely with Vendors and Program team members. Skills PreferredStrong understanding and experience related to business analysis methodologies /processes and Agile methodologies. Strong experience with Microsoft products including Word, Excel, PowerPoint, Project, Visio and MS Access. Experience RequiredTypically has 3 to 5 years of relevant technical or business work experience. Proficient with MS office(including Word,Excel, Powerpoint) Ability to work with Subject Matter Experts to understand application Requirements Experience PreferredSome Sql Experience is preferred Some knowledge of Health Language 7 (Hl7) is preferred Education RequiredBachelor’s Degree in Computer Science, Information Systems, Business Administration, or other related field. Or equivalent work experience. Must Haves :SQL – a minimum of 2 yearsHL7 - a minimum of 2 yearsDocumenting and writing Reports- a minimum of 2 years",
        "source": "Email",
        "date_posted": "2024-10-14 11:52:12-05:00",
        "unique_id": "1928c126c000ed0e",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]