[
    {
        "company": "Largeton INC",
        "job_title": "Salesforce Certified Product Owner",
        "location": "Texas, USA",
        "full_location": {
            "city": "Texas",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Bachelor's degree",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Bachelor’s Degree in Computer Science",
                "10 years’ experience as a Business Analyst",
                "Strong people and communication skills",
                "Experience mapping AS-IS and TO-BE business processes",
                "Agile/Scrum experience"
            ],
            "primary": [
                "Salesforce Platform",
                "Financial Service cloud",
                "Sales cloud",
                "Salesforce Marketing cloud",
                "Integration to ERP System (SAP/Oracle)"
            ],
            "secondary": [
                "Excellent analytical skills",
                "Problem solving skills",
                "Leadership skills",
                "Ability to work in a fast-paced environment",
                "Proficient in MS Word, Excel, Visio, and PowerPoint"
            ],
            "all": [
                "Bachelor’s Degree in Computer Science",
                "10 years’ experience as a Business Analyst",
                "Strong people and communication skills",
                "Experience mapping AS-IS and TO-BE business processes",
                "Agile/Scrum experience",
                "Salesforce Platform",
                "Financial Service cloud",
                "Sales cloud",
                "Salesforce Marketing cloud",
                "Integration to ERP System (SAP/Oracle)",
                "Excellent analytical skills",
                "Problem solving skills",
                "Leadership skills",
                "Ability to work in a fast-paced environment",
                "Proficient in MS Word, Excel, Visio, and PowerPoint"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Awkash Kumar",
        "email": "awkash@largeton.us",
        "jd": "From: Awkash Kumar, Largeton INC awkash@largeton.us Reply to: awkash@largeton.us JD :: Minimum of Bachelor's degree. 10+ years business analyst experience with utilizing program management methodology4+ Projects as a Product owner for Salesforce Platform.2+ projects working on Financial Service cloud, Sales cloud - - Mandatory2+ projects working on Salesforce Marketin cloud - Mandatory1+ Project working with Integration to ERP System (SAP/Oracle)Previous involvement in the deployment of a Global Customer Relationship Management platform (Salesforce.com) required* * ** *Deep understanding of Salesforce.com technical requirements, system configuration, user requirements and all related policies and procedures.Excellent analytical, quantitative, and problem solving skills with the proven ability to communicate and influence effectively at various levels of the organizationProven leadership skills and ability to lead others in defining requirements and identifying solutionsSharp focus on achieving results; persists at completing tasks despite challenges; ability to achieve results and navigate through ambiguityWell-organized; plans activities and consistently follows upAbility to work in a fast paced and dynamic environmentProficient in MS Word, Excel, Visio, and PowerPoint Core SkillsBachelor’s Degree in Computer Science, Engineering, Management Information Systems or related field Minimum of 10 years’ experience as a Business Analyst.Strong people and communication skills (written, verbal and presentations to groups). Strong background of analysis across a number of business processes applications, data definitions, integrations, and varieties of infrastructure.Demonstrates accountability and leadership.Competent ability to deliver under pressure and respond to a changing environmentEffective leadership skills and proven ability to motivate teams to achieve results. Can demonstrate the ability to manage demanding and challenging stakeholders.Has worked in and feels comfortable with international, virtual, multi-cultural, multi-disciplined, and high performance working teams.Extensive experience reviewing and examining business processes and systems, modeling and analyzing data, organizing activities and developing business strategies.Demonstrates a high level of quality in work products, including diligence and detail oriented in analysis performed and precision in statements made.Experience of working as lead analyst on multiple projects in a small team.Experience working in a legal or professional services environment is preferred.Appropriate analysis training/qualifications are preferred (BCS/ISEB diploma, IIBA certification,)Has at least three years of experience mapping AS-IS and TO-BE business processes. Can produce high-quality process maps following BPMN 2.0 and always uses process symbols appropriately.Comfortable with Agile working practices and Scrum ceremonies. Has at least three years of experience working within the framework. Is able to operate as a Business Analyst within an agile scrum team with minimal to zero oversight.Agile/Scrum experience desired. Certified Scrum Product Owner or Certified Scrum Professional preferred. Roles & Responsibilities:Articulate the product vision.Write requirements as User stories/EPICs, FRS.Create backlog and prioritization.Participate in Agile rituals.Support the development team with Questions on the product*Create and manage programs.Review analyze and triage incoming projects.Design solutions with highest possible user experienceLead the development, testing effortsParticipate in System Integration Testing, Business Acceptance TestingParticipate in User Acceptance TestingSmooth production deployment, hyper care and closure of the project/s",
        "source": "Email",
        "date_posted": "2024-10-14 13:57:32-05:00",
        "unique_id": "1928c8528723c0d5",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]