[
    {
        "company": "Sligo Software Solutions, Inc.",
        "job_title": "Project Manager",
        "location": "Rensselaer, NY, USA",
        "full_location": {
            "city": "Rensselaer",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "SLG - 19 - 9906",
            "experience_required": "84 months",
            "degree_required": "Master’s degree in management information systems or equivalent",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "30 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "System Implementation",
                "Integration",
                "Financial Systems",
                "Oracle/Peoplesoft Financials"
            ],
            "primary": [
                "Cross-functional Project Planning",
                "Task Management",
                "Defect Resolution",
                "User Liaison",
                "Reporting"
            ],
            "secondary": [
                "Communication",
                "Documentation",
                "Meeting Coordination",
                "Testing Coordination",
                "Relationship Management"
            ],
            "all": [
                "Project Management",
                "System Implementation",
                "Integration",
                "Financial Systems",
                "Oracle/Peoplesoft Financials",
                "Cross-functional Project Planning",
                "Task Management",
                "Defect Resolution",
                "User Liaison",
                "Reporting",
                "Communication",
                "Documentation",
                "Meeting Coordination",
                "Testing Coordination",
                "Relationship Management"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Srikanth Vanam",
        "email": "srikanth.vanam@sligosoft.com",
        "jd": "From: Srikanth Vanam, Sligosoft srikanth.vanam@sligosoft.com Reply to: srikanth.vanam@sligosoft.com Greetings from Sligo Software Solutions, Inc. !!SLIGO is a Software Development & IT Consulting company. We have around 100+ IT associates working with our esteemed clients across several domains such as IT, Banking, Healthcare, and Government. We have an urgent requirement for Project Manager position with our client. Role: Project ManagerLocation: Rensselaer, New YorkDuration: 30 MonthsJob ID: SLG - 19 - 9906Client: NY StateRespond by Date: 10/11/24 5:00 PM Description Assist in the management, ongoing maintenance, testing, and integration related to the Statewide Financial System (SFS) and OCFS internal systems. Communicate with the Business Service Center regarding processing issues, coordinate meetings and agendas. Assist Accounts Payable and Revenue Units with developing report queries, invoice gathering and researching/developing tools to enhance processes. This position will coordinate and ensure that SFS related changes are completed in OCFS internal systems correctly and timely.Duties Coordinate SFS and BSC activities within all bureaus under the Division of Administration at OCFS including the Bureau of Contract Management (BCM), Bureau of Financial Operations (BFO) and Bureau of Budget Management (BBM), Bureau of Office Management Services (OMS) along with statewide facilities/offices as well as programs such as the Commission for the Blind, the Office of National and Community Service and the Child Care bureau.These activities include communication of key information, scheduling appropriate meetings, coordinating with the training department at OCFS to ensure that SFS training is conducted timely and completely for all OCFS staff affected by SFS.Communicating problems with SFS and BSC and ensuring open issues are recorded and resolved.Pursuing adequate reporting needs out of SFS to meet the myriad reporting requirements at OCFS including ensuring all OCFS staff are appropriately role-mapped in SFS.Ensuring all four different SFS administrators (Security, Workflow, Data, and Reports) are coordinating activities with each other to ensure timely updates to information within SFS.Communicating all SFS and BSC related information in a coordinated, clear and timely manner.Ensuring effective relationships with the SFS and BSC management teams, deployment liaisons, technical team and integration team. Ensuring OCFS is adequately represented for required SFS and BSC activities.Serving as the point of contact for all OCFS staff for information, direction, support, and access to SFS and BSC. This Expert has obtained a significant amount of knowledge and built strong relationships with SFS, the BSC, and various other agencies to address issues and obtain information in a timely fashion.Implement and manage internal communication plan to establish and maintain channels for OCFS staff to submit questions and get support regarding SFS and BSC or to communicate to staff when SFS releases a system alert that affects transaction processing.Interface with Contract Management System (CMS) and Central Accounts Payables (CAPS) development teams and management staff to ensure existing systems meet SFS specifications as CMS and CAPS data is sent to SFS through a batch process and is not entered directly into the SFS system, where appropriate.Lead meetings with OCFS staff to provide SFS and BSC updates, information, schedule changes, planned outages, and any other required SFS or BSC information to ensure OCFS staff have the information they need to complete their work in SFS.Participate in meetings with SFS and other agencies to discuss current SFS announcements, issues, and problem resolutionsLiaise with SFS and BSC agency representatives to escalate OCFS issues, provide needed information to SFS or BSC to resolve issues or re-open issues that were not resolved to the satisfaction of OCFS.Coordinate with all OCFS SFS Administrators to ensure users have proper access, transactions are routed timely, and approvals are made correctly.Maintain documentation, meeting notes, announcements, updates, and emails from SFS and BSC to be disseminated and distributed to appropriate personnel at OCFSCoordinate testing with OCFS staff for any SFS updates to transaction processing or reports.Coordinate access to Query Manager and communicate with all relevant parties to ensure OCFS received high service levelsPlan and implement OCFS testing for SFS upgrades as needed. Mandatory Requirements Experience (14+ Years)Plans, organizes and integrates cross-functional information technology projects that are significant in scope and impact.Requirements This is an 100% Onsite84 Months experience as a project manager with increasing responsibility. Experience must include management of all aspects of system implementation and integration within a large organizational structure, approximately 300 users.84 months experience of management of timelines, tasks, and reporting.84 months experience in the management of multiple simultaneous projects with competing deadlines.84 months experience with managing defect resolution and being the liaison between the end users and development staff.60 months experience with financial systems and processes, including operations and implementation.60 months experience with the implementation and operation of Oracle/Peoplesoft Financials utilized in a large government environment, approximately 300 users.Master’s degree in management information systems or equivalent. Proof of Education is to be submitted with all responses.RésuméCopy of Candidate Identification (i.e., Driver’s License/Green Card/Visa and Passport if applicable)Any documents referenced in the above Requested Qualifications(i.e., professional certifications, degrees, etc.) ThanksSrikanth Vanam",
        "source": "Email",
        "date_posted": "2024-10-14 07:09:39-05:00",
        "unique_id": "1928b0fbcc25f995",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]