[
    {
        "company": "CompuSoft Integrated Solutions, Inc.",
        "job_title": "Business Analyst",
        "location": "Cincinnati, OH, USA",
        "full_location": {
            "city": "Cincinnati",
            "state": "OH",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "Long Term",
                "third party"
            ],
            "experience_required": "Minimum 6 years",
            "degree_required": "Bachelor's degree in IT discipline is preferred",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Process Analysis",
                "Requirements Gathering",
                "Project Management",
                "Testing",
                "SAP CRM"
            ],
            "primary": [
                "Communication with External Customers",
                "Documentation of Test Plans",
                "Change Management Process",
                "Mobile Applications",
                "PC Office Applications"
            ],
            "secondary": [
                "Six Sigma"
            ],
            "all": [
                "Business Process Analysis",
                "Requirements Gathering",
                "Project Management",
                "Testing",
                "SAP CRM",
                "Communication with External Customers",
                "Documentation of Test Plans",
                "Change Management Process",
                "Mobile Applications",
                "PC Office Applications",
                "Six Sigma"
            ],
            "with_experience": [
                "Business Process Analysis",
                "Requirements Gathering",
                "Project Management",
                "Testing",
                "SAP CRM"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "",
        "email": "dev@compusoft-is.com",
        "jd": "From: Dev, CompuSoft Integrated Solutions, Inc. dev@compusoft-is.com Reply to: dev@compusoft-is.com Job Title : Business AnalystLocation : Cincinnati, Ohio (ONSITE ROLE)Employment Type : Long Term We are currently looking for a Business Analyst Level 3 for the Mobility team within IT. The Business Analyst Level 3 is responsible for: establishing liaison relationship with business partners in order to provide solutions; analyzing business workflows to address business needs; managing client’s priorities of projects and requests; conducting feasibility studies and drafting proposals for evaluation by appropriate users and managers; developing and assisting in the presentation of business cases; developing, writing and communicating business requirements for the design and implementation of business solutions; reviewing test plans and monitoring the testing process to ensure that business results are adequately tested; providing Tier III support for application issues, investigating, resolving and escalating problems; supporting and participating in the formal reporting of project status; utilizing approved project management practices to track project status; communicating project status and issues with customers and Team Leader; delivering projects on time and within budget; benchmarking with other companies to collect research in terms of best practices, business practices; leading and directing the work of others; demonstrating strong business acumen and positive discontent to influence continuous improvement; and planning and prioritizing workload to meet deadlines, while planning and tracking status on several projects at once and adjusting to constant business change and changing requirements. High school diploma required; Bachelor's degree in IT discipline is preferredMinimum 6 years of work experience in Information Technology or Client BusinessMinimum 6 years of work experience with business process analysis and requirements gathering, with strong emphasis on communication with the external customerMinimum 3 years of documenting test plans and processes to ensure that release items are adequately tested with minimal riskMinimum 3 years of participating in a formal change management process to promote changes through a tiered landscapeMinimum 1 year of work experience with project management skillsMinimum 3 years with testing and conceptualizing mobile applicationsMinimum 2 years with SAP CRM, ECC, EM, BWMinimum 6 years with PC office applications.Experience/Minimum 6 years? with Six Sigma preferred",
        "source": "Email",
        "date_posted": "2024-10-14 11:29:00-05:00",
        "unique_id": "1928bfd2c13b8aa3",
        "emp_type": [
            "Long Term",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]