[
    {
        "company": "ItechUS",
        "job_title": "Lead Java Engineer Microservices",
        "location": "Atlanta, GA, USA",
        "full_location": {
            "city": "Atlanta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Springboot",
                "Microservices"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Java",
                "Springboot",
                "Microservices"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Mahender",
        "email": "mahender@itechus.net",
        "jd": "From: Mahender, ItechUS mahender@itechus.net Reply to: mahender@itechus.net Lead Java Engineer Microservices Location : Atlanta, GA Need Locals with local ID copy Duration : 12+ Months Java, Springboot Microservice Creates design principles and prepares technical and infrastructure architecture deliverables that meet business requirements and customer needs. Work is conducted in accordance to standards and methodologies and is consistent with the target business architecture strategy? Participates in product design recommendations that span the entire infrastructure framework.? Manage and prioritize the product and feature backlog for your products and APIs? Lead the API/Micro-Services solution development and delivery, including hands on development? Responsible for program design, coding, testing, debugging, documentation and preparing detailed specifications from which complex programs will be written.? Provide application support, which includes problem research, analysis, resolution, and on-call support? Work with QA/Testing groups to resolve issues and to ensure software quality? Meet with clients to understand their needs and offer consulting services to internal groups.? Develop and maintain API?s for multiple lines of business within an efficient Agile SDLC and act as an advocate for the API platform? Builds technical relationships with business, operations, and technical teams and leads design efforts that provides innovative solutions and complex architectures? Work cross-functionally with various Architects, Engineers, and Product owners across multiple teams in a rapidly evolving environment to translate business needs into API interface and functional requirements",
        "source": "Email",
        "date_posted": "2024-10-14 08:34:05-05:00",
        "unique_id": "1928b5d0a6e3cb84",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Java developer"
    }
]