[
    {
        "company": "Arthur Grand Technologies",
        "job_title": "AWS Cloud Engineer with Java",
        "location": "Plano, TX, USA",
        "full_location": {
            "city": "Plano",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "AWS",
                "Spring Boot",
                "RESTful API",
                "Microservices"
            ],
            "primary": [
                "Python",
                "Go",
                "Apache Kafka",
                "EC2",
                "ALB",
                "NLB",
                "Aurora Postgres",
                "DynamoDB",
                "EKS",
                "ECS Fargate",
                "MFTS",
                "SQS/SNS",
                "S3",
                "Route53"
            ],
            "secondary": [
                "Ansible",
                "Artifactory",
                "Docker",
                "GitHub",
                "Jenkins",
                "Kubernetes",
                "Maven",
                "Sonar Qube",
                "IaC",
                "EaC",
                "CI/CD",
                "Shell scripts",
                "Gradle",
                "Spinnaker",
                "Splunk",
                "Datadog",
                "Dynatrace",
                "CloudWatch",
                "Grafana"
            ],
            "all": [
                "Java",
                "Python",
                "Go",
                "Apache Kafka",
                "Spring Boot",
                "RESTful API",
                "Microservices",
                "AWS",
                "EC2",
                "ALB",
                "NLB",
                "Aurora Postgres",
                "DynamoDB",
                "EKS",
                "ECS Fargate",
                "MFTS",
                "SQS/SNS",
                "S3",
                "Route53",
                "Ansible",
                "Artifactory",
                "Docker",
                "GitHub",
                "Jenkins",
                "Kubernetes",
                "Maven",
                "Sonar Qube",
                "IaC",
                "EaC",
                "CI/CD",
                "Shell scripts",
                "Gradle",
                "Spinnaker",
                "Splunk",
                "Datadog",
                "Dynatrace",
                "CloudWatch",
                "Grafana"
            ],
            "with_experience": [
                "Java (10+ years)",
                "AWS (10+ years)",
                "Spring Boot (10+ years)",
                "Microservices (10+ years)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Mohanapriya",
        "email": "mohana.g@arthurgrand.com",
        "jd": "From: Teamafrah, Arthur Grand Technologies Inc teamafrah@arthurgrand.com Reply to: teamafrah@arthurgrand.com Arthur Grand Technologies is currently seeking a highly motivated of AWS Cloud Engineer with Java one of our client. Position: AWS Cloud Engineer with Java Location: Plano, TX (Onsite)Duration: Contract Mandatory Skills:Java, Python, Go, Apache KafkaJava, Spring Boot, RESTful API technologies/MicroservicesAWS (EC2, ALB, NLB, Aurora Postgres, DynamoDB, EKS, ECS Fargate, MFTS, SQS/SNS, S3 and Route53) Detailed Job Description:Formal training or certification on software engineering concepts and 10+ years applied experienceHands-on practical experience delivering system design, application development, testing, and operational stabilityAdvanced in one or more programming language(s) - Java, Python, GoA strong understanding of business technology drivers and their impact on architecture design, performance and monitoring, best practicesDesign and building web environments on AWS, which includes working with services like EC2, ALB, NLB, Aurora Postgres, DynamoDB, EKS, ECS fargate, MFTS, SQS/SNS, S3 and Route53Advanced in modern technologies such as: Java version 8+, Spring Boot, Restful Microservices, AWS or Cloud Foundry, Kubernetes.Experience using DevOps tools in a cloud environment, such as Ansible, Artifactory, Docker, GitHub, Jenkins, Kubernetes, Maven, and Sonar QubeExperience and knowledge of writing Infrastructure-as-Code (IaC) and Environment-as-Code (EaC), using tools like CloudFormation or TerraformExperience with high volume, SLA critical applications, and building upon messaging and or event-driven architecturesDeep understanding of financial industry and their IT systems Nice to Have:IaC, EaC & CI/CD, Shell scripts, Gradle, Maven, Jenkins, SpinnakerSplunk, Datadog, Dynatrace. CloudWatch or GrafanaAWS, Terraform & Jul About Arthur Grand Technologies:Arthur Grand Technologies is a leading provider of staffing and technology consulting services. Our company is managed by a team of professionals who have worked for big 5 consulting firms for 20+ years. We are a minority-owned staff augmentation and technology consulting company.At Arthur Grand Technologies, we value our employees & contractors and strive to provide them with challenging, interesting work, market-relevant benefits, and opportunities for professional growth. If you have the necessary qualifications, and are excited to join a dynamic team, please send your resume to mohana.g@arthurgrand.com for immediate consideration.Thank you for considering Arthur Grand Technologies. We look forward to hearing from you soon. Thanks,Mohanapriya mohana.g@arthurgrand.comArthur Grand Technologies Incwww.arthurgrand.comArthur Grand Technologies is an Equal Opportunity Employer (including disability/vets)",
        "source": "Email",
        "date_posted": "2024-10-14 09:10:04-05:00",
        "unique_id": "1928b8dddba56ea5",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]