[
    {
        "company": "NAVTECH INC",
        "job_title": "Java Fullstack Developer",
        "location": "Alpharetta, GA, USA",
        "full_location": {
            "city": "Alpharetta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "11 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 to 12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java (JDK 17+)",
                "Spring Framework",
                "Spring Boot",
                "Angular",
                "JavaScript",
                "TypeScript"
            ],
            "primary": [
                "Cloud-Native Application Development",
                "RESTful web services",
                "Agile development",
                "Test-Driven Development",
                "Documentation Skills"
            ],
            "secondary": [
                "Bash shell scripting",
                "Groovy",
                "Python",
                "Docker",
                "Kubernetes",
                "Terraform",
                "ETL/ELT experience",
                "GraphQL",
                "Reactive application development",
                "Multi-tenant applications"
            ],
            "all": [
                "Java (JDK 17+)",
                "Spring Framework",
                "Spring Boot",
                "Angular",
                "JavaScript",
                "TypeScript",
                "Cloud-Native Application Development",
                "RESTful web services",
                "Agile development",
                "Test-Driven Development",
                "Documentation Skills",
                "Bash shell scripting",
                "Groovy",
                "Python",
                "Docker",
                "Kubernetes",
                "Terraform",
                "ETL/ELT experience",
                "GraphQL",
                "Reactive application development",
                "Multi-tenant applications"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Alex Keylor",
        "email": "alex@navtechusa.com",
        "jd": "From: Alex Keylor, NAVTECH INC alex@navtechusa.com Reply to: alex@navtechusa.com I have an opportunity for \"Java Fullstack Developer - Alpharetta GA – Onsite - Local\" and I am looking for a candidate who can join Immediately if you are interested, reply to me with your updated resume or if you could refer someone I would really appreciate it. Position : Java Fullstack DeveloperLocation : Alpharetta GA – Onsite - LocalDuration : 6 to 12+ MonthsNeed local to GA F2F Interview RequiredClient is looking for experience requiring minimum 11 years profiles. Job Description:Seeking an experienced, resourceful, full stack engineer who can adapt and hit the ground running with minimal supervision. This individual will be passionate about end-user experience and best-in-class engineering excellence and will be part of a tight-knit, distributed engineering team developing and delivering a comprehensive data operations management solution for client's Data Fabric Platform.Tech Stack· Frontend: Angular 17+, JavaScript, TypeScript, HTML, SCSS, Webpack Module Federation, Tailwinds CSS, Angular Material, Angular Elements· Backend: Java (JDK 17+), Spring Framework 6.X.X, Spring Boot 3.X.X, NestJS 10.X.X, REST and GraphQL microservices, NodeJS· Tools & Frameworks: Nx build management, Monorepo architecture, Jenkins CI/CD, Fortify, Sonar, GitHub· Cloud & Data: GCP (GKE, Composer + Airflow, Dataflow + Apache Beam, BigQuery, BigTable, Firestore, GCS, PubSub, Vertex AI), Terraform, Helm Charts, GitOps· Other Technologies: Websockets, SSE, event-driven architectureEnvironment· Culture: Fast-paced, creative, results-oriented· Team Structure: Agile, working in 2-week sprints using Aha and Jira for project management· Expectations: Self-starters who can work independently with limited guidance, delivering solutions that end-users value and loveResponsibilities· End-to-End Development: Design, develop, test, deploy, and operate software applications, covering both frontend and backend· Cross-Functional Work: Collaborate with global teams to integrate with existing internal systems and GCP cloud· Issue Resolution: Triage and resolve product or system issues, ensuring quality and performance· Documentation: Write technical documentation, support guides, and run books· Agile Practices: Participate in sprint planning, retrospectives, and other agile activities· Compliance: Ensure software meets secure development guidelines and engineering standardsMust-Have Skills· Cloud-Native Application Development: Experience with GCS or AWS· Java Expertise: 5+ years with Java (JDK 17+), Spring Framework, Spring Boot· Frontend Development: 5+ years with Angular, JavaScript, TypeScript, modern responsive web applications· Architecture Knowledge: Understanding of modular systems, performance, scalability, security· Agile Experience: Agile development mindset and experience· Service-Oriented Architecture: Knowledge of RESTful web services, JSON, AVRO· Application Troubleshooting: Debugging, performance tuning, production support· Test-Driven Development: Unit, integration, and load testing experience· Documentation Skills: Strong written and verbal communicationNice-to-Have Skills· Linux/Unix: Bash shell scripting· Scripting Languages: Groovy, Python· Infrastructure as Code: Experience with Terraform· Containerization & Orchestration: Docker, Kubernetes· Cloud Certification: Relevant certifications in cloud technologiesWhat could set you apart· Big Data Processing: ETL/ELT experience; Hadoop, HDFS, Spark, PySpark, Flink or similar experience· GraphQL: Experience with GraphQL· Reactive Development: Experience with reactive application development· Distributed Application Development: Experience with multi-tenant applications -- Regards,Alex . KNAVTECH INCP : (224) 348-1340 E : Alex@navtechusa.com 1600 Golf Road. Suite 1200, Rolling Meadows, IL 60008www.Navtechusa.com E-Verified Company.",
        "source": "Email",
        "date_posted": "2024-10-14 18:42:43-05:00",
        "unique_id": "1928d8a3ece480cd",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]