[
    {
        "company": "Agile Global Solutions",
        "job_title": ".Net Developer",
        "location": "Tallahassee, FL, USA",
        "full_location": {
            "city": "Tallahassee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                ".NET",
                "C#",
                "ASP.NET",
                "SQL"
            ],
            "primary": [
                "MVC",
                "Web API",
                "Blazor",
                "DevOps",
                "Azure DevOps",
                "GitHub"
            ],
            "secondary": [
                "Application Development",
                "System Architecture",
                "Performance Optimization",
                "Security Best Practices",
                "User Interface Design"
            ],
            "all": [
                ".NET",
                "C#",
                "ASP.NET",
                "SQL",
                "MVC",
                "Web API",
                "Blazor",
                "DevOps",
                "Azure DevOps",
                "GitHub",
                "Application Development",
                "System Architecture",
                "Performance Optimization",
                "Security Best Practices",
                "User Interface Design"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "T Chandra Sekhar",
        "email": "sekhar@agileglobalsolutions.com",
        "jd": "From: T Chandra Sekhar, Agile Global Solutions sekhar@agileglobalsolutions.com Reply to: sekhar@agileglobalsolutions.com (Need Local to Tallahassee, FL & State of FL exp is Must) HiGreetings from Agile Global Solutions..!!This side Chandra Sekhar from Agile Global Solutions, We have an excellent job opportunity with one of our Direct client. Position: .Net DeveloperLocation: Tallahassee, FL (Hybrid)Duration: Contract Job Description:The Office of Information Technology Services (OITS) is seeking multiple Application Developers. The activities these candidates will be tasked with include, but are not limited to the following: • Collaborate with business analysts, project managers, and stakeholders to understand the functional and non-functional requirements of the application. • Translate business requirements into architectural designs that align with business goals. • Design the overall system architecture, and define how different components of the interact. • Design, develop, and implement software applications using the .NET framework and C#. • Utilize ASP.NET (or ASP.NET Core) for web application development, including MVC, Web API, and • Blazor for client-side and server-side programming. • Develop and optimize SQL queries, stored procedures, and functions. • Develop user interfaces and ensure the front end is responsive, accessible, and userfriendly. • Review code, architecture, and design to ensure they meet the standards. • Analyze and optimize the performance of the application. • Design strategies for scaling the application efficiently as user demand grows. • Ensure the application adheres to security best practices and compliance requirements. • Implement DevOps practices such as continuous integration and continuous delivery (CI/CD) via Azure DevOps and GitHub repositories. These positions are to provide technical guidance and expertise in supporting the department in developing, architecting, and maintaining systems, apis, data mappings, and monitoring high volume complex data integration processes Best Regards, T Chandra Sekhar - Technical Sr. RecruiterAgile Global Solutions, Inc .....",
        "source": "Email",
        "date_posted": "2024-10-14 10:59:11-05:00",
        "unique_id": "1928be1e08927131",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]