[
    {
        "company": "Vizon Inc",
        "job_title": "Advanced Data Architect",
        "location": "Tallahassee, FL, USA",
        "full_location": {
            "city": "Tallahassee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "4+ years",
            "degree_required": "Bachelor’s or Master’s Degree in Computer Science, Information Systems, or other related field. Or equivalent work experience.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Synapse Analytics",
                "Dedicated SQL Pools",
                "Azure SQL Database",
                "Azure Managed Instance",
                "DDL",
                "DML T-SQL",
                "data architecture design principles",
                "data governance principles",
                "cloud computing concepts",
                "Python",
                "Scala"
            ],
            "primary": [
                "data integration",
                "data pipelines",
                "Salesforce",
                "Message MQ",
                "MuleSoft"
            ],
            "secondary": [
                "analytical skills",
                "problem-solving skills",
                "communication",
                "customer service",
                "decision making",
                "flexibility",
                "interpersonal skills",
                "leadership",
                "team building"
            ],
            "all": [
                "Synapse Analytics",
                "Dedicated SQL Pools",
                "Azure SQL Database",
                "Azure Managed Instance",
                "DDL",
                "DML T-SQL",
                "data architecture design principles",
                "data governance principles",
                "cloud computing concepts",
                "Python",
                "Scala",
                "data integration",
                "data pipelines",
                "Salesforce",
                "Message MQ",
                "MuleSoft",
                "analytical skills",
                "problem-solving skills",
                "communication",
                "customer service",
                "decision making",
                "flexibility",
                "interpersonal skills",
                "leadership",
                "team building"
            ],
            "with_experience": [
                "Synapse Analytics (4+ years)",
                "Dedicated SQL Pools (4+ years)",
                "Azure SQL Database (4+ years)",
                "Azure Managed Instance (4+ years)",
                "DDL (5+ years)",
                "DML T-SQL (5+ years)",
                "data architecture design principles (4+ years)",
                "data governance principles (3+ years)",
                "cloud computing concepts (2+ years)",
                "Python (1+ years)",
                "Scala (1+ years)",
                "Salesforce (1+ years)",
                "Message MQ (1+ years)",
                "MuleSoft (1+ years)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Harsh Goyal",
        "email": "harsh@vizoninc.com",
        "jd": "From: Harsh Goyal, Vizon Inc harsh@vizoninc.com Reply to: harsh@vizoninc.com 100% Interview!Super Urgent PositionConsultant Must be able to go for Onsite(5 Days in a week) in FloridaJob Description -Advanced Data Architect Location: Tallahassee, FLMust have three valid end client references, active linkedIn & filled skill matrixWork Mode: OnsiteJob Description: Primary Job Duties and TasksThe activities these candidates will be tasked with include, but are not limited to the following:• Work with stakeholders and development team to determine project scope and vision, gather and prioritize collected requirements.• Designing and Implementing Data Architectures: Develop comprehensive data architectures that support the organization’s business goals, using Azure Synapse Analytics, Azure SQL, and other Azure data services.• Managing Dedicated SQL Pools: Efficiently manage and optimize Dedicated SQL Pools in Synapse to handle large-scale data warehousing and analytics workloads.• Database Design and Management: Design, implement, and manage databases using Azure SQL and Azure Managed Instance, ensuring high performance, availability, and security.• Data Integration and ETL Processes: Develop and manage ETL (Extract, Transform, Load) processes using Synapse Pipelines, ensuring efficient data flow from various sources to the data warehouse.• Data Governance and Cataloging: Implement data governance practices and manage the data catalog to ensure data quality, consistency, and accessibility.• Building and Maintaining Data Models: Create and maintain data models that accurately represent the data landscape, ensuring they are scalable and optimized for performance.• Ensuring Data Security and Compliance: Implement and oversee data security measures, ensuring compliance with legal and regulatory standards.• Maintain procedures manuals and system documentation.• Research software solutions to support recommendations, analyzing current and future technology trends.These positions are to provide technical guidance and expertise in supporting the department in developing, architecting, and maintaining data, data mappings, and monitoring high-volume complex data transfer processes.Specific Knowledge, Skills, and Abilities (KSAs)The submitted candidate must be able to apply common knowledge, skills, and abilities in the following areas:Minimum Required KSAs:• 4+ years of experience in Synapse Analytics, Dedicated SQL Pools, Azure SQL Database, and Azure Managed Instance.• 5+ years of experience in DDL, DML T-SQL skills, advanced stored procedure writing skills, tables, primary keys, foreign keys, constraints, indexes, transactions, process logging, and error handling.• 4+ years of experience in data architecture design principles, methodologies, and best practices.• 3+ years of experience in data governance principles and compliance requirements related to data security and privacy.• 3+ years of experience in integrating data from various sources and managing large data pipelines.• 2+ years of experience in cloud computing concepts, particularly in Microsoft Azure, including storage solutions and compute capabilities.• 1+ years of Experience with programming languages such as Python or Scala.• 1+ years of experience in Salesforce, Message MQ, and MuleSoft• Strong analytical and problem-solving skills to address complex data challenges.• Ability to design and implement robust, scalable, and efficient data architectures.• Ability to provide excellent customer support; meticulous quality of work and work product.General Knowledge, Skills and Abilities (KSAs)The submitted candidate(s) must be able to apply common knowledge, skills, and abilities in the following areas:1. Communication: Able to clearly convey information, in both written and verbal formats, to individuals or groups in a wide variety of settings (i.e.; project team meetings, management presentations, etc.). Must have the ability to effectively listen and process information provided by others.2. Customer Service: Works well with clients and customers (i.e.; business office, public, or other agencies). Able to assess the needs of the customer, provide information or assistance to satisfy expectations or resolve a problem.3. Decision Making: Makes sound, well-informed, and objective decisions.4. Flexibility: Is open to change, new processes (or process improvement), and new information. Has the ability to adapt in response to new information, changing conditions, or unexpected obstacles. Ability to receive and give constructive criticism and maintain effective work relationships with others.5. Interpersonal: Shows friendliness, courtesy, understanding, and politeness to others.6. Leadership: Motivates, encourages, and challenges others. Can adapt leadership styles in a variety of situations.7. Problem-Solving: Able to identify, evaluate, and use sound judgment to generate and evaluate alternative actions, and make recommendations as accordingly.8. Team Building: Encourages, inspires, and guides others toward accomplishing the common goal.Education and CertificationsEducation: Bachelor’s or Master’s Degree in Computer Science, Information Systems, or other related field. Or equivalent work experience. (Required)Certifications: Microsoft Dynamics 365 Certification (Desired) and MS Dynamics Power Platform Certifications (Desired)",
        "source": "Email",
        "date_posted": "2024-10-14 15:22:51-05:00",
        "unique_id": "1928cd343e73edc5",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Azure Data Engineer"
    }
]