[
    {
        "company": "SoniTalent Corporation",
        "job_title": "Project Manager - NetSuite CRM & CPQ",
        "location": "Plano, TX, USA",
        "full_location": {
            "city": "Plano",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 Months+",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "project management",
                "Netsuite CRM",
                "CPQ tools",
                "business requirements gathering",
                "risk management"
            ],
            "primary": [
                "cross-functional project management",
                "time management",
                "communication",
                "leadership",
                "sales force automation solutions"
            ],
            "secondary": [
                "continuous improvement skills",
                "value stream mapping",
                "leading continuous improvement workshops"
            ],
            "all": [
                "project management",
                "Netsuite CRM",
                "CPQ tools",
                "business requirements gathering",
                "risk management",
                "cross-functional project management",
                "time management",
                "communication",
                "leadership",
                "sales force automation solutions",
                "continuous improvement skills",
                "value stream mapping",
                "leading continuous improvement workshops"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Bhuwan Tiwari",
        "email": "bhuwan.tiwari@sonitalentcorp.com",
        "jd": "From: bhuwan tiwari, Sonitalentcorp bhuwan.tiwari@sonitalentcorp.com Reply to: bhuwan.tiwari@sonitalentcorp.com Job Title – Project Manager - NetSuite CRM & CPQJob Location -Plano, TX – Hybrid – Onsite from day one – Need to be localDuration - 6 Months+Visa -Any Visa Mode Of Interview - Phone/SkypeNote - Need LinkedInJob Description – If you are unable to find all skills in one candidate, we can look to consider a team of two i.e., one PM and one Technical Expert with relevant tools experience listed in the description.This is a hybrid role where the candidate(s) will be required to be at the client site in Plano, TX atleast 50% of the time. Sorry we have not had much work or needs in your areas of expertise this year.That said we have a new situation that came in this week. Here is a description; would you have any suitable consultants for such a need? As usual, this is an urgent situation so we would like potential options for consideration this week from you. ********Client is a provider of technology experiences in the hospitality, education and senior living sectors.They seek support to enhance their project estimating and quoting procedures. Key process components include customer order processing, product option and feature selection, project cost estimation, pricing, definition of terms, and proposal generation. Currently, a combination of manual and automated steps is in place. Relevant tools include Netsuite CRM and Legal IQ. The ideal candidate should possess:Extensive experience in project estimating and quoting within the business services, technology, media, and telecom sectors.Strong project management skills, including cross-functional project management, business requirements gathering, risk management, time management, communication, and leadership.Familiarity with Netsuite CRM and ERP systems.Proficiency in existing CPQ (Configure, Price, Quote) tools.Experience implementing and deploying sales force automation solutions.Continuous improvement skills, including value stream mapping and leading continuous improvement workshops, are a plus Project to be executed in two phases:Streamlining the process as it flows between Sales, Operations, Procurement, Invoicing and Legal departments. Data clean-up (e.g., SKU names across multiple systems).CPQ selection including defining business requirements and conducting RFP process. Thanks, Bhuwan TiwariSr.Technical Recruiter SoniTalent Corporation I5404 Merribrook Lan--e, Prospect, KY, USA Cell -859-946-4062 | bhuwan.tiwari@sonitalentcorp.com",
        "source": "Email",
        "date_posted": "2024-10-14 09:52:33-05:00",
        "unique_id": "1928bccd08fe82ad",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]