[
    {
        "company": "Digital Dhara",
        "job_title": "Business Strategy Analyst",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "8+ years",
            "degree_required": "Bachelor’s degree from a reputable university/college",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Cisco Experience",
                "Analytical capabilities",
                "Financial modeling",
                "Performance measurement",
                "Strong Excel skills",
                "Strong PowerPoint skills"
            ],
            "primary": [
                "Sales operations",
                "Program development",
                "Program management",
                "Cloud business models",
                "SaaS business models",
                "Managed services business models",
                "Communication skills"
            ],
            "secondary": [
                "Market analysis",
                "Dashboard development",
                "Data analytics",
                "Collaboration with cross-functional teams",
                "Automation of processes",
                "B2B technology interest",
                "Understanding of Cisco products"
            ],
            "all": [
                "Cisco Experience",
                "Analytical capabilities",
                "Financial modeling",
                "Performance measurement",
                "Strong Excel skills",
                "Strong PowerPoint skills",
                "Sales operations",
                "Program development",
                "Program management",
                "Cloud business models",
                "SaaS business models",
                "Managed services business models",
                "Communication skills",
                "Market analysis",
                "Dashboard development",
                "Data analytics",
                "Collaboration with cross-functional teams",
                "Automation of processes",
                "B2B technology interest",
                "Understanding of Cisco products"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Khushboo",
        "email": "khushboo@digitaldhara.com",
        "jd": "From: khushboo, Digital Dhara khushboo@digitaldhara.com Reply to: khushboo@digitaldhara.com Role: Business Strategy AnalystLocation: Remote /Across USA Need Ex- Cisco Experience.JD:The Business Analyst role is to support the overall operations of the Global Partnerships and Strategy team including managing the operating cadence, monitoring execution and measurement of business performance. The primary responsibilities of this role are to work with the various stakeholders to support business reviews, and provide analytical support for ongoing improvements as well as development of the future strategy. Depending on ability, there is opportunity to scale and take on larger operational aspects such as supporting partner targets and performance.To be successful, individual needs to understand the Cisco and Splunk Sales GTM and the various systems and processes required to put together performance slides for executive reviews. Extracting and manipulating data from various systems, attention to detail, being fast and efficient in power point, excel and think cell / mekko are key. Ability to identify and reach out to stakeholders to fill gaps in data is necessary. Familiarity with systems such as FinBI, SFDC, Tableau will be key. In addition, the analyst needs to have the process and analytical capabilities required to support the daily operations of these programs and deliver insights into the success of the program.Roles and ResponsibilitiesThe Business Analyst is primarily responsible for the ongoing successful operations of the business:Help size business initiatives and opportunitiesProvide program management support for new initiatives we are incubating; work with business leaders to identify milestones, develop roadmap and execution plan linked to business valueDevelop reporting templates for e2e tracking of execution of business execution partnering with data analytics and finance teamSupport execution of high-impact strategic projects and mission-critical initiatives as part of the leadership teamPerform market analysis to identify opportunities.Support business operations team in the execution of the sales strategyDevelop dashboards and other tools as required to provide visibility into the business and tracking of various initiativesEnsure that the operating cadence is followed by the key stakeholders on a weekly, monthly and quarterly basis. Develop new processes and ensure that existing processes are followed per the program cadence.Develop presentation and analysis for business reviews specifically for the weekly, monthly operating days and quarterly global reviews and any additional reviews as may be necessaryAnalyze customer, market, vertical and other data to generate insights for the improvement and execution of the businessCollaborate with counterparts in the Regional teams to prevent duplication of work, share best practices and provide business continuity during PTOCollaborate with other Cisco cross-functional organizations including sales operations, marketing, architecture, sales teams, partner or and distribution teams to execute programsMonitor program spend against budget, calculate ROI of program against goal, ensure that financial forecasts are accurateWork with IT and other teams on continuous improvement of business processes and operations related to the volume programs, including automation of existing processes Desired Skills and qualifications8+ years experience in finance, sales operations or program development/management in the IT industry (preferable)Strong understanding of systems and processes required to drive a programmatic sales approachStrong analytical capabilities: comfortable with financial modeling, performance measurement and analysis, ROI measurement and analysis, etc.Excellent planning skillsAbility to work independently and provide support to teams working remotelyExcellent written, verbal communication, listening and presentation skills. Able to articulate complex ideas and strategies to people at all levels of the organization.Experience with a mix of cloud, SaaS and managed services business models across a range of technical domains; direct experience in network, security, data center and applications a plusDeeply interested in the B2B technology space with a strong interest in the partner landscape, new business models and how large companies procure and gain value from technology solutionsFamiliarity with Cisco’s products, architectures and services offerings and experience in the IT industry is an added plusStrong Excel and PowerPoint skills are requiredBachelor’s degree from a reputable university/college Thanks & Regards,KhushbooKhushboo@digitaldhara.com",
        "source": "Email",
        "date_posted": "2024-10-14 07:25:04-05:00",
        "unique_id": "1928b1df3bfa97de",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]