[
    {
        "company": "keyinfotek",
        "job_title": "Sr. Database Developer",
        "location": "New York, NY, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "7+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "PL/SQL",
                "Oracle",
                "SQL",
                "Java",
                "Scala"
            ],
            "primary": [
                "Schema design",
                "Code review",
                "SQL query tuning/optimization",
                "Linux",
                "SQL/NoSQL",
                "Messaging"
            ],
            "secondary": [
                "Redshift",
                "Postgres",
                "MongoDB",
                "FIX protocol",
                "Market/reference data",
                "Equity market structure",
                "Order handling",
                "Electronic trading",
                "Strategic thinking",
                "Analytical skills",
                "Problem-solving",
                "Troubleshooting"
            ],
            "all": [
                "PL/SQL",
                "Oracle",
                "SQL",
                "Java",
                "Scala",
                "Schema design",
                "Code review",
                "SQL query tuning/optimization",
                "Linux",
                "SQL/NoSQL",
                "Messaging",
                "Redshift",
                "Postgres",
                "MongoDB",
                "FIX protocol",
                "Market/reference data",
                "Equity market structure",
                "Order handling",
                "Electronic trading",
                "Strategic thinking",
                "Analytical skills",
                "Problem-solving",
                "Troubleshooting"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Monika Pandey",
        "email": "monika@keyinfotek.com",
        "jd": "Hello, Hope you are doing great!! Position – Sr. Database Developer Location – New York, NY (Hybrid) Experience and knowledge of equity products and instruments including FIX protocol and market/reference data Job Description: Responsibilities :- Design and develop high-quality software components for the global trading platform using Java, Scala, and related technologies Contribute to all areas of the software development lifecycle including planning, design, development, testing, implementation, and support Contribute to continuous improvement of processes, product development, product quality and technology Contribute to the overall progress of the team and the firm; ensure timely delivery of quality software Serve as third-tier support for production issues and related support needs. Skills and Experience :- 7+ years of experience in development of equity products in a global financial services company or vendor using PL/SQL & Oracle Must have extensive experience in working with relational databases. Strong working knowledge and expertise in PL/SQL Proficient in Schema design, code review and SQL query tuning/optimization Experience and knowledge of equity products and instruments including FIX protocol and market/reference data Proficiency with computer technologies including Linux, SQL/NoSQL & Messaging Knowledge of equity market structure, order handling and electronic trading Strategic thinking, analytical, problem-solving and troubleshooting skills Expertise in other Database technologies like Redshift, Postgres, MongoDB would be desirable. Ability to work as part of a team or independently, communicate effectively at all organizational levels with written and verbal communication Warm Regards, Monika Pandey Technical recruiter Email:- monika@keyinfotek.com https://keyinfotek.com/linkedin.com/in/monika-pandey-777933232",
        "source": "Email",
        "date_posted": "2024-10-14 10:32:47-05:00",
        "unique_id": "1928bc9b52a04aec",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "DB Admin"
    }
]