[
    {
        "company": "Virginia Department of Transportation (VDOT)",
        "job_title": "VDOT Project Manager 4 - MOD PRODUCT LINE (748480)",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "748480",
            "experience_required": "11+ years",
            "degree_required": "Bachelor’s degree in computer science, Systems Engineering, Management Information Systems, Project Management or Finance/Business",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "PMP Certification",
                "IT Infrastructure Delivery",
                "Networking",
                "Vendor Management",
                "Site Provisioning",
                "Scaled Agile",
                "Waterfall Project Management"
            ],
            "primary": [
                "VITA Certification",
                "Agile Scrum Master Certification",
                "SAFe Scrum Master Certification",
                "Microsoft Office Products (Word, Excel, Access, Outlook, Visio, PowerPoint, Project Server)"
            ],
            "secondary": [],
            "all": [
                "PMP Certification",
                "IT Infrastructure Delivery",
                "Networking",
                "Vendor Management",
                "Site Provisioning",
                "Scaled Agile",
                "Waterfall Project Management",
                "VITA Certification",
                "Agile Scrum Master Certification",
                "SAFe Scrum Master Certification",
                "Microsoft Office Products (Word, Excel, Access, Outlook, Visio, PowerPoint, Project Server)"
            ],
            "with_experience": [
                "PMP Certification",
                "IT Infrastructure Delivery",
                "Networking",
                "Vendor Management",
                "Site Provisioning",
                "Scaled Agile",
                "Waterfall Project Management"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Zara Khan",
        "email": "info@techbrandstaffing.com",
        "jd": "Greetings, Must have Active PMP, Must have IT Infrastructure Delivery, Networking, Vendor Management, Site Provisioning experience, Must have 11+ years of experience, Hope you're doing great, This is Zara Khan from Tech Brand Staffing LLC. I've been retained by a top employer to help them recruit for a new VDOT Project Manager 4 - MOD PRODUCT LINE (748480) position. Please review the below job description and reply back with your updated resume and desired rate. Title: VDOT Project Manager 4 - MOD PRODUCT LINE (748480) Duration: 12 Months Contract Location: Richmond, VA Please fill this box Skill Required years req Years Used Last Used Experience managing large MultiStream projects valued at $10M or greater each Required 8 Experience in IT infrastructure delivery (Networking, physical plant, vendor management, site provisioning) Required 8 PMP Certification Required Experience in both Scaled Agile and Waterfall Project Management Required 8 VITA Certification Highly desired Agile Scrum Master Certification Desired SAFe Scrum Master Certification Desired Microsoft Office Products (Word, Excel, Access, Outlook, Visio, PowerPoint, Project Server) Required 8 Experience managing projects with high visibility and high stakes Required 8 Experience managing projects that had to coordinate with at least one external team. Required 8 Experience managing a project as part of a larger program and under PMO governance. Required 8 Bachelor’s degree in computer science, Systems Engineering, Management Information Systems, Project Management or Finance/Business Required 4 Job description PMP CERTIFICATION REQUIRED with experience in Scaled Agile environment, VITA certification is preferred. Virginia Department of Transportation (VDOT) Asset Management Division is seeking a senior technical Project Manager to manage and deliver complex IT Project(s) with multiple teams and work streams coordinated to an aggressive delivery schedule. Project Manager is responsible for the outcome of the assigned projects. The Project Manager leads the team through the Commonwealth Standard for Project Management for successful completion of the project phases: Preselect Initiation Planning Execution and Control Closeout. The selected candidate will Serve as a hands-on technical project manager with development staff and business groups Coordinate and communicate with Information Technology Division management and staff to coordinate work staff and resourcing. Communicate timelines and expectations to technical and business staff Facilitate multi-functional technical team collaboration. Collaborate with vendors, consultants, and contractors in the execution of projects, including contract management, and work with procurement office(s). Adhere to VDOT and VITA project management practices and governance requirements. Coordinate with VDOT and VITA project management offices. Maintain project budget, plans, tasks, schedules, risks, and status and disseminate information to team members and customers as defined in the communication plan. Ensure documentation of requirements and use cases, facilitate design workshops for assigned project. Ensure preparation of test objectives, test plans and test cases for assigned project. Provide the management of project milestones and deliverables for on-time and on-budget delivery. Define, measure, and clearly communicate progress with project metrics. Support system and application training efforts.",
        "source": "Email",
        "date_posted": "2024-10-14 11:04:07-05:00",
        "unique_id": "1928be6683f3f271",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]