[
    {
        "company": "GAC Solutions Inc",
        "job_title": "Python Developer",
        "location": "Whippany, NJ, USA",
        "full_location": {
            "city": "Whippany",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "9+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Python",
                "Django",
                "Java"
            ],
            "primary": [
                "Python libraries for data transformation",
                "Automation",
                "JIRA",
                "Agile methodology",
                "Communication skills"
            ],
            "secondary": [
                "Data analysis",
                "Statistical data quality check",
                "Mentoring",
                "Stakeholder management"
            ],
            "all": [
                "Python",
                "Django",
                "Java",
                "Python libraries for data transformation",
                "Automation",
                "JIRA",
                "Agile methodology",
                "Communication skills",
                "Data analysis",
                "Statistical data quality check",
                "Mentoring",
                "Stakeholder management"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Arun K",
        "email": "arun@gacsol.com",
        "jd": "From: Arun, GAC Solutions Inc arun@gacsol.com Reply to: arun@gacsol.com Hi Professionals, This is Arun from GAC solutions Inc. I have an excellent job opportunity with one of our premier clients. Since it is an urgent requirement your prompt response is appreciated Python Developer Whippany, NJ - OnsiteContract Note: In Person Interview H1B Consultants Only JD: 9+ years of experience Python developer to join our qualified and diverse development team. The chosen candidate will work with our stakeholders to gather testing requirements and help us deliver quality product to our global user base. Code conversion from Java to python is required for this role.The candidate will be responsible for performing python automation including framework build activities in the compliance space. The role will require interacting with Business Analyst, business stakeholders and developers to understand various test cases. The candidate will also train and mentor other junior testers within the team. The candidate will also drive best practises for end to end automation. Key Accountabilities:- Analyse and understand requirements from business analyst/key stake holders and translate to testing requirements - Expertise in Python and its Django framework - Must have proper knowledge of widely used python libraries for data transformation and data load.- Must have good knowledge of Java as well as that will help in code conversion if required.- Raise any potential blockers to the scrum master/agile team lead and come up with a mitigation plan - Capture testing requirements in JIRA via x-ray test cases and assist the scrum master in sprint prioritization and retrospectives. - Knowledge of the threading functions of Python and its limitations- Excellent written and verbal communication skills- Communicate with key stakeholders with regards to timelines, impact for any committed delivery. - Investigate and analyse user queries in EMEA and APAC hours. - Coordinate SIT and UAT cycles - Perform data analysis and statistical data quality check and profiling. - Ensure testing data gets reported in the compliance dashboards via the prescribed compliance tools - Mentor new joiners- Work and deliver under in agile methodologyStakeholder Management and Leadership • Must be able to work with global (UK, India and US) and multi-disciplinary (3rd party, contractors and Barclays) delivery teams. Demonstrate ability to manage communications across multiple regions and significant time-zone gaps. • Ensure that deliveries are completed as per stakeholder expectations, on schedule, as per regulatory requirements.",
        "source": "Email",
        "date_posted": "2024-10-14 14:01:52-05:00",
        "unique_id": "1928c8921737e194",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Python developer"
    }
]