[
    {
        "company": "Scalable Systems",
        "job_title": "Business Analyst/ Jr. Project Manager",
        "location": "Stamford, NY, USA",
        "full_location": {
            "city": "Stamford",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Management qualification",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Project Management",
                "Change Management"
            ],
            "primary": [
                "Regulatory Projects",
                "Stakeholder Engagement",
                "Risk Management"
            ],
            "secondary": [
                "Team Leadership",
                "Collaboration",
                "Reporting"
            ],
            "all": [
                "Business Analysis",
                "Project Management",
                "Change Management",
                "Regulatory Projects",
                "Stakeholder Engagement",
                "Risk Management",
                "Team Leadership",
                "Collaboration",
                "Reporting"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Pradeep Sharma",
        "email": "pradeep.sharma@scalable-systems.com",
        "jd": "From: Pradeep, Scalable Systems pradeep.sharma@scalable-systems.com Reply to: pradeep.sharma@scalable-systems.com Hi,Greetings of the day! I have an urgent requirement below, please go through JD and let me know if you are comfortable or have any profile. Kindly revert me back with your updated resume as well. Job Title: Business Analyst/ Jr. Project Manager Location: Stamford, NY (Work from Office)Duration: Long Term Contract Responsibilities:This is an opportunity for a driven Business Analyst/ Jr. Project Manager to join Customer and deliver our goals on time, within budget and to the highest qualityYou’ll be joining an innovative and inclusive culture where you’ll have access to fantastic development opportunities What you'll do In your new role, you’ll prepare, analyze and provide reporting on all analysis on regulations and rule mapping to policies, manage project plans, controls and make sure that the plans are in line with any wider program plans and controls. You’ll drive activities to adequately prepare the business and engage all the appropriate stakeholders effectively to enable change to be implemented and handed over. You'll lead a team through the project lifecycle, setting team objectives and carrying out individual assessments, while building and maintaining a positive working relationship with stakeholders across multiple franchises and functions. You’ll also:• Own and drive the project delivery to meet its outcomes and milestone on time and on target• Identify, track, manage and mitigate any project risks, assumptions, issues and dependencies• Lead and monitor the production of a project milestones and make sure that the solutions clearly support the required outcomes and is aligned to our strategic goals• Make sure that all project deliverables satisfy the requirements and that they adhere to the agreed governance framework The skills you'll need:We’ll expect you to hold a management qualification, as well as some experience in change management.You should also have experience of delivering regulatory projects that support a business strategy and its growth agenda. You’ll also need:• A collaborative approach and the ability to build productive relationships with stakeholders, colleagues and senior managers• Experience of delivering complex regulatory projects Thanks & Regards, Pradeep SharmaEmail: pradeep.sharma@scalable-systems.com \"Scalable Systems is an Equal Opportunity Employer. We are committed to creating an inclusive environment for all employees and do not discriminate based on race, color, religion, sex, national origin, age, disability, or any other legally protected status.",
        "source": "Email",
        "date_posted": "2024-10-14 05:57:48-05:00",
        "unique_id": "1928acdf99560b52",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]