[
    {
        "company": "Paramount Software Solutions",
        "job_title": "Full Stack .NET Developer",
        "location": "Raleigh, NC, USA",
        "full_location": {
            "city": "Raleigh",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "onsite",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Minimum 5 years of programing experience.",
            "degree_required": "Bachelor’s degree in computer science, other related degrees, or equivalent application development experience.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$60/hr on C2C (All inclusive)"
        },
        "skills": {
            "core": [
                "C#",
                "ASP.NET",
                "T-SQL",
                "VB6",
                "PL/SQL"
            ],
            "primary": [
                "ASP.NET Core",
                "Entity Framework",
                "ADO.NET",
                "Visual Studio",
                "SQL Management Studio",
                "GIT",
                "HTML",
                "CSS",
                "JavaScript"
            ],
            "secondary": [
                "VBScript",
                "Oracle APEX",
                "ETL processing",
                "SQL Server Integration Services",
                "BCP.exe",
                "T-SQL Bulk Load",
                "SQL Agent",
                "Windows Scheduled Tasks",
                "jQuery",
                "React"
            ],
            "all": [
                "C#",
                "ASP.NET",
                "T-SQL",
                "VB6",
                "PL/SQL",
                "ASP.NET Core",
                "Entity Framework",
                "ADO.NET",
                "Visual Studio",
                "SQL Management Studio",
                "GIT",
                "HTML",
                "CSS",
                "JavaScript",
                "VBScript",
                "Oracle APEX",
                "ETL processing",
                "SQL Server Integration Services",
                "BCP.exe",
                "T-SQL Bulk Load",
                "SQL Agent",
                "Windows Scheduled Tasks",
                "jQuery",
                "React"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Bob",
        "email": "bob.c@paramountsoft.net",
        "jd": "Full Stack .NET Developer This is an on-site position. Location : Raleigh, NC In person interview Onsite Only Raleigh Local Rate : $60/hr on C2C (All inclusive)Candidate's North Carolina DL required with Resume Recent state government and Oracle APEX and PL/SQL experience is a huge plus. You will work on a small team to migrate legacy applications developed in classic ASP (ActiveX), .NET Framework, and T-SQL to full stack ASP.NET Core applications. We need a developer that can pull business logic from a code base written in VB6, classic asp, and T-SQL. Then work with business owners to ensure the rules still apply or make any necessary changes. In any given day you might be asked to upgrade T-SQL scripts, migrate dynamic SQL built in VB6 to a stored procedure, write Web API REST services, build web pages with Razor Pages/MVC, debug an ELT job, document a process. We also have Oracle databases and APEX, which is Oracle’s rapid development framework. Integration work with Oracle/APEX is possible. A good understanding of PL/SQL and APEX is a plus. Responsibilities and Duties · Design and develop ASP.NET Core web applications using the .NET Core development stack. · Work within an older code base that has been maintained by many developers over many years. · Troubleshoot code using standard debugging tools like the Visual Studio debugger and the browser’s dev tools to resolve application errors. · Use GIT source control management in a team environment. · Optimize large and complicated SQL scripts. · Collaborate and communicate effectively with business owners and team members. · Document existing and new application features. Job Requirements · Minimum 5 years of programing experience. · Proficient in programming languages such as VB6, VBScript, C#, T-SQL, and PL/SQL · Experienced in ASP.NET development (.NET Framework and .NET Core) with Entity Framework and/or ADO.NET. · Experienced with Visual Studio and SQL Management Studio development environments. · Solid understanding of design patterns and database normalization. · Proven experience with extract, transform, and load (ETL) processing and SQL Server tools such as Integration Services, BCP.exe, and T-SQL Bulk Load. · Working knowledge of scheduled jobs including SQL Agent and Windows Scheduled Tasks. · Experienced with GIT source control management. · Strong understanding of browser side development including HTML, CSS, JavaScript · Familiar with JavaScript libraries for building user interface such as jQuery and React · Oracle APEX and PL/SQL experience · Bachelor’s degree in computer science, other related degrees, or equivalent application development experience.",
        "source": "Email",
        "date_posted": "2024-10-14 13:52:12-05:00",
        "unique_id": "1928c8046eabb7ed",
        "emp_type": [
            "onsite",
            "third party"
        ],
        "tag": ".net developer"
    }
]