[
    {
        "company": "Blue Ocean Ventures",
        "job_title": "Fullstack .NET Developer",
        "location": "Irvin, TX, USA",
        "full_location": {
            "city": "Irvin",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "8+ Years",
            "degree_required": "Engineering Degree – BE/ME/BTech/MTech/BSc/MSc",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Fullstack",
                ".NET",
                ".Net Core",
                "Azure",
                "Angular",
                ".Net Core API",
                "MVC",
                "Microservices Architecture",
                "SQL"
            ],
            "primary": [
                "CI/CD Pipelines",
                "GitLab"
            ],
            "secondary": [],
            "all": [
                "Fullstack",
                ".NET",
                ".Net Core",
                "Azure",
                "Angular",
                ".Net Core API",
                "MVC",
                "Microservices Architecture",
                "SQL",
                "CI/CD Pipelines",
                "GitLab"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Abhilash SH",
        "email": "abhilash.sh@blue-oceanventures.com",
        "jd": "From: Abhilash s h, Blue ocean ventures abhilash.sh@blue-oceanventures.com Reply to: abhilash.sh@blue-oceanventures.com Role: Fullstack .NET DeveloperLocation: Irvin, TXIn person Interview Only local profile Full Stack Development: Design, implement, and test server-side software using the latest .NET Framework, C#, .Net Core, .Net Core Web API.Develop custom web applications that leverage advanced components of Microsoft technology. Collaborate with cross-functional teams to create scalable and responsive solutions. Microservices and Cloud Integration: Architect and build microservices-based applications. Integrate with third-party web services and APIs. Leverage Azure as cloud platforms to enhance scalability and time-to-market. Database Expertise: Proficient in SQL, including writing complex queries and optimizing database performance. Troubleshoot database-related issues efficiently. Frontend Development: Experience with frontend technologies, particularly Angular. Develop user interfaces using HTML, CSS, and JavaScript/TypeScript. Familiarity with front-end frameworks and build tools (e.g., Webpack). Software Design and Best Practices: Apply software design principles such as SOLID and Domain-Driven Design. Understand code patterns and practices. Maintain currency in technical skills and industry trends.. Experience: -8+ Years Location: -Irvin, TX Educational Qualifications: -Engineering Degree – BE/ME/BTech/MTech/BSc/MSc.Technical certification in multiple technologies is desirable. Skills: - Mandatory skillsFullstack.NET .Net Core, Azure, Angular, .Net Core API, MVC Microservices ArchitectureSQL should be very strong.Must go onsite for client interview. Good to have skills: -Experience in working on CI/CD Pipelines using GitLab Regards, Abhilash SHhttps://www.linkedin.com/in/abhilash-s-h-ab07a5231/Blue Ocean Ventures5555 Glenridge Connector Suite 200 Atlanta, GA 30342Email:Abhilash.sh@blue-oceanventures.comWill To Serve Will To Win Will To Lead",
        "source": "Email",
        "date_posted": "2024-10-14 14:12:15-05:00",
        "unique_id": "1928c92a34a960b0",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": ".net developer"
    }
]