[
    {
        "company": "key infotek llc",
        "job_title": "Data Production Support Analyst",
        "location": "Woburn, MA, USA",
        "full_location": {
            "city": "Woburn",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "8+ years",
            "degree_required": "Bachelor’s degree in computer science, Information Technology, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "ETL tools",
                "SQL",
                "data production support"
            ],
            "primary": [
                "Informatica",
                "Talend",
                "SSIS",
                "relational databases",
                "data warehousing"
            ],
            "secondary": [
                "Python",
                "Shell",
                "AWS Glue",
                "Azure Data Factory",
                "Tableau",
                "Power BI",
                "Agile methodologies"
            ],
            "all": [
                "ETL tools",
                "SQL",
                "data production support",
                "Informatica",
                "Talend",
                "SSIS",
                "relational databases",
                "data warehousing",
                "data quality",
                "data governance",
                "troubleshooting",
                "problem-solving",
                "communication",
                "Python",
                "Shell",
                "AWS Glue",
                "Azure Data Factory",
                "Tableau",
                "Power BI",
                "Agile methodologies"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "VARSHA Rawat",
        "email": "varsha@keyinfotek.com",
        "jd": "From: VARSHA Rawat, key infotek llc varsha@keyinfotek.com Reply to: varsha@keyinfotek.com Job Title: Data Production Support AnalystLocation: Woburn, MA (#Locals Preferred)Domain : HealthcareJob Type: ContractH1B GCP Healthcare ETL tools Production Support SQL Job Summary:We are seeking an experienced ETL Production Support Analyst to join our team in Woburn, MA. The ideal candidate will have 8+ years of experience in ETL processes and data production support. You will be responsible for monitoring, troubleshooting, and maintaining our ETL systems to ensure data integrity and availability for business operations. Key Responsibilities:Monitor daily ETL jobs and workflows to ensure successful execution and data processing.Troubleshoot and resolve production issues related to ETL processes, databases, and data quality.Analyze, identify, and document root causes of ETL job failures, and implement preventive measures.Collaborate with data engineers and developers to optimize ETL processes and improve performance.Provide timely support and communication to stakeholders regarding ETL job status and incidents.Conduct regular audits of data to ensure accuracy, completeness, and adherence to data governance standards.Maintain and update documentation related to ETL workflows, operational procedures, and best practices.Participate in the deployment and implementation of new data integration solutions.Assist in user training and support for data-related queries and tools. Qualifications:Bachelor’s degree in computer science, Information Technology, or a related field.8+ years of experience in ETL production support, data integration, or data management.Proficient in ETL tools (e.g., Informatica, Talend, SSIS) and SQL.Strong understanding of relational databases and data warehousing concepts.Experience with data quality and data governance practices.Excellent troubleshooting and problem-solving skills.Strong communication skills and the ability to work collaboratively in a team environment.Familiarity with scripting languages (e.g., Python, Shell) is a plus. Preferred Skills:Knowledge of cloud-based ETL solutions (e.g., AWS Glue, Azure Data Factory).Experience with data visualization tools (e.g., Tableau, Power BI).Understanding of Agile methodologies and project management frameworks.",
        "source": "Email",
        "date_posted": "2024-10-28 13:05:18-05:00",
        "unique_id": "192d46dcf1bc8565",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "AWS Data Engineer"
    }
]