[
    {
        "company": "Scalable Systems",
        "job_title": "Pega Business Analyst Lead",
        "location": "Groton, CT, USA",
        "full_location": {
            "city": "Groton",
            "state": "CT",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long Term Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Pega",
                "Business Analysis",
                "Requirements Gathering",
                "User Interface Design",
                "Data Mapping"
            ],
            "primary": [
                "System Testing",
                "User Acceptance Testing",
                "Mentoring",
                "Technology Recommendations",
                "Business Process Evaluation"
            ],
            "secondary": [
                "Collaboration",
                "Continuous Improvement",
                "Communication",
                "Mock-ups",
                "Client Interaction"
            ],
            "all": [
                "Pega",
                "Business Analysis",
                "Requirements Gathering",
                "User Interface Design",
                "Data Mapping",
                "System Testing",
                "User Acceptance Testing",
                "Mentoring",
                "Technology Recommendations",
                "Business Process Evaluation",
                "Collaboration",
                "Continuous Improvement",
                "Communication",
                "Mock-ups",
                "Client Interaction"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Pradeep Sharma",
        "email": "pradeep.sharma@scalable-systems.com",
        "jd": "From: Pradeep, Scalable Systems pradeep.sharma@scalable-systems.com Reply to: pradeep.sharma@scalable-systems.com Hi,Greetings of the day! I have an urgent requirement below, please go through JD and let me know if you are comfortable or have any profile. Kindly revert me back with your updated resume as well. Job Title: Pega Business Analyst Lead Location: Groton, CT (Work from Office)Duration: Long Term Contract Key Responsibilities:Lead the business team in gathering requirements and choosing the best way to implement requirements leveraging the Pega system software.Design and configure rules and flows and assist with the draft user interface and draft process flow development.Function as an Information Technology Business Analyst by understanding business requirements and transforming those requirements into data mapping specs.Possesses and applies a comprehensive knowledge across key tasks and high impact assignments.Evaluates performance results and recommends major changes affecting short term project growth and success.Participates in the development of functional business requirements and helps users assess relative priorities for both business process and technology solutions.Understands business processes and priorities. Evaluates alternative business process and technology solutions, and participates in making technology recommendations to enhance business operations.Communicate with the internal customer to analyze information and business workflow to deliver functional requirements, use cases, and user interface designs.Effectively communicate with internal teams and clients to deliver UI requirements such as Graphical User Interfaces, Screen, and Interface mock-ups.Experience supporting Pega development or implementation.Conducts system testing and facilitates user acceptance testing.Works collaboratively with peers to coordinate the overall delivery of technology solutions to business groups.Mentor and oversee work of junior team members.Develops working knowledge of the client’s industry and uses this information to support continuous improvement initiatives. Thanks & Regards, Pradeep SharmaEmail: pradeep.sharma@scalable-systems.com \"Scalable Systems is an Equal Opportunity Employer. We are committed to creating an inclusive environment for all employees and do not discriminate based on race, color, religion, sex, national origin, age, disability, or any other legally protected status.",
        "source": "Email",
        "date_posted": "2024-10-28 08:35:22-05:00",
        "unique_id": "192d39abb52b212b",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "PEGA Developer"
    }
]