[
    {
        "company": "HMG America",
        "job_title": "Cloud Solutions Architect 2",
        "location": "Austin, TX, USA",
        "full_location": {
            "city": "Austin",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "4552525053",
            "experience_required": "6 years",
            "degree_required": "Graduation from an accredited four-year college or university with a degree in computer science or a related field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "11/18/2024 – 08/31/2025",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Azure architecture",
                "Microsoft technologies",
                ".NET Core",
                "C#",
                "MS SQL Server",
                "SSIS",
                "Azure DevOps"
            ],
            "primary": [
                "CI/CD pipelines",
                "Custom integrations",
                "Performance optimization",
                "ETL processes",
                "Infrastructure management",
                "Risk management",
                "Documentation"
            ],
            "secondary": [
                "MuleSoft",
                "Go-Anywhere",
                "SFTP",
                "Mainframe migration strategies",
                "PDF generation using iText",
                "Mainframe technologies"
            ],
            "all": [
                "Azure architecture",
                "Microsoft technologies",
                ".NET Core",
                "C#",
                "MS SQL Server",
                "SSIS",
                "Azure DevOps",
                "CI/CD pipelines",
                "Custom integrations",
                "Performance optimization",
                "ETL processes",
                "Infrastructure management",
                "Risk management",
                "Documentation",
                "MuleSoft",
                "Go-Anywhere",
                "SFTP",
                "Mainframe migration strategies",
                "PDF generation using iText",
                "Mainframe technologies"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Anubhav Jain",
        "email": "anubhav@hmgamerica.com",
        "jd": "From: Anubhav, HMG America anubhav@hmgamerica.com Reply to: anubhav@hmgamerica.com Job Role: Cloud Solutions Architect 2 (4552525053)Location : Austin, TX 78751RemoteDuration : 11/18/2024 – 08/31/2025Monday through Friday from 8:00 AM to 5:00 PMJob Desc / Duties : Railroad Commission of Texas requires the services of 1 Cloud Solutions Architect 2, hereafter referred to as Candidate(s), who meets the general qualifications of Cloud Solutions Architect 2, Applications/Software Development and the specifications outlined in this document for the Railroad Commission of Texas.All work products resulting from the project shall be considered \"works made for hire\" and are the property of the Railroad Commission of Texas and may include pre-selection requirements that potential Vendors (and their Candidates) submit to and satisfy criminal background checks as authorized by Texas law. Railroad Commission of Texas will pay no fees for interviews or discussions, which occur during the process of selecting a Candidate(s).I. DESCRIPTION OF SERVICESRailroad Commission of Texas requires the services of an Azure Enterprise Architect, hereafter referred to as Candidate, who meets the general qualifications for this role and the specifications outlined in this document for Railroad Commission of Texas.All work products resulting from the project shall be considered \"works made for hire\" and are the property of the Railroad Commission of Texas. Candidates may need to satisfy criminal background checks as authorized by Texas law. Railroad Commission of Texas will pay no fees for interviews or discussions that occur during the candidate selection process.The Worker will apply their expert knowledge of Azure architecture and Microsoft technologies at Railroad Commission of Texas to support the needs of the Mainframe Transformation project teams. The Azure Enterprise Architect will perform advanced analysis and design work involving all technical aspects of supporting, improving, and enhancing RRC’s mainframe modernization project.This position requires strong experience in Azure architecture, including the design and implementation of scalable solutions, as well as proficiency in Microsoft technologies such as .NET Core, C#, MS SQL Server, SSIS and Azure DevOps. The ideal candidate will also be skilled in developing custom integrations and managing infrastructure within Azure environments.We are seeking a proactive team member who will be responsible for enhancing assigned applications, addressing production issues, and ensuring optimal performance of Azure solutions. Work assignments will follow a defined software development life cycle (SDLC) process, utilizing Agile methodologies for effective project delivery. The Azure Enterprise Architect will collaborate with multiple agency stakeholders to ensure that solutions meet business requirements and are delivered error-free, supporting RRC’s regulatory obligations for the Oil and Gas and Energy Industry of Texas.ESSENTIAL FUNCTIONS:• Architectural Design: Develop and implement scalable Azure solutions tailored to the needs of the Mainframe Transformation project.• Technical Expertise: Leverage strong knowledge of Microsoft technologies, including .NET Core, C#, MS SQL Server, Azure DevOps, and SQL Server Integration Services (SSIS).• Collaboration: Work closely with cross-functional teams to ensure seamless integration of Azure solutions with existing systems and applications, including those based on C#, SQL Server, and ASP.NET MVC.• DevOps Practices: Design, implement, and maintain CI/CD pipelines using Azure DevOps to automate deployments and streamline development workflows.• Custom Integrations: Design and manage custom integrations within Azure environments to enhance application functionality (MuleSoft, Go-Anywhere, SFTP etc.)• Performance Optimization: Enhance assigned applications, address production issues, and ensure optimal performance of Azure solutions.• ETL Processes: Utilize SSIS for developing and maintaining ETL processes to facilitate data migration and transformation between systems. (Nice to have)• Infrastructure Management: Maintain Azure infrastructure for both production and non-production environments, ensuring optimal performance and availability. (Nice to have)• Risk Management: Construct risk assessments and remediation plans for complex service proposals and advanced technologies.• Environment Setup: Utilize Azure templates to create and configure new environments efficiently.• Network Understanding: Understand and manage Azure networking concepts to ensure secure and reliable connectivity between resources.• Documentation: Prepare and maintain comprehensive technical documentation, including architecture diagrams, process flows, and design specifications.• Subject Matter Expert: Act as a trusted advisor for technical services, providing insights and guidance to both internal and external stakeholders.CANDIDATE SKILLS AND QUALIFICATIONSExperience with Microsoft technologies such as Visual Studio, SQL Server, and ASP.NET MVC Required 7 yearsAbility to troubleshoot and resolve complex technical issues Required 7 yearsMeticulous attention to detail with an ability to produce high-quality work in a dynamic environment Required 7 yearsHighly organized and able to manage multiple tasks at once and meet deadlines Required 7 yearsExtensive skill in effective verbal and written communications with stakeholders Required 7 yearsAt least six [6] years of hands-on experience in Azure architecture and related technologies Required 6 yearsAt least six [6] years of experience in Azure DevOps, including writing CI/CD pipelines Required 6 yearsAt six years [6] years of experience in software development using C# Required 6 yearsAt least Six [6] years of experience in .NET Core development, working in a team environment Required 6 yearsProven technical leadership skills and ability to effectively communicate technical concepts to non-technical stakeholders Required 6 yearsAbility to analyze customer service requirements and design service solutions to meet those objectives Required 6 yearsUnderstanding of Azure networking concepts and infrastructure maintenance for production and non-production environments Required 6 yearsAbility to create and configure new Azure environments using Azure templates Required 6 yearsGraduation from an accredited four-year college or university with a degree in computer science or a related field Required 4 yearsExperience with PDF generation using iText and familiarity with Mulesoft and GoAnywhere Preferred 4 yearsFamiliarity with mainframe migration strategies using SSIS as data transformation tool. Preferred 4 yearsKnowledge of mainframe technologies and systems is a plus Preferred 4 years",
        "source": "Email",
        "date_posted": "2024-10-28 10:03:44-05:00",
        "unique_id": "192d3c79c643ecc8",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Azure Data Engineer"
    }
]