[
    {
        "company": "Adventa",
        "job_title": "Cloud Data Engineer",
        "location": "Dearborn, MI, USA",
        "full_location": {
            "city": "Dearborn",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "6+ years",
            "degree_required": "Bachelor's degree in science, Technology, Engineering, or Mathematics",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Azure Data Factory",
                "Databricks",
                "Python",
                "SQL",
                "Scala"
            ],
            "primary": [
                "Azure cloud services",
                "Data Engineering",
                "Cloud security"
            ],
            "secondary": [
                "Problem-solving",
                "Attention to detail",
                "Collaboration"
            ],
            "all": [
                "Azure Data Factory",
                "Databricks",
                "Python",
                "SQL",
                "Scala",
                "Azure cloud services",
                "Data Engineering",
                "Cloud security",
                "Problem-solving",
                "Attention to detail",
                "Collaboration"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Sangya Kumari Nahak",
        "email": "sangya@adventatech.com",
        "jd": "From: sangya kumari nahak, adventa sangya@adventatech.com Reply to: sangya@adventatech.com Job Title: Cloud Data EngineerLocation: Dearborn, MI (hybrid) --- LOCAL CANDIDATES onlyDuration: 6+ MonthsVisa: CITIZEN,GC EAD,GREEN CARD,H4 EAD,OPT EAD(No CPT/H1B) MOI: F2FNote: Please submit candidates who are Azure certified and available for onsite interviews in Detroit. Our client in the technology industry is seeking Cloud Data Engineer to join their team. Candidates must be certified in and have strong experience in Azure Data Factory and Databricks. As a Cloud Data Engineer, you will be part of the Data Engineering team supporting various business units. The ideal candidate will have excellent problem-solving skills, strong attention to detail, and the ability to work collaboratively in a fast-paced environment.Responsibilities:What's the Job?· Design and implementation of complex cloud solutions using Microsoft Azure, focusing on integration with Databricks and Azure Data Factory.· Develop and maintain scalable and efficient data pipelines and architectures.· Ensure optimal architecture and performance of applications deployed on Azure.· Provide expertise in cloud security, ensuring compliance with industry standards and company policies.· Collaborate with cross-functional teams to understand business requirements and translate them into technical solutions.What's Needed?· 6+ years of experience as a data engineer, with strong proficiency in Azure cloud services, Databricks, and Azure Data Factory.· 3+ years of experience with designing and implementing data solutions using Azure Cloud.· Azure Data Engineering or Databricks Certification is required.· Strong knowledge of programming languages such as Python, SQL, or Scala.· Bachelor's degree in science, Technology, Engineering, or Mathematics.",
        "source": "Email",
        "date_posted": "2024-10-28 11:41:44-05:00",
        "unique_id": "192d4214da462ad9",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Azure Data Engineer"
    }
]