[
    {
        "company": "Menzotech",
        "job_title": "Senior .NET Software Engineer",
        "location": "Leawood, KS, USA",
        "full_location": {
            "city": "Leawood",
            "state": "KS",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Bachelor’s degree in a computer related field and/or equivalent work experience",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6 months contract to hire",
            "rate": "$68/HR"
        },
        "skills": {
            "core": [
                "C#",
                ".NET Framework",
                "SQL Server",
                "Kubernetes",
                "CI/CD Pipelines"
            ],
            "primary": [
                "Microsoft .Net Core",
                "Kafka",
                "TDD",
                "Angular 12+",
                "Agile"
            ],
            "secondary": [
                "Docker",
                "Knockout.js",
                "Web API",
                "HTML",
                "CSS"
            ],
            "all": [
                "C#",
                ".NET Framework",
                "SQL Server",
                "Kubernetes",
                "CI/CD Pipelines",
                "Microsoft .Net Core",
                "Kafka",
                "TDD",
                "Angular 12+",
                "Agile",
                "Docker",
                "Knockout.js",
                "Web API",
                "HTML",
                "CSS"
            ]
        },
        "job_type": [
            "onsite",
            "hybrid"
        ],
        "contact_person": "shivakumar",
        "email": "recruiting1@menzotech.com",
        "jd": "From: shivakumar, Menzotech recruiting1@menzotech.com Reply to: recruiting1@menzotech.com Job Title: Senior .NET Software Engineer - onsite 1 day WednesdaysLocation: Leawood, KSDuration: 6 months contract to hire Locals are also given first preference Candidates must be open for relocation for day 1 onsite ONLY USC/GCMax rate : $68/HR C2H Required skills/experience: MUST HAVECI/CD Pipelines, Microsoft .Net Core, SQL Server, Kubernetes, Kafka, C#, TDD etc. C#, .NET Framework, Angular 12+Agile MUST - Have done test driven dev and unit testing. WHAT YOU'LL DOAs a Senior Software Engineer, you will be developing, testing, implementing, and maintaining software applications for ATI's Virtual Coaching platform, bringing innovative, seamless and performant solutions that change lives for our customers. WHERE YOU’LL WORKThis position will work a hybrid schedule from our Leawood, KS. HOW YOU’LL SPEND YOUR TIME·Enhance and develop functionality for the ATI Nursing platform using advanced technologies like C#, .NET Framework, Angular, Docker, Kubernetes, Kafka, Knockout.js, Web API, and MSSQL·Collaborate with a diverse team of Platform Analysts, Scrum Masters, QA Analysts, and Product Owners to define and deliver impactful projects·Work independently, as well as with team members on different teams and in different locations·Conduct thorough code reviews as a reviewer to ensure high-quality software development·Provide technical mentoring and guidance to less experienced Software Engineers·Continually work towards making improvements in the release process and facilitate migration to a Continuous Deployment/Continuous Integration approach·Provide technical expertise and troubleshooting as needed to support production issues·Execute deployments in production and non-production environments and willing to support deployments outside of work hours participate in an on-call rotation WHAT YOU'LL NEED·Bachelor’s degree in a computer related field and/or equivalent work experience·5+ years of relevant work experience in software development for web-based applications·Demonstrating strong organizational and teamwork skills, meticulous attention to detail, and a proactive willingness to actively engage and collaborate with other development teams working on different integrations.·Excellent problem-solving skills and an ability to translate a business scenario into a technical solution·Demonstrating excellent written and verbal communication skills to effectively convey ideas, collaborate with team members, product partners, and stakeholders. This includes actively engaging with product partners to understand requirements, collaborating with the team and Quality Engineering (QE) to troubleshoot issues, and working together with QE to ensure comprehensive coverage for validation and verification of the delivered value.·Proficiency in .NET, C#, SQL, HTML, and CSS.·Experience with web frameworks such as Angular or React.·Experience with Kafka, Docker and Kubernetes is strongly recommended·Understanding of an Agile based development methodology or similar formal methodologies·Strong understanding of software development best practices and principles",
        "source": "Email",
        "date_posted": "2024-10-28 09:49:48-05:00",
        "unique_id": "192d3dbad04c937e",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]