[
    {
        "company": "Tekinspirations",
        "job_title": "System Analyst",
        "location": "Tallahassee, FL, USA",
        "full_location": {
            "city": "Tallahassee",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Bachelor’s or Master’s Degree in Computer Science, Information Systems, or other related field. Or equivalent work experience.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Long-term contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Visual Vault SaaS product",
                "Business process workflows",
                "Test plans",
                "Test cases",
                "Technical documentation"
            ],
            "primary": [
                "Analytical skills",
                "Problem-solving skills",
                "Written communication skills",
                "Oral communication skills",
                "Interpersonal skills"
            ],
            "secondary": [
                "Microsoft Dynamics 365 Certification",
                "MS Dynamics Power Platform Certifications",
                "User acceptance testing",
                "Software updates",
                "System documentation"
            ],
            "all": [
                "Visual Vault SaaS product",
                "Business process workflows",
                "Test plans",
                "Test cases",
                "Technical documentation",
                "Analytical skills",
                "Problem-solving skills",
                "Written communication skills",
                "Oral communication skills",
                "Interpersonal skills",
                "Microsoft Dynamics 365 Certification",
                "MS Dynamics Power Platform Certifications",
                "User acceptance testing",
                "Software updates",
                "System documentation"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Akash Sharma",
        "email": "akash.s@tekinspirations.com",
        "jd": "From: Akash Sharma, Tekinspirations akash.s@tekinspirations.com Reply to: akash.s@tekinspirations.com Job Title: System Analyst Location: Tallahassee, FL (Hybrid) The selected candidate will be required to attend on-site meetings and presentations on select days throughout the month Type: Long-term contract MOI: Skype Note: We are looking for a Technical Business System Analyst who has at least one of the certifications mentioned below and experience with Visual Vault SaaS product. Primary Job Duties and Tasks The Office of Information Technology Services (OITS) is seeking a System Analyst C. Advanced (STC Job #1240 Systems Analyst, C. Advanced). The activities this candidate will be tasked with include, but are not limited to the following: Analyzing defined business rules and functional requirements Updating system documentation to ensure it reflects the current system version. Evaluating enhancement requests and providing estimates Designing technical solutions using the Visual Vault SaaS product Creating test plans and test scripts to verify system modifications are error-free and perform as designed. Facilitating user acceptance testing Documenting the results testing activities Deploying software updates Specific Knowledge, Skills and Abilities (KSAs) The submitted candidate must be able to apply common knowledge, skills, and abilities in the following areas: Skilled at working with the Visual Vault SaaS product. Experience with establishing and maintaining business process workflows. Ability to construct effective test plans and test cases. Ability to communicate business information effectively and in writing to users and information technology personnel. Ability to establish and maintain effective working relationships with others. Ability to present ideas in business-friendly and user-friendly language. Exceptionally self-motivated and directed. Superior analytical and problem-solving skills Excellent written and oral communication skills Excellent interpersonal skills Ability to write technical documentation. Knowledge of OITS applications, infrastructure, and general business principles, practices, and procedures. Education and Certifications Education: Bachelor’s or Master’s Degree in Computer Science, Information Systems, or other related field. Or equivalent work experience. (Required) Certifications: Microsoft Dynamics 365 Certification and MS Dynamics Power Platform Certifications",
        "source": "Email",
        "date_posted": "2024-10-28 14:32:14-05:00",
        "unique_id": "192d4bd62475f183",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]