[
    {
        "company": "Panzer Solutions LLC",
        "job_title": "Python Developer",
        "location": "Mount Laurel, NJ, USA",
        "full_location": {
            "city": "Mount Laurel",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party",
                "contract"
            ],
            "job_code": "",
            "experience_required": "5-6 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "$45/hr on C2C"
        },
        "skills": {
            "core": [
                "Python",
                "MySQL",
                "Graph Algorithms",
                "Linux"
            ],
            "primary": [
                "Basic Network Knowledge",
                "Routing Protocols",
                "Network Modeling Tools"
            ],
            "secondary": [
                "Cisco WAE",
                "Cariden MATE",
                "WANDL",
                "Packetdesign",
                "Network X"
            ],
            "all": [
                "Python",
                "MySQL",
                "Graph Algorithms",
                "Linux",
                "Basic Network Knowledge",
                "Routing Protocols",
                "Network Modeling Tools",
                "Cisco WAE",
                "Cariden MATE",
                "WANDL",
                "Packetdesign",
                "Network X"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Krish Sankla",
        "email": "krish.sankla@panzersolutions.com",
        "jd": "From: Krish Sankla, Panzer Solutions LLC krish.sankla@panzersolutions.com Reply to: krish.sankla@panzersolutions.com NOTE: NEED ONLY LOCAL Position: Python DeveloperLocation: Mount Laurel, NJ onsite 4 days/week $45/hr on C2C 5 - 6 years of strong Python Development and ScriptingMySQLGraph Algorithms & Modeling – Dijkstra, Breadth First Search, Depth First Search, A*LinuxBasic Network KnowledgeGeneral understanding of how routers workProtocols: BGP and IGPNetwork modeling tools: Cisco WAE or similar is a plusAbility to solve complex problems and break them down. Client provided description:Looking for a software person with graph algorithm knowledge.Solid working knowledge of Python & MysqlWorking knowledge of basic graph algorithms like Dijkstra, Breadth First Search, Depth First Search, A*Good knowledge of linux environments to be able to independently run scriptsUnderstanding of how transport network and routing network work togetherBasic understanding of routing protocols specifically BGP + IGP (OSPF or ISIS)Prior working experience with network modeling tools like Cisco WAE, Cariden MATE, WANDL, Packetdesign, Network X is a bonusAbility to problem solve - think and break down complex problems quickly Thanks Regards, Krish SanklaTalent Acquisition Specialist | Panzer Solutions LLCLinkedInwww.panzersolutions.com | 50 Washington Street, 9th Floor, SONO Corporate Center Norwalk, CT 06850 Notice of Confidentiality:The information contained herein is intended only for the confidential use of the recipient. If the reader of this message is neither the intended recipient, nor the person responsible for delivering it to the intended recipient, you are hereby notified that you have received this communication in error, and that any review, dissemination, distribution, or copying of this communication is strictly prohibited. If you receive this in error, please notify the sender immediately by telephone, and destroy this e-mail message OR reply with the subject \"REMOVE\" or \"UNSUBSCRIBE\" such that your email would be taken out of our distribution list.",
        "source": "Email",
        "date_posted": "2024-10-28 17:29:34-05:00",
        "unique_id": "192d55fbfaf1646d",
        "emp_type": [
            "third party",
            "contract"
        ],
        "tag": "Python developer"
    }
]