[
    {
        "company": "Cloud Think Technologies",
        "job_title": "Oracle HCM Business Analyst",
        "location": "San Jose, CA, USA",
        "full_location": {
            "city": "San Jose",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "10+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "06+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle Cloud HCM",
                "Requirements Gathering",
                "Oracle HCM solutions",
                "Strong understanding of Oracle HCM modules"
            ],
            "primary": [
                "Hire",
                "Onboard",
                "Benefits",
                "Rewards",
                "Transfers",
                "Offboard"
            ],
            "secondary": [
                "Analytical skills",
                "Problem-solving skills",
                "Communication skills",
                "Interpersonal skills",
                "Process mapping",
                "Documentation",
                "Project management methodologies"
            ],
            "all": [
                "Oracle Cloud HCM",
                "Requirements Gathering",
                "Oracle HCM solutions",
                "Strong understanding of Oracle HCM modules",
                "Hire",
                "Onboard",
                "Benefits",
                "Rewards",
                "Transfers",
                "Offboard",
                "Analytical skills",
                "Problem-solving skills",
                "Communication skills",
                "Interpersonal skills",
                "Process mapping",
                "Documentation",
                "Project management methodologies"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Rohit Yadav",
        "email": "rohit@cloudthinktech.com",
        "jd": "Hi, This is Rohit Yadav, Senior Technical Recruiter from Cloud think tech Inc. I have urgent requirement for the position mentioned below. Please let me know if you are interested regarding this position.Reply me with your confirmation, waiting for your positive reply. Job: Oracle HCM Business AnalystLocation: San Jose, CA (Remote)Term: 06+ Months Visa : All Visa Linked in must Job Description Required Skills: Oracle Cloud HCM, Requirements Gathering, Oracle HCM solutions, Strong understanding of Oracle HCM modules, including Hire, Onboard, Benefits, Rewards, Transfers, and Offboard Job Summary:Jade Global is seeking a skilled Oracle HCM Business Analyst to join our team. The ideal candidate will have a strong understanding of Oracle HCM modules and be able to effectively gather, analyze, and document business requirements. This role will play a crucial part in ensuring successful implementations and ongoing support of Oracle HCM solutions. Responsibilities:Requirements Gathering: Gather, build, and document detailed process requirements (global and regional) for various Oracle HCM modules, including Hire, Onboard, Benefits, Rewards, Transfers, and Offboard.Design Workshops: Prepare for design workshops by gathering necessary documentation, data, and scheduling meetings. Take detailed notes during workshops.Testing and Launch Readiness: Support user and agent testing, ensuring that the system meets business requirements and is ready for launch. Assist in developing cutover plans.Reporting and Analytics: Define reporting and analytics requirements for processes within Oracle HCM.Communication and Enablement: Build communications, training materials, knowledge bases, and enablement resources for delivery teams.Content Creation: Design and update employee-facing articles, help text, notifications, and other communication materialsQualifications:Proven experience as an Oracle HCM Business AnalystStrong understanding of Oracle HCM modules, including Hire, Onboard, Benefits, Rewards, Transfers, and OffboardExcellent analytical and problem-solving skillsStrong communication and interpersonal skillsAbility to work independently and as part of a team Experience with process mapping and documentationKnowledge of project management methodologiesPreferred Qualifications:Certification in Oracle HCM modulesExperience with Oracle Cloud HCMExperience in a consulting or implementation environmentIf you are a highly motivated and skilled Oracle HCM Business Analyst looking for a challenging and rewarding opportunity, we encourage you to apply. Thanks and Regards Rohit YadavCloud Think TechnologiesEmail: Rohit@cloudthinktech.com",
        "source": "Email",
        "date_posted": "2024-10-28 09:25:55-05:00",
        "unique_id": "192d3a5313e158ea",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]