[
    {
        "company": "TEK Inspirations",
        "job_title": "Project Manager",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "10 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Agile Leadership",
                "Microsoft DevOps"
            ],
            "primary": [
                "Budget Management",
                "Team Coordination",
                "Risk Management",
                "Communication Planning"
            ],
            "secondary": [
                "Technical Support",
                "Application Design",
                "Performance Monitoring",
                "Stakeholder Communication",
                "Resource Negotiation"
            ],
            "all": [
                "Project Management",
                "Agile Leadership",
                "Microsoft DevOps",
                "Budget Management",
                "Team Coordination",
                "Risk Management",
                "Communication Planning",
                "Technical Support",
                "Application Design",
                "Performance Monitoring",
                "Stakeholder Communication",
                "Resource Negotiation"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Vaibhav Raghuvanshi",
        "email": "vaibhav.raghuvanshi@tekinspirations.com",
        "jd": "From: Vaibhav Raghuvanshi, TEK Inspirations vaibhav.raghuvanshi@tekinspirations.com Reply to: vaibhav.raghuvanshi@tekinspirations.com Hi,Hope you are doing great!!!Please share suitable profile and mention JOB. Job Description -Project ManagerThere is an hacker rank test for 60 Mins General responsibilities: Designs, plans, and coordinates work teams. Follows standard project management industry practices such as the PMI's framework. Understands business and technical objectives of a project and works closely with project sponsor.Creates project charter and work plan and tracks budget and schedule progress via appropriate metrics. Establishes project organization and methodologies and defines roles and responsibilities. Documents risks and develops mitigation plans.Manages scope. Creates and implements a communication plan. Builds an effective team, assigns tasks to team members, and evaluates outcomes.Negotiates resources. Communicates to stakeholders and project sponsor.Identifies, tracks, and ensures resolution of issues and removal of barriers.Provides technical support to project members. Handles complex application features and technical designs.Designs and implements the components required for complex application features. Generally manages a group of applications system analysts. Relies on experience and judgment to plan and accomplish goals.Professional certification is highly desirable.May require specific PC, workstation, operating system, application or platform skills. Provides overall direction to the formulation, development, implementation, and delivery of a project.Exercises management responsibility over the achievement of performance, revenue, and profit objectives of a project and its contracts. Ensures that the project plan maintains tasks, schedules, estimates, and status, and disseminates information to team members and customers.Creates a structure and organization for the management of a complex environment with emphasis on quality, productivity, and consistency.Directs corrective actions in any area where performance falls below objectives. Arranges for the assignment of responsibility to other supporting facilities, business areas, and support functions, and monitors their performance.Self-directed and independent. Responsible for the coordination and completion of projects.Oversees all aspects of projects. Sets deadlines, assigns responsibilities, and monitors and summarizes progress of project.Prepares reports for upper management regarding status of project. Requested experience: 5 years of experience managing projects with budgets greater than $5 million.5 years Agile Leadership Experience (document in resume)10 years of experience as a project manager (must be last position)Microsoft DevOps ExperienceExperience working with other project managers to ensure technology integration between systemsMust be local to Lansing, Michigan area. Work will be 2 days per week in office and 3 days remote.Previous experience with us is highly desired Regards,Vaibhav",
        "source": "Email",
        "date_posted": "2024-10-28 11:32:08-05:00",
        "unique_id": "192d419338a8f5ac",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]