[
    {
        "company": "TEK Inspirations",
        "job_title": "Project Manager III",
        "location": "Bellevue, WA, USA",
        "full_location": {
            "city": "Bellevue",
            "state": "WA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "MS Office",
                "Excel",
                "PowerPoint"
            ],
            "primary": [
                "Project Management",
                "Buying/Product Management"
            ],
            "secondary": [
                "Driving cross-functional relationships",
                "Organizational skills"
            ],
            "all": [
                "MS Office",
                "Excel",
                "PowerPoint",
                "Project Management",
                "Buying/Product Management",
                "Driving cross-functional relationships",
                "Organizational skills"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Arbab Ahmed",
        "email": "arbab.ahmeh@tekinspirations.com",
        "jd": "From: Arbab Ahmed, TEK Inspirations arbab.ahmeh@tekinspirations.com Reply to: arbab.ahmeh@tekinspirations.com Hello,Hope you are doing well.Job Title- Project Manager III Duration- 6+ MonthsLocation- Bellevue, WA. Role is Hybrid with 3 days a week in the office. MOI: Skype Description:This role will be primarily responsible for Project Managing the Planning & Strategy cycle for Accessories including scheduling important meetings, tracking important milestones, and ensuring materials are completed by team members on time. Other Projects will be added to this management scope as needed by the business. This role needs a candidate who is a self-starter, can hit the ground running quickly, gather necessary information, and quickly drive the cross-functional relationships needed to successfully manage projects across teams. At least 5 years’ relevant experience required. Role is Hybrid with 3 days a week in the office. Skillset Matrix Technology Requirements (I.E Programs, systems, etc.) - MS Office, specifically Excel and PowerPoint What does a typical day look like? (daily tasks) - Updating project schedules, following up on deliverables, attending meetings Preferred background/prior work experience? - Project Management, potentially Buying/Product Management experience Priority soft skills - Skilled at driving cross-functional relationships, organize Working with manager to set up supplier call. More information to be provided shortly. Update from Manager: Looking for candidates with PM experience in Merchandising Org.",
        "source": "Email",
        "date_posted": "2024-10-28 09:37:48-05:00",
        "unique_id": "192d3b0c12e179bd",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]