[
    {
        "company": "CVS Health",
        "job_title": "Pre-IT Business Consultant PM",
        "location": "Woonsocket, RI, USA",
        "full_location": {
            "city": "Woonsocket",
            "state": "RI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5-7 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "Budget through 2025",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Agile",
                "Documentation",
                "Microsoft Project",
                "Excel"
            ],
            "primary": [
                "Healthcare background",
                "Retail Industry experience",
                "Communication",
                "Stakeholder management",
                "Cross-functional team governance"
            ],
            "secondary": [
                "PMP",
                "CSM designation",
                "Presence",
                "Flexibility",
                "Problem articulation"
            ],
            "all": [
                "Project Management",
                "Agile",
                "Documentation",
                "Microsoft Project",
                "Excel",
                "Healthcare background",
                "Retail Industry experience",
                "Communication",
                "Stakeholder management",
                "Cross-functional team governance",
                "PMP",
                "CSM designation",
                "Presence",
                "Flexibility",
                "Problem articulation"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Maseera Khan",
        "email": "maseera@absoluting.com",
        "jd": "From: Maseera Khan, Absolute IT maseera@absoluting.com Reply to: maseera@absoluting.com Job DescriptionThis role is NOT a traditional PM, as it is entirely functional on the business side (PRE-IT) working on a day-to-day basis with Executives and VP’s to help drive overall process and roadmap initiatives with heavy documentation in assisting to make business decisions. A background in Healthcare background or Retail Industry experience working in large retail chain is a plus.*PMP is not a must but would be a plus. Ideally, they should have CSM designation and 5-7 years managing large, complex projects involving several stakeholders in an Agile environment. Initiative: Working to increase traffic in the CVS Pharmacy Front Stores leading to incremental revenue.This should be someone who has worked in a large Retail organization or a competitor of CVS who can own meeting leadership, information management, executive communications, cross functional team governance, prioritization, and executive level project plans. Title: Pre-IT Business Consultant PM Company: CVS Health Location: Woonsocket, RI – must be comfortable in a hybrid model 3 days per week (Tuesday-Thursday) OR Wellesley, MA office Location Details: 1 CVS Drive, Woonsocket, RI 02895 OR 93 Worcester St, Wellesley, MA 02481Why Open: GatheringStart: ASAPDuration: Budget through 2025, but with a goal to convert before hand if it’s a fit for the client and the candidate but no guarantee’s at this timeInterview Process: 2 round virtual interviews Background Check:7 year criminal (federal, county, state)Employment verification – 7 yearsEducation verificationHours / Shift: Monday- Friday, regular business hoursRequirements:5-7+ years of PM experience: Basic project management – 5-7 years experience with hands on PM experience/pick up on action items/take minutesTruly worked as a PM not just use some buzzwordsHealthcare background (if they have worked at CVS in the past and have a positive reference that is a plus!Nice to have: working in a product modelSoft skills IMPORTANT: Presence, communicate at all levels of the organization, articulate problems/hear and understand issues/experience with documentation.Ability to work with business partners/communicationFlexible/not phased by constant changes & a little chaos Microsoft project used in a PM standpoint (HUGE) – expert knowledge needed Large enterprise experience is a must/someone who is comfortable going to multiple teams to dig deeper/work in a high matrixed organization Excel experienceCommunicate with business partners, but this is a smaller team working with a number of their clients",
        "source": "Email",
        "date_posted": "2024-10-28 09:17:18-05:00",
        "unique_id": "192d39d14526b35b",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]