[
    {
        "company": "InfoTech Spectrum Inc.",
        "job_title": "Sr. Pharma Project Manager",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Bachelor’s degree in Business Administration, Computer Science or related discipline.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Through 2025",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "In Vivo Workflow",
                "Study Log",
                "ELN",
                "Pharmaceutical Experience",
                "Microsoft Project"
            ],
            "primary": [
                "Information Technology infrastructure",
                "Application development frameworks",
                "Configuration and support of technology solutions",
                "Project lifecycle methodologies",
                "Agile",
                "RUP",
                "ASAP",
                "EPM / PPM toolsets"
            ],
            "secondary": [
                "Analysis Skills",
                "Judgment / Decision Making",
                "Organization and planning",
                "Strong written and oral communication",
                "Negotiation and conflict management",
                "Team building"
            ],
            "all": [
                "Project Management",
                "In Vivo Workflow",
                "Study Log",
                "ELN",
                "Pharmaceutical Experience",
                "Microsoft Project",
                "Information Technology infrastructure",
                "Application development frameworks",
                "Configuration and support of technology solutions",
                "Project lifecycle methodologies",
                "Agile",
                "RUP",
                "ASAP",
                "EPM / PPM toolsets",
                "Analysis Skills",
                "Judgment / Decision Making",
                "Organization and planning",
                "Strong written and oral communication",
                "Negotiation and conflict management",
                "Team building"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Minu Roy",
        "email": "minu.roy@infotechspectrum.com",
        "jd": "From: Minu, infotechspectrum minu.roy@infotechspectrum.com Reply to: minu.roy@infotechspectrum.com Role:- Sr. Pharma Project ManagerLocation:- Remote(USC, H4 EAD Only)Job Description:-RequirementsBachelor’s degree in Business Administration, Computer Science or related discipline.At least 10+ years of project management experienceIn Vivo Workflow and Study Log experienceELN experienceStrong pharmaceutical experienceKnowledge of Information Technology infrastructure, application development frameworks, configuration and support of technology solutionsExperience in organizing, planning and executing business and IT projects from vision through implementationExperience with project lifecycle methodologies – e.g., Waterfall, RUP, Agile, ASAPExperience in managing small to large teams of matrixed resources from all areas of the development lifecycle – BAs, SAs, Developers, Architects, PMs, QA team and operationsProficiency in Project Management Software: Microsoft Project and experience with EPM / PPM toolsets (e.g. Planview) JOB DESCRIPTION:Our client in Groton, CT, a leader in drug discovery and development, is seeking a Sr Project Manager to join a fast moving, complex and high profile initiative. Pharmaceutical in vivo workflow and Study Log experience is a must have for this role. This role is on an acquisition/integration team focused on mapping and ingesting in vivo studies from an acquired company into their legacy system. The source system is homegrown, so a strong knowledge of in vivo workflows, animal studies and study logs is essential for success. Additionally, broad experience with Lab Notebooks is important.This assignment will run through 2025 and is 100% remote, though a small amount of travel may be required. Responsibility Responsible for project oversight and hands-on project management to actively manage project plans, deliverables, dependencies and outcome for selected project(s) as approved by senior management and key stakeholders. Ensure project goals and objectives are achieved within the project timeframe, scope, costs and quality guidelines established by the relevant stakeholders and management committees. This position is responsible for:Management of all aspects of the project according to project management methodologies, standards and best practices as set by the PMORequirements collection and scope definition for project aligned with project goals and objectivesSchedule creation and management with assignment of milestones, dependencies that are essential for the project network diagram and the management of the critical pathProject cost management which includes, but not limited to baseline, budget at completion, actual cost, estimate to complete. Earned value analysis as well as other formal PM methodologies for forecasting and reporting on project budgetsProject resource forecasting, leveling, and integration Negotiation with resource managers to acquire the resources necessary to produce the project on time and within budget.Project risk analysis, assessment, risks and mitigation strategies planning, and management, interfacing with all levels of management and IT within the organizationIdentification, tracking and resolution of issues related to the project throughout its lifecycle Definition and implementation of appropriate change management strategy and plans to ensure that change management concerns are addressed during and after project implementationTimely and concise communications with key stakeholders in the business and ITCompliance with all PMO project management cadences ClimateThis position is minimally supervised and requires experience and judgment to plan and accomplish goals for a variety of complicated tasks. Leads and directs the work of others. This position is centered in a fast paced environment with a high frequency and variety of demands where multi-tasking and prioritization are required. Because this is a highly visible position that touches many groups – requires ability to flourish in a dynamic, interdependent environment, and be diplomatic enough to consider the impact of decisions on all impacted groups. Job Specifications SkillsAnalysis SkillsJudgment / Decision MakingOrganization and planningStrong written and oral communicationNegotiation and conflict managementTeam building RequirementsBachelor’s degree in Business Administration, Computer Science or related discipline.At least 10+ years of project management experienceIn Vivo Workflow and Study Log experienceELN experienceKnowledge of Information Technology infrastructure, application development frameworks, configuration and support of technology solutionsStrong pharmaceutical experience. Experience in organizing, planning and executing business and IT projects from vision through implementationExperience with project lifecycle methodologies – e.g., Waterfall, RUP, Agile, ASAPExperience in managing small to large teams of matrixed resources from all areas of the development lifecycle – BAs, SAs, Developers, Architects, PMs, QA team and operationsProficiency in Project Management Software: Microsoft Project and experience with EPM / PPM toolsets (e.g. Planview) TraitsSelf motivated with a high degree of initiativeAbility to organize and work independentlyGood sense of judgmentAbility to prioritizeAbility to thrive in a fast-paced environment where multi-tasking and prioritization are requiredAbility to handle multiple initiatives, quickly-changing priorities, and customer expectationsExcellent facilitator with strong leadership skillsResults and process oriented Best Regards,Minu RoySr. Technical Recruiter || InfoTech Spectrum Inc.Email : minu.roy@infotechspectrum.com || Web: www.infotechspectrum.com2060, Walsh Ave, #120, Santa Clara, CA 95050",
        "source": "Email",
        "date_posted": "2024-10-28 13:39:19-05:00",
        "unique_id": "192d48cf242a2f5e",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]