[
    {
        "company": "Jabil Circuit",
        "job_title": "Scrum Master",
        "location": "St. Petersburg, FL, USA",
        "full_location": {
            "city": "St. Petersburg",
            "state": "FL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "6+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Scrum Master",
                "SAP",
                "onshore-offshore team leadership"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "Scrum Master",
                "SAP",
                "onshore-offshore team leadership"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Digvijay Singh",
        "email": "digvijay@spearstaffing.com",
        "jd": "From: Digvijay Singh, Spear Staffing digvijay@spearstaffing.com Reply to: digvijay@spearstaffing.com Scrum MasterSt. Petersburg, FL (hybrid) Please send local first. Relos will be reviewed lastJabil Circuit The Scrum Master will lead a hybrid onshore-offshore development team responsible for the client Partner Portal enhancements, leveraging SAP BTP. This role requires significant experience managing agile projects across distributed teams, ensuring the seamless execution of Scrum processes and sprint planning, while coordinating with both onshore stakeholders and offshore developers. The Scrum Master will ensure that the team delivers high-quality SAP BTP-based enhancements in line with client's objectives. Required Skills -Scrum MasterSAPonshore-offshore team leadership Job Duties -Facilitate Scrum ceremonies (daily stand-ups, sprint planning, retrospectives) for the onshore-offshore team, ensuring strong communication and collaboration.Act as the primary point of contact between Jabil’s Product Owner and the offshore development team.Ensure the development team follows SAP BTP development best practices and maintains a high standard of work quality.",
        "source": "Email",
        "date_posted": "2024-10-28 15:04:07-05:00",
        "unique_id": "192d4da947a4b6a3",
        "emp_type": [
            "third party"
        ],
        "tag": "Scrum Master"
    }
]