[
    {
        "company": "SoniTalent Corporation",
        "job_title": "SDET (Software Development Engineer Test) (CORILLIAN PLATFORM - VULNERABILITY REMEDIATION)",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SDET",
                "Automation Engineer",
                "Checkmarx",
                ".NET",
                "C#",
                "JavaScript (jQuery)"
            ],
            "primary": [
                "Cybersecurity vulnerability remediation",
                "Financial or banking domain experience",
                "Cross-functional team collaboration"
            ],
            "secondary": [
                "Knowledge of cybersecurity regulations",
                "Secure coding practices",
                "Experience with Fiserv"
            ],
            "all": [
                "SDET",
                "Automation Engineer",
                "Checkmarx",
                ".NET",
                "C#",
                "JavaScript (jQuery)",
                "Cybersecurity vulnerability remediation",
                "Financial or banking domain experience",
                "Cross-functional team collaboration",
                "Knowledge of cybersecurity regulations",
                "Secure coding practices",
                "Experience with Fiserv"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Bhuwan Tiwari",
        "email": "bhuwan.tiwari@sonitalentcorp.com",
        "jd": "From: bhuwan tiwari, Sonitalentcorp bhuwan.tiwari@sonitalentcorp.com Reply to: bhuwan.tiwari@sonitalentcorp.com Role – SDET (Software Development Engineer Test) (CORILLIAN PLATFORM - VULNERABILITY REMEDIATION)Location – Remote (PST)Duration – 6+months Visa – Any Visa Here is a quick recap of the key skills and the knockouts:- MUST be an SDET/Automation Engineer and they need to have experience with checkmarx and testing cybersecurity applications to identify vulnerabilities. These applications are Corillian banking apps and also built on C#/.Net. Must have Financial or banking domain client experience JOB DESCRIPTION:SEEKING SR SOFTWARE DEVELOPER TO ASSIST IN REMEDIATION OF CYBERSECURITY VULNERABILITIES WITHIN THE CORILLIAN ONLINE BANKING PLATFORM.DEVELOPERS WILL WORK CLOSELY WITH CYBERSECURITY TEAM TO ENSURE VULNERABILITIES ARE ADDRESSED AND SECURE CODING PRACTICES ARE FOLLOWED. RESPONSIBILITIES:• REMEDIATE CYBERSECURITY VULNERABILITIES IDENTIFIED IN CORILLIAN PLATFORM.• WORK WITH CYBERSECURITY TEAM TO PRIORITIZE AND RESOLVE A PORTION OF 91 OPEN VULNERABILITIES.• ENSURE COMPATIBILITY BETWEEN PLATFORM UPDATES (E.G., JQUERY) AND CORILLIAN DLLS BY COORDINATING WITH FISERV DEVELOPMENT TEAM.• APPLY SECURE CODING PRACTICES TO REMEDIATION EFFORTS, ENSURING COMPLIANCE WITH SECURITY STANDARDS.• DELIVER VULNERABILITY FIXES ON TIME, MAINTAINING PROJECT SCHEDULES AND SECURITY REQUIREMENTS.• PARTICIPATE IN SECURITY DISCUSSIONS TO CONTRIBUTE RECOMMENDATIONS FOR SYSTEM ARCHITECTURE AND CODE IMPROVEMENTS. REQUIRED SKILLS:• 5+ YEARS OF SOFTWARE DEVELOPMENT EXPERIENCE, FOCUSED ON THE CORILLIAN ONLINE BANKING PLATFORM.• HANDS-ON EXPERIENCE WITH CYBERSECURITY VULNERABILITY REMEDIATION IN FINANCIAL OR BANKING SYSTEMS.• PROFICIENCY IN .NET, C#, AND JAVASCRIPT (JQUERY) FOR SECURE DEVELOPMENT.• SAST TOOLS LIKE CHECKMARX FOR DETECTING AND RESOLVING VULNERABILITIES.• EXPERIENCE WORKING WITH CROSS-FUNCTIONAL TEAMS, INCLUDING CYBERSECURITY AND FISERV DEVELOPERS. PREFERRED EXPERIENCE:• WORK WITH FISERV ON SIMILAR BANKING PLATFORM ENVIRONMENTS.KNOWLEDGE OF CYBERSECURITY REGULATIONS AND BEST PRACTICES IN FINANCIAL INSTITUTIONS.",
        "source": "Email",
        "date_posted": "2024-10-28 14:36:06-05:00",
        "unique_id": "192d4c0edd86768d",
        "emp_type": [
            "third party"
        ],
        "tag": ".net developer"
    }
]