[
    {
        "company": "Vyzeinc",
        "job_title": "Lead Backend Developer(W2)",
        "location": "Charlotte, NC, USA",
        "full_location": {
            "city": "Charlotte",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years developer experience with 7+ years JavaScript development experience",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "One year engagement",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "JavaScript",
                "Node.js",
                "SQL",
                "Agile",
                "Cybersecurity"
            ],
            "primary": [
                "Typescript",
                "Dashboard Development",
                "Active Directory",
                "LDAP",
                "Unit/Functional Testing"
            ],
            "secondary": [
                "Linux Server Administration",
                "T-SQL",
                "CSS Techniques",
                "Java",
                "Groovy",
                "Gradle",
                "TFS",
                "GIT"
            ],
            "all": [
                "JavaScript",
                "Node.js",
                "SQL",
                "Agile",
                "Cybersecurity",
                "Typescript",
                "Dashboard Development",
                "Active Directory",
                "LDAP",
                "Unit/Functional Testing",
                "Linux Server Administration",
                "T-SQL",
                "CSS Techniques",
                "Java",
                "Groovy",
                "Gradle",
                "TFS",
                "GIT"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Roshan",
        "email": "roshan@vyzeinc.com",
        "jd": "From: Roshan, Vyzeinc roshan@vyzeinc.com Reply to: roshan@vyzeinc.com Job Description -Role: Lead Backend Developer (W2 role)Location: - Charlotte, NC or San Francisco, CA(Local) (F2F interview)Interview: In person (F2F interview)One year engagementOverview:This is a lead resource so looking for someone seasoned. Back-end developer with full stack/front end exposure.8+ years developer experience with 3+ years JavaScript development experience Exposure to UX/UI design concepts nice to haveExperience developing dashboards is mandatoryExperience working with internal customers to gather requirements Experience working in an Agile environment Experience with metrics cybersecurity (nice to have but not mandatory)Good communication skills and the ability to summarize and document technical processes In this contingent resource assignment, you may: Consult on complex initiatives with broad impact and large-scale planning for Information Security Engineering. Review and analyze complex multi-faceted, larger scale or longer-term Information Security Engineering challenges that require in-depth evaluation of multiple factors including intangibles or unprecedented factors. Contribute to the resolution of complex and multi-faceted situations requiring solid understanding of the function, policies, procedures, and compliance requirements that meet deliverables. Strategically collaborate and consult with client personnel. Required Qualifications: 5+ years of Information Security Engineering experience, or equivalent demonstrated through one or a combination of the following: work or consulting experience, training, military experience, education. Responsibilities:• Develop cybersecurity metrics dashboards and other tools to support metrics development and operation• Work with internal customers to gather and understand requirements• Function as a technical lead when needed for feature and functionality development• Perform code reviews and testing• Collaborate with a small team of developers and share development responsibilitiesQualificationsRequirements:• 10+ years developer experience with 7+ years JavaScript development experience• Server-side Node.js or other JavaScript/Typescript development experience• Experience developing dashboards• Experience working with internal customers to gather requirements• Good communication skills and the ability to summarize and document technical processes• Experience with cybersecurity or metrics (either one, or both)• Proficiency working in both Windows and Linux server environments• Strong database and SQL skills• Solid understanding of the different types of code-coverage and writing Unit/Functional tests• Experience with Active Directory and LDAP• Experience working in an Agile environment• Exposure to UX/UI design conceptsAdditional desired skills:• Typescript experience• Basic experience with Linux server administration• T-SQL and SQL Server experience• Experience with modern CSS techniques and frontend performance optimization• Java/Groovy/Gradle experience for occasional updates and debugging of Jenkins pipelines• Experience with TFS for reviewing legacy code and GIT for all other SCM• Experience working in the financial services industry – particularly other banks• Full stack development experience Here are our initial screening questions:How many years have you been in a lead developer role and can you briefly describe what you did for one of those roles?What mix of front-end and back-end developer experience do you have? E.g., do you do mostly back-end with some front-end, an even amount of both, or some other combination?Can you briefly describe an example of an app you worked on that required you to do both front-end and back-end work?Can you briefly give an example of a challenge you faced where you had to focus on optimizing performance?",
        "source": "Email",
        "date_posted": "2024-10-28 21:33:27-05:00",
        "unique_id": "192d63f0062e43e3",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]