[
    {
        "company": "DMS Vision, INC",
        "job_title": "Hybrid Senior SAP FI/CO Business Analyst",
        "location": "Buena Park, CA, USA",
        "full_location": {
            "city": "Buena Park",
            "state": "CA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "15 or more years",
            "degree_required": "Bachelor's degree in Finance, Accounting, Information Technology, or related field",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "6+ C2H Month Project",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "SAP FICO",
                "full cycle SAP end-to-end implementation",
                "designing and configuring SAP FICO module",
                "FI and CO cross-functional integration"
            ],
            "primary": [
                "communication skills",
                "SAP BI HANA",
                "Concur",
                "Blackline",
                "GL",
                "AR",
                "AP",
                "Asset Accounting",
                "Cost Center Acctg",
                "Profit Center Acctg",
                "S/4HANA"
            ],
            "secondary": [
                "packaging and distribution industry",
                "analytical skills",
                "problem-solving skills",
                "lead cross-functional teams",
                "stakeholder management"
            ],
            "all": [
                "SAP FICO",
                "full cycle SAP end-to-end implementation",
                "designing and configuring SAP FICO module",
                "FI and CO cross-functional integration",
                "communication skills",
                "SAP BI HANA",
                "Concur",
                "Blackline",
                "GL",
                "AR",
                "AP",
                "Asset Accounting",
                "Cost Center Acctg",
                "Profit Center Acctg",
                "S/4HANA",
                "packaging and distribution industry",
                "analytical skills",
                "problem-solving skills",
                "lead cross-functional teams",
                "stakeholder management"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Gaurav Gaur",
        "email": "gaurav@dmsvisions.com",
        "jd": "From: Gaurav Gaur, DMS VISIONS INC gaurav@dmsvisions.com Reply to: gaurav@dmsvisions.com Hi,Hope you are doing well,Please find the job description given below and let me know your interest.Position: Hybrid Senior SAP FI/CO Business AnalystLocation: Buena Park, CA (90620) (On-site two days a week. Only, local candidates prefer LA or Orange County residents.)Duration: 6+ C2H Month ProjectVisa: Only USC AND GC Job Description Communication skills need to be no less than a 9. MUST HAVES: 1. 15 or more years of SAP FICO experience. 2. Must have full cycle SAP end-to-end implementation experience. 3. Must hold one or more relevant certificates. 4. Experience in designing and configuring SAP FICO module 5. Experienced in FI and CO cross-functional integration within SAP such SD, MM, PP, WTY, VMS, CS, PS and integration with non-SAP environment such Salesforce, Vertex, and SAP Hybris DESCRIPTION: As senior SAP Finance Business Analyst you will be responsible for the architecture, setup, configuration, testing and support of core SAP Finance and Controlling functions. You will be in close contact with business as well as other members of the ERP team. In this role, you are able to translate business requirements into efficient solutions to optimize business processes. Although this role is mainly SAP related, but other systems like SAP BI HANA, Concur, Blackline, are part the ERP landscape as well. Principle Duties Lead the analysis, design, and implementation of SAP FI/CO solutions tailored to the packaging and distribution industry.Collaborate with finance, operations, and IT teams to understand business needs and identify areas for improvement in financial processes.Gather and analyze detailed requirements for SAP FI/CO modules, ensuring alignment with industry-specific needs and best practices.Design and configure solutions in SAP Finance and Controlling modules, including GL, AR, AP, Asset Accounting, Cost Center Acctg, and Profit Center AcctgDevelop functional specifications for custom developments, reports, interfaces, and workflows specific to packaging and distribution operations.Lead requirement gathering sessions and translate complex business needs into technical requirements.Ensure seamless integration between FI/CO and other modules like MM (Materials Management), SD (Sales and Distribution), and WM (Warehouse Management).Provide guidance and mentorship to junior team members on SAP FI/CO best practices and industry standards.Conduct user training sessions and develop comprehensive documentation for end-users.Participate in full lifecycle SAP implementations, upgrades, and enhancement projects.Stay current with the latest SAP FI/CO updates and industry trends, recommending innovative solutions to enhance business processes. Qualifications: Bachelor's degree in Finance, Accounting, Information Technology, or related field. MBA or relevant master's degree preferred.SAP FI/CO certification preferred8+ years of experience in SAP FI/CO, including at least 2-3 full lifecycle implementations in the packaging and distribution industry.Strong knowledge of finance and accounting principles, with a focus on industry-specific requirements for packaging and distribution businesses.Expertise in configuring and optimizing SAP FICO modules (GL, AR, AP, AA, CO-PA, etc.).Experience with S/4HANA a plusExcellent analytical, problem-solving, and communication skills.Ability to lead cross-functional teams and manage stakeholder relationships at all levels. If you are interested, please share your updated resume and suggest the best number & time to connect with you Thanks & Regards,Gaurav GaurEmail: gaurav@dmsvisions.com | Phone : 972-645-9280LinkedIn: https://www.linkedin.com/in/gaurav-gaur-hr/DMS Vision ,INC4645 Avon Lane, Suite 210Frisco, TX 75033",
        "source": "Email",
        "date_posted": "2024-10-28 13:43:11-05:00",
        "unique_id": "192d4907d3436178",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]