[
    {
        "company": "Quantum World IT",
        "job_title": "Azure Engineer",
        "location": "Urbana, MD, USA",
        "full_location": {
            "city": "Urbana",
            "state": "MD",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Proven experience as an Azure Engineer or similar role with a strong focus on cloud migrations.",
            "degree_required": "Bachelor’s degree in Computer Science, Information Technology, or related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Microsoft Azure",
                "VMware ESXi",
                "vCenter",
                "vSphere",
                "PowerShell",
                "Python",
                "Bash"
            ],
            "primary": [
                "Azure Virtual Machines",
                "Azure Site Recovery",
                "Azure Migrate",
                "Operating system administration",
                "Virtualization technologies",
                "Network structures"
            ],
            "secondary": [
                "Problem-solving skills",
                "Communication skills",
                "Teamwork skills"
            ],
            "all": [
                "Microsoft Azure",
                "VMware ESXi",
                "vCenter",
                "vSphere",
                "PowerShell",
                "Python",
                "Bash",
                "Azure Virtual Machines",
                "Azure Site Recovery",
                "Azure Migrate",
                "Operating system administration",
                "Virtualization technologies",
                "Network structures",
                "Problem-solving skills",
                "Communication skills",
                "Teamwork skills"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Rhitik Gaur",
        "email": "rhitik.gaur@quantumworldit.com",
        "jd": "From: Rhitik Gaur, Quantum World It rhitik.gaur@quantumworldit.com Reply to: rhitik.gaur@quantumworldit.com Greeting, I hope all is well with youFor the following, Quantum World IT is seeking the best consultant profile.Please respond with your most recent resume if you are considering new opportunities.Looking Onsite || Azure Engineer || Urbana, MD (Onsite)Description:Job Summary:As an Azure Engineer in our Program Catalyst initiative, you will play a pivotal role in migrating our on-premises VMware virtual environments to Azure. This position requires deep expertise in both VMware and Azure platforms, focusing on efficiently moving and rebuilding operating systems in the cloud to optimize performance and scalability. Key Responsibilities:- Design and implement migration strategies to transfer on-premises VMware virtual machines to Microsoft Azure.- Rebuild and configure operating systems and applications to ensure optimal performance in the Azure environment.- Develop automation tools and scripts to streamline the migration and setup processes.- Work closely with IT infrastructure teams to ensure seamless integration of migrated systems with existing Azure services.- Monitor the migrated systems, troubleshoot any issues, and ensure the stability and efficiency of operations.- Prepare detailed documentation on migration processes and system configurations.- Provide technical guidance and training to team members and stakeholders on Azure solutions.- Stay updated with the latest developments in Azure and VMware technologies and implement best practices in system architecture and security. Requirements:- Bachelor’s degree in Computer Science, Information Technology, or related field.- Proven experience as an Azure Engineer or similar role with a strong focus on cloud migrations.- Extensive knowledge of VMware ESXi, vCenter, and vSphere environments.- Strong understanding of Microsoft Azure services, especially Azure Virtual Machines, Azure Site Recovery, and Azure Migrate.- Proficiency in scripting languages such as PowerShell, Python, or Bash.- Familiarity with operating system administration, virtualization technologies, and network structures.- Excellent problem-solving skills and the ability to work under pressure.- Strong communication and teamwork skills.Competencies:Digital : Microsoft AzurePlease enter the following information is needed for submission and share your visa and Photo id Position Applied for Candidate Full Name [As per Passport] Contact Number Primary & Secondary Email ID Current Location LinkedIn Passport No. Work Authorization Had ever worked with TCS in Past (Required filed) (Contract/Full Time) Are you comfortable for on-site Had you gotten covid vaccination doses Rate expectation Thanks & RegardsRhitik GaurDirect : +1 805 973 0148Email: Rhitik.gaur@quantumworldit.comQuantum World Technologies Inc.4281 Katella Ave, Suite #102 Los Alamitos CA 90720 USA",
        "source": "Email",
        "date_posted": "2024-10-28 17:40:09-05:00",
        "unique_id": "192d58cf51c5c5d0",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Azure Data Engineer"
    }
]