[
    {
        "company": "KK Associates LLC",
        "job_title": "Certified Pega Business Architect",
        "location": "Hartford, CT, USA",
        "full_location": {
            "city": "Hartford",
            "state": "CT",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Degree or equivalent in Business, Information Systems, or Computer Science",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Pega",
                "Business Analysis",
                "Agile",
                "Scrum",
                "Communication"
            ],
            "primary": [
                "Problem Solving",
                "Analytical Skills",
                "Interpersonal Skills",
                "System Development Life Cycle"
            ],
            "secondary": [
                "User Interface Design",
                "Data Mapping",
                "Mentoring",
                "User Acceptance Testing"
            ],
            "all": [
                "Pega",
                "Business Analysis",
                "Agile",
                "Scrum",
                "Communication",
                "Problem Solving",
                "Analytical Skills",
                "Interpersonal Skills",
                "System Development Life Cycle",
                "User Interface Design",
                "Data Mapping",
                "Mentoring",
                "User Acceptance Testing"
            ]
        },
        "job_type": [],
        "contact_person": "Shaik Khadar",
        "email": "khadar@kksoftwareassociates.com",
        "jd": "From: Khadar, KK Associates LLC khadar@kksoftwareassociates.com Reply to: khadar@kksoftwareassociates.com We are hiring Certified Pega Business Architect Consultants for one of my client in Location:- Hartford, CT interesting candidates please send resumes to khadar@kksoftwareassociates.com Contact:- 6146995972 -105 Position:- :- Certified Pega Business ArchitectLocation: - Hartford, CT JD :-Certified Pega Business Architect5+ years of business analysis experience Degree or equivalent in Business, Information Systems, or Computer Science Extensive experience with Agile/Scrum required Excellent written and verbal communication skills Ability to understand business processes and translate into technical specifications Solid problem solving and analytical skills Ability to work effectively with people at all levels of the organization Client‐focused approach with outstanding interpersonal skills Working knowledge of system development life cycle conceptsPega Business Analyst Lead the business team in gathering requirements and choosing the best way to implement requirements leveraging the Pega system software. Design and configure rules and flows and assist with the draft user interface and draft process flow development. Function as an Information Technology Business Analyst by understanding business requirements and transforming those requirements into data mapping specs. Possesses and applies a comprehensive knowledge across key tasks and high impact assignments. Evaluates performance results and recommends major changes affecting short term project growth and success. Participates in the development of functional business requirements and helps users assess relative priorities for both business process and technology solutions. Understands business processes and priorities. Evaluates alternative business process and technology solutions, and participates in making technology recommendations to enhance business operations.Communicate with the internal customer to analyze information and business workflow to deliver functional requirements, use cases, and user interface designs.Effectively communicate with internal teams and clients to deliver UI requirements such as Graphical User Interfaces, Screen, and Interface mock-ups. Experience supporting Pega development or implementation. Conducts system testing and facilitates user acceptance testing.Works collaboratively with peers to coordinate the overall delivery of technology solutions to business groups.Mentor and oversee work of junior team members.Develops working knowledge of the client’s industry and uses this information to support continuous improvement initiatives.",
        "source": "Email",
        "date_posted": "2024-10-28 09:40:24-05:00",
        "unique_id": "192d3b2fb175f4e5",
        "emp_type": [
            "third party"
        ],
        "tag": "PEGA Developer"
    }
]