[
    {
        "company": "Tek Inspirations",
        "job_title": "Enterprise Project Manager – Electronic Case Management System (ECM) Implementation",
        "location": "Harrisburg, PA, USA",
        "full_location": {
            "city": "Harrisburg",
            "state": "PA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "7 years",
            "degree_required": "Bachelor's degree or equivalent technical study preferred",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Enterprise Solutions",
                "Technical Initiatives Management",
                "Budgeting",
                "Communication"
            ],
            "primary": [
                "PMP Certification",
                "Leadership",
                "Negotiation",
                "Problem-solving",
                "Team-building"
            ],
            "secondary": [
                "Knowledge of Pennsylvania Client operations",
                "Security Compliance",
                "Cross-Functional Coordination",
                "Stakeholder Engagement",
                "Risk Management"
            ],
            "all": [
                "Project Management",
                "Enterprise Solutions",
                "Technical Initiatives Management",
                "Budgeting",
                "Communication",
                "PMP Certification",
                "Leadership",
                "Negotiation",
                "Problem-solving",
                "Team-building",
                "Knowledge of Pennsylvania Client operations",
                "Security Compliance",
                "Cross-Functional Coordination",
                "Stakeholder Engagement",
                "Risk Management"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Mohit Kumar",
        "email": "kumar.mohit@tekinspirations.com",
        "jd": "From: Mohit Kumar, Tek Inspirations kumar.mohit@tekinspirations.com Reply to: kumar.mohit@tekinspirations.com Title : Enterprise Project Manager – Electronic Case Management System (ECM) ImplementationThe interview would be a video interview to start...possibly onsite if selected for a 2nd interview. Need Local to PA ConsultantLooking for USC and GC holders with great experience and communication skills They are requiring this person live in PA and be close enough to come onsite as needed in Harrisburg, PA. . Job details are below...skills matrix is attached. (Need to be filled by the consultant) SkillRequired / DesiredAmountof ExperienceExperience directly managing technical initiatives w/large project teams throughout the various IT areas, technical complexity and vendor involvement. Required 7 Years Experience with Enterprise solutions Required7 Years PMP Certification Required- Four (4) year college degree or equivalent technical study Required- Familiarity and experience with the Pennsylvania DHS Highly Desired- Enterprise Project Manager – Electronic Case Management System (ECM) Implementation Position Overview:Seeking an experienced Enterprise Project Manager (PM) to lead the implementation of an Electronic Case Management (ECM) platform. This role will ensure seamless integration and alignment with other federal programs, supporting various program offices in consolidating case-management systems onto a secure and efficient enterprise platform.The ECM platform-based solution will replace multiple custom-coded systems, enhancing data-sharing capabilities, reducing maintenance costs, and improving security and compliance across Client. The PM will engage with several federal and state stakeholders and oversee the full lifecycle of the ECM system's deployment.Key Responsibilities:Project Leadership: Serve as the Enterprise Project Manager (PM) for the ECM system implementation, ensuring alignment with organizational goals of data sharing, cost reduction, and enhanced security.Governance & Communication: Act as a primary communicator within ECM governance structures, engaging with Client program office stakeholders, executive leadership, and HHS DC representatives as needed.Onboarding & Support: Create and implement onboarding plans to facilitate smooth transitions for Client program offices to the new ECM platform.Decommissioning Legacy Systems: Develop strategies for phasing out outdated systems as onboarding progresses.Cross-Functional Coordination: Collaborate closely with program-specific PMs, ensuring integration of best practices and fostering cooperation across multiple teams.Subject Matter Expertise: Gain a comprehensive understanding of case management requirements across agencies to provide informed leadership on the ECM project.Contractor Skills and Experience Requirements:Experience: Minimum of seven (7) to nine (9) years managing large-scale technical initiatives, including cross-functional teams and multi-vendor environments.Technical and Business Acumen: Demonstrated expertise in budgeting, communication, leadership, negotiation, problem-solving, and team-building.Enterprise Solutions: Proven experience in implementing Enterprise solutions, with strong organizational and interpersonal skills.Education: Bachelor's degree or equivalent technical study preferred.Certifications: Project Management Professional (PMP) certification is preferred.Client Familiarity: Knowledge of Pennsylvania Client operations is a significant advantage.Security Requirements: Successful candidates will undergo a criminal history background check and provide a Pennsylvania State Policy (PSP) PATCH report for security access.This role is ideal for a seasoned project manager who is adaptable, resourceful, and highly skilled in enterprise-level implementation. The successful candidate will drive innovation and collaboration, contributing to a transformative system that serves Pennsylvania's most critical health and human services needs. OPERATIONAL REQUIREMENTS:The PM directs, administers, manages, and facilitates an enhancement, re-engineering of a business process or a developmental project. The PM is the individual ultimately responsible for the DHS ECM system implementation. The PM’s primary responsibility is to drive the entire effort from start to finish. The PM must ensure the project is completed on schedule, within the defined budget and the final product meets the business, technical, established quality requirements, and determined outcomes.The selected contractor must be familiar with the five (5) phases along with inputs/outputs identified by the Project Management Institute (PMI) that combine to turn a project idea into a working product. The PM will need to rely on their proven experience leading projects to a successful implementation, and their judgment, to plan and accomplish goals. Strong interpersonal skills are required when consulting with the program areas and various IT teams to define requirements and to analyze and resolve problems, ensuring collaboration and agreement with recommended solutions. The role description is outlined below:· Direct, administer, manage, and facilitate an enhancement, business process reengineering or development of a high priority, high profile, and commonwealth enterprise-wide information technology project of strategic importance. · Manage other PMs. This individual will serve as the primary and/or Lead PM for an agency-wide initiative involving other PMs.· Accountable for activities with excess delivery cycles of 8 to 24 months.· Manage, coordinate, and establish priorities for complete life cycle of the project including the planning, design, programming, testing, and implementation of business solutions designed to meet requirements of the program offices within the Department.Responsible for the development of estimates for the enhancement, business process re-engineering or development effort in planning, analysis, design, construction, testing, and implementation.Works with team leads to adjust and revise project estimates when necessary.Ensure new project estimates are approved and agreed upon by the client.Develop the detailed Project Management Plan for the enhancement, business process re-engineering or development effort.Accountable for the approval and sign-off of the Project Management Plan with customer representatives and all affected project stakeholders. Accountable for delivery of all work tasks identified in the Project Management Plan and Project Schedule.· Design project plans, which identify needs and define major tasks and milestones, based on scope, resources, budget, and personnel.Ensure tasks provide value and support the strategic direction of the project and meet service commitments.Manage and track the project progress against the project schedule.Monitor project milestones and phases and take corrective action, as needed, to ensure the project is on schedule. Monitor and track the project budget and advise necessary stakeholders. Plan, organize, prioritize, and manage multiple work efforts across the project team.Notify team members of project timelines, milestones, phases, work requests, target dates, and approved executable work packages.Responsible to schedule or monitor status reviews, project management inspections, software quality assurance work product, and process reviews with the appropriate stakeholders. Responsible for the capturing and reporting of required project management metrics.Analyze and distribute project metric reports associated with work items related to improvement measures.Ensure all scope changes are documented and follow processes outlined in the Change Management Plan.Prepare status reports on a periodic basis for the project team, team leads, group leads, sponsor, and appropriate stakeholders.· Report status and recommendations to senior leadership as needed. Follow HHS DC PMO methodology to ensure consistency throughout the various IT and program areas by reviewing the project standards and procedures with project team members.Provide input and support for continual improvement within the HHS DC PMO to better service the HHS DC supported program areas.Work closely with HHS DC Application, Data Warehouse, Solution Management, Networking, Security and Service Management teams, as required, identifying tasks for the project schedule to support the implementation.Facilitate discussions between IT areas and vendors with focus on solution(s) to ensure the needs/requirements of the program area are achieved.Anticipate issues and proactively address them. Identify and manage project risk and issues using a RAID Log. Develop risk mitigation strategies tracking to closure. Engage management in a proactive manner.Build and maintain relationships with key stakeholders and customer representatives. Serve as the primary point of contact for all project-related issues and the resolution of issues.Communicate effectively with customers and software / hardware suppliers supporting the commonwealth as appropriate.Communicate to team members how their work assignments relate to and help achieve project objectives.Accountable for the final project management evaluation review with stakeholders. Manage and track the project status against the project schedule.Following the HHS DC Daptiv guidelines, providing weekly project updates.Coordinate system testing with appropriate staff resources.Deliver presentations, as necessary.Ensure project compliance with HHS DC standards and procedures.Develop and facilitate the achievement of project service commitments. Ensure tasks are providing value and supporting the strategic direction of the project.Balance workload with project members’ capacity. Engaging management in a proactive manner.Plan, coordinate, and conduct training and orientation sessions.Accountable for peer reviews with the appropriate project team resources. Identify and manage project risk, and develop risk mitigation strategies, tracking to closure.Work with vendor to plan project specific training and orientation needs.Complete weekly timesheet reporting in PeopleFluent/VectorVMS by close of business (COB) Friday.Provide weekly personal status reporting by COB Friday submitted on SharePoint.Following the guidelines of the HHS DC PMO to set-up a SharePoint project site and utilize Microsoft Teams for key documentation.",
        "source": "Email",
        "date_posted": "2024-10-28 16:41:41-05:00",
        "unique_id": "192d533e654c34a5",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]