[
    {
        "company": "Adventa Tech",
        "job_title": "Adabas Linux Database Administrator (DBA)",
        "location": "Quincy, MA, USA",
        "full_location": {
            "city": "Quincy",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Minimum of (10) years of Information Technology experience; Minimum of (5) years of experience as an Adabas Database Administrator",
            "degree_required": "Bachelor’s degree in computer science, Information Systems, Business Administration, or a related field.",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Adabas",
                "Linux",
                "Database Administration",
                "AWS Cloud",
                "Linux shell scripting"
            ],
            "primary": [
                "ADAREP",
                "ADASAV",
                "ADABAS",
                "Adabas Encryption",
                "Natural Construct",
                "EntireX Communicator",
                "Natural Security",
                "Predict",
                "Software AG products"
            ],
            "secondary": [
                "Microsoft 365",
                "Excel",
                "Word",
                "PowerPoint",
                "Access",
                "Visio",
                "Jira Software",
                "SDLC",
                "Business modeling",
                "Process modeling",
                "Data modeling"
            ],
            "all": [
                "Adabas",
                "Linux",
                "Database Administration",
                "AWS Cloud",
                "Linux shell scripting",
                "ADAREP",
                "ADASAV",
                "ADABAS",
                "Adabas Encryption",
                "Natural Construct",
                "EntireX Communicator",
                "Natural Security",
                "Predict",
                "Software AG products",
                "Microsoft 365",
                "Excel",
                "Word",
                "PowerPoint",
                "Access",
                "Visio",
                "Jira Software",
                "SDLC",
                "Business modeling",
                "Process modeling",
                "Data modeling"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Rudranarayana Dalei",
        "email": "rudranarayana@adventatech.com",
        "jd": "From: Rudranarayana Dalei, Adventa Tech rudranarayana@adventatech.com Reply to: rudranarayana@adventatech.com Position: Adabas Linux Database Administrator (DBA)Duration: 12+ MonthsLocation: Quincy, MA - Hybrid ONLY DL from these states - MA, RI, CT or NHVisa: No H1B /CPTMOI: SkypeLinkedin is Must. MUST HAVE:Must be from either MA, RI, CT or NH. I can only submit with ID Proof of residency. Work Site: Quincy, MA - HybridPOSITION OVERVIEW: Seeking highly motivated Adabas Linux Database Administrator (DBA) who will support a “Lift and Shift” of the on-premises legacy mainframe application to AWS Cloud. Collaborate closely with development to be the liaison between the business community, the technical development team, and Cloud Rehosting Vendors. The DBA will play an integral role in supporting the cloud rehosting project, maintenance enhancements that may be implemented on the cloud platform, or defect fixes that need to be remediated on the cloud platform to meet the requirements of the business community. The first step in porting operations and systems to a new infrastructure will be to rehost the Natural/Adabas MA21 mainframe system in the AWS cloud. The successful candidate will support the MA21 AWS Cloud rehosting effort in support of the One Health Initiative. Coordinating these efforts of the MA21 cloud rehosting project will enable the successful migration of the MA21 legacy mainframe system as a key strategic step toward the future One Health Initiative.Experience with Adabas Utilities:Use of utilities like ADAREP, ADABAS, ADASAV, ADAORD, etc. for database maintenance and reportingSecurity certificate configuration with Software AG products Upgrades, Configuration, and Management Of Software AG Products on Linux, Including: Upgrades, Configuration, and Management Of Software AG Products on Linux, Including:? Adabas ? EntireX Communicator? Adabas Encryption ? Natural Construct? ConnX ? Natural One? Entire Net-Work? Natural Security? Entire Connection? PredictLinux shell scriptingPerforming database startup and shutdownPerforming and restoring database backupsPerforming Adabas File ReordersUsing the Software AG Update Manager to apply updates/fixesUsing administration subsystems, including cron, to schedule system tasks QUALIFICATIONS:Strong relationship skills and ability to interact with internal and external stakeholders and managementDemonstrated proficiency in business modeling, process modeling, and data modelingKnowledge of methods and techniques of computer systems analysis, design, technical terminology, codes, and standard abbreviationsUsing the available system management tools (both console and Web-based System Management)Knowledge of MA HIX or other State Health ExchangeAbility to work with multiple vendorsStrong organizational skills, problem-solving aptitude, and attention to detailAbility to work well with others in a fast-paced, dynamic environmentStrong initiative, ability to manage multiple projects, and strong follow-through skillsDeliver oral and written instructions in a precise, understandable mannerStrong organizational skills with the ability to maintain accurate records and status reportingProficiency in Microsoft 365, Excel, Word, PowerPoint, Access, and VisioExperience with Jira SoftwareExperience with the SDLC (Software Development Life Cycle)EDUCATION AND CERTIFICATIONSBachelor’s degree in computer science, Information Systems, Business Administration, or a related field.Minimum of (10) years of Information Technology experienceMinimum of (5) years of experience as an Adabas Database Administrator",
        "source": "Email",
        "date_posted": "2024-10-28 20:00:26-05:00",
        "unique_id": "192d5e9dc625d85a",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Oracle DBA"
    }
]