[
    {
        "company": "UST",
        "job_title": "Data Engineer",
        "location": "Bentonville, AR, USA",
        "full_location": {
            "city": "Bentonville",
            "state": "AR",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "6+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Must have existing work authorization",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Spark",
                "Scala",
                "Python",
                "GCP"
            ],
            "primary": [
                "Tableau"
            ],
            "secondary": [],
            "all": [
                "Java",
                "Spark",
                "Scala",
                "Python",
                "GCP",
                "Tableau"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Dharani K",
        "email": "dharani.k@vdartinc.com",
        "jd": "Hello, Hope you are doing well, Please find the job description below; if you are interested, kindly let me know. Title: Data Engineer Duration: Contract Location: Bentonville, AR (Onsite) Client: UST Locals Required. Except OPT and H1T, All Work Authorization is Workable While sharing the resume, Please do mention the candidate location and Work Authorization. Job Description : Must have skills. 6+ year strong experience working in Java, Spark, Scala Experience on Python Experience working on Tableau Client is looking for a highly energetic and collaborative Data Engineer with experience leading enterprise data projects around Business and IT operations. The ideal candidate should be an expert in leading projects in developing and testing data pipelines, data analytics efforts, proactive issue identification and resolution and alerting mechanism using traditional, new and emerging technologies. Excellent written and verbal communication skills and ability to liaise with technologists to executives is key to be successful in this role. As a Data Engineer at UST Global, this is your opportunity to ·- 6+ year strong experience working in Java, Spark, Scala - Hands on experience on Python - Strong in GCP - Hands on experience working on Tableau Waiting for your response. Please share your available time so I can contact you directly by phone. Best Regards, Dharani K Technical Recruiter VDart Inc Email: dharani.k@vdartinc.com LinkedIn: http://www.linkedin.com/in/dharani-krishnasamy-396116178/ Website: www.vdart.com Join VDart's Preferred Partner Program: https://www.vdart.com/suppliers/",
        "source": "Email",
        "date_posted": "2024-10-28 17:03:39-05:00",
        "unique_id": "192d548034bfe656",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "GCP Data Engineer"
    }
]