[
    {
        "company": "Neo Tech Solutions, Inc.",
        "job_title": "Business Analyst",
        "location": "Trenton, NJ, USA",
        "full_location": {
            "city": "Trenton",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Contract",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Software Development Lifecycle",
                "Requirement Gathering",
                "Agile",
                "Waterfall"
            ],
            "primary": [
                "Excellent Communication Skills",
                "Jira",
                "Project Management",
                "Stakeholder Management",
                "Budget Proposals"
            ],
            "secondary": [
                "Testing Tools",
                "Interpersonal Skills",
                "User Stories",
                "Process Improvement",
                "Leadership"
            ],
            "all": [
                "Business Analysis",
                "Software Development Lifecycle",
                "Requirement Gathering",
                "Agile",
                "Waterfall",
                "Excellent Communication Skills",
                "Jira",
                "Project Management",
                "Stakeholder Management",
                "Budget Proposals",
                "Testing Tools",
                "Interpersonal Skills",
                "User Stories",
                "Process Improvement",
                "Leadership"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Venkat Ram",
        "email": "venkat@neotechusa.com",
        "jd": "From: Venkat Ram, Neo Tech Solutions, Inc. venkat@neotechusa.com Reply to: venkat@neotechusa.com Hi ,Hope you are doing wellPlease find the below Job Description and let me know if you are interested in applying for this position. Position: Business AnalystDuration: ContractLocation: Trenton, NJ Job Description:Demonstrated experience in the standard concepts, practices and deliverables related to Business Analysis in support of software development projects.Note: Hybrid Position - 3days Onsite, 2 days Remote. Looking for candidates who are currently Local candidates only.Must have Excellent communication skills both Written and Verbal Individuals in this position have demonstrated experience in the standard concepts, practices, and deliverables related to Sr. Business Analysis in support of software development projects. Understands how to gather and document requirements. Has a working knowledge of the software development lifecycle. Works under limited supervision with considerable latitude for initiative and independent judgment. Some familiarity with the help of standard market Testing tools. Coordinate with internal resources and third parties/vendors for the flawless execution of the project.Review vendor Statement of Works provides feedback and recommendations to the CIO.Draft and submit budget proposals and recommend subsequent budget changes where necessary.Update project epics, user stories, and tasks in the Jira Project Management tool and provide summary reports for US DOE.Review, analyze and evaluate business systems and user needs for Phase 3 - Student and Staff data collection of Student Longitudinal Data Systems project.Serve as a liaison between stakeholders and users.Gather critical information from meetings with various stakeholdersPerform requirement analysis and document requirementsTranslate business requirements into user stories for execution in agile delivery mode * Manage competing resources and priorities.Evaluate business processes, anticipate requirements, uncover areas for improvement, and develop and implement solutions.Demonstrate progressive leadership in the complete life cycle of software development in Agile and Waterfall methodologies and possess excellent written & oral communication skills and interpersonal skills. Required details for submissionFull Name: Email id:Contact Number:Current Location:Relocation:Interview Availability:Notice Period:Visa Status:Any Interviews in Pipeline:Any offers in Pipeline:Linked in: Pay rate: Thanks & RegardsVenkat RamTalent Acquisition Manager+1 (908) 864-9002venkat@neotechusa.comNeo Tech Solutions, Inc.Suite 204, 515 Plainfield Ave, Edison, NJ 08817",
        "source": "Email",
        "date_posted": "2024-10-28 09:20:32-05:00",
        "unique_id": "192d3d15eb289c77",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]