[
    {
        "company": "LGL Technologies LLC",
        "job_title": "Business Analyst with Devops",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "12 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "1 year with possible extension",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Understanding",
                "Azure DevOps",
                "Business Process Review",
                "Requirements Elicitation",
                "Business Process Reengineering"
            ],
            "primary": [
                "Analytical Skills",
                "Organizational Skills",
                "Problem-Solving Skills",
                "VISIO",
                "MS Office Products"
            ],
            "secondary": [
                "Gap Fit Analysis",
                "Functional Specifications",
                "Technical Specifications",
                "RFP Development",
                "Data Warehousing"
            ],
            "all": [
                "Business Understanding",
                "Azure DevOps",
                "Business Process Review",
                "Requirements Elicitation",
                "Business Process Reengineering",
                "Analytical Skills",
                "Organizational Skills",
                "Problem-Solving Skills",
                "VISIO",
                "MS Office Products",
                "Gap Fit Analysis",
                "Functional Specifications",
                "Technical Specifications",
                "RFP Development",
                "Data Warehousing"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Madhu",
        "email": "madhu@lgltechnologies.com",
        "jd": "From: Madhu, LGL Technologies LLC madhu@lgltechnologies.com Reply to: madhu@lgltechnologies.com Role : Business Analyst with Devops Location : Lansing ,MI Work Mode : Hybrid Role with 2 days onsite from day 1 - Flexible days on site. Duration: 1 year with possible extension Don't send resumes less than 12 yrs Top Skills & Years of Experience Required: • Experience working with multiple agencies and/or vendors and/or departments in an enterprise environment• Business Understanding• Identifies systemic gaps and possible solutions for continuous improvements and modernization.• Excellent analytical, organizational, and problem-solving skills.• Extensive experience using Azure DevOps, VISIO, MS office products• Candidates should have a minimum of 12 years general BA experience and a minimum of 7 years conducting business process review and requirements elicitation and documentationCandidates must have a minimum of 12 years of general BA experience. Facilitation of requirements elicitation meetings; experience with gap fit analysis and requirements refinement.Reviews, analyzes, and evaluates business systems and user needs. Formulates systems to parallel overall business strategies. Experienced with business process reengineering and identifying new applications of technology to business problems to make business more effective. Familiar with industry standard (including Legacy, Core, and Emerging technologies), business process mapping, and reengineering. Prepares solution options, risk identification, and financial analyses such as cost/benefit, ROI, buy/build, etc. Writes detailed description of user needs, program functions, and steps required to develop or modify computer programs. Prepare and document Functional and Technical Specifications for reporting and data warehouse work. Assist with business warehouse/intelligence support and enhancements. Develops RFPs. Assist in deployment and management of end-user reporting tools and platforms. Work with IT and business project teams to understand reporting and data warehousing requirements and propose solutions. Document and provide knowledge transfer to the rest of the Enterprise Reporting Team for all solutions. Reviews, analyzes, and evaluates business systems and user needs. Formulates systems to parallel overall business strategies. Has knowledge of commonly used concepts, practices, and procedures within a particular field. Familiar with relational database concepts, and client-server concepts. Relies on limited experience and judgment to plan and accomplish goals. Performs a variety of tasks. Works under general supervision; typically reports to a project manager. A certain degree of creativity and latitude is required Specific Position Experience Required:Minimum of 7 years conducting business process review and requirements elicitation and documentationMinimum of 5 years developing and/or managing user stories on Agile development project(s)Minimum of 2 years working directly with senior management in facilitating discussions to determine strategy, develop road maps and/or gain consensus to resolve opposing positionsMinimum of 2 years supporting the development of or compliance to statement of work and/or other work agreements/contractsMinimum of 2 years working on projects developing/implementing IT solutions for public useMinimum of 1 year working on IT infrastructure projectsMinimum of 1 year working with programs governed by state and/or federal regulations",
        "source": "Email",
        "date_posted": "2024-10-28 17:22:50-05:00",
        "unique_id": "192d55990ed5e6ce",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]