[
    {
        "company": "Smart IT Frame",
        "job_title": "Database Administrator",
        "location": "Denver, CO, USA",
        "full_location": {
            "city": "Denver",
            "state": "CO",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "DB2 Database Administration",
                "MQ Replication",
                "DB2 upgrades"
            ],
            "primary": [],
            "secondary": [],
            "all": [
                "DB2 Database Administration",
                "MQ Replication",
                "DB2 upgrades"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Venkatesh",
        "email": "venkatesh@smartitframe.com",
        "jd": "From: Venkatesh, Smart IT Frame venkatesh@smartitframe.com Reply to: venkatesh@smartitframe.com Hi All, Warm greetings from Smart IT Frame! We are currently seeking candidates for an exciting job opportunity within our organization. If you're interested in learning more about this role, please don't hesitate to get in touch. You can either share your updated resume. Role: Database AdministratorLocation: Denver, CO – OnsiteType: Contract Required Skills: • DB2 Database Administration• MQ Replication• DB2 upgrades Job Description: • Provide technical expertise in DB2 System Administration to support project teams and ensure smooth operations.• Collaborate with stakeholders to define project scope, goals, and deliverables.• Develop detailed project plans, including timelines, resource allocation, and risk management strategies.• Monitor project progress and make adjustments as necessary to ensure successful completion.• Communicate project status, risks, and issues to stakeholders and senior management. - Ensure all projects adhere to company standards and best practices.• Facilitate project meetings and provide regular updates to team members and stakeholders. - Identify and resolve project issues and conflicts in a timely manner.• Mentor and guide project team members to enhance their skills and performance. - Ensure proper documentation and reporting of project activities and outcomes.• Utilize project management tools and techniques to optimize project efficiency and effectiveness.",
        "source": "Email",
        "date_posted": "2024-10-28 15:03:28-05:00",
        "unique_id": "192d4ea1c2a3f660",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "DB Admin"
    }
]