[
    {
        "company": "TechStar Group",
        "job_title": "Xamarin Mobile Developer",
        "location": "Alpharetta, GA, USA",
        "full_location": {
            "city": "Alpharetta",
            "state": "GA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "4 years",
            "degree_required": "Degree in an IT discipline or equivalent combination of education and work experience",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Xamarin Forms",
                "C#",
                "Visual Studio",
                "Object-Oriented principles",
                "MVVM principles"
            ],
            "primary": [
                "Android SDKs",
                "Applications development",
                "Technical documentation"
            ],
            "secondary": [
                "Honeywell Dolphin mobile computers",
                "Git",
                "Jira",
                "Azure DevOps",
                "AirWatch",
                ".NET MAUI",
                "Sales and Supply Chain business functions"
            ],
            "all": [
                "Xamarin Forms",
                "C#",
                "Visual Studio",
                "Object-Oriented principles",
                "MVVM principles",
                "Android SDKs",
                "Applications development",
                "Technical documentation",
                "Honeywell Dolphin mobile computers",
                "Git",
                "Jira",
                "Azure DevOps",
                "AirWatch",
                ".NET MAUI",
                "Sales and Supply Chain business functions"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Vijayakumar R",
        "email": "vijay@techstargroup.com",
        "jd": "From: Vijayakumar R, TechStar Group vijay@techstargroup.com Reply to: vijay@techstargroup.com Role: Xamarin Mobile DeveloperLocation: Alpharetta, GA (Onsite)duration is 6 months Contract. Position Overview:Help shape the future of the client Technology. We are currently building a suite of Xamarin-based Mobile applications, known internally as “MobilePro”, to put in the hands of our store associates throughout the company. These applications will free our associates from the sales counter and enable them to perform critical functions (Point of Sale, Inventory, Receiving etc.) from anywhere at the branch. As a mobile developer, you would be responsible for both designing and developing these applications including how they interact with our APIs and back-end systems. KEY FACTORS FOR SUCCESS: Create, Enhance and Maintain our MobilePro applications. Support the existing MobilePro application currently installed on 2000+ devices at 375 of our 600 locations. Gather requirements and feedback from product owners and stakeholders for new MobilePro applications and enhancements. Work with other SiteOne development groups to integrate the MobilePro suite with new and existing systems. Implement best practices for mobile design and development. Create & maintain coding standards for Xamarin-based applications. Be a team player while being able to work independently. Engage in expanded contact with multiple departments and functional operations: actively participating in strategic business relationships and/or issues. Troubleshoot and resolve issues with deployed applications. Skills We Are Seeking Must Have Degree in an IT discipline or equivalent combination of education and work experience Minimum of 4 years of applications development experience in the Microsoft environment including design, coding, testing, and implementation. Proficiency in Object-Oriented and MVVM principles. 2+ years of Xamarin Forms experience with emphasis on Android-based development and good understanding of Android SDKs and tools. Strong knowledge of C# and Visual Studio. Preferred Skills Experience with Honeywell “Dolphin” mobile computers. Experience with Git, Jira, Azure DevOps and AirWatch. Experience with .NET MAUI. Ability to prepare technical documentation. Experience with or understanding of Sales and Supply Chain business functions.",
        "source": "Email",
        "date_posted": "2024-10-28 14:59:35-05:00",
        "unique_id": "192d4e248ec8001a",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]