[
    {
        "company": "State of Texas-Texas Health and Human Services Commission",
        "job_title": "Business analyst",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "10 months",
            "rate": "$45-$50/Hr on C2C"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Texas Medicaid systems"
            ],
            "primary": [
                "Agile delivery approach",
                "Information Technology projects",
                "Software development processes and practices"
            ],
            "secondary": [],
            "all": [
                "Business Analysis",
                "Texas Medicaid systems",
                "Agile delivery approach",
                "Information Technology projects",
                "Software development processes and practices"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Gunjan",
        "email": "gunjan@pinakastaffing.com",
        "jd": "From: GUNJAN, PINAKA STAFFING gunjan@pinakastaffing.com Reply to: gunjan@pinakastaffing.com Position: Business analyst 2()Location: (Remote)Contract for 10 monthsClient: State of Texas-Texas Health and Human Services Commission Rate- $45-$50/Hr on C2C JD:Job DescriptionJob DescriptionReviews, analyzes, and evaluates business systems and user needs. Formulates systems to parallel overall business strategies. Experienced with business process reengineering and identifying new applications of technology to business problems to make business more effective. Familiar with industry standard business process mapping, and reengineering. Prepares solution options, risk identification, and financial analyses such as cost/benefit, ROI, buy/build, etc. Writes detailed description of user needs, program functions, and steps required to develop or modify computer programs. Additional job details and special considerationsThe Worker will be a part of the team reporting to the Director of Medicaid IT-Contracted Systems and will assist with the delivery of multiple ARPA-funded system enhancements for applications that support Long Term Care and other ancillary applications. The Worker will be responsible for providing vendor oversight of the enhancement delivery and supporting the Product Owner to ensure that the delivery aligns with the customer's needs. II. CANDIDATE SKILLS AND QUALIFICATIONS Minimum Requirements:Candidates that do not meet or exceed the minimum stated requirements (skills/experience) will be displayed to customers but may not be chosen for this opportunity. YearsRequired/PreferredExperience5RequiredExperience as a Business Analyst.5RequiredExperience with Texas Medicaid systems.8PreferredExperience working with Information Technology projects.8PreferredKnowledge of software development processes and practices.5PreferredExperience with and Agile delivery approach.",
        "source": "Email",
        "date_posted": "2024-10-28 11:59:41-05:00",
        "unique_id": "192d431bb79e3efe",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]