[
    {
        "company": "Sligo Software Solutions, Inc.",
        "job_title": "Mid-Level Project Manager",
        "location": "New York, NY, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "SLG - 19 - 9951",
            "experience_required": "8+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Stakeholder Engagement",
                "Documentation",
                "Cross-Functional Coordination"
            ],
            "primary": [
                "Higher Education Project Management",
                "Data Collection",
                "Issue Log Management",
                "Knowledge Transfer"
            ],
            "secondary": [],
            "all": [
                "Project Management",
                "Stakeholder Engagement",
                "Documentation",
                "Cross-Functional Coordination",
                "Higher Education Project Management",
                "Data Collection",
                "Issue Log Management",
                "Knowledge Transfer"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Abhijith",
        "email": "amallavajhula@sligosoft.com",
        "jd": "Greetings from Sligo Software Solutions, Inc. !!SLIGO is a Software Development & IT Consulting company. We have around 100+ IT associates working with our esteemed clients across several domains such as IT, Banking, Healthcare, and Government. We have an urgent requirement for Mid-Level Project Manager position with our client. Role: Mid-Level Project Manager Location: Ny, New York Duration: 12 Months Job ID: SLG - 19 - 9951 Client: NY State Description Project manager will support the project director and chief academic technology officer in helping to coordinate this effort. Duties Assist in developing and maintaining detailed project plans. Schedule meetings, project deadlines, and follow-ups. Organize and coordinate project meetings, including agendas, note taking, documenting action items and decisions. Updating project documents with relevant information from meetings. Maintain project documents. Mandatory Requirements Experience (8+ Years) Plans, organizes and integrates cross-functional information technology projects that are significant in scope and impact. Requirements This is an 100% Onsite 36 Months of experience in project management in higher education. 36 Months of experience in project management, managing stakeholder engagement plans. 36 Months of experience in project management, collecting project data for review and distribution by various project team members 36 Months of experience in project management, processing and responding to project support inquiries from various external stakeholders. 36 months of experience in project management, managing issue logs. 36 months of experience in project management, documenting project requirements and assisting in preparing project design specifications. 36 months of experience in project management, documenting project information in support of knowledge transfer. Résumé Copy of Candidate Identification (i.e., Driver’s License/Green Card/Visa and Passport if applicable) Any documents referenced in the above Requested Qualifications (i.e., professional certifications, degrees, etc.)",
        "source": "Email",
        "date_posted": "2024-10-28 12:16:19-05:00",
        "unique_id": "192d440f544f7d22",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]