[
    {
        "company": "Procorp Systems",
        "job_title": "Java Developer with Middleware Integration experience",
        "location": "New York, NY, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 + Months",
            "rate": "DOE"
        },
        "skills": {
            "core": [
                "Java",
                "Middleware",
                "Microservices",
                "Relational Databases",
                "Scala"
            ],
            "primary": [
                "Distributed Caching",
                "Sybase",
                "Oracle",
                "MSSQL",
                "MQ",
                "Kafka",
                "Linux",
                "Analytical Skills",
                "Communication Skills",
                "Interpersonal Skills"
            ],
            "secondary": [
                "Agile",
                "DevOps",
                "Continuous Integration",
                "Cloud-ready Development",
                "Docker",
                "Confluent Kafka",
                "Automation",
                "Scripting Languages",
                "Python"
            ],
            "all": [
                "Java",
                "Middleware",
                "Microservices",
                "Relational Databases",
                "Scala",
                "Distributed Caching",
                "Sybase",
                "Oracle",
                "MSSQL",
                "MQ",
                "Kafka",
                "Linux",
                "Analytical Skills",
                "Communication Skills",
                "Interpersonal Skills",
                "Agile",
                "DevOps",
                "Continuous Integration",
                "Cloud-ready Development",
                "Docker",
                "Confluent Kafka",
                "Automation",
                "Scripting Languages",
                "Python"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Frank",
        "email": "frank@procorpsystems.com",
        "jd": "Hello Hope you’re doing well Title: Java Developer with Middleware Integration experienceLocation: New York, NY(In person interview is must)Duration: 12 + Months Rate : DOE Role ProfileAs a software developer, you will be responsible for the development and maintenance of next generation fraud screening platform for real-time fraud detection and prevention. You will work with our architecture team to ensure industrial and departmental best practices are being followed.Your role will be a focal point between our fraud analytics, reporting, and data governance teams. You will be a productive member of the development team and share core tasks as a member of an Agile squad. Responsibilities Commercial experience of core Java programming with strong proficiencyExperience of working with a functional programming languageExperience with Scala programming (or willingness on becoming an expert on it)Fundamental knowledge of MicroservicesStrong experience with distributed caching and relational databases, preferably with Sybase, Oracle, MSSQLMust Have experience with middleware- MQ, KafkaExperience of working in a Linux environmentStrong analytical and problem-solving skillsStrong oral and written communication skillsExcellent interpersonal skills and professional approachAbility to work effectively in a global and dynamic teamUnderstanding of distributed system design and infrastructure Skills DesiredExperience in the full software development life cycleExperience working in an agile team using Agile and DevOps practices & toolsExperience working with Continuous Integration systemsExperience with cloud-ready development, Docker containersExperience with Confluent KafkaExperience with automation and scripting languages (Python preferred)",
        "source": "Email",
        "date_posted": "2024-10-28 14:31:56-05:00",
        "unique_id": "192d4bd1c7a6bb68",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]