[
    {
        "company": "Tek Inspirations",
        "job_title": "Technical Project Manager",
        "location": "Baltimore, MD, USA",
        "full_location": {
            "city": "Baltimore",
            "state": "MD",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "5-7 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "Communication",
                "Collaboration",
                "Presentation Skills",
                "Marketing"
            ],
            "primary": [
                "HR",
                "Learning and Development",
                "Microsoft 365",
                "SharePoint",
                "PowerPoint"
            ],
            "secondary": [
                "Viva",
                "Jive",
                "Twiki",
                "AEM",
                "Stensul",
                "Blastmail",
                "SalesForce",
                "Interpersonal Skills",
                "Problem-solving",
                "Flexibility"
            ],
            "all": [
                "Project Management",
                "Communication",
                "Collaboration",
                "Presentation Skills",
                "Marketing",
                "HR",
                "Learning and Development",
                "Microsoft 365",
                "SharePoint",
                "PowerPoint",
                "Viva",
                "Jive",
                "Twiki",
                "AEM",
                "Stensul",
                "Blastmail",
                "SalesForce",
                "Interpersonal Skills",
                "Problem-solving",
                "Flexibility"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Inder Negi",
        "email": "inder.negi@tekinspirations.com",
        "jd": "From: Inder, Tek Inspirations inder.negi@tekinspirations.com Reply to: inder.negi@tekinspirations.com Title: Technical Project Manager, Marketing & Communications, HR, Technical WritingLocation: Hybrid-Baltimore, MD (Need Locals) Visa: USC, GC & EADDescription:This role is a vital, cornerstone of the Talent Development global team and this person will support the Tech Talent Marketing and Communications lead. Responsibilities include helping maintain our internal collaboration spaces, creating slides or presentation decks to facilitate communication with stakeholders and partners including the Technology Talent Learning Council, the Distinguished Engineers, CIO / Divisional leadership teams, Regional leadership teams.Responsibilities also includes1) Message development, document preparation, attendance at meetings with stakeholders and ongoing 1:1 communication.2) Marketing and Communication – design and implement internal communications program to educate the Technology organization regarding offerings; assist the effort to rebrand the function internally; manage the team Jive site; liaise with the Tech COO communications team for execution.3) This individual will report to the Tech Talent Marketing and Communications Lead (VP).The candidate should be a curious self-starter with a positive attitude who can navigate the broad organization with strong collaboration, program / project management, communication, and leadership skills, and comfort working independently at all levels.With regularity the candidate will produce presentations for the CIOs and other senior management groups that requires strong verbal and written presentation/ storytelling experience and skills. Candidate should be passionate about people development and leading continuous, innovative improvements in the same. The role has a global remit and will work closely with a globally distributed team.ResponsibilitiesEstablish and manage the various governance bodies that will direct the people development strategy for technology. The Technology Training Council will meet periodically to set direction, review the strategy and plan, remove blockers and provide resources / subject matter experts. Additional governing bodies may be established based on the programs and people development needsProvide CIOs and Technology divisional leadership and management with updates on the learning & development strategy / programs and marketing materials that enable them to maximize the development of people on their team, to contribute to a learning culture, and to increase team enjoyment and retention.Oversee maintenance of the Technology People Development Jive site and other marketing materials – critical components of our People Development communications and engagement strategy.Develop and oversee execution of marketing campaigns including email, posters, Jive site updates and other communication channels. Partner with Tech COO Communications team in execution of communications.Partner with regional COO teams to ensure awareness of central-driven programs, availability of marketing collateral and sharing of best practices. Experience:5-7 years of experience creating management level communication and presentation documents.5-7 years of experience within HR and/or Learning and Development, and with a globally distributed team.5+ years partnering with VP and ED level colleagues in developing and implementing strategic solutions.Optimally 2-5+ years working within the financial services industryA proven influencer with strong interpersonal skills, able to interact at all levels to drive successful outcomes in line with management prioritiesTrack record of integrity, grit, courage, flexibility, fortitude, positivity, and compassionComfortable working as a member of a global organization with team members, stakeholders, upper management, and clients in different regions across Asia, EMEA and North AmericaSkills:Strong collaboration skills and excellence orientationStrong project management and organization skills with the ability to multitask and prioritizeStrong verbal and written communications skillsDemonstrates initiative, judgment and thoughtful decision makingAdvanced PowerPoint skillsExperience with end-user collaboration/content management tools including Microsoft 365, SharePoint, Viva, Jive, Twiki, AEM, Stensul, Blastmail, SalesForceAbility to work under pressure and within tight deadlinesOpen-minded, independent, problem-solving, and highly motivated team player Thanks and Regards, Inder Negi Sr. Technical RecruiterTEK Inspirations LLC | Frisco, Texas E: inder.negi@tekinspirations.com",
        "source": "Email",
        "date_posted": "2024-10-28 10:38:52-05:00",
        "unique_id": "192d3e887422cce6",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Project Manager"
    }
]