[
    {
        "company": "",
        "job_title": "Sr. Oracle DBA",
        "location": "Atlantic City, NJ, USA",
        "full_location": {
            "city": "Atlantic City",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "15 years",
            "degree_required": "Bachelor's degree in engineering, math, or a science discipline (or equivalent experience)",
            "visa_sponsorship": "No visa sponsorship",
            "notice_period": "Not specified",
            "duration": "12+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle Database Administration",
                "Linux Administration",
                "Windows Administration",
                "Database Monitoring",
                "Database Maintenance"
            ],
            "primary": [
                "Troubleshooting",
                "Performance Analysis",
                "Data Loading",
                "Data Extraction",
                "Virtualized Environments",
                "Microsoft Excel",
                "Microsoft Access",
                "Microsoft PowerPoint",
                "Microsoft Word",
                "Microsoft Project",
                "Microsoft Visio",
                "Web Application Support",
                "Nginx",
                "Node.js",
                "VMware"
            ],
            "secondary": [
                "Problem-solving",
                "Organizational Skills",
                "Verbal Communication",
                "Written Communication",
                "Presentation Skills"
            ],
            "all": [
                "Oracle Database Administration",
                "Linux Administration",
                "Windows Administration",
                "Database Monitoring",
                "Database Maintenance",
                "Troubleshooting",
                "Performance Analysis",
                "Data Loading",
                "Data Extraction",
                "Virtualized Environments",
                "Microsoft Excel",
                "Microsoft Access",
                "Microsoft PowerPoint",
                "Microsoft Word",
                "Microsoft Project",
                "Microsoft Visio",
                "Web Application Support",
                "Nginx",
                "Node.js",
                "VMware",
                "Problem-solving",
                "Organizational Skills",
                "Verbal Communication",
                "Written Communication",
                "Presentation Skills"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Andrew Symonds",
        "email": "andrew@dewsoftech.com",
        "jd": "From: andrew, andrew andrew@dewsoftech.com Reply to: andrew@dewsoftech.com Sr. Oracle DBALocation: Atlantic City, NJ(Hybrid)Duration: 12+ months Job Description:We are seeking a highly skilled and motivated Senior Database Administrator to join our dynamic IT team. As a Senior Database Administrator you will play a crucial role in designing, implementing, and maintaining our infrastructure to ensure optimal performance, security, and reliability. You will collaborate with cross-functional teams to support the company's technical needs and contribute to the evolution of our architecture.Our client is need an experienced Oracle DBA ASAP. Location is important – they should be willing to work on-site at the client location in Atlantic City. With a requirement to be on-site in Atlantic City, NJ, at least once a week for production updates on the servers. This part of the role cannot be performed remotely. Responsibilities:Install, configure, and maintain Oracle Database and associated software in both physical and virtual environments.Provide expertise in troubleshooting Oracle issues on Linux (RHEL and CentOS) and Windows environments.Deliver technical solutions to a wide range of problems and user requests through an established trouble ticketing system.Support the Technical Support team by participating in after-hours coverage as needed.Provide database support and architecture designs for large infrastructure projects and deployments.Collaborate with development teams and provide infrastructure support and input into architecture design and onboarding plans for new systems, including diagrams and documentation.Provide operational support to development teams by participating in production release planning and software deployments.Manage database deployments (upgrades, updates, patches).Perform hardware maintenance and deployment (installations, equipment upgrades, and updates).Log and document all database requests with defined pertinent information to support analysis and reporting.Conduct database monitoring (log review, performance analysis and reporting, data loading, and extraction).Perform database maintenance (backups, upgrades, updates, patching, installation).Provide monthly analysis of database performance and include findings in the monthly status report.Conduct monthly analysis to identify trends and system performance issues, with findings reported in the monthly status report.Qualifications:Bachelor's degree in engineering, math, or a science discipline (or equivalent experience).15 years of proven experience as an Oracle Database Administrator for enterprise-wide systems.Demonstrated significant experience in Linux and Windows Administration, including best practices, CLI, and GUIs.Extensive experience with database monitoring (log review, performance analysis and reporting, data loading, and extraction).Extensive experience with database maintenance (backups, upgrades, updates, patching, installation).Familiarity with complex Linux/Windows environments and related protocols (HTTP/FTP/SCP/NFS, etc.).Experience with Microsoft Excel, Access, PowerPoint, Word, Project, and Visio.Experience supporting web applications and environments, including Nginx and Node.js.Experience with VMware and virtualized environments.Excellent problem-solving skills and the ability to troubleshoot complex database issues.Strong organizational, verbal/written communication, and presentation skills are essential.Must be a U.S. Citizen able to obtain a security clearance. Thanks & Regards Andrew SymondsSenior IT RecruiterPh.No:302-318-9133Email:andrew@dewsoftech.com",
        "source": "Email",
        "date_posted": "2024-10-28 16:04:36-05:00",
        "unique_id": "192d5323c151b993",
        "emp_type": [
            "third party"
        ],
        "tag": "Oracle DBA"
    }
]