[
    {
        "company": "Shrive Technologies",
        "job_title": "Data modelling and Analytics engineer",
        "location": "Washington, DC, USA",
        "full_location": {
            "city": "Washington",
            "state": "DC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "8+ Yrs.",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Power BI",
                "DAX",
                "SQL Query",
                "Databricks Lakehouse",
                "Azure Databricks",
                "DBT"
            ],
            "primary": [
                "Data Fabric",
                "Azure",
                "Azure Databricks"
            ],
            "secondary": [],
            "all": [
                "Power BI",
                "DAX",
                "SQL Query",
                "Databricks Lakehouse",
                "Azure Databricks",
                "DBT",
                "Data Fabric",
                "Azure"
            ],
            "with_experience": [
                "Power BI (8+ years)",
                "DAX (8+ years)",
                "SQL Query (8+ years)",
                "Databricks Lakehouse (8+ years)",
                "Azure Databricks (8+ years)",
                "DBT (8+ years)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Thanusha",
        "email": "thanusha@shrivetechnologies.com",
        "jd": "From: Thanusha, Shrive Technologies thanusha@shrivetechnologies.com Reply to: thanusha@shrivetechnologies.com Location : Washinton, DCJob Description (Posting). : Data modelling and Analytics engineer. 1. BackgroundOperations Monitoring and Rapid data solutions team, which is part of ITSFE is seeking a Data Modelling and Analytics Expert with specialized skills in Power BI Semantic Model development and DAX (Data Analysis Expressions) query implementation. The ideal candidate will also possess expertise in SQL Query, Databricks Lakehouse, Azure Databricks, and DBT to enhance our data analytics capabilities. 2. ObjectiveThe primary objective of this role is to design, implement and maintain a robust Semantic Model in Power BI, enabling users to create meaningful insights and analytics. The expert will also be responsible for developing complex DAX queries to support reporting needs while leveraging Databricks for data processing and transformation. 3. Scope of WorkThe Power BI Expert will be responsible for the following tasks: Semantic Model Development:o Design, develop and maintain a scalable and efficient Semantic Model tailored to business requirements.o Ensure the Semantic Model supports optimal performance and user experience.o Collaborate with stakeholders to gather requirements and validate model design. DAX Query Implementation:o Write and optimize DAX queries to create calculated columns, measures, and tables as needed.o Ensure DAX calculations are efficient and support the reporting framework.o Provide guidance on best practices for DAX usage among team members. Databricks and Azure Databricks Integration:o Utilize Databricks Lakehouse to manage large volumes of data effectively.o Implement data processing workflows using Azure Databricks, ensuring smooth integration with Power BI.o Develop and maintain ETL pipelines using Databricks to prepare data for analysis. DBT (Data Build Tool) Implementation:o Implement DBT for data transformation and modeling within the data pipeline.o Create modular and reusable DBT models that align with business requirements.o Collaborate with data engineers to ensure data quality and integrity. Advanced Hands-On Experiences:o Utilize advanced Power BI features, including row-level security, incremental data refresh, and Power Query for data transformation.o Implement custom visuals and integrate APIs to extend Power BI functionality.o Develop advanced analytical solutions using AI capabilities within Power BI, such as predictive analytics and machine learning models.o Leverage advanced data modeling techniques, including star schema design, to improve query performance and simplify data analysis. Reporting and Dashboard Creation:o Assist in developing interactive dashboards and reports based on the Semantic Model.o Implement user-friendly features that enhance data accessibility and visualization. Performance Monitoring and Optimization:o Monitor the performance of the Semantic Model, DAX queries, and data pipelines.o Implement strategies to optimize performance as data volumes grow. 4. Qualifications Proven experience with Power BI, including Semantic Model development and DAX. Expertise in SQL Query, Databricks Lakehouse, Azure Databricks, and DBT. Strong understanding of data warehousing concepts and ETL processes. Familiarity with data visualization best practices. Excellent analytical and problem-solving skills. Strong communication and interpersonal skills. (1.) To be responsible for providing technical guidance to a team of developers, enhancing their technical capabilities and increasing productivity. (2.) To conduct comprehensive code reviews, establish and oversee quality assurance processes, performance optimization , implementation of best practices and coding standards to ensure succeful delivery of complex projects. (3.) To ensure process compliance in the assigned moduleSkill (Primary) : Data Fabric-Azure-Azure DatabricksJob Title/RoleData modelling and Analytics engineer.Experience level required (Years)8+ Yrs.Mandatory required skillsAzure Databricks & Power BI is mustPreferred/Desired skillsAzure Databricks & Power BI is mustPlease share the Detailed Job DescriptionData modelling and Analytics engineer.1. BackgroundOperations Monitoring and Rapid data solutions team, which is part of ITSFE is seeking a Data Modelling and Analytics Expert with specialized skills in Power BI Semantic Model development and DAX (Data Analysis Expressions) query implementation. The ideal candidate will also possess expertise in SQL Query, Databricks Lakehouse, Azure Databricks, and DBT to enhance our data analytics capabilities.2. ObjectiveThe primary objective of this role is to design, implement and maintain a robust Semantic Model in Power BI, enabling users to create meaningful insights and analytics. The expert will also be responsible for developing complex DAX queries to support reporting needs while leveraging Databricks for data processing and transformation.3. Scope of WorkThe Power BI Expert will be responsible for the following tasks:Semantic Model Development:Design, develop and maintain a scalable and efficient Semantic Model tailored to business requirements.Ensure the Semantic Model supports optimal performance and user experience.Collaborate with stakeholders to gather requirements and validate model design.DAX Query Implementation:Write and optimize DAX queries to create calculated columns, measures, and tables as needed.Ensure DAX calculations are efficient and support the reporting framework.Provide guidance on best practices for DAX usage among team members.Databricks and Azure Databricks Integration:Utilize Databricks Lakehouse to manage large volumes of data effectively.Implement data processing workflows using Azure Databricks, ensuring smooth integration with Power BI.Develop and maintain ETL pipelines using Databricks to prepare data for analysis.DBT (Data Build Tool) Implementation:Implement DBT for data transformation and modeling within the data pipeline.Create modular and reusable DBT models that align with business requirements.Collaborate with data engineers to ensure data quality and integrity.Advanced Hands-On Experiences:Utilize advanced Power BI features, including row-level security, incremental data refresh, and Power Query for data transformation.Implement custom visuals and integrate APIs to extend Power BI functionality.Develop advanced analytical solutions using AI capabilities within Power BI, such as predictive analytics and machine learning models.Leverage advanced data modeling techniques, including star schema design, to improve query performance and simplify data analysis. Reporting and Dashboard Creation:Assist in developing interactive dashboards and reports based on the Semantic Model.Implement user-friendly features that enhance data accessibility and visualization.Performance Monitoring and Optimization:Monitor the performance of the Semantic Model, DAX queries, and data pipelines.Implement strategies to optimize performance as data volumes grow.4. QualificationsProven experience with Power BI, including Semantic Model development and DAX.Expertise in SQL Query, Databricks Lakehouse, Azure Databricks, and DBT.Strong understanding of data warehousing concepts and ETL processes.Familiarity with data visualization best practices.Excellent analytical and problem-solving skills.Strong communication and interpersonal skills.",
        "source": "Email",
        "date_posted": "2024-10-28 09:48:00-05:00",
        "unique_id": "192d3b92ed22e209",
        "emp_type": [
            "third party"
        ],
        "tag": "Azure Data Engineer"
    }
]