[
    {
        "company": "Excel Hire Staffing, LLC",
        "job_title": "Adabas Linux Database Administrator (DBA)",
        "location": "Quincy, MA, USA",
        "full_location": {
            "city": "Quincy",
            "state": "MA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Minimum of (10) years of Information Technology experience; Minimum of (5) years of experience as an Adabas Database Administrator",
            "degree_required": "Bachelor’s degree in computer science, Information Systems, Business Administration, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Adabas",
                "Linux",
                "AWS",
                "Azure",
                "Database Administration"
            ],
            "primary": [
                "RedHat",
                "SuSe",
                "CentOS",
                "Cloud-based services",
                "Software AG products"
            ],
            "secondary": [
                "Linux shell scripting",
                "Microsoft 365",
                "Excel",
                "Word",
                "PowerPoint",
                "Access",
                "Visio",
                "Jira Software",
                "SDLC"
            ],
            "all": [
                "Adabas",
                "Linux",
                "AWS",
                "Azure",
                "Database Administration",
                "RedHat",
                "SuSe",
                "CentOS",
                "Cloud-based services",
                "Software AG products",
                "Linux shell scripting",
                "Microsoft 365",
                "Excel",
                "Word",
                "PowerPoint",
                "Access",
                "Visio",
                "Jira Software",
                "SDLC"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Vinod Kumar",
        "email": "vinod.kumar@excelhirestaffing.com",
        "jd": "From: Vinod Kumar, Excel Hire Staffing, LLC vinod.kumar@excelhirestaffing.com Reply to: vinod.kumar@excelhirestaffing.com Adabas Linux Database Administrator (DBA)Must be from either MA, RI, CT or NH. I can only submit with ID Proof of residency. Work Site: Quincy, MA - HybridVisa - AnyDETAILED LIST OF JOB DUTIES AND RESPONSIBILITIES:Monitor and maintain the stability of Adabas/Natural applications supporting services in the Cloud-based, distributed Linus server environmentExperience supporting Linux operating systems: RedHat (preferred), SuSe, and CentOS. Understanding of Linux operating systems architecture and use of commands and utilities.Fundamental Cloud knowledge, AWS, AzureResponsible for supporting a broad range of Software AG (SAG) and other third-party vendor products to provide a stable technical infrastructureDesign and implement Adabas databases to ensure optimal performance and scalabilityParticipate with database support and provide timely resolution of database-related issuesUnderstanding knowledge of EntireX Communicator (RPC & ACI Protocol)Monitor database performance using tools like Adabas ManagerDevelop and implement backup and recovery procedures using Adabas Backup and Recovery ToolsOptimize database performance through query optimization, indexing, and buffer pool managementMonitor database using Adabas Performance Monitor to identify and resolve performance bottlenecksCommunicate effectively with business users and managers. Ensure project documentation, plans, and scheduling comply with agency initiatives and prioritiesAdministering the Natural development environmentExperience with Adabas Utilities: Use of utilities like ADAREP, ADABAS, ADASAV, ADAORD, etc. for database maintenance and reportingSecurity certificate configuration with Software AG products Upgrades, Configuration, and Management Of Software AG Products on Linux, Including: Upgrades, Configuration, and Management Of Software AG Products on Linux, Including:? Adabas ? EntireX Communicator? Adabas Encryption ? Natural Construct? ConnX ? Natural One? Entire Net-Work? Natural Security? Entire Connection? PredictLinux shell scriptingPerforming database startup and shutdownPerforming and restoring database backupsPerforming Adabas File ReordersUsing the Software AG Update Manager to apply updates/fixesUsing administration subsystems, including cron, to schedule system tasksQUALIFICATIONS: Strong relationship skills and ability to interact with internal and external stakeholders and managementDemonstrated proficiency in business modeling, process modeling, and data modelingKnowledge of methods and techniques of computer systems analysis, design, technical terminology, codes, and standard abbreviationsUsing the available system management tools (both console and Web-based System Management)Knowledge of MA HIX or other State Health ExchangeAbility to work with multiple vendorsStrong organizational skills, problem-solving aptitude, and attention to detailAbility to work well with others in a fast-paced, dynamic environmentStrong initiative, ability to manage multiple projects, and strong follow-through skillsDeliver oral and written instructions in a precise, understandable mannerStrong organizational skills with the ability to maintain accurate records and status reportingProficiency in Microsoft 365, Excel, Word, PowerPoint, Access, and VisioExperience with Jira SoftwareExperience with the SDLC (Software Development Life Cycle)EDUCATION AND CERTIFICATIONSBachelor’s degree in computer science, Information Systems, Business Administration, or a related field.Minimum of (10) years of Information Technology experienceMinimum of (5) years of experience as an Adabas Database Administrator",
        "source": "Email",
        "date_posted": "2024-10-28 13:40:33-05:00",
        "unique_id": "192d48e14fa7deca",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "DB Admin"
    }
]