[
    {
        "company": "Vyzeinc",
        "job_title": "Java Frontend with ReactJS and Typescript",
        "location": "New York, NY, USA",
        "full_location": {
            "city": "New York",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "onsite",
                "third party"
            ],
            "experience_required": "12+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "React",
                "Typescript",
                "JavaScript",
                "Angular",
                "HTML",
                "CSS"
            ],
            "primary": [
                "NodeJS",
                "Agile",
                "Scrum",
                "Cross-browser compatibility",
                "Secure coding"
            ],
            "secondary": [
                "Excellent communication",
                "Adaptability",
                "User Experience design"
            ],
            "all": [
                "React",
                "Typescript",
                "JavaScript",
                "Angular",
                "HTML",
                "CSS",
                "NodeJS",
                "Agile",
                "Scrum",
                "Cross-browser compatibility",
                "Secure coding",
                "Excellent communication",
                "Adaptability",
                "User Experience design"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Vyzeinc",
        "email": "roshan@vyzeinc.com",
        "jd": "Job Description -JOB TITLE : Java Frontend with ReactJS and Typescript (Onsite) New York5 Days Onsite - no exceptionsNeed Local NJ/NYExp Required : 12+ yearsThe client is an Investment Banking Client (cannot disclose the name at the moment)If shortlisted Interview immediately. RoleConsultants are expected to demonstrate Clients' cultural values every day -own it, simplify it, sense of urgency, thoughtful risk-taking, unlock potential, and be inclusive –with a relentless focus on our customers. As a Front End, you are expected to perform the following general duties:• Provide Design and Development Support• Understand application layering.• Be responsible for approaches for integrating backend services with user interface.• Work closely with the Product Manager on designing web pages to ensure the best User Experience.• Work closely with team members from across MasterCard to identify functional and system requirements.All About youThe ideal candidate for this position is expected to:• Have experience in developing UI using Modern Web Development frameworks such as Angular, React, NodeJS, JavaScript, and Typescript.• Possess the ability to write secure code in Angular, JavaScript, and Typescript.• Have at least 5+ years of experience working as an Angular developer.• Have knowledge of multiple front-end languages (JavaScript, HTML, CSS) and their libraries• Write cross-browser compatible code.• Have an excellent oral and written communication.• Be familiar with Agile/Scrum methodologies.• Have demonstrated ability to adapt quickly to new technologies.• Be a strong, confident communicator to communicate your ideas and thoughts to the relevant stakeholders.• Last but not the least, have a bias for action.",
        "source": "Email",
        "date_posted": "2024-10-28 21:07:46-05:00",
        "unique_id": "192d6278148c5fc6",
        "emp_type": [
            "onsite",
            "third party"
        ],
        "tag": "Java developer"
    }
]