[
    {
        "company": "Sibitalent",
        "job_title": "Sr. REACT ENGINEER with .net as a backend",
        "location": "Richmond, VA, USA",
        "full_location": {
            "city": "Richmond",
            "state": "VA",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Bachelor’s degree in Computer Science, Software Engineering, or a related field (or equivalent experience)",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "React 18",
                "TypeScript",
                "HTML5",
                "CSS3",
                "Graph QL",
                "REST APIs"
            ],
            "primary": [
                "Redux",
                "React Query",
                "Axios",
                "React Router",
                "Next.js",
                "Progressive Web Apps (PWAs)",
                "Webpack",
                "Vite",
                "Jest",
                "React Testing Library",
                "Azure YAML CI/CD pipelines",
                "Azure Bicep/ARM templates",
                "Git",
                "Git hub"
            ],
            "secondary": [
                "SASS",
                "CSS Modules",
                "Styled Components",
                "Material UI",
                "Module Federation",
                "micro frontend architectures",
                "Agile (Scrum and Kanban)"
            ],
            "all": [
                "React 18",
                "TypeScript",
                "HTML5",
                "CSS3",
                "Graph QL",
                "REST APIs",
                "Redux",
                "React Query",
                "Axios",
                "React Router",
                "Next.js",
                "Progressive Web Apps (PWAs)",
                "Webpack",
                "Vite",
                "Jest",
                "React Testing Library",
                "Azure YAML CI/CD pipelines",
                "Azure Bicep/ARM templates",
                "Git",
                "Git hub",
                "SASS",
                "CSS Modules",
                "Styled Components",
                "Material UI",
                "Module Federation",
                "micro frontend architectures",
                "Agile (Scrum and Kanban)"
            ]
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Arun Kushwaha",
        "email": "arun.kushwaha@sibitalent.com",
        "jd": "Hello, My name is Arun Kushwaha and I am a Staffing Specialist at Sibitalent. I am reaching out to you on an exciting job opportunity with one of our clients. Job DescriptionJob Title: Sr. REACT ENGINEER with .net as a backendLocation: Richmond, VA, LocalContract Length: 6 Months Seeking a React Developer with .Net in the backend, but stronger in the front end using ReactThis is a React role (vs someone who says they are full stack and mainly have a back-end resume). Purpose of the roleIt takes a passion for technology to develop ground-breaking products. Working collaboratively and creatively as part of a close-knit product team, you will be part of the development process from end to end: consulting users, carrying out experiments, tackling complex business problems and implementing new products. You can balance customer needs with business goals and know how to deliver technical solutions that enhance business value. Creative, curious, and highly analytical, you never stop learning and thrive on constant change in the digital marketplace. looking for an experienced Senior Frontend Software Engineer with a deep understanding of React 18 and TypeScript to join our dynamic development team focused on delivering iconic customer experiences for our Wholesale Dealer customers. You will play a key role in building and optimizing complex, scalable web applications while ensuring a seamless user experience. Experience with module federation and micro frontends will be highly valued as we aim to build modern, scalable applications for the future.What you will do – Essential ResponsibilitiesWork with fellow associates to understand the real-life challenges of our Wholesale customers and discover what they need to leverage Carmax as a partner to drive their business’ success.Develop and maintain responsive web applications using React 18 and TypeScript.Collaborate with colleagues in product design, product management and systems architecture to develop experimental solutions and bring great ideas to life.Market your innovative ideas internally and evolve them according to feedback and critique within an agile environment.Collaborate with UX/UI designers and product managers to translate designs into responsive UI components with a focus on user experience and accessibility.Stay up-to-date with modern frontend technologies and integrate best practices into the development process.Ensure high performance of front-end components, manage state efficiently and optimizing for maximum speed and scalability.Troubleshoot and debug applications, identifying performance bottlenecks and implementing solutions.Implement design systems, reusable components, and ensure consistency across the application.Write clean, maintainable, and well-documented code while adhering to best practices.Contribute to module federation and micro frontend architecture (if applicable) for scalable, independent deployments of application features.Conduct code reviews, pair programming, and foster a culture of continuous learning and improvement within the team by providing constructive feedback to peers.Mentor junior engineers, offering technical guidance and leadership when needed, fostering a culture of continuous learning and improvement.Qualifications:Bachelor’s degree in Computer Science, Software Engineering, or a related field (or equivalent experience).5+ years of experience in frontend development with React and TypeScript.Expertise in React 18, including hooks, context, and concurrent features.Experience with Graph QL and/or REST APIs.Proficiency in HTML5, CSS3, and modern styling approaches (e.g., SASS, CSS Modules, Styled Components, Material UI).Experience with modern React libraries for state management, data-fetching, and routing such as Redux, React Query, Axios, React Router etc.Experience with server-side rendering (Next.js) and Progressive Web Apps (PWAs).Solid experience with frontend build toolchain and bundlers (e.g., Webpack, Vite, RS Pack etc.).Experience with testing frameworks such as Jest and React Testing Library.Hands-on experience with Module Federation and implementing micro frontend architectures.Knowledge of Azure YAML CI/CD pipelines, Azure Bicep/ARM templates, version control (Git/Git hub), pull request workflows, and deployment strategies.Strong problem-solving skills and a passion for creating excellent user experiences.Excellent communication and collaboration skills with the ability to work collaboratively in a team.Experience working in Agile (Scrum and Kanban) development environments.",
        "source": "Email",
        "date_posted": "2024-10-28 16:32:59-05:00",
        "unique_id": "192d55085da07c95",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": ".net developer"
    }
]