[
    {
        "company": "kk soft tech",
        "job_title": "Full Stack Java Developer",
        "location": "St Paul, MN, USA",
        "full_location": {
            "city": "St Paul",
            "state": "MN",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "5+ years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Spring Framework",
                "React.js",
                "SQL",
                "Microservices"
            ],
            "primary": [
                "Java 8",
                "Java 17",
                "Spring Boot",
                "Hibernate",
                "RESTful APIs",
                "SOAP APIs",
                "Oracle",
                "MySQL",
                "JavaScript",
                "HTML5",
                "CSS3",
                "Redux",
                "JSON Web Tokens",
                "Spring Data JPA",
                "Vue"
            ],
            "secondary": [
                "Agile Development",
                "CI/CD",
                "Git",
                "YUI",
                "Jquery",
                "AWS",
                "EC2",
                "Serverless",
                "Lambda"
            ],
            "all": [
                "Java",
                "Spring Framework",
                "React.js",
                "SQL",
                "Microservices",
                "Java 8",
                "Java 17",
                "Spring Boot",
                "Hibernate",
                "RESTful APIs",
                "SOAP APIs",
                "Oracle",
                "MySQL",
                "JavaScript",
                "HTML5",
                "CSS3",
                "Redux",
                "JSON Web Tokens",
                "Spring Data JPA",
                "Vue",
                "Agile Development",
                "CI/CD",
                "Git",
                "YUI",
                "Jquery",
                "AWS",
                "EC2",
                "Serverless",
                "Lambda"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "sushant kumar",
        "email": "sushant.s@kksoftwareassociates.com",
        "jd": "From: sushant kumar, kk soft tech sushant.s@kksoftwareassociates.com Reply to: sushant.s@kksoftwareassociates.com Role: Full Stack Java Developer. Location Required: St Paul, Minnesota (Hybrid)Note: Java+Springboot+React.js+API+SQL. Who are we looking for?A Full Stack Java and React.js Developer. Technical Skills:· 5+ years’ experienceo Contributing to the architecture and design (architecture, design patterns, reliability, and scaling) of new and current systemso Service oriented architectureo Java 8,Java 17 / Spring framework/Spring boot / Spring batch/J2EE /Hibernate/ JSON / JS / JSP / Microservices / Restful APIs / SOAP APIs / Oracle & My SQLo Proficiency in React.js and its core principleso Strong JavaScript, HTML5, and CSS3 skillso Experience with popular React.js workflows (such as Redux)o Knowledge of modern authorization mechanisms, such as JSON Web Tokenso SQLo Gradleo JSF (JavaServer Faces), PrimeFaceso Spring Data JPAo UI development: Vue, HTML, and CSS· Comfort and experience with complex web applications and backend services in a modern product-focused development environment including things like version control (Git), test driven development, continuous integration and deployment (CI/CD) and agile development processes.· Capability to understand pros/cons and make appropriate recommendations related to rewrite vs. patching legacy application pages (familiarity with YUI/Jquery necessary)· Possess the ability and drive to work through challenging problems independently while keeping the team informed of progress and blockers.· Self-starter and independent with a strong sense of ownership and responsibility for work· Ability to handle ambiguity, communicate well with partner teams, and empathize with customers.· Excellent teamwork and interpersonal skills – ability to communicate the results of your efforts to project team members and stakeholders in a clear, concise, and timely manner.· Knowledge or interest in learning how to expand our utilization of AWS’s capabilities (EC2, Serverless, Lambda, and more). Process Skills:· Capable of analyzing requirements and develop software as per project defined software process.· Develop and peer review of LLD (Initiate/ participate in peer reviews)· Ability to execute test plans, create test cases test data and contribute to appropriate software (including programming languages) development life cycle methodology and application of specialized business and technical knowledge. Behavioral Skills:· Resolve technical issues of projects and explore alternate designs.· Participates as a team member and fosters teamwork by inter-group coordination within the modules of the project.· Effectively collaborates and communicates with the stakeholders and ensure client satisfaction.· Train and coach members of project groups to ensure effective knowledge management activity.",
        "source": "Email",
        "date_posted": "2024-10-28 12:47:56-05:00",
        "unique_id": "192d45de710fe7a5",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]