[
    {
        "company": "Technocraft solutions",
        "job_title": "Business analyst (Only Locals)",
        "location": "Lansing, MI, USA",
        "full_location": {
            "city": "Lansing",
            "state": "MI",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "136256",
            "experience_required": "16 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Understanding",
                "Analytical skills",
                "Organizational skills",
                "Problem-solving skills",
                "Azure DevOps",
                "VISIO",
                "MS office products"
            ],
            "primary": [
                "Requirements elicitation",
                "Gap fit analysis",
                "Business process reengineering",
                "Functional and Technical Specifications",
                "Agile development"
            ],
            "secondary": [
                "Customer service",
                "Stakeholder management",
                "IT infrastructure projects",
                "Public sector experience",
                "Knowledge transfer"
            ],
            "all": [
                "Business Understanding",
                "Analytical skills",
                "Organizational skills",
                "Problem-solving skills",
                "Azure DevOps",
                "VISIO",
                "MS office products",
                "Requirements elicitation",
                "Gap fit analysis",
                "Business process reengineering",
                "Functional and Technical Specifications",
                "Agile development",
                "Customer service",
                "Stakeholder management",
                "IT infrastructure projects",
                "Public sector experience",
                "Knowledge transfer"
            ],
            "with_experience": [
                "Business Understanding",
                "Requirements elicitation",
                "Gap fit analysis",
                "Agile development"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Harsh Tiwari",
        "email": "harsh.tiwari@technocraftsol.com",
        "jd": "From: Harsh Tiwari, Technocraft solutions harsh.tiwari@technocraftsol.com Reply to: harsh.tiwari@technocraftsol.com Job Title: Business analyst (Only Locals)Job ID: 136256 Location: Lansing, MI (DTMB)Duration: 12 MonthsTop Skills & Years of Experience Required:• Experience working with multiple agencies and/or vendors and/or departments in an enterprise environment• Business Understanding• Identifies systemic gaps and possible solutions for continuous improvements and modernization.• Excellent analytical, organizational, and problem-solving skills.• Extensive experience using Azure DevOps, VISIO, MS office productsCandidates must have a minimum of 16 16 years of general BA experience.• Facilitation of requirements elicitation meetings; experience with gap fit analysis andrequirements refinement.• Reviews, analyzes, and evaluates business systems and user needs. Formulates systems toparallel overall business strategies. Experienced with business process reengineering andidentifying new applications of technology to business problems to make business moreeffective. Familiar with industry standard (including Legacy, Core, and Emerging technologies),business process mapping, and reengineering. Prepares solution options, risk identification, andfinancial analyses such as cost/benefit, ROI, buy/build, etc. Writes detailed description of userneeds, program functions, and steps required to develop or modify computer programs.• Prepare and document Functional and Technical Specifications for reporting and datawarehouse work. Assist with business warehouse/intelligence support and enhancements.Develops RFPs. Assist in deployment and management of end-user reporting tools andplatforms. Work with IT and business project teams to understand reporting and datawarehousing requirements and propose solutions. Document and provide knowledge transfer tothe rest of the Enterprise Reporting Team for all solutions.• Reviews, analyzes, and evaluates business systems and user needs. Formulates systems toparallel overall business strategies. Has knowledge of commonly used concepts, practices, andprocedures within a particular field. Familiar with relational database concepts, and client-serverconcepts. Relies on limited experience and judgment to plan and accomplish goals. Performs avariety of tasks. Works under general supervision; typically reports to a project manager. Acertain degree of creativity and latitude is requiredSpecific Position Experience Required:• Minimum of 7 years conducting business process review and requirements elicitation anddocumentation• Minimum of 5 years developing and/or managing user stories on Agile development project(s)• Minimum of 2 years working directly with senior management in facilitating discussions todetermine strategy, develop road maps and/or gain consensus to resolve opposing positions• Minimum of 2 years supporting the development of or compliance to statement of work and/orother work agreements/contracts• Minimum of 2 years working on projects developing/implementing IT solutions for public use• Minimum of 1 year working on IT infrastructure projects• Minimum of 1 year working with programs governed by state and/or federal regulationsDTMB Agency Services is looking for a Business Analyst 5 4 to provide excellent customer servicesupporting both project and work request needs. This person will have the opportunity to join inflightprojects focused on implementing new IT solutions to provide increased efficiencies and public support.These IT solutions leverage current technologies and include working with subject matter experts,vendors, and the public. Key responsibilities include being the liaison between DTMB and the projectstakeholders, as well as providing expert facilitation and elicitation to help develop strategy andrequirements for future enhancements and related work projects. In addition, as part of the overallsupport for Agency Partners, this person will be a critical member of the DTMB Agency Services BusinessAnalyst team, participating in various related work requests and contributing to the operationalactivities of the BA team. The ideal candidate will possess SOM DTMB process experience; strongfacilitator experience for requirements elicitation; experience with gap fit analysis and requirementsrefinement for an inflight project.Customer service and being a champion to ease Agency compliance with DTMB policies and practicesare key performance expectations for this person. They must be able to quickly gain a workingunderstanding of applicable constraints and enablers and help Agency Partners navigate those for thesuccess for their projects and work requests. A common day would include attendance in variousstanding meetings for each of the projects, as well as those that include the BA team – being able toconfidently speak to current activities in each, listening to understand needs, and helping to provideinput that assists in meeting the objectives of the respective meetings. In addition, related work willinclude preparing for and facilitating discussions with stakeholders to complete analysis and drive toconsensus for requirements and priorities. Session outcomes will be captured in notes, specificationdocuments and/or user stories.DTMB Agency Services welcomes candidates that are self-directed, well organized, confident in theirability to build relationships, quick to come up to speed on new assignments, and able to be flexible andadaptable to changing needs and/or direction.",
        "source": "Email",
        "date_posted": "2024-10-28 08:33:19-05:00",
        "unique_id": "192d37559b33a9dc",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]