[
    {
        "company": "Simpalm",
        "job_title": "Senior Business Analyst",
        "location": "Dallas, TX, USA",
        "full_location": {
            "city": "Dallas",
            "state": "TX",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "Minimum 10 years",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Business Analysis",
                "Requirements Gathering",
                "User Story Development",
                "Agile methodologies"
            ],
            "primary": [
                "Communication",
                "Collaboration",
                "Problem-Solving",
                "Quality Assurance Support"
            ],
            "secondary": [
                "Jira",
                "Confluence"
            ],
            "all": [
                "Business Analysis",
                "Requirements Gathering",
                "User Story Development",
                "Agile methodologies",
                "Communication",
                "Collaboration",
                "Problem-Solving",
                "Quality Assurance Support",
                "Jira",
                "Confluence"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Shane",
        "email": "shane@simpalm.com",
        "jd": "From: shane, Simpalm shane@simpalm.com Reply to: shane@simpalm.com We are seeking a motivated and assertive Business Analyst to join one of our direct clients in Dallas, TX. This role will support an engineering team by refining business requirements and translating them into actionable user stories, playing a critical part in the software development lifecycle. This role requires someone with a strong personality, excellent communication skills, and a drive to \"get things done.\" If you have experience in fast-paced environments and are skilled at bridging technical and business requirements, we’d love to hear from you. Tittle: Senior Business Analyst Role is Hybrid position Location: Dallas, TX (Local Candidate) Linkedin is Mandatory to Share, with out linkedIn candidate will be rejected Key Responsibilities: Requirements Gathering and Analysis: Work with the Product Manager and relevant stakeholders to gather, analyze, and document business requirements. User Story Development: Translate high-level requirements into clear and detailed user stories, including acceptance criteria, that are actionable for engineering teams. Collaboration: Act as a key point of contact between the engineering and product teams, facilitating clear communication and ensuring alignment on priorities. Documentation: Maintain organized and accessible documentation, including requirements, user stories, and business process flows. Problem-Solving: Proactively identify project risks, address bottlenecks, and propose solutions to ensure timely delivery of projects. Quality Assurance Support: Assist with the development and validation of acceptance criteria, support testing, and help troubleshoot any issues that arise. Requirements: Experience: Minimum 10 years as a Business Analyst in a software development or technology-focused environment. Communication: Excellent verbal and written communication skills, with the ability to convey technical concepts to non-technical stakeholders. Personality: Confident, assertive, and solution-oriented with a \"get things done\" attitude. Technical Knowledge: Familiarity with Agile methodologies, user story creation, and backlog management tools (e.g., Jira, Confluence). Collaboration: Demonstrated experience working closely with engineering and product management teams to align on goals and deliver results.",
        "source": "Email",
        "date_posted": "2024-10-28 10:23:29-05:00",
        "unique_id": "192d3d9ab5fdb3e5",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]