[
    {
        "company": "Sonitalent Corp",
        "job_title": "Business Analyst",
        "location": "Charlotte, NC, USA",
        "full_location": {
            "city": "Charlotte",
            "state": "NC",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6+ months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Domain Business Analyst",
                "Retirement/Group Insurance/Institutional Banking",
                "Record Keeping",
                "Jira"
            ],
            "primary": [],
            "secondary": [
                "Money Movement",
                "Plan Management"
            ],
            "all": [
                "Domain Business Analyst",
                "Retirement/Group Insurance/Institutional Banking",
                "Record Keeping",
                "Jira",
                "Money Movement",
                "Plan Management"
            ],
            "with_experience": []
        },
        "job_type": [
            "onsite"
        ],
        "contact_person": "Abdul Rahman",
        "email": "abdul.rahman@sonitalentcorp.com",
        "jd": "HiI hope you are doing well,We are looking for a “Business Analyst” Please let me know if you are looking for this role and send me your updated resume also.Job Role: Business AnalystLocation: Charlotte, NC (Onsite) LocalDuration: 6+ monthsInterview: Phone/ Skype-2RoundsLinkedIn Must haveJob Description: Must have skills:1. Domain Business Analyst2. Retirement/Group Insurance/Institutional Banking3. Record Keeping4. JiraWhat are some “nice-to-have” skills:1. Money Movement2. Plan ManagementResponsibilities:As a Business Analyst, you will be responsible for analyzing an organization and designing its processes and systems. You will assess the business model and its integration with technology, gather and synthesize information, and define the future state and/or business solution. Additionally, you will be expected to be a Subject Matter Expert (SME) with deep knowledge and experience, have influencing and advisory skills, and be responsible for team decisions. You will engage with multiple teams and contribute to key decisions, as well as provide solutions to problems that apply across multiple teams. Intermediate proficiency in Atlassian Jira Align is required. Advanced proficiency in Retirement Planning Services required, intermediate proficiency in Business Process Design is recommended.Conduct in-depth analysis of business processes, systems, and data to identify opportunities for improvement and optimization.Partner with key stakeholders across the organization to understand needs, challenges, and objectives.Elicit, document, and analyze onboarding requirements for new retirement plans.Develop clear and concise user stories and functional specifications.Write detailed business requirements for setting up the initial plan, contribution limit monitoring, vesting, loans, etc. as per the retirement plan contract.Collaborate with IT teams to translate business requirements into technical specifications.Maintain and track query clarification related to plan implementation and requirement traceability matrix.Manage project scope, timelines, and resources, ensuring projects are delivered on time and within budget.Collaborate with Business and ensure the right data elements are implemented as part of initial configurations.Review and validate the implementation of plan requirements on the core and peripheral systems.Evaluate potential solutions and technologies, assessing their alignment with contractual agreements, effectiveness, and impact.Support test analyst(s) by providing inputs and clarification on various validation scenarios.Revalidate post-production functional defects (if any).Create and maintain comprehensive documentation, including requirements documents, process maps, and user guides.Present findings and recommendations to stakeholders in a clear and compelling manner.Stay up to date on industry trends and best practices in retirement services.",
        "source": "Email",
        "date_posted": "2024-10-28 15:05:04-05:00",
        "unique_id": "192d4db70cdf897e",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Business Analyst"
    }
]