[
    {
        "company": "Vyze Inc",
        "job_title": "Database Architect",
        "location": "Albany, NY, USA",
        "full_location": {
            "city": "Albany",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "job_code": "",
            "experience_required": "84 Months Experience developing Oracle PL/SQL using advanced PL/SQL programming techniques.",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "30 months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Oracle PL/SQL",
                "SQL Plus",
                "SQL Developer",
                "SQL Loader",
                "ETL techniques"
            ],
            "primary": [
                "Database design",
                "Data modelling",
                "Performance tuning",
                "Debugging PL/SQL"
            ],
            "secondary": [
                "Windows desktops",
                "AIX servers",
                "Linux servers",
                "Java applications",
                "Powebuilder"
            ],
            "all": [
                "Oracle PL/SQL",
                "SQL Plus",
                "SQL Developer",
                "SQL Loader",
                "ETL techniques",
                "Database design",
                "Data modelling",
                "Performance tuning",
                "Debugging PL/SQL",
                "Windows desktops",
                "AIX servers",
                "Linux servers",
                "Java applications",
                "Powebuilder"
            ]
        },
        "job_type": [
            "remote",
            "onsite"
        ],
        "contact_person": "Ravina",
        "email": "ravina@vyzeinc.com",
        "jd": "From: Ravina, Vyze Inc ravina@vyzeinc.com Reply to: ravina@vyzeinc.com Job Description -Job Title : Database Architect ( 50% REMOTE )Location : Albany, NY ( Need Local )Duration : 30 months Work Auth. : USC , GCMode of Interview : WebcastingProvide a short description of the Position: Database design and development for Environmental Health projectsProvide a complete list of the day-to-day tasks to be performed by the Selected Candidate: The Database Architect will be responsible for, but not limited to, the analysis and design of database objects and data collection systems, including the transformation of legislative requirements into system functionality; data modelling; responsible for software development tasks including coding, testing, and implementation; prepares technical and user documentation. What type of software is typically used by the Agency: Windows desktops, Oracle databases, Powebuilder and Java applicationsWhat type of hardware is typically used by the Agency: Windows desktops, AIX and Linux serversPosition Job Title Description: Determines database structural requirements by analyzing client operations, applications, and programming; reviews objectives with clients; evaluates current systems; provides database support by coding utilities, responding to user questions, and resolving problems.Position Skill Level Description: 84+ months: Candidate is able to provide guidance to large teams and/or has extensive industry experience and is considered at the top of his/her field.List all the Position REQUESTED Qualifications:84 Months Experience developing Oracle PL/SQL using advanced PL/SQL programming techniques.84 Months Experience using Oracle development tools such as SQL Plus, SQL Developer, and SQL Loader for programming and maintaining applications.84 Months Experience designing and implementing logical and physical database models, including indexes, primary keys, foreign keys, and constraints.48 months Experience performing Extract, Transform, and Load (ETL) techniques.24 months Experience optimizing, performance tuning, and debugging PL/SQLDescription ITS staff will provide orientation and guidance so that the consultant can get an understanding of the applications they will support and the environment in which they will work.Program staff will provide informal user training so that the consultant can gain an understanding of the application from an end user perspective.The NYS Governor's Office of Employee Relations (GOER) sets mandatory training requirements that must be completed by full-time, part-time, seasonal, per diem employees, and consultants. Examples include but are not limited to: Security Awareness, Preventing Sexual Harassment and Preventing Workplace Violence. By taking these courses, all state employees will be informed of important policies and procedures that affect day-to-day operations and interactions to achieve an overall better workforce and environment.There may be additional Department of Health (DOH) and/or Office of Information Technology Services (OITS) agency-specific mandated training.What type and/or manner, of knowledge transfer is requested during the Engagement: Prepare documentation and conduct formal/informal training sessions in order to effectively transfer knowledge in the areas needed for on-going support of applications and projects. For example, the knowledge transfer may include, but is not limited to:Prepare Word documents, process diagrams, etc.Maintain and explain procedural documentation for administrative functions and testing procedures.In some cases, step-by-step instructions may be required.Explain the documentation, expand and revise the documentation as requested to further enhance the documentation's usability and understandability.Train State staff and other consultants such that State staff and other consultants can effectively and efficiently provide support.Periodic mentoring/training sessions may also be required for effective knowledge transfers.",
        "source": "Email",
        "date_posted": "2024-10-28 14:13:57-05:00",
        "unique_id": "192d4aca5f4891d2",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Oracle DBA"
    }
]