[
    {
        "company": "NAM Info Inc",
        "job_title": "SAP Project Manager & MDG",
        "location": "Somerset, NJ, USA",
        "full_location": {
            "city": "Somerset",
            "state": "NJ",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "contract",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "6 to 12 Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Project Management",
                "MDM Implementation",
                "Data Migration",
                "Integration Initiatives"
            ],
            "primary": [
                "Stakeholder Engagement",
                "Training",
                "Business Analysis"
            ],
            "secondary": [
                "Communication",
                "Collaboration",
                "Technical Support"
            ],
            "all": [
                "Project Management",
                "MDM Implementation",
                "Data Migration",
                "Integration Initiatives",
                "Stakeholder Engagement",
                "Training",
                "Business Analysis",
                "Communication",
                "Collaboration",
                "Technical Support"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Venki R",
        "email": "venki@nam-it.com",
        "jd": "From: Venki, NAM INFO INC venki@nam-it.com Reply to: venki@nam-it.com Hi Greetings from NAM Info Inc!!! Please find the below immediate requirements from my Client. Please revert me back with updated copy of resume, Visa status and contact details Note: Send resumes to Venki@nam-it.com for quick submittals. Position: SAP Project Manager & MDGLocation: Hybrid-Somerset, NJDuration: 6 to 12 Months Contract JD:Project Management and Implementation:Lead or support MDM implementation projects, including data migration, and integration initiatives.Collaborate with IT teams to define requirements for MDM tools and technologies.Provide training and support to business users on master data management best practices. Stakeholder Engagement:Work with business leaders to translate master data requirements into actionable business plans.Serve as a trusted advisor, helping clients navigate complex MDM challenges and delivering tailored solutions.Communicate effectively with technical and non-technical stakeholders to ensure alignment and success. Thanks & Regards...Venki RSenior Executive (Staffing)Nam Info Inc Email : Venki@nam-it.comWebsite - www.nam-it.com2525 US Highway 130, Building D, Suite 2-Cranbury, NJ-08512 “The harder you work, the luckier you get” Follow us on: USA | CANADA | INDIA MBE Certified Company , E Verify Company Note: This is not an unsolicited mail. Under Bill 1618 Title III passed by the 105th USA Congress this email cannot be considered as spam as long as we include our contact information and an option to be removed from our emailing list. If you have received this message in error or, are not interested in receiving our emails, please accept our apologies. To be removed from our mailing list, please reply with the subject line \"REMOVE\". All removal requests will be honored ASAP. We sincerely apologize for any inconvenience caused to you",
        "source": "Email",
        "date_posted": "2024-10-28 09:17:24-05:00",
        "unique_id": "192d39d29dc33bbf",
        "emp_type": [
            "contract",
            "third party"
        ],
        "tag": "Project Manager"
    }
]