[
    {
        "company": "W3Global",
        "job_title": "BA with Veeva Vault application exp",
        "location": "USA",
        "full_location": {
            "city": "",
            "state": "",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "third party"
            ],
            "job_code": "",
            "experience_required": "Not specified",
            "degree_required": "Bachelor's degree in any field",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Veeva Vault",
                "Business Analysis",
                "Waterfall methodologies",
                "Agile methodologies",
                "MS Office applications"
            ],
            "primary": [
                "Patient recruitment software",
                "Retention software",
                "Software engineering",
                "Architecture",
                "UX design"
            ],
            "secondary": [
                "Risk assessment",
                "Problem resolution",
                "Negotiation",
                "Influencing skills",
                "Excellent written and verbal communications",
                "Proactive",
                "Strong business acumen",
                "Excellent follow-through"
            ],
            "all": [
                "Veeva Vault",
                "Business Analysis",
                "Waterfall methodologies",
                "Agile methodologies",
                "MS Office applications",
                "Patient recruitment software",
                "Retention software",
                "Software engineering",
                "Architecture",
                "UX design",
                "Risk assessment",
                "Problem resolution",
                "Negotiation",
                "Influencing skills",
                "Excellent written and verbal communications",
                "Proactive",
                "Strong business acumen",
                "Excellent follow-through"
            ]
        },
        "job_type": [
            "remote"
        ],
        "contact_person": "Nora West",
        "email": "nora.west@w3global.com",
        "jd": "Hello, BA with Veeva Vault application exp - NJ (Remote)See JD below-We are looking for a business analyst to assist with our mobile app projects within OneTech. Highly organized. Love to work with and refine existing processes as well as develop new ones Ability to multitask and work in a cross-functional team environment. Experience with patient recruitment and or retention software Background in software engineering, architecture and or UX design preferred Primary Business Analyst on several small to medium complexity projects. Bachelor's degree in any field. Demonstrated knowledge of both traditional Waterfall and Agile Lean methodologies. Experience in converting business requirements and functional requirements to use cases, epics, and user stories with acceptance criteria. Demonstrated ability to quantify resource requirements and measure and communicate proposed project benefits. Strong risk assessment, problem resolution, negotiation, and influencing skills. Demonstrated ability to engage both developers and business partners to achieve target outcomes. Excellent written and verbal communications; Fantastic listener. Self-starter, proactive, strong-business acumen, excellent follow-through. Proficient with MS Office applications (e.g. Visio, Word, Excel, Power Point, etc.)(1.) To conduct in-depth analysis to understand client needs, challenges, and opportunities, translating them into clear and concise functional specifications. (2.) To analyze available options, considering feasibility, cost, and alignment with business requirements and suggest solutions.(3.) To participate and facilitate the walkthrough to brief the functional specification mapping to business requirements.(4.) To prepare and or aid the preparation of test cases in line with functional requirements(5.) Tackle complex business problems and develop innovative solutions.",
        "source": "Email",
        "date_posted": "2024-10-28 12:01:08-05:00",
        "unique_id": "192d4330db407031",
        "emp_type": [
            "third party"
        ],
        "tag": "Business Analyst"
    }
]