[
    {
        "company": "ITech US INC",
        "job_title": "Java Architect",
        "location": "Buffalo, NY, USA",
        "full_location": {
            "city": "Buffalo",
            "state": "NY",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "experience_required": "Not specified",
            "degree_required": "Not specified",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "12+ Months",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "Systems Analysis",
                "Design",
                "Development",
                "Banking Domain Experience"
            ],
            "primary": [
                "Technical Specifications",
                "Project Management",
                "Debugging",
                "Technical Leadership"
            ],
            "secondary": [
                "Diversity Promotion",
                "Risk Management",
                "Vendor Software Evaluation",
                "Documentation Review"
            ],
            "all": [
                "Java",
                "Systems Analysis",
                "Design",
                "Development",
                "Banking Domain Experience",
                "Technical Specifications",
                "Project Management",
                "Debugging",
                "Technical Leadership",
                "Diversity Promotion",
                "Risk Management",
                "Vendor Software Evaluation",
                "Documentation Review"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Manasa Salla",
        "email": "manasa.s@itechus.net",
        "jd": "Hello, This is Manasa from ITech US inc. Given below are the details of the position with one of our clients and was wondering if you would be interested or can recommend someone who would be interested in this jobJava Architect Location : Buffalo NY , Hybrid – 3 days from Client Location Need Locals Duration : 12+ Months Banking Domain experienceComplete and oversee basic to complex systems analysis, design and development. Play a key role as an individual contributor on complex projects. Maintain an excellent functional understanding of the supported application(s).Direct and monitor less experienced resources and coordinate development tasks on small to large scope projects.Assist with preparing and managing the technical component of project plans.Participate with other Development, Operations and Technology staff in overall systems development direction from technical analysis to user acceptance testing. Prepare and review test data and execute detailed test plans. Complete any required debugging.Evaluate and understand complex interrelationships and effects among programs, interfacing applications and platforms. Provide highly analytical consulting and leadership in identifying and implementing new uses of information technologies to assist business units in meeting strategic objectives.Prepare thorough, clear technical and functional specifications and update systems documentation. Prepare charts, tables and diagrams to assist in analyzing problems. Review documentation prepared by less experienced staff.Maintain efficient operation and effectiveness of supported applications.Recommend new technology, policies or processes to benefit the organization and improve deficiencies. May lead or participate in technical evaluations of vendor software.Follow and promote use of development standards and procedures.Maintain a good understanding of the business being supported and its functions, processes, operations and strategic direction.Understand and adhere to the Company’s risk and regulatory standards, policies and controls in accordance with the Company’s Risk Appetite. Identify risk-related issues needing escalation to management.Promote an environment that supports diversity and reflects the M&T Bank brand.Maintain M&T internal control standards, including timely implementation of internal and external audit points together with any issues raised by external regulators as applicable.Complete other related duties or projects as required, which may include playing a lead role in due diligence, cost/benefit analysis or business study activities.Offshore Java developers SE 1 or 2Provides designs and software solutions that enable the technical direction in the development of new or existing applications to solve basic to complex problems or enhancements. Serves as a principal application designer for major modifications effectively using analytical and technical skills and available technology and tools in the evaluation of client requirements and processes. Provides solutions that are technologically sound. May complete day-to-day support activities and special projects. Often directs and monitors the activities of less experienced personnel.With banking experience Thanks & RegardsManasa SallaSr Technical RecruiteriTech US, Incmanasa.s@itechus.netLinkedIn: https://www.linkedin.com/in/manasa-salla-0836711a8",
        "source": "Email",
        "date_posted": "2024-10-28 18:05:52-05:00",
        "unique_id": "192d580faf45b82f",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]