[
    {
        "company": "Vyzeinc",
        "job_title": "Java Full Stack Developer (React)",
        "location": "Hoffman Estates, IL, USA",
        "full_location": {
            "city": "Hoffman Estates",
            "state": "IL",
            "country": "USA"
        },
        "job_details": {
            "employment_type": [
                "full-time",
                "third party"
            ],
            "job_code": "",
            "experience_required": "10+ years",
            "degree_required": "Bachelor’s degree in Computer Science, Software Engineering, or a related field.",
            "visa_sponsorship": "Not specified",
            "notice_period": "Not specified",
            "duration": "Not specified",
            "rate": "Not specified"
        },
        "skills": {
            "core": [
                "Java",
                "React",
                "Spring Boot",
                "Hibernate",
                "RESTful API"
            ],
            "primary": [
                "HTML",
                "CSS",
                "JavaScript",
                "Redux",
                "SQL",
                "NoSQL",
                "Git",
                "CI/CD"
            ],
            "secondary": [
                "AWS",
                "Azure",
                "Docker",
                "Kubernetes",
                "JUnit",
                "Mockito",
                "Selenium",
                "Jest",
                "Agile methodologies",
                "Jira",
                "Trello"
            ],
            "all": [
                "Java",
                "React",
                "Spring Boot",
                "Hibernate",
                "RESTful API",
                "HTML",
                "CSS",
                "JavaScript",
                "Redux",
                "SQL",
                "NoSQL",
                "Git",
                "CI/CD",
                "AWS",
                "Azure",
                "Docker",
                "Kubernetes",
                "JUnit",
                "Mockito",
                "Selenium",
                "Jest",
                "Agile methodologies",
                "Jira",
                "Trello"
            ]
        },
        "job_type": [
            "hybrid"
        ],
        "contact_person": "Roshan",
        "email": "roshan@vyzeinc.com",
        "jd": "From: Roshan, Vyzeinc roshan@vyzeinc.com Reply to: roshan@vyzeinc.com Role:Java Full Stack Developer (React)Location:Hoffman Estates, IL (Local Candidates Only within 50 miles)Work Mode:Day 1 Hybrid OnsiteLinkedIn Profile:Mandatory (Should not be created recently; must be at least 6 years old for senior candidates)Job Description:We are seeking a Java Full Stack Developer with expertise in React to join our dynamic team. The ideal candidate will have a strong grasp of both front-end and back-end technologies, enabling them to develop robust, scalable web applications with exceptional user experiences.Key Responsibilities:Full Stack Development:Design, develop, and maintain web applications using Java for back-end and React for front-end.Ensure responsive UI and seamless performance across devices.API Integration:Collaborate with back-end developers to create and integrate RESTful APIs for smooth data flow.User Experience & Design:Work closely with UI/UX designers to build visually appealing and user-friendly interfaces.Follow web design and accessibility best practices.Code Quality & Reviews:Write clean, maintainable code following best practices.Participate in code reviews and provide constructive feedback.Testing & Debugging:Conduct unit testing and debug applications to ensure performance and functionality meet standards.Collaboration & Agile Participation:Engage in Agile development processes, including daily stand-ups, sprint planning, and retrospectives.Collaborate with cross-functional teams to meet delivery timelines.Documentation:Maintain clear documentation of code, architecture, and processes for future reference and onboarding.Qualifications:Education:Bachelor’s degree in Computer Science, Software Engineering, or a related field.Experience:10+ years of experience in full-stack development with a strong focus on Java and React.Hands-on experience with front-end technologies: HTML, CSS, JavaScript, React, Redux.Strong expertise in back-end development: Java, Spring Boot, Hibernate.Technical Skills:Proficient in RESTful API design and development.Familiar with SQL/NoSQL databases.Hands-on experience with Git and CI/CD practices.Soft Skills:Excellent communication and collaboration skills.Strong analytical and problem-solving abilities.Ability to work independently and within a fast-paced team environment.Preferred Skills:Experience with cloud platforms like AWS or Azure and containerization tools (Docker, Kubernetes).Familiarity with testing frameworks like JUnit, Mockito, or Selenium, Jest.Understanding of Agile methodologies and experience using project management tools such as Jira or Trello.This is a great opportunity for candidates looking to work in a challenging, Agile environment with a mix of front-end and back-end development responsibilities. Only local candidates within a 50-mile radius of Hoffman Estates, IL will be considered.",
        "source": "Email",
        "date_posted": "2024-10-28 10:58:00-05:00",
        "unique_id": "192d3f9427b90685",
        "emp_type": [
            "full-time",
            "third party"
        ],
        "tag": "Java developer"
    }
]